{
  "imdbId" : "0085271",
  "title" : "Brainstorm",
  "releaseYear" : "1983",
  "duration" : "1:46",
  "rating" : "PG",
  "director" : "Douglas Trumbull",
  "imageUrl" : "0085271.jpg",
  "description" : "Brilliant researchers Lillian Reynolds and Michael Brace have developed a system of recording and playing back actual experiences of people. Once the capability of tapping into 'higher brain functions' is added in, and you can literally jump into someone else's head and play back recordings of what he or she was thinking, feeling, seeing, etc., at the time of the recording, the applications for the project quickly spiral out of control. While Michael Brace uses the system to become close again to Karen Brace, his estranged wife who also works on the project, others start abusing it for intense sexual experiences and other logical but morally questionable purposes. The government tries to kick Michael and Lillian off the project once the vast military potential of the technology is discovered. It soon becomes obvious that the government is interested in more than just missile guidance systems. The lab starts producing mind torture recordings and other psychosis inducing material. When one of the researchers dies and tapes the experience of death, Michael is convinced that he must playback this tape to honor the memory of the researcher and to become enlightened. When another researcher dies during playback the tape is locked away and Michael has to fight against his former colleagues and the government lackeys that now run his lab in order to play back and confront the 'scariest thing any of us will ever face' - death itself.",
  "genres" : [ "Sci-Fi", "Thriller" ],
  "cast" : [ "Christopher Walken", "Natalie Wood", "Louise Fletcher", "Cliff Robertson", "Jordan Christopher", "Donald Hotton", "Alan Fudge", "Joe Dorsey", "Bill Morey", "Jason Lively", "Darrell Larson", "Lou Walker", "Stacey Kuhne-Adams", "John Hugh", "Ira David Wood III", "Keith Colbert", "Jerry Bennett", "Mary Fran Lyman", "Jack Harmon", "Nina Axelrod", "Kelly W. Brown", "Desiree Ayres", "Debby Porter", "Alan G. Butler", "Robert Bloodworth", "Georgianne Walken", "Jimmy Boyd", "Charlie Briggs", "Ann Lincoln", "Robert Terry Young", "Bill Willens", "Jim Burk", "Jimmy Casino", "Robert Hippard", "John Gladstein", "Herbert Hirschman", "John Vidor", "Bill Couch", "Robert Gooden", "Wallace Merck", "Glen Lee", "Ernest Robinson", "Roger Black", "Tommy J. Huff", "May Boss", "Clay Boss", "Peter Harrell", "Susan Kampe", "Lana Clarkson", "Eric Lively" ],
  "tags" : [ ]
}
