[{
  "imdbId" : "0106145",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Emissary",
  "description" : "When the troubled Commander Sisko takes command of a surrendered space station, he learns that it borders a unique stable wormhole."
}, {
  "imdbId" : "0106145",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Past Prologue",
  "description" : "Tahna Los, a former Bajoran terrorist during the Occupation, asks Sisko for asylum on DS9. Meanwhile, the station's last Cardassian inhabitant, Garak, possibly a former spy for the Cardassian government, proves an interesting mystery to Dr. Bashir."
}, {
  "imdbId" : "0106145",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "A Man Alone",
  "description" : "Ibudan, a criminal/murderer Odo has dealt with before, returns to DS9 only to be murdered shortly after. . .leaving Odo to be the prime suspect. Meanwhile, Jake and Nog's trouble making prompt Keiko to do something helpful for the station's children."
}, {
  "imdbId" : "0106145",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Babel",
  "description" : "The crew and civilian population of Deep Space Nine begin to gabble when a plague, engineered by the Bajorans as a weapon against the Cardassians, accidentally gets released into the station's atmosphere."
}, {
  "imdbId" : "0106145",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Captive Pursuit",
  "description" : "For the first time an alien comes from the other side of the wormhole. He has ship trouble and seems very reluctant to accept any help. Chief O'Brien quickly finds out he has a secret."
}, {
  "imdbId" : "0106145",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Q-Less",
  "description" : "Q, the Enterprise-D's consistent omnipotent annoyance, comes to harass the DS9 crew when his traveling companion, Vash, refuses to travel with Q any longer."
}, {
  "imdbId" : "0106145",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Dax",
  "description" : "Sins of the Host indeed, as Jadzia Dax is accused of a murder her previous host, Curzon, supposedly committed."
}, {
  "imdbId" : "0106145",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "The Passenger",
  "description" : "Rao Vantika, a captured criminal, is badly burned and dies in Bashir's arms. . .but the criminal's captor believes he is still alive."
}, {
  "imdbId" : "0106145",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "Move Along Home",
  "description" : "The Wadi from the Gamma Quadrant are to make first contact and decide to visit DS9. When they catch Quark cheating they let him off by playing a special game."
}, {
  "imdbId" : "0106145",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "The Nagus",
  "description" : "The Ferengi's greatest politician and leader, the Grand Nagus, comes to the station. He seems very interested in Quark's bar."
}, {
  "imdbId" : "0106145",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "Vortex",
  "description" : "A man named Croden tells Odo he can take him to a place where aliens much like Odo himself exist, which would help Odo find out where he truly comes from."
}, {
  "imdbId" : "0106145",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "Battle Lines",
  "description" : "After showing Bajoran spiritual leader Kai Opaka the wormhole, she, Sisko, Bashir and Kira crash land on a moon. Kai Opaka dies and the three meet the unfriendly locals."
}, {
  "imdbId" : "0106145",
  "season" : "1",
  "episodeNumber" : "13",
  "title" : "The Storyteller",
  "description" : "While Sisko tries to negotiate an agreement between two Bajoran factions, he orders O'Brien to escort Bashir to an emergency that endangers a village."
}, {
  "imdbId" : "0106145",
  "season" : "1",
  "episodeNumber" : "14",
  "title" : "Progress",
  "description" : "Kira must convince an old Bajoran farmer to leave a moon becoming uninhabitable due to mining operations. Jake and Nog try to trade off Cardassian yamok sauce."
}, {
  "imdbId" : "0106145",
  "season" : "1",
  "episodeNumber" : "15",
  "title" : "If Wishes Were Horses",
  "description" : "Dax investigates if an unusual energy reading is dangerous for the station when all of the sudden people's imaginations really come alive, causing chaos."
}, {
  "imdbId" : "0106145",
  "season" : "1",
  "episodeNumber" : "16",
  "title" : "The Forsaken",
  "description" : "Lwaxana Troi comes for a political visit and instead hounds Odo for romantic attention. Meanwhile, an alien probe wrecks havoc with the station's computer, leaving Odo and Lwaxana trapped together."
}, {
  "imdbId" : "0106145",
  "season" : "1",
  "episodeNumber" : "17",
  "title" : "Dramatis Personae",
  "description" : "Out of nowhere the entire station's command staff, save Odo, become power hungry and vie to defeat each other by forming secret alliances and plotting assassinations. Needless to say, Odo tries to figure out how this mysterious behavior was influenced."
}, {
  "imdbId" : "0106145",
  "season" : "1",
  "episodeNumber" : "18",
  "title" : "Duet",
  "description" : "A Cardassian suffering from Kalla-Nohra, a disease that indicates he served in a labor camp, visits DS9. Kira is determined to convict him as a war criminal."
}, {
  "imdbId" : "0106145",
  "season" : "1",
  "episodeNumber" : "19",
  "title" : "In the Hands of the Prophets",
  "description" : "Vedek Winn, a candidate in the race for the open Kai position, stirs up trouble on DS9 when she attempts to boycott Keiko's school for not teaching Bajoran religious beliefs."
}, {
  "imdbId" : "0106145",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "The Homecoming",
  "description" : "Word that a previously thought dead Bajoran resistance legend is still alive sends Kira and Chief O'Brien to Cardassia IV to rescue him; meanwhile \"The Circle\", a sect of the Bajoran provisional government that is intent on wiping out alien influence, is sneaking into power."
}, {
  "imdbId" : "0106145",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "The Circle",
  "description" : "Kira spends time with Vedek Bareil on Bajor just as \"The Circle\" begins arming themselves from a mysterious source."
}, {
  "imdbId" : "0106145",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "The Siege",
  "description" : "As a \"Circle\"-led Bajoran military tries to occupy the station, a skeleton crew led by Sisko fight to reveal \"The Circle's\" big secret before they are forced to evacuate themselves. Meanwhile, Kira and Dax lead a mission to reveal the truth about \"The Circle\" on Bajor."
}, {
  "imdbId" : "0106145",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "Invasive Procedures",
  "description" : "A jealous Trill, who had waited his entire life to receive a symbiont but never had, decides to steal one. . .Dax's!"
}, {
  "imdbId" : "0106145",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "Cardassians",
  "description" : "Political heat rises on the station as Bajorans enter the station with orphaned Cardassians they have adopted."
}, {
  "imdbId" : "0106145",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "Melora",
  "description" : "A new arrival to the station with a special gravity-based disability appeals to Bashir's heart; meanwhile an old associate of Quark's comes to the station to kill the barkeep."
}, {
  "imdbId" : "0106145",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "Rules of Acquisition",
  "description" : "A female Ferengi, posing as a male to be available to participate in business (a rule STRICTLY forbidden by the Ferengi government), falls for Quark during very important negotiations between the Ferengi and a Gamma Quadrant race."
}, {
  "imdbId" : "0106145",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "Necessary Evil",
  "description" : "Odo relives some terrible and tragic memories of a past investigation when he was the constable on Cardassian-occupied Deep Space Nine, then named Terok Nor."
}, {
  "imdbId" : "0106145",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "Second Sight",
  "description" : "While noted scientist Gideon Seyetik is preparing for an ambitious project, re-igniting a star, Sisko is intrigued by a woman who keeps disappearing."
}, {
  "imdbId" : "0106145",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "Sanctuary",
  "description" : "A race that has been conquered twice over, one of the conquerors being the mysterious Dominion, comes to the station seeking aid and a new home."
}, {
  "imdbId" : "0106145",
  "season" : "2",
  "episodeNumber" : "11",
  "title" : "Rivals",
  "description" : "Quark meets his match when a new rival opens a casino opposite Quark's Bar on the Promenade; meanwhile the station is suffering issues of high improbability."
}, {
  "imdbId" : "0106145",
  "season" : "2",
  "episodeNumber" : "12",
  "title" : "The Alternate",
  "description" : "Odo and Dr. Mora Pol, Odo's 'father', discover a life form similar to Odo on a Gamma Quadrant planet."
}, {
  "imdbId" : "0106145",
  "season" : "2",
  "episodeNumber" : "13",
  "title" : "Armageddon Game",
  "description" : "Chief O'Brien, who still doesn't like the good Doctor Bashir, must rely on him when the two are stranded on a planet and O'Brien is infected with a deadly, fast moving disease."
}, {
  "imdbId" : "0106145",
  "season" : "2",
  "episodeNumber" : "14",
  "title" : "Whispers",
  "description" : "Chief O'Brien's world is turned upside down when for no reason whatsoever he is being ignored by his family and friends and is being closed out of every essential job on the station."
}, {
  "imdbId" : "0106145",
  "season" : "2",
  "episodeNumber" : "15",
  "title" : "Paradise",
  "description" : "Sisko and Chief O'Brien discover a colony that lives without technology."
}, {
  "imdbId" : "0106145",
  "season" : "2",
  "episodeNumber" : "16",
  "title" : "Shadowplay",
  "description" : "Odo and Dax investigate the mysterious disappearance of people from a village. Kira tries to keep a close eye on Quark, while Vedek Bareil unexpectedly visits."
}, {
  "imdbId" : "0106145",
  "season" : "2",
  "episodeNumber" : "17",
  "title" : "Playing God",
  "description" : "A Trill named Arjin comes to DS9 to learn what it is to be a Trill with a symbiont but finds his teacher, Dax, to be less than he expected."
}, {
  "imdbId" : "0106145",
  "season" : "2",
  "episodeNumber" : "18",
  "title" : "Profit and Loss",
  "description" : "A Cardassian woman, who was once a former flame of Quark's, visits the station under dubious circumstances."
}, {
  "imdbId" : "0106145",
  "season" : "2",
  "episodeNumber" : "19",
  "title" : "Blood Oath",
  "description" : "Three legendary Klingons come to DS9 to see if Jadzia Dax will participate in a Blood Oath they made with Jadzia's previous host Curzon."
}, {
  "imdbId" : "0106145",
  "season" : "2",
  "episodeNumber" : "20",
  "title" : "The Maquis: Part 1",
  "description" : "The destruction of a Cardassian ship leads Sisko, Dukat, and Sisko's old friend Cal Hudson to the fact that there is an unofficial war between the Maquis and the Cardassians."
}, {
  "imdbId" : "0106145",
  "season" : "2",
  "episodeNumber" : "21",
  "title" : "The Maquis: Part 2",
  "description" : "Sisko tries to resolve the Maquis crisis by preventing a war, freeing Gul Dukat and offering the defected Hudson the chance to return."
}, {
  "imdbId" : "0106145",
  "season" : "2",
  "episodeNumber" : "22",
  "title" : "The Wire",
  "description" : "Dr. Bashir fights to save Garak's life when a device implanted in his brain, designed to alleviate pain in the event of torture, begins to malfunction and is slowly killing him."
}, {
  "imdbId" : "0106145",
  "season" : "2",
  "episodeNumber" : "23",
  "title" : "Crossover",
  "description" : "Kira and Bashir find themselves in an alternate universe."
}, {
  "imdbId" : "0106145",
  "season" : "2",
  "episodeNumber" : "24",
  "title" : "The Collaborator",
  "description" : "Vedek Bareil is targeted by fellow Kai candidate Vedek Winn as having been a collaborator with the Cardassians during the Occupation."
}, {
  "imdbId" : "0106145",
  "season" : "2",
  "episodeNumber" : "25",
  "title" : "Tribunal",
  "description" : "Chief O'Brien goes through the horrific Cardassian judicial system when he is charged for an unknown crime."
}, {
  "imdbId" : "0106145",
  "season" : "2",
  "episodeNumber" : "26",
  "title" : "The Jem'Hadar",
  "description" : "Sisko and Quark and a strange telepathic woman are arrested by Jem'Hadar, soldiers of the Dominion."
}, {
  "imdbId" : "0106145",
  "season" : "3",
  "episodeNumber" : "1",
  "title" : "The Search: Part 1",
  "description" : "Instead of waiting for the Jem'Hadar to attack, Sisko wants to try a different approach. He wants to take a new class starship to try to find the Founders."
}, {
  "imdbId" : "0106145",
  "season" : "3",
  "episodeNumber" : "2",
  "title" : "The Search: Part 2",
  "description" : "Odo has found his home and is introduced. Meanwhile Sisko finds out peace talks between the Dominion and the Federation have already started."
}, {
  "imdbId" : "0106145",
  "season" : "3",
  "episodeNumber" : "3",
  "title" : "The House of Quark",
  "description" : "Quark is forced to marry a Klingon widow after he takes credit for the accidental death of her husband, the head of a powerful Klingon House."
}, {
  "imdbId" : "0106145",
  "season" : "3",
  "episodeNumber" : "4",
  "title" : "Equilibrium",
  "description" : "The Trill homeworld is the setting, as Sisko and Bashir take Jadzia home for treatment when she begins experiencing hallucinations after playing a tune she can't recall."
}, {
  "imdbId" : "0106145",
  "season" : "3",
  "episodeNumber" : "5",
  "title" : "Second Skin",
  "description" : "Kira finds herself on Cardassia as a Cardassian. She is told she is called Iliana Ghemor and was a Cardassian spy."
}, {
  "imdbId" : "0106145",
  "season" : "3",
  "episodeNumber" : "6",
  "title" : "The Abandoned",
  "description" : "Odo tries to change the nature of a Jem'Hadar boy that Quark finds, while Sisko tries to break his son's relationship with a 20 year old Dabo girl."
}, {
  "imdbId" : "0106145",
  "season" : "3",
  "episodeNumber" : "7",
  "title" : "Civil Defense",
  "description" : "The station goes into lockdown and the crew is endangered when an old Cardassian security program is accidentally activated."
}, {
  "imdbId" : "0106145",
  "season" : "3",
  "episodeNumber" : "8",
  "title" : "Meridian",
  "description" : "Dax falls in love with one of the residents of a multi-dimensional planet, while on DS9 an alien requests a holosuite program of Kira from Quark."
}, {
  "imdbId" : "0106145",
  "season" : "3",
  "episodeNumber" : "9",
  "title" : "Defiant",
  "description" : "Thomas Riker, impersonating Will Riker, steals the Defiant in order to fight with the Maquis. Sisko assist Gul Dukat on Cardassia Prime in stopping the ship entering Cardassian territory."
}, {
  "imdbId" : "0106145",
  "season" : "3",
  "episodeNumber" : "10",
  "title" : "Fascination",
  "description" : "As Lwaxanna Troi visits the station for a Bajoran festival, the crew is stricken with intense romantic attractions to one another."
}, {
  "imdbId" : "0106145",
  "season" : "3",
  "episodeNumber" : "11",
  "title" : "Past Tense: Part 1",
  "description" : "Sisko, Bashir and Dax are accidentally sent to San Francisco in the 21st century due to a transporter malfunction, and must figure out how to get back to return without changing the time line."
}, {
  "imdbId" : "0106145",
  "season" : "3",
  "episodeNumber" : "12",
  "title" : "Past Tense: Part 2",
  "description" : "Sisko is forced to take the place of a key historical figure on Earth in 2024 in order to preserve the timeline."
}, {
  "imdbId" : "0106145",
  "season" : "3",
  "episodeNumber" : "13",
  "title" : "Life Support",
  "description" : "Dr. Bashir must use extraordinary measures to prolong Vedek Bareil's life long enough to allow Bareil to complete sensitive peace negotiations between the Bajorans and the Cardassians."
}, {
  "imdbId" : "0106145",
  "season" : "3",
  "episodeNumber" : "14",
  "title" : "Heart of Stone",
  "description" : "After chasing a fugitive into a cave, Kira gets stuck and is slowly encapsulated by a growing crystal stone while Odo tries to figure out how to free her."
}, {
  "imdbId" : "0106145",
  "season" : "3",
  "episodeNumber" : "15",
  "title" : "Destiny",
  "description" : "Sisko faces a conflict between his Starfleet duties and his role as the Bajoran Emissary when an ancient Bajoran prophecy predicts that a joint Federation-Cardassian project will lead to the destruction of the wormhole."
}, {
  "imdbId" : "0106145",
  "season" : "3",
  "episodeNumber" : "16",
  "title" : "Prophet Motive",
  "description" : "Grand Nagus Zek is acting bizarre by giving away money and rewriting the Rules of Acquisition. Quark attempts to get the old Nagus back."
}, {
  "imdbId" : "0106145",
  "season" : "3",
  "episodeNumber" : "17",
  "title" : "Visionary",
  "description" : "While a Romulan delegation tries to get information about the Dominion, O'Brien gets visions of unpleasant things that are about to happen in the future."
}, {
  "imdbId" : "0106145",
  "season" : "3",
  "episodeNumber" : "18",
  "title" : "Distant Voices",
  "description" : "After being attacked in the infirmary, Dr. Bashir has a dual mystery on his hands: what has happened to the station while he was out and why is he aging so rapidly now?"
}, {
  "imdbId" : "0106145",
  "season" : "3",
  "episodeNumber" : "19",
  "title" : "Through the Looking Glass",
  "description" : "Sisko is kidnapped to impersonate his deceased, mirror universe self to gain Jennifer Sisko's loyalty in the Rebel Alliance."
}, {
  "imdbId" : "0106145",
  "season" : "3",
  "episodeNumber" : "20",
  "title" : "Improbable Cause",
  "description" : "After an attempt is made on Garak's life, Odo conducts the investigation on who tried to murder the Cardassian tailor - and why."
}, {
  "imdbId" : "0106145",
  "season" : "3",
  "episodeNumber" : "21",
  "title" : "The Die Is Cast",
  "description" : "Now rejoined with his former mentor, Garak is ordered to interrogate Odo about the secrets of his people, while the joined Romulan/Cardassian attack fleet moves towards the Founders' home world on a mission of destruction."
}, {
  "imdbId" : "0106145",
  "season" : "3",
  "episodeNumber" : "22",
  "title" : "Explorers",
  "description" : "Sisko rebuilds an ancient Bajoran space vessel from the blueprints, and he and Jake take the ship on a trip, attempting to prove that the ancient Bajorans went beyond their solar system without warp drive."
}, {
  "imdbId" : "0106145",
  "season" : "3",
  "episodeNumber" : "23",
  "title" : "Family Business",
  "description" : "Quark and Rom return to the Ferengi home world because their mother has broken the law - by wearing clothes and earning profits, forbidden for women in Ferengi society."
}, {
  "imdbId" : "0106145",
  "season" : "3",
  "episodeNumber" : "24",
  "title" : "Shakaar",
  "description" : "News arrives that Kai Winn has also become Bajor's political leader. She asks Kira to negotiate with an old resistance friend about returning soil reclamators."
}, {
  "imdbId" : "0106145",
  "season" : "3",
  "episodeNumber" : "25",
  "title" : "Facets",
  "description" : "Dax asks the crew to join her Zhian'tara ritual. The memories of her former hosts will take over their bodies. Nog is preparing for Starfleet Academy."
}, {
  "imdbId" : "0106145",
  "season" : "3",
  "episodeNumber" : "26",
  "title" : "The Adversary",
  "description" : "The Defiant is off to show the Federation's presence to the new Tzenkethi government. While underway the ship malfunctions and Bashir is suspected of sabotage."
}, {
  "imdbId" : "0106145",
  "season" : "4",
  "episodeNumber" : "1",
  "title" : "The Way of the Warrior",
  "description" : "Sisko becomes uncomfortable when the Klingons station a task force to help defend against the Dominion. Worf is summoned to find out their true intentions."
}, {
  "imdbId" : "0106145",
  "season" : "4",
  "episodeNumber" : "2",
  "title" : "The Visitor",
  "description" : "Melanie, an aspiring writer, wants to know why Jake Sisko stopped writing at 40. Jake tells how his father died in an accident and then suddenly reappeared."
}, {
  "imdbId" : "0106145",
  "season" : "4",
  "episodeNumber" : "3",
  "title" : "Hippocratic Oath",
  "description" : "Bashir is asked to help a group of renegade Jem'Hadar break their addiction to ketracel white. Meanwhile Worf is dissatisfied with the way Odo runs security."
}, {
  "imdbId" : "0106145",
  "season" : "4",
  "episodeNumber" : "4",
  "title" : "Indiscretion",
  "description" : "Kira and Gul Dukat go after the lost prison ship Ravinok. Dukat has a secret. Meanwhile Kasidy Yates tries to find work near Bajor, leaving Sisko uncomfortable."
}, {
  "imdbId" : "0106145",
  "season" : "4",
  "episodeNumber" : "5",
  "title" : "Rejoined",
  "description" : "Lenara Kahn, the new host of the wife of Dax's former host Torias, comes to the station. While they're not allowed to renew their relation, there's still a spark."
}, {
  "imdbId" : "0106145",
  "season" : "4",
  "episodeNumber" : "6",
  "title" : "Starship Down",
  "description" : "A damaged Defiant must play a dangerous game of cat-and-mouse with two Jem'hadar ships inside a gas giant."
}, {
  "imdbId" : "0106145",
  "season" : "4",
  "episodeNumber" : "7",
  "title" : "Little Green Men",
  "description" : "Quark and Rom take Nog to Earth and Starfleet Academy, but a malfunction with the ship takes the crew back in time, to Roswell New Mexico in 1947."
}, {
  "imdbId" : "0106145",
  "season" : "4",
  "episodeNumber" : "8",
  "title" : "The Sword of Kahless",
  "description" : "Worf, Dax and the Klingon Dahar master Kor set out to find an ancient lost relic: the Sword of Kahless."
}, {
  "imdbId" : "0106145",
  "season" : "4",
  "episodeNumber" : "9",
  "title" : "Our Man Bashir",
  "description" : "When an transporter emergency turns the command crew into holosuite characters, Bashir's James Bond fantasy takes on a deadly reality."
}, {
  "imdbId" : "0106145",
  "season" : "4",
  "episodeNumber" : "10",
  "title" : "Homefront",
  "description" : "Sisko travels to Earth when a bombing at a Federation conference is determined to be the work of Changelings."
}, {
  "imdbId" : "0106145",
  "season" : "4",
  "episodeNumber" : "11",
  "title" : "Paradise Lost",
  "description" : "When Starfleet institutes martial law to combat the Changeling Menace, Sisko begins to question if the Dominion is the real threat."
}, {
  "imdbId" : "0106145",
  "season" : "4",
  "episodeNumber" : "12",
  "title" : "Crossfire",
  "description" : "First Minister Shakaar visits the station, despite a threat of assassination. He falls in love with Kira much to Odo's dismay."
}, {
  "imdbId" : "0106145",
  "season" : "4",
  "episodeNumber" : "13",
  "title" : "Return to Grace",
  "description" : "Dukat returns, stripped of his prestige, to escort Kira to a Cardassian conference about the Dominion. But an attack by a Klingon raider may give Dukat a chance to redeem himself in the eyes of his government."
}, {
  "imdbId" : "0106145",
  "season" : "4",
  "episodeNumber" : "14",
  "title" : "Sons of Mogh",
  "description" : "Worf's brother Kurn asks him to perform a death rite to regain his lost honor. Meanwhile Kira and O'Brien investigate Klingon activity near the Bajoran border."
}, {
  "imdbId" : "0106145",
  "season" : "4",
  "episodeNumber" : "15",
  "title" : "Bar Association",
  "description" : "Unfair working conditions and pay cuts cause Rom to organize a union of the employees of Quark's Bar. Meanwhile Worf still finds it hard to settle on the station."
}, {
  "imdbId" : "0106145",
  "season" : "4",
  "episodeNumber" : "16",
  "title" : "Accession",
  "description" : "A man claiming to be the emissary comes through the wormhole. Sisko is happy to give up his position. Meanwhile Keiko returns and O'Brien stops spending time with Bashir."
}, {
  "imdbId" : "0106145",
  "season" : "4",
  "episodeNumber" : "17",
  "title" : "Rules of Engagement",
  "description" : "When Worf destroys a civilian shuttle during an engagement with the Klingons, an extradition hearing is held to see if he must face charges."
}, {
  "imdbId" : "0106145",
  "season" : "4",
  "episodeNumber" : "18",
  "title" : "Hard Time",
  "description" : "O'Brien tries to re-integrate to life on the station after serving 20 years in a virtual prison."
}, {
  "imdbId" : "0106145",
  "season" : "4",
  "episodeNumber" : "19",
  "title" : "Shattered Mirror",
  "description" : "When the Mirror Universe counterpart of Sisko's deceased wife lures Jake to the other side, Sisko must follow and help the human resistance against the Alliance's forces."
}, {
  "imdbId" : "0106145",
  "season" : "4",
  "episodeNumber" : "20",
  "title" : "The Muse",
  "description" : "A mysterious woman approaches Jake about his future as a writer. Odo promises to do whatever it takes to help Lwaxana Troi keep her baby over the father's wishes - even if it means marrying her himself."
}, {
  "imdbId" : "0106145",
  "season" : "4",
  "episodeNumber" : "21",
  "title" : "For the Cause",
  "description" : "Sisko must face betrayal when evidence surfaces that Kasidy is smuggling for the Maquis. Meanwhile Garak makes acquaintance with Ziyal."
}, {
  "imdbId" : "0106145",
  "season" : "4",
  "episodeNumber" : "22",
  "title" : "To the Death",
  "description" : "A renegade group of Jem'Hadar plunders Deep Space Nine. Sisko agrees to a combat operation with loyal Jem'Hadar to prevent the renegades completing a planetary gateway."
}, {
  "imdbId" : "0106145",
  "season" : "4",
  "episodeNumber" : "23",
  "title" : "The Quickening",
  "description" : "Bashir tries to help a planet in the grips of a Dominion-engineered plague that guarantees a painful death."
}, {
  "imdbId" : "0106145",
  "season" : "4",
  "episodeNumber" : "24",
  "title" : "Body Parts",
  "description" : "Quarks hears on Ferenginar he is going to die. Rom convinces him to sell his remains. After an accident, Bashir has to move Keiko's baby to Kira's womb."
}, {
  "imdbId" : "0106145",
  "season" : "4",
  "episodeNumber" : "25",
  "title" : "Broken Link",
  "description" : "Odo is suddenly struck by illness. He is barely able to hold shape. Bashir and Odo see no other alternative then going to the Founders. Garak wants to come along."
}, {
  "imdbId" : "0106145",
  "season" : "5",
  "episodeNumber" : "1",
  "title" : "Apocalypse Rising",
  "description" : "With the war between Klingons and Federation intensifying, Sisko must make a plan to expose Gowron as a changeling. Odo is still having trouble with becoming a solid."
}, {
  "imdbId" : "0106145",
  "season" : "5",
  "episodeNumber" : "2",
  "title" : "The Ship",
  "description" : "The crew is forced to retreat in a crashed Jem'Hadar ship after an attack by the Jem'Hadar. They get the feeling there's something very important about this ship."
}, {
  "imdbId" : "0106145",
  "season" : "5",
  "episodeNumber" : "3",
  "title" : "Looking for par'Mach in All the Wrong Places",
  "description" : "While Worf helps Quark to pursue his former wife Grilka, O'Brien and Kira grow uncomfortably close to each other."
}, {
  "imdbId" : "0106145",
  "season" : "5",
  "episodeNumber" : "4",
  "title" : "...Nor the Battle to the Strong",
  "description" : "Jake, reporting from the front lines, sees what war truly is."
}, {
  "imdbId" : "0106145",
  "season" : "5",
  "episodeNumber" : "5",
  "title" : "The Assignment",
  "description" : "An alien entity has possessed Keiko's body and is holding it hostage until O'Brien completes an assignment for it."
}, {
  "imdbId" : "0106145",
  "season" : "5",
  "episodeNumber" : "6",
  "title" : "Trials and Tribble-ations",
  "description" : "Darvin, a disgraced Klingon spy, travels back in time to alter some events to his likings. The DS9 crew must find what he's trying to change and prevent it without altering the time line. They'll have to blend in with the crew from Star Trek: The Original Series."
}, {
  "imdbId" : "0106145",
  "season" : "5",
  "episodeNumber" : "7",
  "title" : "Let He Who Is Without Sin...",
  "description" : "While vacationing on Risa, Worf and Dax meet a group of fundamentalist protesters who claim that the Federation has gone soft."
}, {
  "imdbId" : "0106145",
  "season" : "5",
  "episodeNumber" : "8",
  "title" : "Things Past",
  "description" : "Sisko, Dax, Odo and Garak find themselves in the past when the Cardassians controlled the station, and a crime that Odo investigated may be the key."
}, {
  "imdbId" : "0106145",
  "season" : "5",
  "episodeNumber" : "9",
  "title" : "The Ascent",
  "description" : "When Odo and Quark crash land, they must put aside their differences to climb a mountain to signal for help. Jake and Nog try to be roommates, but their different styles clash."
}, {
  "imdbId" : "0106145",
  "season" : "5",
  "episodeNumber" : "10",
  "title" : "Rapture",
  "description" : "Sisko begins having visions that may show him how to best help Bajor, but they're killing him."
}, {
  "imdbId" : "0106145",
  "season" : "5",
  "episodeNumber" : "11",
  "title" : "The Darkness and the Light",
  "description" : "A mysterious assassin begins wiping out all the members of Kira's old resistance cell."
}, {
  "imdbId" : "0106145",
  "season" : "5",
  "episodeNumber" : "12",
  "title" : "The Begotten",
  "description" : "The discovery of an infant Changeling gives Odo a chance to correct what he sees as the \"mistakes\" in his upbringing. But as Starfleet's pressure for results grows, he has to turn to his \"father,\" Dr. Mora"
}, {
  "imdbId" : "0106145",
  "season" : "5",
  "episodeNumber" : "13",
  "title" : "For the Uniform",
  "description" : "When the traitorous Eddington returns, Sisko will go to any lengths to capture him."
}, {
  "imdbId" : "0106145",
  "season" : "5",
  "episodeNumber" : "14",
  "title" : "In Purgatory's Shadow",
  "description" : "A coded message from the Gamma Quadrant leads Garak to believe his mentor, Enabran Tain, is still alive. He and Worf seek him out, only to discover something much worse: a Dominion invasion fleet poised to attack the Alpha Quadrant."
}, {
  "imdbId" : "0106145",
  "season" : "5",
  "episodeNumber" : "15",
  "title" : "By Inferno's Light",
  "description" : "The station readies for a Dominion attack. Worf and Garak meet some unexpected friends in a Dominion Prison camp."
}, {
  "imdbId" : "0106145",
  "season" : "5",
  "episodeNumber" : "16",
  "title" : "Doctor Bashir, I Presume?",
  "description" : "Dr. Bashir is selected to be the model for the next-generation of Emergency Medical Hologram (EMH). But he balks when his parents are invited to the station to be interviewed by the EMH programmer, Dr. Zimmerman. There is a dark secret in his family that he's afraid that his parents will reveal."
}, {
  "imdbId" : "0106145",
  "season" : "5",
  "episodeNumber" : "17",
  "title" : "A Simple Investigation",
  "description" : "Odo becomes romantically attached to a woman working with the Orion Syndicate."
}, {
  "imdbId" : "0106145",
  "season" : "5",
  "episodeNumber" : "18",
  "title" : "Business as Usual",
  "description" : "Quark must wrestle with his conscience when he becomes involved with arms merchants."
}, {
  "imdbId" : "0106145",
  "season" : "5",
  "episodeNumber" : "19",
  "title" : "Ties of Blood and Water",
  "description" : "When a Cardassian official that thinks of Kira as his daughter is dying, he agrees to reveal all he knows to her. But the experience dredges up Kira's memories of her own father's death."
}, {
  "imdbId" : "0106145",
  "season" : "5",
  "episodeNumber" : "20",
  "title" : "Ferengi Love Songs",
  "description" : "Quark doesn't know whether to be panicked or overjoyed when he learns that his mother is the new lover of the Grand Nagus."
}, {
  "imdbId" : "0106145",
  "season" : "5",
  "episodeNumber" : "21",
  "title" : "Soldiers of the Empire",
  "description" : "Dax and Worf accompany Martok on his first command since being held by the Dominion. But the ship they are given hasn't seen victory in months and the crew is near mutinous."
}, {
  "imdbId" : "0106145",
  "season" : "5",
  "episodeNumber" : "22",
  "title" : "Children of Time",
  "description" : "The DS9 cast discovers a small colony on a remote world that was originally populated by them 200 years earlier due to a time-travel accident with the Defiant. The current colonists lives depend on making sure that accident happens again, even though they've now forwarned the crew that it will happen. Each crew member needs to decide if they are willing to give up their lives on DS9 in order to preserve the history of the colony."
}, {
  "imdbId" : "0106145",
  "season" : "5",
  "episodeNumber" : "23",
  "title" : "Blaze of Glory",
  "description" : "Driven to desperation by the Dominion, the Maquis launch a massive bio-weapons strike towards Cardassia. Sisko must trust the traitor Eddington to try to stop them."
}, {
  "imdbId" : "0106145",
  "season" : "5",
  "episodeNumber" : "24",
  "title" : "Empok Nor",
  "description" : "While salvaging components from DS9's sister station, the crew run afoul of a \"surprise\" left behind by the Cardassians."
}, {
  "imdbId" : "0106145",
  "season" : "5",
  "episodeNumber" : "25",
  "title" : "In the Cards",
  "description" : "Jake and Nog go through hell and high water, from participating in an auction to dealing with the Dominion, to receiving a Willie Mays baseball card to cheer up the war-fatigued Captain Sisko."
}, {
  "imdbId" : "0106145",
  "season" : "5",
  "episodeNumber" : "26",
  "title" : "Call to Arms",
  "description" : "With the continuing battalions of Jem'Hadar entering the Alpha Quadrant in preparation for war, Sisko decides to mine the wormhole to prevent further troop movement. This provokes a confrontation between the Dominion and the Federation, forcing Sisko to abandon DS9."
}, {
  "imdbId" : "0106145",
  "season" : "6",
  "episodeNumber" : "1",
  "title" : "A Time to Stand",
  "description" : "Borrowing a captured Jem'Hadar attack ship, Sisko and crew embark on a mission to destroy the hidden base where all of the ketracel-white is stored for the entire Alpha Quadrant."
}, {
  "imdbId" : "0106145",
  "season" : "6",
  "episodeNumber" : "2",
  "title" : "Rocks and Shoals",
  "description" : "Sisko and his crew crash on a barren world when their commandeered Jem'Hadar ship is shot down. They encounter Jem'Hadar who crashed there earlier, and have taken Nog and Garak hostage in exchange for medical aid for their Vorta overseer."
}, {
  "imdbId" : "0106145",
  "season" : "6",
  "episodeNumber" : "3",
  "title" : "Sons and Daughters",
  "description" : "Serving with his recruit son aboard a Klingon vessel, Worf finds his relationship with his son strained. Meanwhile, strained relationships abound on DS9 between Major Kira and Gul Dukat."
}, {
  "imdbId" : "0106145",
  "season" : "6",
  "episodeNumber" : "4",
  "title" : "Behind the Lines",
  "description" : "After forming an attack plan on the Dominion, Sisko relinquishes command of the Defiant to Dax after accepting a promotion. On DS9, the resistance faces discovery when Odo links with another changeling."
}, {
  "imdbId" : "0106145",
  "season" : "6",
  "episodeNumber" : "5",
  "title" : "Favor the Bold",
  "description" : "Sisko mounts an attack to re-take DS9, while Rom faces charges as an enemy of the Dominion state."
}, {
  "imdbId" : "0106145",
  "season" : "6",
  "episodeNumber" : "6",
  "title" : "Sacrifice of Angels",
  "description" : "The Federation attacks DS9 in hopes of keeping the mine field in the wormhole intact, while the Dominion waits entrance to the Alpha Quadrant from the other side."
}, {
  "imdbId" : "0106145",
  "season" : "6",
  "episodeNumber" : "7",
  "title" : "You Are Cordially Invited...",
  "description" : "Suddenly desiring to wed within the week on DS9, Worf and Jadzia go through their own Klingon rituals: Worf on a four day bachelor party with the male members of the crew & Jadzia deals with her prospective mother-in-law, who totally opposes the idea of \"an alien\" marrying into her Klingon household."
}, {
  "imdbId" : "0106145",
  "season" : "6",
  "episodeNumber" : "8",
  "title" : "Resurrection",
  "description" : "Major Kira takes a romantic interest in a Bajoran radical from the other universe who transports himself into her universe and onto DS9."
}, {
  "imdbId" : "0106145",
  "season" : "6",
  "episodeNumber" : "9",
  "title" : "Statistical Probabilities",
  "description" : "A group of genetically engineered humans are brought to Dr. Bashir on DS9 in hopes of integrating them with the rest of the universe."
}, {
  "imdbId" : "0106145",
  "season" : "6",
  "episodeNumber" : "10",
  "title" : "The Magnificent Ferengi",
  "description" : "At the request of the Grand Nagus, Quark puts together a mission to rescue Quark's mother, who is in the hands of the Dominion."
}, {
  "imdbId" : "0106145",
  "season" : "6",
  "episodeNumber" : "11",
  "title" : "Waltz",
  "description" : "After being attacked by Cardassian forces, Sisko gets stranded with a very psychotic Gul Dukat, who was being transported to his trial. Meanwhile the crew of the Defiant races to rescue survivors."
}, {
  "imdbId" : "0106145",
  "season" : "6",
  "episodeNumber" : "12",
  "title" : "Who Mourns for Morn?",
  "description" : "A former patron of Quark's bequeaths everything to him."
}, {
  "imdbId" : "0106145",
  "season" : "6",
  "episodeNumber" : "13",
  "title" : "Far Beyond the Stars",
  "description" : "Captain Sisko has a full sensory vision of himself as an under-appreciated science fiction magazine writer in 1950s America."
}, {
  "imdbId" : "0106145",
  "season" : "6",
  "episodeNumber" : "14",
  "title" : "One Little Ship",
  "description" : "An attack by the Dominion on Sisko's ship endangers Dax and her crew aboard as she leads them into an anomaly that shrinks them to a very minute size. Unfortunately, they were being held stable by Sisko within a tractor beam, which was discontinued during the attack."
}, {
  "imdbId" : "0106145",
  "season" : "6",
  "episodeNumber" : "15",
  "title" : "Honor Among Thieves",
  "description" : "Chief O'Brien goes undercover to infiltrate an Orion crime ring."
}, {
  "imdbId" : "0106145",
  "season" : "6",
  "episodeNumber" : "16",
  "title" : "Change of Heart",
  "description" : "Worf and Jadzia travel to the badlands to procure some information on the Dominion from a traitorous Cardassian. Bashir wants to engage in a holo-suite spy simulation, but O'brian prefers to brush up on his tongo game after watching Jadzia lose to Quark."
}, {
  "imdbId" : "0106145",
  "season" : "6",
  "episodeNumber" : "17",
  "title" : "Wrongs Darker Than Death or Night",
  "description" : "After receiving some disturbing information for Gul Dukat, Major Kira seeks Sisko's approval as Emissary to travel back in time to find out the truth about her mother. Meanwhile, Chief O'Brien and Dr. Bashir discuss a holosuite program surrounding the Battle of the Alamo."
}, {
  "imdbId" : "0106145",
  "season" : "6",
  "episodeNumber" : "18",
  "title" : "Inquisition",
  "description" : "Dr. Bashir's plans to attend a medical conference at a breezy resort are canceled when Starfleet Intelligence boards DS9, suspecting the doctor of treason."
}, {
  "imdbId" : "0106145",
  "season" : "6",
  "episodeNumber" : "19",
  "title" : "In the Pale Moonlight",
  "description" : "To save the Federation in a critical scheme, Sisko comes to realize that he must violate its fundamental principles to do so."
}, {
  "imdbId" : "0106145",
  "season" : "6",
  "episodeNumber" : "20",
  "title" : "His Way",
  "description" : "Odo is schooled in the ways of romance by a holographic programmed lounge singer."
}, {
  "imdbId" : "0106145",
  "season" : "6",
  "episodeNumber" : "21",
  "title" : "The Reckoning",
  "description" : "Spiritualists on Bajor summon Captain Sisko to the planet surface, where they show him a stone tablet with some unknown inscriptions. Once on DS9, the inscription reveals an ancient prophecy of coming disasters surrounding the wormhole, Bajor, and DS9, as those around him voice their uneasiness about Sisko being an Emissary for the planet."
}, {
  "imdbId" : "0106145",
  "season" : "6",
  "episodeNumber" : "22",
  "title" : "Valiant",
  "description" : "Jake and Nog's runabout come under attack from the Jem'Hadar, and are rescued by the Valiant, a ship manned by Red Squad, a elite group of young Starfleet cadets."
}, {
  "imdbId" : "0106145",
  "season" : "6",
  "episodeNumber" : "23",
  "title" : "Profit and Lace",
  "description" : "Quark's mother and the Grand Nagus show up on DS9, announcing a new amendment to the Bill of Opportunities he has instituted on the home planet of Ferenganar, and then follows up with the announcement, that, due to the new amendment, chaos has followed and he has been deposed."
}, {
  "imdbId" : "0106145",
  "season" : "6",
  "episodeNumber" : "24",
  "title" : "Time's Orphan",
  "description" : "The Chief's daughter gets caught in a time displacement and when they get her back, she is considerably older."
}, {
  "imdbId" : "0106145",
  "season" : "6",
  "episodeNumber" : "25",
  "title" : "The Sound of Her Voice",
  "description" : "As the Defiant races to a shipwrecked officer who is days away, the crew keeps in contact with her. Meanwhile, Jake follows Quark's latest scheme for story research."
}, {
  "imdbId" : "0106145",
  "season" : "6",
  "episodeNumber" : "26",
  "title" : "Tears of the Prophets",
  "description" : "When Sisko is picked to head up an attack on the Cardassian homeworld, the Prophets appear to him in a vision, warning him of impending doom if he leaves the station."
}, {
  "imdbId" : "0106145",
  "season" : "7",
  "episodeNumber" : "1",
  "title" : "Image in the Sand",
  "description" : "Having returned to Earth a couple of months ago, Sisko waits for the Prophets to instruct him on what to do next. When he receives one, he begins searching for the woman behind the face in the sand in his vision. Meanwhile, back on DS9, Kira deals with a promotion and handling the decisions surrounding her command, and finding herself wishing for the return of Sisko. And Worf deals with the loss of his wife, Jadzia Dax."
}, {
  "imdbId" : "0106145",
  "season" : "7",
  "episodeNumber" : "2",
  "title" : "Shadows and Symbols",
  "description" : "Ezri joins Sisko and his family on his quest for the Orb of the Emissary. Colonel Kira mounts a blockade around a Bajoran moon where the Romulan alliance has deposited an ammunitions dump, claiming it in the name of defense for a Romulan hospital. And Quark joins the rest of the DS9 crew as they join Worf aboard a Klingon warship as they mount a dangerous mission in Jadzia Dax's name in an effort to get her spirit into Stovokohr, the Klingon equivalent of Heaven."
}, {
  "imdbId" : "0106145",
  "season" : "7",
  "episodeNumber" : "3",
  "title" : "Afterimage",
  "description" : "Sisko tries to convince Ezri to stay in Starfleet and serve aboard DS9, as Ezri tries to get to know Jadzia's friends aboard the station, especially Worf. Meanwhile, Garak tries to deal with a severe bout of claustrophobia."
}, {
  "imdbId" : "0106145",
  "season" : "7",
  "episodeNumber" : "4",
  "title" : "Take Me Out to the Holosuite",
  "description" : "A Vulcan captain challenges Sisko to a game of baseball."
}, {
  "imdbId" : "0106145",
  "season" : "7",
  "episodeNumber" : "5",
  "title" : "Chrysalis",
  "description" : "Dr. Bashir attempts to bring one of his genetically engineered friends out of the catatonic state she is in, and when he is successful, he begins to fall for her."
}, {
  "imdbId" : "0106145",
  "season" : "7",
  "episodeNumber" : "6",
  "title" : "Treachery, Faith, and the Great River",
  "description" : "A Vorta offers Odo valuable information on the Dominion in exchange for asylum. Meanwhile, Nog tries his Ferengi knowledge as he wheels and deals for a valuable piece of equipment for Chief O'Brien."
}, {
  "imdbId" : "0106145",
  "season" : "7",
  "episodeNumber" : "7",
  "title" : "Once More Unto the Breach",
  "description" : "An aged Kor requests an opportunity to die with honor as a warrior."
}, {
  "imdbId" : "0106145",
  "season" : "7",
  "episodeNumber" : "8",
  "title" : "The Siege of AR-558",
  "description" : "Capt. Sisko and his away team volunteer to stay with a besieged unit at an isolate outpost."
}, {
  "imdbId" : "0106145",
  "season" : "7",
  "episodeNumber" : "9",
  "title" : "Covenant",
  "description" : "Kira is kidnapped and taken to Empok Nor by a member of a Pah'Wraith cult and discovers the group leader is Gul Dukat."
}, {
  "imdbId" : "0106145",
  "season" : "7",
  "episodeNumber" : "10",
  "title" : "It's Only a Paper Moon",
  "description" : "Severely depressed at his serious war wound, Nog retreats into Vic Fontaine's holosuite program while the singer tries to help him."
}, {
  "imdbId" : "0106145",
  "season" : "7",
  "episodeNumber" : "11",
  "title" : "Prodigal Daughter",
  "description" : "Ezri travels to her family home in search of Chief O'Brien who has discovered a murdered woman connected with the family and the Orion Syndicate."
}, {
  "imdbId" : "0106145",
  "season" : "7",
  "episodeNumber" : "12",
  "title" : "The Emperor's New Cloak",
  "description" : "Quark and Rom have to rescue Grand Nagus Zek who is being held captive in the Alternate Universe."
}, {
  "imdbId" : "0106145",
  "season" : "7",
  "episodeNumber" : "13",
  "title" : "Field of Fire",
  "description" : "Find an apparently untraceable murderer, Ezri Dax reluctantly calls up the residual consciousness remnant of her symbiont's past hidden psychopathic murderer host, Joran."
}, {
  "imdbId" : "0106145",
  "season" : "7",
  "episodeNumber" : "14",
  "title" : "Chimera",
  "description" : "After searching out and finding Odo, another changeling asks him to leave DS9 with him, even though the rest of the crew aren't convinced the new changeling is not part of the Founders."
}, {
  "imdbId" : "0106145",
  "season" : "7",
  "episodeNumber" : "15",
  "title" : "Badda-Bing, Badda-Bang",
  "description" : "When a programming glitch won't go away, mobsters take over Vic's and open for business, but the DS9 gang takes it personal when their favorite hangout is no longer their favorite, and they plan to get the new management ousted."
}, {
  "imdbId" : "0106145",
  "season" : "7",
  "episodeNumber" : "16",
  "title" : "Inter Arma Enim Silent Leges",
  "description" : "While making plans to attend a medical conference on the Romulan home world, Dr. Bashir is contacted by Sloane of Section 31 and recruited to determine the health of a high-ranking Romulan official. Things turn more desperate, though, when the ranking Starfleet admiral traveling with him, who knows about Section 31's interest in the conference mysteriously suffers a brain aneurysm after Dr. Bashir finds out that Sloane is traveling with the group, as well."
}, {
  "imdbId" : "0106145",
  "season" : "7",
  "episodeNumber" : "17",
  "title" : "Penumbra",
  "description" : "When the ship Worf was serving on is attacked in battle and all search efforts are abandoned, Ezri takes a runabout in search of him against Sisko's orders. Meanwhile, Sisko proposes to Cassidy Yates."
}, {
  "imdbId" : "0106145",
  "season" : "7",
  "episodeNumber" : "18",
  "title" : "'Til Death Do Us Part",
  "description" : "The Prophets have told Sisko that they do not agree with his impending marriage. Ezri and Worf are captured by Dominion forces. Some of the Cardassians are beginning to regret their alliance with the Dominion, as Gul Dukat, disguised as a Bajoran, sets foot on DS9."
}, {
  "imdbId" : "0106145",
  "season" : "7",
  "episodeNumber" : "19",
  "title" : "Strange Bedfellows",
  "description" : "Kai Winn gets unknowingly involved with Gul Dukat, disguised as a Bajoran. Tensions further escalate between Weyoun and Gul Damar as the Dominion gather to sign a peace treaty with the Breen, including certain concessions of unknown territories by the Cardassians, as Ezri and Worf try to escape the Cardassian home world."
}, {
  "imdbId" : "0106145",
  "season" : "7",
  "episodeNumber" : "20",
  "title" : "The Changing Face of Evil",
  "description" : "After the Breen attack Earth, mixed emotions abound on DS9. Having revealed her secret regarding the Prophets to Dukat, Kai Winn turns her back on them, only to be convinced by Dukat to embrace the Pah Wraiths. And on the home world of Cardassia, Legate Damar mounts a resistance to the Dominion."
}, {
  "imdbId" : "0106145",
  "season" : "7",
  "episodeNumber" : "21",
  "title" : "When It Rains...",
  "description" : "Kira gets sent behind Cardassian lines in an effort to train them in resistance fighting. When Dr. Bashir learns of the deadly disease that Odo is infected with, he gets met with barriers when trying to obtain his medical records from Starfleet. And Martok gets blindsided by Gowron when he arrives on DS9, announcing that he has assumed command of the Klingon fleet."
}, {
  "imdbId" : "0106145",
  "season" : "7",
  "episodeNumber" : "22",
  "title" : "Tacking Into the Wind",
  "description" : "Odo is affected by the disease threatening to eliminate his race more than he lets on to, while Kira has to deal with the Cardassian's dislike of her. Even though General Martok sees Chancellor Gowron's move as part of a political vendetta, he does nothing about it."
}, {
  "imdbId" : "0106145",
  "season" : "7",
  "episodeNumber" : "23",
  "title" : "Extreme Measures",
  "description" : "Dr. Bashir and Chief O'Brien go to some pretty extreme measures to try and track down a cure for Odo."
}, {
  "imdbId" : "0106145",
  "season" : "7",
  "episodeNumber" : "24",
  "title" : "The Dogs of War",
  "description" : "Odo begins recovery from the deadly disease as Dr. Bashir informs him of Section 31's intentions of wiping out his race. A resistance mission goes bad for Kira and Garak and they end up hiding in the basement of the house that Garak grew up in, as they learned that Legate Damar becomes a casualty of war, who is also hiding with them. And the Grand Nagus chooses Quark as his successor upon his impending retirement to Reysa."
}, {
  "imdbId" : "0106145",
  "season" : "7",
  "episodeNumber" : "25",
  "title" : "What You Leave Behind",
  "description" : "Sisko leads, what he hopes will be, a final all-out assault on Cardassia Prime, as Kira and Garak mount a suicide assault on the Cardassian headquarters, occupied by the Dominion, who kill innocent women and children village by village in retaliation for Resistance attacks."
}]