[{
  "imdbId" : "12327578",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Strange New Worlds",
  "description" : "Captain Christopher Pike comes out of self-imposed exile to rescue an officer gone missing during a secret mission."
}, {
  "imdbId" : "12327578",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Children of the Comet",
  "description" : "An ancient alien relic thwarts the Enterprise crew from re-routing a comet on track to strike an inhabited planet."
}, {
  "imdbId" : "12327578",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Ghosts of Illyria",
  "description" : "Una must confront a secret she's been hiding when a contagion ravages the ship, incapacitating the rest of the crew."
}, {
  "imdbId" : "12327578",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Memento Mori",
  "description" : "Pike must find unconventional Starfleet methods to deal with a malevolent force that attacks the Enterprise."
}, {
  "imdbId" : "12327578",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Spock Amok",
  "description" : "A personal visit causes a comedy of errors during Spock & Pike's crucial negotiations with an unusual alien species."
}, {
  "imdbId" : "12327578",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Lift Us Where Suffering Cannot Reach",
  "description" : "A threat to an idyllic planet reunites Captain Pike with the lost love of his life. To protect her and a scientific holy child from a conspiracy, Pike offers his help and is forced to face unresolved feelings of his past."
}, {
  "imdbId" : "12327578",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "The Serene Squall",
  "description" : "While on a dangerous humanitarian mission, the crew of the Enterprise stumbles into a harrowing game of leverage with the quadrant's deadliest space pirate."
}, {
  "imdbId" : "12327578",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "The Elysian Kingdom",
  "description" : "The USS Enterprise becomes stuck in a nebula that's home to an alien consciousness which traps the crew in a fairy tale."
}, {
  "imdbId" : "12327578",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "All Those Who Wander",
  "description" : "Enterprise crew comes face-to-face with their demons - and scary monsters too - when their landing party's stranded on a barren planet with a ravenous enemy."
}, {
  "imdbId" : "12327578",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "A Quality of Mercy",
  "description" : "In the season one finale, just as Captain Pike thinks he's figured out how to escape his fate, he's visited by his future self, who shows him the consequences of his actions."
}, {
  "imdbId" : "12327578",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "The Broken Circle",
  "description" : "A distress call from Lt. Noonien-Singh compels Spock to disobey orders and take the Enterprise and its crew into disputed space on a rescue mission."
}, {
  "imdbId" : "12327578",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "Ad Astra Per Aspera",
  "description" : "Commander Una Chin-Riley faces court martial, imprisonment and dishonorable discharge from Starfleet."
}, {
  "imdbId" : "12327578",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "Tomorrow and Tomorrow and Tomorrow",
  "description" : "La'an travels back in time to 21st-century Earth to prevent an attack which will alter humanity's future history."
}, {
  "imdbId" : "12327578",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "Among the Lotus Eaters",
  "description" : "Returning to a planet that dredges up tragic memories, Captain Pike and his landing party find themselves forgetting everything, including their own identities as he confronts a ghost from his past."
}, {
  "imdbId" : "12327578",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "Charades",
  "description" : "A shuttle accident leads to Spock's Vulcan DNA being removed by aliens, making him fully human and completely unprepared to face T'Pring's family during an important ceremonial dinner."
}, {
  "imdbId" : "12327578",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "Lost in Translation",
  "description" : "Uhura seems to be the only one who can hear a strange sound that seems to trigger terrifying hallucinations."
}, {
  "imdbId" : "12327578",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "Those Old Scientists",
  "description" : "An accident while investigating a time portal sends Ensigns Beckett Mariner and Bradward Boimler through time from the 24th Century, and Captain Pike and his crew must get them back where they belong before they can alter the timeline."
}, {
  "imdbId" : "12327578",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "Under the Cloak of War",
  "description" : "Captain Pike and his crew welcome a Klingon defector aboard the U.S.S. Enterprise, but his presence triggers the revelation of some shocking secrets."
}, {
  "imdbId" : "12327578",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "Subspace Rhapsody",
  "description" : "An accident with an experimental quantum probability field causes everyone on the Enterprise to break uncontrollably into song, but the real danger is that the field is expanding & beginning to impact other ships - allies & enemies alike."
}, {
  "imdbId" : "12327578",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "Hegemony",
  "description" : "When the Enterprise investigates an attack on a colony at the edge of Federation space, Captain Pike and the crew face the return of a formidable enemy."
}]