[{
  "imdbId" : "0996994",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "A Necessary War: December 1941 - December 1942",
  "description" : "This series profiles World War II as seen primarily through the eyes of people living in just four U.S. Cities. This episode details an antebellum period before the attack on Pearl Harbor, that attack, the fall of the Phillipines, the Bataan Death March and the fighting at Guadalcanal."
}, {
  "imdbId" : "0996994",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "When Things Get Tough: January 1943 - December 1943",
  "description" : "Americans mobilize for total war at home and overseas. Factories hum around the clock, while in North Africa and then Italy, inexperienced GIs learn how to fight. Meanwhile, in the skies over Europe, thousands of American airmen gamble their lives against preposterous odds on daylight bombing missions."
}, {
  "imdbId" : "0996994",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "A Deadly Calling: November 1943 - June 1944",
  "description" : "Americans are shocked by terrible losses on the Pacific atoll of Tarawa, while in Italy Allied forces are stalled for months at Monte Cassino and a risky landing at Anzio fails utterly. At home, as overcrowded \"war towns\" boom, economic transformation leads to confrontation and ugly racial violence."
}, {
  "imdbId" : "0996994",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Pride of Our Nation: June 1944 - August 1944",
  "description" : "On June 6, 1944, D-Day, 1.5 million Allied troops take part in the greatest invasion in history, but then bog down in the Norman hedgerows for weeks. Saipan proves the costliest Pacific battle to date, while back home dreaded telegrams from the War Department begin arriving at an inconceivable rate."
}, {
  "imdbId" : "0996994",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "FUBAR: September 1944 - December 1944",
  "description" : "Victory in Europe seems imminent, but in Holland, the Vosges Mountains, and the Hurtgen Forest, GIs learn painful lessons as old as war itself--that generals make plans, plans go wrong and soldiers die. Meanwhile, on the island of Peleliu, the Marines fight one of the most brutal, and unnecessary, battles of the Pacific."
}, {
  "imdbId" : "0996994",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "The Ghost Front: December 1944 - March 1945",
  "description" : "Americans are shocked by Hitler's massive counterattack in the Ardennes Forest--but by mid March, 1945, they are across the Rhine, while the Russians are 50 miles from Berlin. In the Pacific, after weeks of desperate fighting, Iwo Jima is secured, and American bombers begin a full-fledged air assault on Japan."
}, {
  "imdbId" : "0996994",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "A World Without War: March 1945 - September 1945",
  "description" : "A few weeks after the death of President Roosevelt shocks the country, Germany surrenders. Meanwhile, American sailors, soldiers and Marines endure the worst battle of the Pacific--Okinawa. In August, American planes drop atomic bombs on Hiroshima and Nagasaki, and the Japanese, too, surrender. Millions return home--to try to learn how to live in a world without war."
}]