[{
  "imdbId" : "1333053",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Beginnings",
  "description" : "At the 60th independence anniversary of the largest democracy, Michael tells how it entered the world stage. Some 75,000 years ago, curious men from Africa followed the shore to southern Indian, thriving as it was fertile. Some of its prehistorical 'cultural' heritage remains, e.g. in some of the Brahmin caste's Hindu traditions, as in some genes. 10,000 years later, agriculture started sedentarisation and cities, perhaps the oldest being present Pakistan's Harappa, which civilization peaked in the third millennium BC. Also Mohenjo-Dara, capital of a vast, 5,000,000 ..."
}, {
  "imdbId" : "1333053",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "The Power of Ideas",
  "description" : "Since the fifth century BC, India developed an Iron Age pacifist model: individuals seek dharma (virtue), artha (richess and success), kharma (pleasure and joy) and ultimately moksa (enlightenment). In the holy Ganges cities, Michael contemplates the hierarchic, controversially fatalistic Hindu caste system and ritualistic tradition. The philosophical rise of moralism and meditation culminated in Buddhism, the teaching of prince Gautama turned wandering ascetic preaching detachment. After Alexander conquered the Persian empire, Indian admirer Chandragaupta Maurya ..."
}, {
  "imdbId" : "1333053",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Spice Routes & Silk Roads",
  "description" : "In 150 BC, the Greek Hippalos discovered strong monsoons that allowed seafaring using improved Roman wooden ships from the Red and Arab Seas to the spice coast of modern Kerala and back. This enabled trade in what made the subcontinent as rich as silk-home China. Herbal products like peppers, ginger, cardamom and other conservation - and seasoning ingredients, worth up to their weight in gold, plus gems, paid mainly in metals and wine. India's fertile south conserves the Ancient Tamil language and metropolitan capital then, Manduarai. North of the Himalaya, the Kushan..."
}, {
  "imdbId" : "1333053",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Ages of Gold",
  "description" : "In the 6th century AD was the start of India's Golden Age, with the rise of mythical kingdoms, especially Rama's Ayodhya, according to the supreme Hindu epic, the moralistic Ramayana. Aydodhya was later really built as capital of the historical Gupta dynasty's vast, rich, well-organized northern empire, recorded by Chinese visiting monk Fa Hsien. They excelled in metallurgy, astronomy and hedonism. The later southern counterpart was the Chola empire (c900-1300), capital Tanjore. Their Tamil culture, excelling in architecture, dance and bronze, lives on."
}, {
  "imdbId" : "1333053",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "The Meeting of Two Oceans",
  "description" : "Ghazni Afghan empire founder's 11th century raids from Multan (Pakistan) started Islam's influence on India. Since the twelfth century conquests established sultanates dominating northern Hindustan. In the 16th century another wave of Turkic-Mongol-Persian invaders, under Babur's dynasty, united them. Soon much of the South, was established as the Mughal empire. The natural meeting of Sufism and Hinduism in asceticism now was matched by a policy of tolerant coexistence, with Hindu vassals. A brilliant culture flowered, embellished by the Taj Mahal. However economic ..."
}, {
  "imdbId" : "1333053",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Freedom",
  "description" : "Michael discusses with Indian historians and witnesses, including some rajahs, first how British India was established by the East India Company in the general British rivalry with France, first in southern principalities, then in Bengal, finally taking over the Mughal empire. Then the pros and contras of the raj (colonial rule). Finally the mutiny, the long struggle for independence, finally won by Ganghi, and the separation between a mainly Hindu Indian state and a Muslim Pakistan."
}]