[{
  "imdbId" : "0112054",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Mesopotamia: Return to Eden",
  "description" : "Explore the land of the Bible and see evidence of the world's oldest civilizations. Go back to the dawn of civilization, following clues that lead to the Garden of Eden."
}, {
  "imdbId" : "0112054",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Egypt: Quest for Immortality",
  "description" : "Discover the enduring legacy of the pharaohs in the magnificent riches of their tombs and among the fragile relics of their mummies. Explore the ancient Egyptians' fascination with death and their quest for immortality."
}, {
  "imdbId" : "0112054",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Aegean: The Legacy of Atlantis",
  "description" : "Follow the trail of clues that lead from the ancient myths of the Aegean world to their real-life counterparts. Experience the lives of the legendary heroes as they are rediscovered in the ruins of this ancient Mediterranean world."
}, {
  "imdbId" : "0112054",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Greece: A Moment of Excellence",
  "description" : "Enter the extraordinary lives of the classical Greeks at the height of their civilization. Examine the conflicting forces of passion and reason that shaped the art and ideas of the western world."
}, {
  "imdbId" : "0112054",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "China: Dynasties of Power",
  "description" : "Witness the glory of ancient China's greatest rulers and the secrets of their giant tombs. Learn the ruthless military tactics and weapons technology of these all-powerful rulers and discover how the building of the Great Wall would unify that nation."
}, {
  "imdbId" : "0112054",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Rome: The Ultimate Empire",
  "description" : "Enter the Colosseum alongside the gladiators and their foes as they prepare for battle. This episode re-creates the glory of Rome at the zenith of its power and explains how the Romans conquered the western world. Learn the mistakes that led to the Empire's chaotic collapse."
}, {
  "imdbId" : "0112054",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Maya: The Blood of Kings",
  "description" : "Witness the dark rituals of human mutilation as the Maya rulers draw their own blood to offer to the gods. This episode reveals Maya culture at its peak---while its cities matched the sophistication and power of those in Europe in AD 800, this civilization declined suddenly a century later---leaving behind questions and enigmas."
}, {
  "imdbId" : "0112054",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Inca: Secrets of the Ancestors",
  "description" : "Witness the conquest of an Inca ruler at the pinnacle of his power. Follow Inca roads into the past and explore the secrets of their ancestors---the Moche, the Nazca, and the Paracas---whose legacies inspired the greatest South American empire ever."
}, {
  "imdbId" : "0112054",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "Africa: A History Denied",
  "description" : "Uncover the hidden history of Africa's great coastal kingdoms and its mysterious counterparts in the heartland of Zimbabwe and southern Africa. For years, this legacy has been denied---only now can the true story be revealed."
}, {
  "imdbId" : "0112054",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "Tibet: The End of Time",
  "description" : "Follow the tale of glory and tragedy as a young boy---the reincarnation of the Tibetan God-King---witnesses the collapse of a timeless culture. This episode explores a genuine Shangri-la and its struggle to survive in a hostile contemporary world."
}]
