[{
  "imdbId" : "0092484",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Pilot",
  "description" : "This was the pilot for the hit series. Ken Wahl stars as Vinnie Terranova, a Justice Department agent reassigned to the Organized Crime Bureau (OCB) as a \"wiseguy\", a specially trained deep undercover agent. To help support his cover, Vinnie has just finished serving 18 months in a New Jersey prison. Vinnie is frustrated that he can't tell his mother that he is a government agent and not the criminal that he is now perceived to be. He wants out of the assignment, but after a friend is killed while investigating the Steelgrave crime family, Vinnie decides to go after ..."
}, {
  "imdbId" : "0092484",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "New Blood",
  "description" : "In an attempt to take over Sonny Steelgrave's business, mob head Paul Patrice frames Sonny for several murder attempts he makes on the life of the special prosecutor investigating Sonny."
}, {
  "imdbId" : "0092484",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "The Loose Cannon",
  "description" : "A psychopathic murderer posing as Sonny's nephew double-crosses Sonny and holds Vinnie's girlfriend Gina hostage."
}, {
  "imdbId" : "0092484",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "The Birthday Surprise",
  "description" : "When Vinnie's young cousin, a boxer, is found dead of an apparent drug overdose, Vinnie jeopardizes his cover by going to \"legals\" -- the coroner, the homicide cops -- to get them moving on what he knows was a murder."
}, {
  "imdbId" : "0092484",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "One on One",
  "description" : "When the local cops put the heat on Sonny Steelgrave and bust up several of his secret deals, he smells a rat in the inner circle and Vinnie finds himself the number one suspect."
}, {
  "imdbId" : "0092484",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Prodigal Son",
  "description" : "After his mother is mugged in Brooklyn, an enraged Vinnie sets out to find the punk who did it, but when he visits his mother in the hospital, it breaks his heart that she still won't forgive him for his life of \"crime.\""
}, {
  "imdbId" : "0092484",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "A Deal's a Deal",
  "description" : "Sonny's cruel punishment of a lounge singer who wants out of his contract triggers a cascade of events that leads to Vinnie's being photographed with McPike -- a photo that is to be delivered to Sonny."
}, {
  "imdbId" : "0092484",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "The Marriage of Heaven and Hell",
  "description" : "Sonny's impending marriage to a syndicate boss' daughter begins a supposedly businesslike realignment of \"families, \" but Vinnie learns that the wedding is a pretext for a bloody gang war."
}, {
  "imdbId" : "0092484",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "No One Gets Out of Here Alive",
  "description" : "An outraged Sonny Steelgrave accuses Vinnie of betraying him to his arch-rival, then realizes the devastating truth -- that his paisan is an undercover Federal agent"
}, {
  "imdbId" : "0092484",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "Last Rites for Lucci",
  "description" : "In the aftermath of the Steelgrave case, Vinnie tries to vindicate himself of his lingering feelings of betrayal and disloyalty by risking his life to save an old friend from the Brooklyn neighborhood who has a contract out on him."
}, {
  "imdbId" : "0092484",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "Independent Operator",
  "description" : "Vinnie's assignment to check out a contract killer leads him into a huge global contraband syndicate -- an operation that far exceeds the scope of the Steelgrave family -- overlorded by brother and sister Mel and Susan Profitt."
}, {
  "imdbId" : "0092484",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "Fascination for the Flame",
  "description" : "Vinnie, now a bodyguard for the Profitts, gets his first trial by fire when Mel Profitt, the brilliant but paranoid overlord of an international crime empire, disrupts the wedding of an associate, who retaliates by kidnapping Susan."
}, {
  "imdbId" : "0092484",
  "season" : "1",
  "episodeNumber" : "13",
  "title" : "Smokey Mountain Requiem",
  "description" : "Vinnie tells Mel Profitt he is leaving to go hare to New Jersey, but Mel offers him the biggest cocaine distribution network in the country -- a plum that Vinnie feels is too juicy for any undercover cop to turn down."
}, {
  "imdbId" : "0092484",
  "season" : "1",
  "episodeNumber" : "14",
  "title" : "Player to Be Named Now",
  "description" : "When Mel's former girlfriend shows up, begging for readmission to the Inner circle, he humiliates her, using her as a sexual pawn in a power game with a rival, but for Vinnie, forced to watch it happen, the worst is yet to come."
}, {
  "imdbId" : "0092484",
  "season" : "1",
  "episodeNumber" : "15",
  "title" : "The Merchant of Death",
  "description" : "Vinnie retrieves secret records that enable Mel Profitt to blackmail a French official into buying munitions."
}, {
  "imdbId" : "0092484",
  "season" : "1",
  "episodeNumber" : "16",
  "title" : "Not for Nothing",
  "description" : "Small-time hood Aldo Baglia notices a photo of Vinnie in a newspaper, and tracks him down and shoots him for revenge."
}, {
  "imdbId" : "0092484",
  "season" : "1",
  "episodeNumber" : "17",
  "title" : "Squeeze",
  "description" : "When Mel Profitt's armaments deals go sour, he sends Vinnie back East to set up a narcotics import distribution deal with the mob."
}, {
  "imdbId" : "0092484",
  "season" : "1",
  "episodeNumber" : "18",
  "title" : "Blood Dance",
  "description" : "After rejecting an offer to finance a coup d'etat in the Caribbean, Mel Profitt becomes obsessed with a supposed voodoo death curse, and Vinnie, horrified, can only watch as Mel's personality begins to disintegrate."
}, {
  "imdbId" : "0092484",
  "season" : "1",
  "episodeNumber" : "19",
  "title" : "Phantom Pain",
  "description" : "After Susan is arrested for Mel's murder, Vinnie refuses McPike's order to pull out of the Profitt case, because Susan, who has seemingly lost her grip on reality, has told him she is pregnant with his child."
}, {
  "imdbId" : "0092484",
  "season" : "1",
  "episodeNumber" : "20",
  "title" : "Dirty Little Wars",
  "description" : "With Mel and Susan Profitt undone, McPike begins dismantling their empire, but Vinnie demands to stay on the case to get to the bottom of Roger Lococco's ties to a rogue CIA operation to stage a Caribbean coup d'etat."
}, {
  "imdbId" : "0092484",
  "season" : "1",
  "episodeNumber" : "21",
  "title" : "Date with an Angel",
  "description" : "Roger Loccoco in effect signs his own death warrant by testifying to a Senate comnittee about a cabal within the U.S. intelligence community, but to back him up he needs Vinnie to testify as an O.C.B. operative -- testimony that would end Vinnie's career as an uncercover agent."
}, {
  "imdbId" : "0092484",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "Going Home",
  "description" : "Vinnie's resignation from the Organized Crime Bureau leads him home and into a hotbed of racial hatred."
}, {
  "imdbId" : "0092484",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "School of Hard Knox",
  "description" : "Vinnie returns to the O.C.B. on his own terms, determined to infiltrate the radical racist organization that has threatened his family and friends."
}, {
  "imdbId" : "0092484",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "Revenge of the Mud People",
  "description" : "The local police leave their kid gloves behind when they haul Vinnie in, mistakenly believing he has murdered one of their own."
}, {
  "imdbId" : "0092484",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "Last of the True Believers",
  "description" : "Knox Pooley's explosive appearance on an issue-oriented talk show ends in tragedy, and Vinnie and Richie join forces to link yet another brutal murder to the Pilgrims of Promise evangelist."
}, {
  "imdbId" : "0092484",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "Aria for Don Aiuppo",
  "description" : "When Vinnie's mother falls in love with an organized crime boss, rekindling a romance that began in the old country, the O.C.B. asks Vinnie to intervene."
}, {
  "imdbId" : "0092484",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "7th Avenue Freeze Out",
  "description" : "Vinnie goes undercover for the O.C.B. as a garment-center security consultant to keep the new wave of organized crime leadership from destroying a father-and-son business."
}, {
  "imdbId" : "0092484",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "Next of Kin",
  "description" : "Another side of Eli is revealed when his son David is reported missing while on an overseas business trip."
}, {
  "imdbId" : "0092484",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "All or Nothing",
  "description" : "While David and Eli move to close their most important knock-off dress deal ever, Pinzolo uses the same deal -- and information from someone close to David - in an attempt to bury Eli and Elrose Fashions for good."
}, {
  "imdbId" : "0092484",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "Where's the Money?",
  "description" : "With Elrose Fashions in its death throes, David and Eli's tenuous relationship shatters, and David seeks to avenge his grievous losses against Rick Pinzolo."
}, {
  "imdbId" : "0092484",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "Postcard from Morocco",
  "description" : "David Sternberg's final act is to leave a letter incriminating Rick Pinzolo in a murder he witnessed, and Raglin desperately seeks to make the charges stick, as the OCB garment-center investigation draws to a disquieting close."
}, {
  "imdbId" : "0092484",
  "season" : "2",
  "episodeNumber" : "11",
  "title" : "Stairway to Heaven",
  "description" : "When Frank learns his wife is going to die, Vinnie uses some missing OCB funds to enable her to get a lifesaving transplant."
}, {
  "imdbId" : "0092484",
  "season" : "2",
  "episodeNumber" : "12",
  "title" : "White Noise",
  "description" : "Vinnie has no choice but to come out from behind his OCB badge to face the chilling accusations of mobster Sonny Steelgrave -- the friend he was forced to betray."
}, {
  "imdbId" : "0092484",
  "season" : "2",
  "episodeNumber" : "13",
  "title" : "Dead Dog Lives",
  "description" : "Vinnie and Frank hatch a plan to use a record company OCB acquired to gain entry into the corrupt music industry. Their target is a powerful player named Winston Newquay (Tim Curry)."
}, {
  "imdbId" : "0092484",
  "season" : "2",
  "episodeNumber" : "14",
  "title" : "And It Comes Out Here",
  "description" : "Corrupt music mogul Winston Newquay tries to buy out Vinnie's Dead Dog Records, but he instead opts to merge with Isaac Twine's company, Shakala. Newquay tries to take away Vinnie's contracted star, Diana Price."
}, {
  "imdbId" : "0092484",
  "season" : "2",
  "episodeNumber" : "15",
  "title" : "The Rip-Off Stick",
  "description" : "Newquay seduces Diana Price and she tells Vinnie she can't resist him because she's in love. Vinnie sends her to Jamaica for 6 months to get her away from Newquay."
}, {
  "imdbId" : "0092484",
  "season" : "2",
  "episodeNumber" : "16",
  "title" : "High Dollar Bop",
  "description" : "Vinnie and his record producer Johnny Medley try to steal Eddie Tempest, a hot property, from Winston Newquay. Newquay has Medley beaten severely. In a no-limit poker game, Newquay wins Shakala Records from Isaac Twine. Vinnie convinces Newquay to keep him on in the company."
}, {
  "imdbId" : "0092484",
  "season" : "2",
  "episodeNumber" : "17",
  "title" : "Hip Hop on the Gravy Train",
  "description" : "Vinnie and McPike use Isaac Twine, Eddie Tempest and Claudia Newquay to increase the pressure on Winston."
}, {
  "imdbId" : "0092484",
  "season" : "2",
  "episodeNumber" : "18",
  "title" : "The One That Got Away",
  "description" : "Newquay packages Eddie Tempest's live performances; classified information on Vinnie winds up in Travis' hands."
}, {
  "imdbId" : "0092484",
  "season" : "2",
  "episodeNumber" : "19",
  "title" : "Living and Dying in 4/4 Time",
  "description" : "The case against Newquay is dismissed as entrapment. After making a bet with Newquay that he will live to dance on his grave, Isaac dies of a heart attack. Vinnie lets Travis have Dead Dog Records, telling him to keep a chair warm for him for the future. Newquay goes insane and is institutionalized."
}, {
  "imdbId" : "0092484",
  "season" : "2",
  "episodeNumber" : "20",
  "title" : "Call It Casaba",
  "description" : "After Vinnie puts the Shakala Records investigation to rest, he and McPike take a trip to the mountains with Lifeguard, whose real-life problems may force him to quit the OCB."
}, {
  "imdbId" : "0092484",
  "season" : "2",
  "episodeNumber" : "21",
  "title" : "Le Lacrime D'Amore: Part 1",
  "description" : "After a restraining order keeps Vinnie away from Amber, Vinnie uncovers a plan to sell Shakala as part of a large real estate venture."
}, {
  "imdbId" : "0092484",
  "season" : "2",
  "episodeNumber" : "22",
  "title" : "Le Lacrime D'Amore: Part 2",
  "description" : "Not wanting to hurt his mother, Vinnie tries to resist an OCB investigation of his new stepfather while his relationship with Amber Twine grows ever closer."
}, {
  "imdbId" : "0092484",
  "season" : "3",
  "episodeNumber" : "1",
  "title" : "A Rightful Place",
  "description" : "While Don Aiuppo battles to survive an attempted assassination, Vinnie takes his place at the commission table, determined to bring down the family member who ordered the hit."
}, {
  "imdbId" : "0092484",
  "season" : "3",
  "episodeNumber" : "2",
  "title" : "Battle of the Barge",
  "description" : "When Cerrico and Tommy Chin tangle over rights to the carting business in Chinatown, Vinnie has to balance his undercover role as a mobster with his responsibility to the OCB."
}, {
  "imdbId" : "0092484",
  "season" : "3",
  "episodeNumber" : "3",
  "title" : "Sins of the Father",
  "description" : "In his bid for the governor's seat, Phil Alatorre plans to reveal Vinnie as a mob boss."
}, {
  "imdbId" : "0092484",
  "season" : "3",
  "episodeNumber" : "4",
  "title" : "Heir to the Throne",
  "description" : "Cemco moves to consolidate his power within the commission and asks Don Aiuppo for his blessing, but the unforgiving don, who blames Albert for the death of his son 20 years before, plans his playback -- even if it means endangering Vinnie's life."
}, {
  "imdbId" : "0092484",
  "season" : "3",
  "episodeNumber" : "5",
  "title" : "Sleepwalk",
  "description" : "On the advice of a therapist, Vinnie and Amber agree to confront their true feelings for each other on a retreat in Vermont."
}, {
  "imdbId" : "0092484",
  "season" : "3",
  "episodeNumber" : "6",
  "title" : "How Will They Remember Me?",
  "description" : "Some things that were with Pete are found and brought to Vince. And among them is a journal written by his father wherein he talks about a time when he got mixed up with some mobsters."
}, {
  "imdbId" : "0092484",
  "season" : "3",
  "episodeNumber" : "7",
  "title" : "People Do It All the Time",
  "description" : "Still disturbed by his daughter's marriage to an aspiring sculptor, as well as his impending grandfatherhood, Lifeguard intervenes when his son-in-law takes a construction job with a suspect company."
}, {
  "imdbId" : "0092484",
  "season" : "3",
  "episodeNumber" : "8",
  "title" : "Reunion",
  "description" : "Vinnie attends his high school's 15th reunion, but he finds that rekindling old and valued friendships is sticky when-his closest friends believe he's a gangster."
}, {
  "imdbId" : "0092484",
  "season" : "3",
  "episodeNumber" : "9",
  "title" : "Day One",
  "description" : "In order to avenge his disruption of the plot to takeover Isle Pavot, Vinnie is drawn into a plot to destabilize the Japanese economy led by Admiral Strichen and General Leland Masters."
}, {
  "imdbId" : "0092484",
  "season" : "3",
  "episodeNumber" : "10",
  "title" : "Day Four",
  "description" : "After the funeral of the assassinated economist Andrew Valenti, Vinnie accelerates his investigation into the covert plot behind the professor's murder."
}, {
  "imdbId" : "0092484",
  "season" : "3",
  "episodeNumber" : "11",
  "title" : "Day Seven",
  "description" : "The pieces of the diplomatic puzzle begin to come together for Vinnie as General Masters puts the final touches on his plot to make Vinnie the fall guy."
}, {
  "imdbId" : "0092484",
  "season" : "3",
  "episodeNumber" : "12",
  "title" : "Day Nine",
  "description" : "In a Senate executive session, a falsely accused Vinnie is systematically stripped of his honor, even as Gen. Masters' diabolical scheme is exposed."
}, {
  "imdbId" : "0092484",
  "season" : "3",
  "episodeNumber" : "13",
  "title" : "Meet Mike McPike",
  "description" : "When cantankerous Mike McPike is asked to leave his nursing home--the latest in a string of them-- he \"retires\" temporarily to the home of his son Frank, who is so close to his father that everyone, including Vinnie, thought the man was dead."
}, {
  "imdbId" : "0092484",
  "season" : "3",
  "episodeNumber" : "14",
  "title" : "To Die in Bettendorf",
  "description" : "Sid Royce, the man who worked for Sonny Steelgrave, who after being arrested was placed in the witness protection program. And McPike, feeling that he doesn't deserve it, was the one who chose where he was relocated to and his cover name. And he was sent to a place in the middle of nowhere and his name is Elvis Prim. When his wife who hates what has happened to them runs away. Royce then bolts and goes looking for McPike and does when he is trying to work things out with his wife. He puts a gun on McPike and demands he locate his wife."
}, {
  "imdbId" : "0092484",
  "season" : "3",
  "episodeNumber" : "15",
  "title" : "Romp",
  "description" : "Vinnie joins his old neighborhood friends for a bachelor party but ends up finding one of his pals in trouble with a loan shark."
}, {
  "imdbId" : "0092484",
  "season" : "3",
  "episodeNumber" : "16",
  "title" : "A One Horse Town",
  "description" : "Vinnie goes underground as a small-town deputy to root out the corruption in a company town run by one man -- the reclusive Old Man Volchek."
}, {
  "imdbId" : "0092484",
  "season" : "3",
  "episodeNumber" : "17",
  "title" : "His Master's Voice",
  "description" : "Vinnie enlists Frank's help when two of Stem's deputies are murdered."
}, {
  "imdbId" : "0092484",
  "season" : "3",
  "episodeNumber" : "18",
  "title" : "Hello Buckwheat",
  "description" : "Vinnie bolts after watching Stem kill himself by electrocuting himself, which was the same way Sonny Steelgrave killed himself. Frank doesn't know what he's going to do now in regards to Vochek. But suddenly Roger Laccocco shows up. It seems Vince called him to ask him to help Frank."
}, {
  "imdbId" : "0092484",
  "season" : "3",
  "episodeNumber" : "19",
  "title" : "Let Them Eat Cake",
  "description" : "McPike and Lococco wrap up their investigation of Volchek while Vinnie takes a job with an unscrupulous waste disposal company."
}, {
  "imdbId" : "0092484",
  "season" : "3",
  "episodeNumber" : "20",
  "title" : "Meltdown",
  "description" : "McPike and Lococco help Volchek come to grips with his family's legacy while Vinnie moves to stop the illegal dumping of hospital wastes."
}, {
  "imdbId" : "0092484",
  "season" : "3",
  "episodeNumber" : "21",
  "title" : "Sanctuary",
  "description" : "Vinnie's crusade against illegal waste dumping uncovers a web of political ties to organized crime figures."
}, {
  "imdbId" : "0092484",
  "season" : "3",
  "episodeNumber" : "22",
  "title" : "Brrump-Bump",
  "description" : "As McPike is near death in a coma, Kousakis plans to kill Boden and Weiss from his hideaway in Father Patrick's church."
}, {
  "imdbId" : "0092484",
  "season" : "4",
  "episodeNumber" : "1",
  "title" : "Fruit of the Poisonous Tree: Part 1",
  "description" : "When Vinnie Terranova disappears, McPike fears he has been kidnapped by a right wing Salvadoran death squad, and his investigation locks him into a reluctant alliance with Michael Santana, a disbarred Cuban-American Federal prosecutor contracted by Terranova shortly before he disappeared. Part 1 of 2."
}, {
  "imdbId" : "0092484",
  "season" : "4",
  "episodeNumber" : "2",
  "title" : "Fruit of the Poisonous Tree: Part 2",
  "description" : "When Vinnie Terranova disappears, McPike fears he has been kidnapped by a right wing Salvadoran death squad, and his investigation locks him into a reluctant alliance with Michael Santana, a disbarred Cuban-American Federal prosecutor contracted by Terranova shortly before he disappeared. Part 2 of 2."
}, {
  "imdbId" : "0092484",
  "season" : "4",
  "episodeNumber" : "3",
  "title" : "Black Gold",
  "description" : "The arrival of a shipload of Haitian \"boat people\" in Miami inadvertently interferes in Santana and McPike's plans to catch Guzman in an illegal act, and opens up a new case."
}, {
  "imdbId" : "0092484",
  "season" : "4",
  "episodeNumber" : "4",
  "title" : "The Gift",
  "description" : "Santana impresses Guzman with his trustworthiness and finds himself getting deeper into Guzman's operations, a move that endangers his father and Dahlia."
}, {
  "imdbId" : "0092484",
  "season" : "4",
  "episodeNumber" : "5",
  "title" : "La Mina",
  "description" : "Santana learns the details of Guzman's money laundering operation and comes face to face with the drug lord who cost him his job as a Federal prosecutor."
}, {
  "imdbId" : "0092484",
  "season" : "4",
  "episodeNumber" : "6",
  "title" : "Witness Protection for the Archangel Lucifer",
  "description" : "Arnado Guzman, hiding out in El Salvador, contacts his trusted \"son,\" Michael Santana, to bring him funds, and Santana concocts a plan to bring him back to justice."
}, {
  "imdbId" : "0092484",
  "season" : "4",
  "episodeNumber" : "7",
  "title" : "Point of No Return",
  "description" : "When his brother-in-law disappears, Santana is drawn into a web of police corruption."
}, {
  "imdbId" : "0092484",
  "season" : "4",
  "episodeNumber" : "8",
  "title" : "Dead Right",
  "description" : "Hillary asks Frank and Santana for help in a lawsuit involving defective aircraft parts."
}, {
  "imdbId" : "0092484",
  "season" : "4",
  "episodeNumber" : "9",
  "title" : "Changing Houses",
  "description" : "Santana goes after a group of high school drug dealers who shot his niece after she witnessed the murder of her high school principal."
}]
