[{
  "imdbId" : "0163949",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Shanghai Express",
  "description" : "Sammo Law a cop from China comes to L.A. to find a criminal. The LAPD assigns him two cops to help him."
}, {
  "imdbId" : "0163949",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Diamond Fever",
  "description" : "Sammo uncovers a diamond counterfeiting and smuggling operation ran by a major Chinese criminal, Lee Hei."
}, {
  "imdbId" : "0163949",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Dead Ringers",
  "description" : "When fighters start dying in an Internet based all-in-fighting competition the LAPD are called in. Louis goes undercover to see whether or not the fighters are being murdered."
}, {
  "imdbId" : "0163949",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Funny Money",
  "description" : "With the help of a federal agent Sammo and his fellow officers go after a gang who are counterfeiting money."
}, {
  "imdbId" : "0163949",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Cop Out",
  "description" : "Using his status as a new and unknown member of the LAPD Sammo goes undercover to help the team root out a group of vigilante cops."
}, {
  "imdbId" : "0163949",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Extreme Measures",
  "description" : "Sammo and his colleagues try to discover the whereabouts a group of White Supremacists armed with heavy weapons."
}, {
  "imdbId" : "0163949",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Trackdown",
  "description" : "The murder of a DA leads to Sammo and his colleagues uncovering a lawyer who hires a gang to steal prosecution evidence."
}, {
  "imdbId" : "0163949",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Take Out",
  "description" : "A friend of Sammo's owns a restaurant. He refuses to sell to Nathan Babbott, a big businessman, and then gets attacked. To help his friend Sammo begins an investigation into Babbott. Sammo has problems trying to open a checking account at the local bank."
}, {
  "imdbId" : "0163949",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "How Sammo Got His Groove Back",
  "description" : "Terrell Parker, an LAPD press officer, sees his cousin, a rap artist shot by an assassin. His life saved only by the appearance of Sammo and Louis. Terrell tries to get himself involved in the investigation by partnering up with Sammo. Between them they uncover a CD bootlegging operation."
}, {
  "imdbId" : "0163949",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "Bad Seed",
  "description" : "Winship discovers that his niece is involved with a Triad gang and assigns Sammo and Terrell to track her down. Terrell is now part of the department."
}, {
  "imdbId" : "0163949",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "Lock-Up",
  "description" : "Sammo and Terrell go undercover to infiltrate a gun-smuggling operation run by prison inmates."
}, {
  "imdbId" : "0163949",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "Painted Faces",
  "description" : "Sammo's nemesis, Lee Hei, is back in the US and attempts to assassinate the mayor of Shanghai."
}, {
  "imdbId" : "0163949",
  "season" : "1",
  "episodeNumber" : "13",
  "title" : "Substitutes",
  "description" : "Sammo discovers that a legendary gangster and drugs dealer has left Colombia and come back to Los Angeles, looking for his ex-wife and son."
}, {
  "imdbId" : "0163949",
  "season" : "1",
  "episodeNumber" : "14",
  "title" : "Wild Life",
  "description" : "Sammo and Terrell try to nail an illegal animal trading and hunting ring."
}, {
  "imdbId" : "0163949",
  "season" : "1",
  "episodeNumber" : "15",
  "title" : "Breakout",
  "description" : "A prisoner escapes from jail and goes looking for the $3 million he and his colleagues stole 5 years earlier."
}, {
  "imdbId" : "0163949",
  "season" : "1",
  "episodeNumber" : "16",
  "title" : "Captive Hearts",
  "description" : "Sammo and Terrell pursue a sweatshop proprietor suspected of selling babies."
}, {
  "imdbId" : "0163949",
  "season" : "1",
  "episodeNumber" : "17",
  "title" : "Trifecta",
  "description" : "Billy Rafferty, Terrell's former partner is found murdered. Terrell and Sammo investigate the last case he was working on, working undercover at a racetrack."
}, {
  "imdbId" : "0163949",
  "season" : "1",
  "episodeNumber" : "18",
  "title" : "Big Trouble",
  "description" : "A gang threatens the supermarket owned by Terrell's mum and step dad. He decides that he is going to help them out and enlists Sammo to aid him"
}, {
  "imdbId" : "0163949",
  "season" : "1",
  "episodeNumber" : "19",
  "title" : "Nitro Man",
  "description" : "During a robbery at Melanie's bank she ends up as a hostage and is kidnapped. Sammo is desperate to find her and save her from danger."
}, {
  "imdbId" : "0163949",
  "season" : "1",
  "episodeNumber" : "20",
  "title" : "Red Storm",
  "description" : "While waiting at the airport for the arrival of his teacher, Master Reng, from China, Sammo gets involved with trying to stop a gang of crazed terrorists."
}, {
  "imdbId" : "0163949",
  "season" : "1",
  "episodeNumber" : "21",
  "title" : "Requiem",
  "description" : "Lee Hei and his daughter, Lin Pai Chin, are back in America trying to set up a big drug deal to finance their other criminal activities."
}, {
  "imdbId" : "0163949",
  "season" : "1",
  "episodeNumber" : "22",
  "title" : "End Game",
  "description" : "Lee Hei and his daughter continue to cause trouble for Sammo and his fellow cops. This time though they are told that if they don't catch them then their unit could be shut down."
}, {
  "imdbId" : "0163949",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "Sammo Blammo",
  "description" : "The MCU gets a new chief, Amy Dillon, after Winship retires. As soon as she takes up her appointment Sammo is kidnapped by a recently released thief and has a very complex bomb strapped to his chest. Daniel Darius, the thief, was part of a team who managed to steal over $50 million worth of art from an auction house. He was the only one who was caught and now he wants his share of the money. Problem is he has no idea who the rest of the team were and has only very brief descriptions of them. The MCU has only 8 hours to solve a 15 year old case before Sammo goes Blammo!"
}, {
  "imdbId" : "0163949",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "Thieves Among Thieves",
  "description" : "Sammo and Tyrell are working undercover with some jewel thieves when they are attacked by another group of, heavily armed, thieves. They attack their own comrades and join the new gang so that they can find out who they are, and who they are working for. The new gang specialises in robbing other gangs of criminals which leaves Sammo and Tyrell in a dangerous situation. The MCU have no idea where their two fellow officers are or what they are up to."
}, {
  "imdbId" : "0163949",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "This Shogun for Hire",
  "description" : "A notorious Japanese assassin arrives in America, brought in by Gordon Ganza, a top ranking drug dealer. He is there to make sure that a deal with the Bolivians goes through by killing a public official that is causing them difficulties. Grace, who is working undercover in the Ganza organization, tries to get close to Nakamura so that she can find out who his target is and get that information back to Sammo & Terrell."
}, {
  "imdbId" : "0163949",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "24 Hours",
  "description" : "Sammo and Tyrell are given the assignment of 'babysitting' a prisoner who has been given permission to go to his sisters funeral. The prisoner is Alistair Temple, 'The Silver Phantom', a master criminal who is known to be able to get in anywhere, get out of any restraints and should never, never be left unguarded! When the three of them get to the church they are ambushed and Temple is taken from Sammo and Tyrell. Can Sammo, Tyrell and Grace find Temple, uncover who took him and why and manage to do it all before the news of his escape gets out and ruins Amy's chance ..."
}, {
  "imdbId" : "0163949",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "Ninety Million Reasons to Die",
  "description" : "A visit to the bank reveals that $6 million dollars has been deposited in Sammo's account. He is still wondering what is going on as he leaves the bank and is immediately approached and kidnapped by some men. They want to know how he knows Alison and where she is? When he manages to escape he is determined to track down this girl before his captors do and find out exactly what is going on."
}, {
  "imdbId" : "0163949",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "My Man Sammo",
  "description" : "Sammo and Tyrell accidentally mess up an Interpol undercover operation when they arrest some arms dealers. Charlton McCallister, the Interpol agent, knows that the female arms dealer he was pretending to work for has a very big deal coming up. Amy volunteers to go undercover, even though she has no experience of that kind of work. At her first meeting McCallister gets shot and injured and she has to carry on without him. Sammo takes on the part of her butler/bodyguard so that they can try and find out exactly what is being sold and who is out to buy it."
}, {
  "imdbId" : "0163949",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "Friendly Skies",
  "description" : "Grace and Tyrell take a flight escorting some of the worst criminals known to a maximum-security prison. One of the guards pulls a gun on the pilot and forces him to fly below radar level and then releases the convicts. The leader is a man Grace helped put away for murder and he wants to get revenge on her almost as much as he wants to complete his plan for a major crime. The MCU start to discover what he is up to and find that his plan is more audacious then they could have imagined."
}, {
  "imdbId" : "0163949",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "Call of the Wild",
  "description" : "A mild mannered man, with no criminal record, walks into an office and kills the man inside. When Sammo catches up with him he nearly kills him as well, with martial arts skills. According to his wife he didn't even know any martial arts skills. Tyrell's ex turns up with stories about her becoming a werewolf on full moons and going out and stalking someone. Are there any connections between these two occurrences? The MCU soon begins to think there is and start investigating."
}, {
  "imdbId" : "0163949",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "Blue Flu",
  "description" : "A biological virus is unleashed in a police precinct and the whole station is quarantined. Sammo and Tyrell investigate a student who stole the virus from his university by injecting it into himself. While they try to find out where the virus and vaccine is, and who is behind the outbreak, Amy and Grace find themselves quarantined in the MCU precinct when it to is attacked."
}, {
  "imdbId" : "0163949",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "Sammo Claus",
  "description" : "Know what this is about?"
}, {
  "imdbId" : "0163949",
  "season" : "2",
  "episodeNumber" : "11",
  "title" : "No Quarter",
  "description" : "Know what this is about?"
}, {
  "imdbId" : "0163949",
  "season" : "2",
  "episodeNumber" : "12",
  "title" : "Scorpio Rising",
  "description" : "Know what this is about?"
}, {
  "imdbId" : "0163949",
  "season" : "2",
  "episodeNumber" : "13",
  "title" : "No Fare",
  "description" : "Having not taken any time off for two years Sammo is told that he has to take a week off. It doesn't take him long to go stir crazy and he offers to help his neighbor, just out of hospital, by driving his cab for him. Meanwhile the rest of the MCU are involved in looking for a jewel thief and the murderer of a Marine Biologist."
}, {
  "imdbId" : "0163949",
  "season" : "2",
  "episodeNumber" : "14",
  "title" : "Dog Day Afternoon",
  "description" : "Sammo ends up looking after a dog after his owner is found murdered. While investigating the murder Sammo is attacked and the men try to grab Homer, the dog, in the process. The MCU team decides that there is more to this dog then first seems apparent and decide to find out as much as they can about it and his owner, Mason Talbot. They hope this will lead them to the reason for his death and who murdered him."
}, {
  "imdbId" : "0163949",
  "season" : "2",
  "episodeNumber" : "15",
  "title" : "Deathfist Five: MCU",
  "description" : "Jake Cord, international action star of the Deathfist movies, is assigned to follow Sammo and Tyrell. His latest Deathfist movie is going to involve the MCU and he wants to learn more about their work to make his film more authentic. The case Sammo and Tyrell are investigating is that of an arson attack at a judges' house. The arson was more than the normal matches and gasoline, there were traces of the fuel used in flame-throwers found at the site."
}, {
  "imdbId" : "0163949",
  "season" : "2",
  "episodeNumber" : "16",
  "title" : "Honor Among Strangers",
  "description" : "An ex-army man, Cliff Eagleton, and his men, The Freedom Brigade, rob a bank equipped with fully automatic weapons and body armor. A Military Intelligence Officer, Lt. Garrett, reveals that he escaped from a court and killed a Texas Ranger. She also tells them that the guns they managed to capture at the robbery were supposed to have been scrapped at an Army base. Grace goes undercover at the base to find out why they were not scrapped and who on the base is involved. Sammo meanwhile teams up with Walker, a Texas Ranger, who is also after Eagleton."
}, {
  "imdbId" : "0163949",
  "season" : "2",
  "episodeNumber" : "17",
  "title" : "Freefall",
  "description" : "A new generation of spy satellite crashes down to earth in downtown LA. The FBI tells Amy that the only missing piece is extremely radioactive. If it is opened it could irradiate half the city. Involved in the bringing down of the satellite are the criminal cult Scorpio and their mysterious leader 'The One'. FBI agent Wick insists that Sammo and Grace are not to be allowed to participate in the case because they are both Chinese nationals and are probably Chinese spies. While this is going on Sammo is also trying to track down the whereabouts of his son, Lone Wei."
}, {
  "imdbId" : "0163949",
  "season" : "2",
  "episodeNumber" : "18",
  "title" : "The Thrill Is Gone",
  "description" : "A new designer drug hits the street. It is called 'Thrill' and it breaks down your inhibitions and imbues you with a euphoric sense of invincibility. Sammo and Tyrell have to deal with a gang of 'Thrill junkies' when a traffic jam they are in is attacked. They stop the gang but Sammo's leg is broken in the process. He ends up in the same hospital as Ludlow Teale, the government's chief negotiator for the Middle East. Kyle Strode returns to town and Grace continues trying to get inside his organization so that she can find Lone Wei. The MCU investigations reveal that ..."
}, {
  "imdbId" : "0163949",
  "season" : "2",
  "episodeNumber" : "19",
  "title" : "Heartless",
  "description" : "Know what this is about?"
}, {
  "imdbId" : "0163949",
  "season" : "2",
  "episodeNumber" : "20",
  "title" : "In the Dark",
  "description" : "Sammo and Tyrell go to a prison to pick up Anton Trimble, the highest ranking Scorpio member ever captured alive. Scorpio tries to rescue him and show off their new weapon at the same time. They use an EMP weapon to disable all the electronics in the prison and the surrounding area. Sammo and Tyrell escape with Anton and are chased by a group of Scorpio agents. Meanwhile Grace is trying to find a way to get into Scorpio via her links with Kyle Strode."
}, {
  "imdbId" : "0163949",
  "season" : "2",
  "episodeNumber" : "21",
  "title" : "Final Conflict: Part 1",
  "description" : "The MCU discover that Scorpio began in Shanghai and has a personal grudge against Sammo. 'The One' steps up his campaign to kill Sammo by first dealing with his friends and family. He already has his son as a member of Scorpio and next he kidnaps Amy and her fiancé and buries them alive in their limo. Sammo, Grace and Tyrell have to find out where Amy is before he targets the next one of them."
}, {
  "imdbId" : "0163949",
  "season" : "2",
  "episodeNumber" : "22",
  "title" : "Final Conflict: Part 2",
  "description" : "Know what this is about?"
}]