[{
  "imdbId" : "1132290",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Pilot",
  "description" : "Secret Service Agents Pete Lattimer and Myka Bering are assigned to protect an exposition in Washington D.C., but they fail and a rare Aztec stone is stolen. However, they are individually assigned to a matter of national security by the mysterious Mrs. Irene Frederic and they meet each other in a warehouse in South Dakota, the Badlands. They are welcomed by the clumsy Arthur \"Artie\" Nelson, who shows them thousand of artifacts stored there to protect mankind against their powers. Pete and Myka travel to Iowa to investigate the reason why law student Cody Thomas has ..."
}, {
  "imdbId" : "1132290",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Resonance",
  "description" : "Pete and Myka are sent to Chicago to investigate a series of odd bank robberies. During their investigation, they have a run-in with Bonnie Belski, a persistent FBI agent looking for a logical explanation for the happenings. It seems the bank robbers are using a device that creates a sound resonance so severe, it sort of hypnotizes all who hear it and leaves them in a state of euphoria for minutes after. It's up to Myka and Pete to figure out where the robbers will strike next and retrieve whatever bizarre object they are employing. Meanwhile, Artie examines a ..."
}, {
  "imdbId" : "1132290",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Magnetism",
  "description" : "Pete and Myka are sent to investigate a small town where the inhabitants' minds are being altered making them act as they please. Meanwhile, Artie is confused by the energy flows going on in the warehouse and he seeks help from Leena who may know more about what is going on."
}, {
  "imdbId" : "1132290",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Claudia",
  "description" : "Artie is kidnapped by a woman who blames him for the death of her brother."
}, {
  "imdbId" : "1132290",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Elements",
  "description" : "The Warehouse team pursues an artifact collector who is trying to gather together sculptures of the four elements thinking they will enable him to find the secret to obtaining god-like powers."
}, {
  "imdbId" : "1132290",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Burnout",
  "description" : "Pete and Myka hunt for a lethal artifact but it finds Pete first. As Pete prepares to sacrifice himself as did the first Warehouse agent who recovered it, Myka searches for a way to save him, if she can find him."
}, {
  "imdbId" : "1132290",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Implosion",
  "description" : "The theft of the perfect Samurai sword attracts Atrie's attention because he suspects his former partner and current nemesis; McPherson."
}, {
  "imdbId" : "1132290",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Duped",
  "description" : "Pete's goofing around with Lewis Carroll's mirror creates a mishap in the warehouse with bad consequences for Myka, but there's no time to learn of it as Artie has to send his agents out right away to discover how two small-time crooks are suddenly able to rake in millions at the casinos without raising any eyebrows."
}, {
  "imdbId" : "1132290",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "Regrets",
  "description" : "A prison, a new warden, and a charismatic preacher inmate who may have a artifact seems related to a string prisoner suicides accompanied by hallucinations. Pete and Myka search for the artifact as an approaching tropical storm accentuates it's influence but get caught up in the mayhem."
}, {
  "imdbId" : "1132290",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "Breakdown",
  "description" : "While Artie undergoes a Warehouse style performance review things go from a little haywire to seriously bad at the Warehouse."
}, {
  "imdbId" : "1132290",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "Nevermore",
  "description" : "The Warehouse team narrowly misses nabbing McPherson then Myka's father falls under the influence of an artifact that resists the purple goo."
}, {
  "imdbId" : "1132290",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "MacPherson",
  "description" : "Mrs. Frederics explains the reason for MacPeherson's break with the Warehouse program. Depite some extreme precautions he managed to get his hands on some artifacts that he plans to auction. But to Artie and the team it all sounds like a smoke screen for a more nefarious plan."
}, {
  "imdbId" : "1132290",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "Time Will Tell",
  "description" : "MacPherson escapes with what he took from the warehouse's bronze sector, and a car crash puts Mrs. Frederic in the hospital. Meanwhile Pete and Myka head London to gather clues about MacPherson's plan."
}, {
  "imdbId" : "1132290",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "Mild Mannered",
  "description" : "Myka and Pete go to Detroit after a seemingly invulnerable vigilante begins using extraordinary means to thwart criminals. Meanwhile, the rest of the team tries to get past recent events while improving conditions at the warehouse."
}, {
  "imdbId" : "1132290",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "Beyond Our Control",
  "description" : "For the first time, residents of \"Univille\" (Warehouse 13's hometown) begin experiencing bizarre and increasingly powerful events leading to the discovery that a dangerous artifact is loose in their own backyard."
}, {
  "imdbId" : "1132290",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "Age Before Beauty",
  "description" : "When young supermodels rapidly age 50 years overnight, Pete and Myka go undercover in the glam world of high fashion to discover who - and what - is behind the transformations."
}, {
  "imdbId" : "1132290",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "13.1",
  "description" : "Douglas Fargo of Eureka's Global Dynamics is sent to Warehouse 13 to help update its aging computer system. This triggers a seemingly sentient computer virus that sends the Warehouse into lockdown and traps the team inside."
}, {
  "imdbId" : "1132290",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "Around the Bend",
  "description" : "Pete's mission to find a traitor leads him into conflict with the Warehouse team."
}, {
  "imdbId" : "1132290",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "For the Team",
  "description" : "Claudia gets some on the job training in her first field assignment with Myka. But she's a bit overwhelmed by the hunky guys on the wrestling team they're investigating despite their tendency toward spontaneous human combustion. Fortunatly H. G. Wells lends a hand seeking a sympathetic if skeptical ear from Myka. Poor Pete, stuck back at the warehouse, helps Artie with his infatuation with the warehouse doctor and then takes action on his own infatuation."
}, {
  "imdbId" : "1132290",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "Merge with Caution",
  "description" : "Pete and Myka's attempt to get normal is interrupted by an artifact."
}, {
  "imdbId" : "1132290",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "Vendetta",
  "description" : "When a dangerous artifact is used to murder a close colleague in a plot involving revenge against Artie, Katie Logan, a Secret Service Agent from Pete's past, becomes embroiled in the case."
}, {
  "imdbId" : "1132290",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "Where and When",
  "description" : "Pete and Myka use H.G. Wells's time machine to travel back to 1961."
}, {
  "imdbId" : "1132290",
  "season" : "2",
  "episodeNumber" : "11",
  "title" : "Buried",
  "description" : "The team unearths an earlier Warehouse in search of a cure for Mrs. Frederic's mystery illness."
}, {
  "imdbId" : "1132290",
  "season" : "2",
  "episodeNumber" : "12",
  "title" : "Reset",
  "description" : "Wells' treacherous attack and devastating betrayal in Egypt has set into motion the plan she has been secretly orchestrating for more than one hundred years. When it becomes clear that Wells has her hands on the original weapon of mass destruction, Artie, Claudia and Mrs. Frederic race against the clock to stop her deadly endgame."
}, {
  "imdbId" : "1132290",
  "season" : "2",
  "episodeNumber" : "13",
  "title" : "Secret Santa",
  "description" : "Pete and Myka hunt down a malevolent artifact-wielding Santa Claus and come to the aid of a businessman. Meanwhile, Artie is reunited with his estranged father Isadore after 30 years."
}, {
  "imdbId" : "1132290",
  "season" : "3",
  "episodeNumber" : "1",
  "title" : "The New Guy",
  "description" : "A rock legend's guitar becomes a menace in Jersey City, N.J., and Artie and Claudia run into an ATF agent who has a knack for knowing when people lie."
}, {
  "imdbId" : "1132290",
  "season" : "3",
  "episodeNumber" : "2",
  "title" : "Trials",
  "description" : "The team becomes involved in a number of cases where people undergo dramatic mental aberrations that see them regress to their childhood. The team searches for a cure as well as a possible connection to a high profile murder case."
}, {
  "imdbId" : "1132290",
  "season" : "3",
  "episodeNumber" : "3",
  "title" : "Love Sick",
  "description" : "While Artie and Claudia investigate people turning into clay in Salt Lake City, Pete and a blonde Myke wake up together naked in Artie's bedroom and discover Steve missing."
}, {
  "imdbId" : "1132290",
  "season" : "3",
  "episodeNumber" : "4",
  "title" : "Queen for a Day",
  "description" : "As Steve and Claudia seek Ulysses S. Grant's flask within a Civil War re-enactment, Pete and Mika crash his ex-wife's wedding before a bee artifact gives everyone a hive mentality."
}, {
  "imdbId" : "1132290",
  "season" : "3",
  "episodeNumber" : "5",
  "title" : "3... 2... 1",
  "description" : "H. G. Wells is retrieved from stasis as a hologram to help the Warehouse team track down the ram's horn that brought down the walls of Jerico."
}, {
  "imdbId" : "1132290",
  "season" : "3",
  "episodeNumber" : "6",
  "title" : "Don't Hate the Player",
  "description" : "Pete, Claudia and Myka answer an emergency call when Fargo from Eureka gets trapped in a virtual reality fantasy game of his own making."
}, {
  "imdbId" : "1132290",
  "season" : "3",
  "episodeNumber" : "7",
  "title" : "Past Imperfect",
  "description" : "While artifact-hunting with Pete, Myka spots the man who killed her former partner and resolves to bring him in. Meanwhile, Artie mind-melds with a dog."
}, {
  "imdbId" : "1132290",
  "season" : "3",
  "episodeNumber" : "8",
  "title" : "The 40th Floor",
  "description" : "The Regents are under attack and several have been assassinated. It's up to the Warehosuse 13 crew to thwart the current attack by an unknown organization equipped with artifacts."
}, {
  "imdbId" : "1132290",
  "season" : "3",
  "episodeNumber" : "9",
  "title" : "Shadows",
  "description" : "As Pete and Jane travel down Memory Lane, Myka and Claudia find a young woman at the center of several flash disappearances, all beyond sight of any artifact."
}, {
  "imdbId" : "1132290",
  "season" : "3",
  "episodeNumber" : "10",
  "title" : "Insatiable",
  "description" : "Frozen, flesh-eating zombies run amok on a campus in Ithaca, New York. Meanwhile, Death will stop at nothing to claim its next victim - Claudia."
}, {
  "imdbId" : "1132290",
  "season" : "3",
  "episodeNumber" : "11",
  "title" : "Emily Lake",
  "description" : "In trying to thwart Walter Sykes' plan to free H.G Wells, the field agents encounter Walter's latest recruit - Steve."
}, {
  "imdbId" : "1132290",
  "season" : "3",
  "episodeNumber" : "12",
  "title" : "Stand",
  "description" : "Pete and Myka race to stop Sykes from using his own cache of artifacts to destroy them and the Warehouse."
}, {
  "imdbId" : "1132290",
  "season" : "3",
  "episodeNumber" : "13",
  "title" : "The Greatest Gift",
  "description" : "It's nearly Christmas, and a brush with the upholstery brush of Philip Van Doren Stern bears Pete from his wonderful life into a world where he's never been born."
}, {
  "imdbId" : "1132290",
  "season" : "4",
  "episodeNumber" : "1",
  "title" : "A New Hope",
  "description" : "Warehouse 13 has been destroyed, Pandora's Box has been opened, and quite possibly the only hope left in the world lies in the use of a dangerous, evil artifact with the ability to turn back time."
}, {
  "imdbId" : "1132290",
  "season" : "4",
  "episodeNumber" : "2",
  "title" : "An Evil Within",
  "description" : "Pete and Myka investigate a mysterious case where mobs of angry people are hallucinating en masse and attacking innocents."
}, {
  "imdbId" : "1132290",
  "season" : "4",
  "episodeNumber" : "3",
  "title" : "Personal Effects",
  "description" : "It's all hands on deck to prevent a small town from being wiped off the map when a box full of Artifacts is accidently unleashed there."
}, {
  "imdbId" : "1132290",
  "season" : "4",
  "episodeNumber" : "4",
  "title" : "There's Always a Downside",
  "description" : "Pete and Claudia reunite with Warehouse alum Hugo (Rene Auberjonois) to track down a deadly artifact at his nephew's prep school, while Myka and Steve investigate an Artifact that is killing an up and coming musician (Sam Huntington) in New Orleans."
}, {
  "imdbId" : "1132290",
  "season" : "4",
  "episodeNumber" : "5",
  "title" : "No Pain No Gain",
  "description" : "Pete and Myka investigate a hockey player who seems to be miraculously and instantly recovering from serious game injuries, while Claudia is invited to a mysterious lunch by Mrs. Frederic. Elsewhere, Artie and Steve discover someone has been stealing artifacts from inside the Warehouse."
}, {
  "imdbId" : "1132290",
  "season" : "4",
  "episodeNumber" : "6",
  "title" : "Fractures",
  "description" : "Someone has stolen Lewis Carroll's Mirror from inside the Warehouse allowing the psychotic and murderous spirit of Alice Liddell to escape again. Our team must stop her killing spree before one of them ends up dead."
}, {
  "imdbId" : "1132290",
  "season" : "4",
  "episodeNumber" : "7",
  "title" : "Endless Wonder",
  "description" : "Pete and Myka follow the trail of an artifact that seems to make people taller at first, only to cause them to get sick and die later. During the investigation, Pete gets involved with an attractive female drug company associate, who ends up suspecting Pete and Myka aren't just plain, average Secret Service agents. Meanwhile, Artie, Steve and Claudia follow up on the investigation of Brother Adrian and the missing artifacts. Claudia finds out what was really behind what she considered Steve's strange behavior."
}, {
  "imdbId" : "1132290",
  "season" : "4",
  "episodeNumber" : "8",
  "title" : "Second Chance",
  "description" : "Pete and Myka investigate the case of people literally rusting away in a West Virginia mill town. Steve and Claudia visit his hometown in New Jersey in a bid to end his dependence on the Metronome."
}, {
  "imdbId" : "1132290",
  "season" : "4",
  "episodeNumber" : "9",
  "title" : "The Ones You Love",
  "description" : "Pete, Myka, and Claudia each travel to save a loved one who has fallen victim to an artifact, Mrs. Frederic and Steve head to the Vatican to investigate the Brotherhood, and Artie has an impossible showdown with Brother Adrian."
}, {
  "imdbId" : "1132290",
  "season" : "4",
  "episodeNumber" : "10",
  "title" : "We All Fall Down",
  "description" : "His personality split after using the Astrolabe, Artie embarks on a scheme to release a deadly virus that could wipe out half the world's population."
}, {
  "imdbId" : "1132290",
  "season" : "4",
  "episodeNumber" : "11",
  "title" : "The Living and the Dead",
  "description" : "Following the orchid's release in Germany, Pete and Myka must race to stop a global plague before it kills half the world's population."
}, {
  "imdbId" : "1132290",
  "season" : "4",
  "episodeNumber" : "12",
  "title" : "Parks and Rehabilitation",
  "description" : "Pete and Claudia travel to Oregon to investigate a series of earthquake-related accidents occurring in a National Park."
}, {
  "imdbId" : "1132290",
  "season" : "4",
  "episodeNumber" : "13",
  "title" : "The Big Snag",
  "description" : "In a special, black and white noir episode, Pete and Myka are transported into an unfinished 1940s crime novel."
}, {
  "imdbId" : "1132290",
  "season" : "4",
  "episodeNumber" : "14",
  "title" : "The Sky's the Limit",
  "description" : "Artie is blindsided when Mrs. Frederic introduces him to Abigail Chow, the new B&B manager - with ulterior motives."
}, {
  "imdbId" : "1132290",
  "season" : "4",
  "episodeNumber" : "15",
  "title" : "Instinct",
  "description" : "H.G. Wells returns to help Pete and Myka with an artifact that's forcing confessions out of criminals all while earthquakes are beginning to shake the Warehouse."
}, {
  "imdbId" : "1132290",
  "season" : "4",
  "episodeNumber" : "16",
  "title" : "Runaway",
  "description" : "When a volcanic event at an Arkansas State Prison allows two inmates to escape, Pete, Myka and Steve must partner with a U.S. Marshal to track down the fugitives."
}, {
  "imdbId" : "1132290",
  "season" : "4",
  "episodeNumber" : "17",
  "title" : "What Matters Most",
  "description" : "When residents of a posh gated community start getting affected by a mysterious, versatile artifact, Myka and Pete investigate."
}, {
  "imdbId" : "1132290",
  "season" : "4",
  "episodeNumber" : "18",
  "title" : "Lost & Found",
  "description" : "The Warehouse team uncovers a lead on a cache of artifacts stolen from Warehouse 12 by the infamous pirate, Roaring Dan Seavey."
}, {
  "imdbId" : "1132290",
  "season" : "4",
  "episodeNumber" : "19",
  "title" : "All the Time in the World",
  "description" : "The team tracks an evil alchemist who has bronzed Claudia and stolen the only artifact that can reverse the process. The clock is ticking as Claudia's condition apparently affects both Mrs. Frederic and the Warehouse."
}, {
  "imdbId" : "1132290",
  "season" : "4",
  "episodeNumber" : "20",
  "title" : "The Truth Hurts",
  "description" : "The evil alchemist Paracelsus is on the run, and Pete and Myka must stop him before he achieves immortality - or something worse. Myka fights what appears to be a losing battle against cancer, while Steve learns Artie's been keeping life-altering information from Claudia."
}, {
  "imdbId" : "1132290",
  "season" : "5",
  "episodeNumber" : "1",
  "title" : "Endless Terror",
  "description" : "Paracelsus turns the warehouse into a house of horrors. Can the team stop him in time?"
}, {
  "imdbId" : "1132290",
  "season" : "5",
  "episodeNumber" : "2",
  "title" : "Secret Services",
  "description" : "Pete and Myka return to Washington DC, to investigate a series of victims drowning on dry land where they run into a pair of fellow Secret Service agents with a surprising secret - a secret which forces Myka and Pete to evaluate where their own relationship has taken them. Meanwhile, Artie uses an artifact to take Claudia back into his memories of an old case, to show her the truth about her sister."
}, {
  "imdbId" : "1132290",
  "season" : "5",
  "episodeNumber" : "3",
  "title" : "A Faire to Remember",
  "description" : "Pete and Steve immerse themselves in a Renaissance Faire as they search for a dangerous artifact which animated both a horseless chariot and a life-size chess piece and set them against the faire patrons. Meanwhile, Claudia risks combining artifacts in a desperate attempt to revive her sister Claire from her artifact-induced coma; Myka struggle to prevent Artie from finding out and stopping her."
}, {
  "imdbId" : "1132290",
  "season" : "5",
  "episodeNumber" : "4",
  "title" : "Savage Seduction",
  "description" : "Pete, Myka, and Artie help Kelly Hernandez (Pete's ex-girlfriend) save her grandmother who is trapped inside a Telenovela, and in the process \"fall in\" and become characters of this Latino Soap Opera themselves. Meanwhile, Claudia and Steve investigate a strange accident at a university that leads them to discover an artifact that literally duplicates its users."
}, {
  "imdbId" : "1132290",
  "season" : "5",
  "episodeNumber" : "5",
  "title" : "Cangku Shisi",
  "description" : "The team tries to free Claire from Benedict Valda of the alternate reality, as he controls her using an Artifact and tries to shift the Warehouse to China. Can the team stop that from happening?"
}, {
  "imdbId" : "1132290",
  "season" : "5",
  "episodeNumber" : "6",
  "title" : "Endless",
  "description" : "The team shares stories of their defining moments. Pete has a hard time accepting the end of Warehouse 13. Claudia has a difficult time accepting her future role as the Warehouse caretaker."
}]