[{
  "imdbId" : "0141842",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Pilot",
  "description" : "A mobster passes out at a family barbecue and seeks therapy to understand why."
}, {
  "imdbId" : "0141842",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "46 Long",
  "description" : "Tony is getting fed up with his mother. Brendan act's against Tony's wishes. Salvatore and Paulie try to track down A.J.'s teacher's stolen car."
}, {
  "imdbId" : "0141842",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Denial, Anger, Acceptance",
  "description" : "Tony encourages an unwanted son-in-law to divorce, Carmela learns another secret of Tony's, Meadow experiments with speed to study for the SATs, and Chris and Brendan find out the price of disrespecting Junior."
}, {
  "imdbId" : "0141842",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Meadowlands",
  "description" : "Jackie's death leaves a power vacuum, Brendan's death leaves Chris fearing for his life, and Anthony's discovery of what his father really does leaves him confused."
}, {
  "imdbId" : "0141842",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "College",
  "description" : "While visiting colleges with Meadow, Tony spots a snitch. Carmela, meanwhile, discovers something about Dr. Melfi."
}, {
  "imdbId" : "0141842",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Pax Soprana",
  "description" : "Tony tries to balance Junior against the other capos, while Carmela reasserts herself as the woman in Tony's life."
}, {
  "imdbId" : "0141842",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Down Neck",
  "description" : "Anthony has disciplinary problems at school, prompting Tony to recount memories of his childhood with Dr. Melfi."
}, {
  "imdbId" : "0141842",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "The Legend of Tennessee Moltisanti",
  "description" : "The FBI begins closing in on the DiMeo family. Tony and Carmela are angry over all the attention Italians get from the authorities, while Chris fumes that he's not getting enough attention."
}, {
  "imdbId" : "0141842",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "Boca",
  "description" : "The capos discuss what to do about the local soccer coach, while Junior's mouth causes him some embarrassment."
}, {
  "imdbId" : "0141842",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "A Hit Is a Hit",
  "description" : "Tony tries to branch out into legitimate investments, while Chris and Adriana decide to try their hands at music production."
}, {
  "imdbId" : "0141842",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "Nobody Knows Anything",
  "description" : "Following the arrest of two of his men, Tony suspects a traitor. Efforts to discover who, however, are stymied."
}, {
  "imdbId" : "0141842",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "Isabella",
  "description" : "The stress Tony is going through begins to take its toll, and the hit Junior has ordered doesn't help."
}, {
  "imdbId" : "0141842",
  "season" : "1",
  "episodeNumber" : "13",
  "title" : "I Dream of Jeannie Cusamano",
  "description" : "Tony starts cleaning house, while Artie feels torn between keeping the peace in his household, and getting even with Tony for destroying his restaurant."
}, {
  "imdbId" : "0141842",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "Guy Walks Into a Psychiatrist's Office",
  "description" : "Pussy returns after months in hiding, Chris starts a boiler room stock operation, and Tony's long-lost sister shows up on the doorstep."
}, {
  "imdbId" : "0141842",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "Do Not Resuscitate",
  "description" : "Junior leaves prison due to ill health, while Livia's health also declines. Pussy begins talking with someone interested in learning more about Tony."
}, {
  "imdbId" : "0141842",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "Toodle-Fucking-Oo",
  "description" : "Richie Aprile gets out after ten years in prison and starts reasserting his authority. Meadow gets in trouble after a party gets out of hand."
}, {
  "imdbId" : "0141842",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "Commendatori",
  "description" : "Tony, Paulie and Chris travel to Naples to conduct a business deal, while Pussy becomes more stressed over trying to balance his secret lives."
}, {
  "imdbId" : "0141842",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "Big Girls Don't Cry",
  "description" : "Paulie and Silvio get promoted, Furio gets welcomed, Pussy gets pushed aside, and Chris gets frustrated with his Hollywood aspirations."
}, {
  "imdbId" : "0141842",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "The Happy Wanderer",
  "description" : "Tony's old school friend digs himself into trouble with his gambling, while Tony's family problems only continue to grow."
}, {
  "imdbId" : "0141842",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "D-Girl",
  "description" : "Anthony continues to cause problems at home, while Pussy's divided loyalties cause him greater anguish."
}, {
  "imdbId" : "0141842",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "Full Leather Jacket",
  "description" : "Rebellion by some of the lower soldiers ends in bloodshed, while Carmela starts intimidating her neighbors to help Meadow's chances at Georgetown."
}, {
  "imdbId" : "0141842",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "From Where to Eternity",
  "description" : "Chris awakens from his coma with a message for Tony and Paulie. Carmela, meanwhile, wants Tony to take a cut."
}, {
  "imdbId" : "0141842",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "Bust-Out",
  "description" : "Tony continues putting the squeeze on David, while Richie discusses the possibility with Junior of removing some competition."
}, {
  "imdbId" : "0141842",
  "season" : "2",
  "episodeNumber" : "11",
  "title" : "House Arrest",
  "description" : "Junior feels the restrictions of his house arrest acutely, while Tony starts putting in hours at his actual job to allay FBI suspicions."
}, {
  "imdbId" : "0141842",
  "season" : "2",
  "episodeNumber" : "12",
  "title" : "The Knight in White Satin Armor",
  "description" : "Richie and Janice get engaged, but Richie's violent temper finally takes him too far. Tony, meanwhile, breaks up with Irina, much to her dismay."
}, {
  "imdbId" : "0141842",
  "season" : "2",
  "episodeNumber" : "13",
  "title" : "Funhouse",
  "description" : "Tony gets sick from food poisoning and blames Artie's restaurant. Pussy, meanwhile, reaches the end of the line."
}, {
  "imdbId" : "0141842",
  "season" : "3",
  "episodeNumber" : "1",
  "title" : "Mr. Ruggerio's Neighborhood",
  "description" : "The FBI has trouble finding a new informant, so they attempt to bug the Soprano home. Meanwhile, Anthony continues to get into trouble at school."
}, {
  "imdbId" : "0141842",
  "season" : "3",
  "episodeNumber" : "2",
  "title" : "Proshai, Livushka",
  "description" : "Livia dies of a stroke, bringing the family together one more time for the funeral where old tensions resurface."
}, {
  "imdbId" : "0141842",
  "season" : "3",
  "episodeNumber" : "3",
  "title" : "Fortunate Son",
  "description" : "Chris becomes a made man, while Tony experiences another panic attack. Meadow continues to seethe over Tony's treatment of her boyfriend."
}, {
  "imdbId" : "0141842",
  "season" : "3",
  "episodeNumber" : "4",
  "title" : "Employee of the Month",
  "description" : "Dr. Melfi is brutally attacked, and when the justice system lets her down, she must consider asking Tony for help."
}, {
  "imdbId" : "0141842",
  "season" : "3",
  "episodeNumber" : "5",
  "title" : "Another Toothpick",
  "description" : "Tony and Carmela try a therapy session together, which ends in an angry dispute. Artie, meanwhile, tries to move in on Adriana."
}, {
  "imdbId" : "0141842",
  "season" : "3",
  "episodeNumber" : "6",
  "title" : "University",
  "description" : "Noah and Meadow's relationship is disrupted by her roommate, while Ralphie starts getting rough with one of the strippers from the Bada Bing."
}, {
  "imdbId" : "0141842",
  "season" : "3",
  "episodeNumber" : "7",
  "title" : "Second Opinion",
  "description" : "Junior continues his cancer treatments, but the prognosis is iffy. Chris, meanwhile, finds himself under suspicion from Paulie."
}, {
  "imdbId" : "0141842",
  "season" : "3",
  "episodeNumber" : "8",
  "title" : "He Is Risen",
  "description" : "Tensions rise between Tony and Ralphie until circumstances demand that they resolve their differences. Meadow gets involved with Jackie's son, and ends up in trouble."
}, {
  "imdbId" : "0141842",
  "season" : "3",
  "episodeNumber" : "9",
  "title" : "The Telltale Moozadell",
  "description" : "Tony continues seeing Gloria, another of Dr. Melfi's patients, while Meadow continues seeing Jackie Jr."
}, {
  "imdbId" : "0141842",
  "season" : "3",
  "episodeNumber" : "10",
  "title" : "To Save Us All from Satan's Power",
  "description" : "Tony starts having flashbacks about Pussy's betrayal, and then later discovers that Jackie Jr. has been failing in his responsibilities."
}, {
  "imdbId" : "0141842",
  "season" : "3",
  "episodeNumber" : "11",
  "title" : "Pine Barrens",
  "description" : "While Silvio has the flu, Chris and Paulie run his collections for him, which results in the pair getting lost in the woods and nearly freezing to death."
}, {
  "imdbId" : "0141842",
  "season" : "3",
  "episodeNumber" : "12",
  "title" : "Amour Fou",
  "description" : "Gloria grows increasingly demanding until Tony realizes who she is, and Jackie Jr. ends up in very serious trouble when Chris realizes who he is."
}, {
  "imdbId" : "0141842",
  "season" : "3",
  "episodeNumber" : "13",
  "title" : "Army of One",
  "description" : "Ralphie issues his final decision on the fate of Jackie Jr., and Anthony faces military school after getting expelled."
}, {
  "imdbId" : "0141842",
  "season" : "4",
  "episodeNumber" : "1",
  "title" : "For All Debts Public and Private",
  "description" : "Chris puts a ghost from his past to rest, while Carmela grows uneasy about her future."
}, {
  "imdbId" : "0141842",
  "season" : "4",
  "episodeNumber" : "2",
  "title" : "No Show",
  "description" : "Chris' success earns him some jealousy, Adriana learns the truth about her friend, and Meadow blows up over her father's job."
}, {
  "imdbId" : "0141842",
  "season" : "4",
  "episodeNumber" : "3",
  "title" : "Christopher",
  "description" : "Columbus Day ignites tensions between Italians and Native Americans, and Bobby receives devastating news about his wife."
}, {
  "imdbId" : "0141842",
  "season" : "4",
  "episodeNumber" : "4",
  "title" : "The Weight",
  "description" : "A joke sparks a series of hit contracts, while Carmela finds herself happier than perhaps she should be that Furio will be around for good."
}, {
  "imdbId" : "0141842",
  "season" : "4",
  "episodeNumber" : "5",
  "title" : "Pie-o-My",
  "description" : "Ralph buys a racehorse, but Tony ends up more attached to it than Ralphie is. Carmela starts trying to invest in her future."
}, {
  "imdbId" : "0141842",
  "season" : "4",
  "episodeNumber" : "6",
  "title" : "Everybody Hurts",
  "description" : "Tony starts to feel depressed over the negative impact he has on people who don't deserve it, while Carmela tries to set up Furio with a friend."
}, {
  "imdbId" : "0141842",
  "season" : "4",
  "episodeNumber" : "7",
  "title" : "Watching Too Much Television",
  "description" : "Adriana learns that life is not like TV shows, while Tony discovers that a former girlfriend has moved on."
}, {
  "imdbId" : "0141842",
  "season" : "4",
  "episodeNumber" : "8",
  "title" : "Mergers and Acquisitions",
  "description" : "Paulie has to take care of some rough relationships for his mother, while Tony's fancy for a fellow horse fancier lands him in trouble with Carmela."
}, {
  "imdbId" : "0141842",
  "season" : "4",
  "episodeNumber" : "9",
  "title" : "Whoever Did This",
  "description" : "Ralph's callous behavior finally steps over the line, while Chris gets deeper into his heroin habit."
}, {
  "imdbId" : "0141842",
  "season" : "4",
  "episodeNumber" : "10",
  "title" : "The Strong, Silent Type",
  "description" : "In the midst of suspicions that he killed Ralph, Tony tries to intervene to get Chris clean and sober."
}, {
  "imdbId" : "0141842",
  "season" : "4",
  "episodeNumber" : "11",
  "title" : "Calling All Cars",
  "description" : "Tony's dreams seem to tell him where his life is headed, but he still feels as though he's out of control."
}, {
  "imdbId" : "0141842",
  "season" : "4",
  "episodeNumber" : "12",
  "title" : "Eloise",
  "description" : "Carmela and Furio grow too close for safety, while Paulie discovers that he's not as big a fish as he thought he was."
}, {
  "imdbId" : "0141842",
  "season" : "4",
  "episodeNumber" : "13",
  "title" : "Whitecaps",
  "description" : "Junior's trial comes to an end, but Tony's trials are just getting underway. Also, the Sopranos almost purchase a house on the beach."
}, {
  "imdbId" : "0141842",
  "season" : "5",
  "episodeNumber" : "1",
  "title" : "Two Tonys",
  "description" : "Some of the old guard return from prison and want to get back in the action. Chris and Paulie are at each other's throats over matters of money and respect, and Tony decides to tell Dr. Melfi what's really on his mind."
}, {
  "imdbId" : "0141842",
  "season" : "5",
  "episodeNumber" : "2",
  "title" : "Rat Pack",
  "description" : "Carmine's passing opens new wounds, while cousin Tony wants to put his past behind him. Tony Soprano, meanwhile, discovers a traitor."
}, {
  "imdbId" : "0141842",
  "season" : "5",
  "episodeNumber" : "3",
  "title" : "Where's Johnny?",
  "description" : "With Carmine's passing and Feech's arrival, turf wars are breaking out around New Jersey. Junior's health, meanwhile, starts to decline."
}, {
  "imdbId" : "0141842",
  "season" : "5",
  "episodeNumber" : "4",
  "title" : "All Happy Families",
  "description" : "Feech makes a pain of himself by trying to return to his past glory. Carmela tries to work with Anthony's teacher to rein in the out-of-control son."
}, {
  "imdbId" : "0141842",
  "season" : "5",
  "episodeNumber" : "5",
  "title" : "Irregular Around the Margins",
  "description" : "A car crash puts Tony and Adriana in a compromising position, and Cousin Tony must try to keep Chris from getting bent out of shape."
}, {
  "imdbId" : "0141842",
  "season" : "5",
  "episodeNumber" : "6",
  "title" : "Sentimental Education",
  "description" : "Carmela has another furtive romance collapse, while Tony B. throws away a chance to turn his life around."
}, {
  "imdbId" : "0141842",
  "season" : "5",
  "episodeNumber" : "7",
  "title" : "In Camelot",
  "description" : "Tony learns about his father through the man's mistress, while Chris' friend learns that there are habits more harmful to your health than heroin."
}, {
  "imdbId" : "0141842",
  "season" : "5",
  "episodeNumber" : "8",
  "title" : "Marco Polo",
  "description" : "An uncomfortable party leads Tony and Carmela to a partial reconciliation, while cousin Tony gets an offer he decides not to refuse."
}, {
  "imdbId" : "0141842",
  "season" : "5",
  "episodeNumber" : "9",
  "title" : "Unidentified Black Males",
  "description" : "Tony finds out that his cousin wants a bigger share of responsibilities, while Finn makes an embarrassing discovery about Vito."
}, {
  "imdbId" : "0141842",
  "season" : "5",
  "episodeNumber" : "10",
  "title" : "Cold Cuts",
  "description" : "Chris and cousin Tony do some digging to make sure old secrets stay buried, while Janice puts her marriage in jeopardy with her fierce temper."
}, {
  "imdbId" : "0141842",
  "season" : "5",
  "episodeNumber" : "11",
  "title" : "The Test Dream",
  "description" : "Cousin Tony heads off to avenge the death of his good friend, while a dream reveals to Tony what he must do to prevent a full-scale war."
}, {
  "imdbId" : "0141842",
  "season" : "5",
  "episodeNumber" : "12",
  "title" : "Long Term Parking",
  "description" : "Tony makes a request to Johnny Sack on behalf of his cousin, and Adriana makes a request to the FBI, followed by one to Chris."
}, {
  "imdbId" : "0141842",
  "season" : "5",
  "episodeNumber" : "13",
  "title" : "All Due Respect",
  "description" : "Tony realizes that he must take care of family messes himself in order to keep the peace within his own clan."
}, {
  "imdbId" : "0141842",
  "season" : "6",
  "episodeNumber" : "1",
  "title" : "Members Only",
  "description" : "Gene Pontecorvo makes a final break from the mob life, while Junior's paranoid delusions could be the end of Tony."
}, {
  "imdbId" : "0141842",
  "season" : "6",
  "episodeNumber" : "2",
  "title" : "Join the Club",
  "description" : "The family tries to cope with Tony's hospitalization and possibly impending death, while Tony begins to hallucinate a new life parallel to his own."
}, {
  "imdbId" : "0141842",
  "season" : "6",
  "episodeNumber" : "3",
  "title" : "Mayham",
  "description" : "While the gang begins to turn on itself, Tony finds himself at the threshold."
}, {
  "imdbId" : "0141842",
  "season" : "6",
  "episodeNumber" : "4",
  "title" : "The Fleshy Part of the Thigh",
  "description" : "Tony goes home and returns to business, perhaps with a new frame of mind. Paulie receives a shock about his mother."
}, {
  "imdbId" : "0141842",
  "season" : "6",
  "episodeNumber" : "5",
  "title" : "Mr. & Mrs. John Sacrimoni Request",
  "description" : "Johnny Sack asks for permission to get out of jail for his daughters wedding; Tony's on the look out for personal protection."
}, {
  "imdbId" : "0141842",
  "season" : "6",
  "episodeNumber" : "6",
  "title" : "Live Free or Die",
  "description" : "Tony seeks guidance from overseas to solve a local problem; and decides whether a top earner deserves another chance."
}, {
  "imdbId" : "0141842",
  "season" : "6",
  "episodeNumber" : "7",
  "title" : "Luxury Lounge",
  "description" : "Chris meets and beats the stars, while Artie turns violent after having his hospitality abused."
}, {
  "imdbId" : "0141842",
  "season" : "6",
  "episodeNumber" : "8",
  "title" : "Johnny Cakes",
  "description" : "Vito considers starting a new life in New Hampshire, while Anthony continues his pursuit of revenge against Junior."
}, {
  "imdbId" : "0141842",
  "season" : "6",
  "episodeNumber" : "9",
  "title" : "The Ride",
  "description" : "Paulie finds public opinion turned against him after an amusement ride accident, while Chris tries to start a new life as a husband and father."
}, {
  "imdbId" : "0141842",
  "season" : "6",
  "episodeNumber" : "10",
  "title" : "Moe n' Joe",
  "description" : "Tony reflects on how growing up with Janice colors his attitudes now, while Vito tries to make a new life for himself in New Hampshire."
}, {
  "imdbId" : "0141842",
  "season" : "6",
  "episodeNumber" : "11",
  "title" : "Cold Stones",
  "description" : "Phil takes out his revenge on Vito, while Tony grows frustrated with Anthony's lack of ambition or work ethic."
}, {
  "imdbId" : "0141842",
  "season" : "6",
  "episodeNumber" : "12",
  "title" : "Kaisha",
  "description" : "Tony and Phil begin an explosive conflict that puts Phil in the hospital, while Chris and Anthony both embark on new romances."
}, {
  "imdbId" : "0141842",
  "season" : "6",
  "episodeNumber" : "13",
  "title" : "Soprano Home Movies",
  "description" : "Carmela and Tony go away for Tony's birthday up to Janice's and Bobby's where a fight emerges between Tony and Bobby over Janice. Meanwhile A.J. is throwing a party at the Soprano home."
}, {
  "imdbId" : "0141842",
  "season" : "6",
  "episodeNumber" : "14",
  "title" : "Stage 5",
  "description" : "Johnny Sac finds out he only has 3 months to live. Meanwhile, 'Cleaver' premieres and is a hit, while Carmela has mixed emotions about it, saying too much of it is based on Tony."
}, {
  "imdbId" : "0141842",
  "season" : "6",
  "episodeNumber" : "15",
  "title" : "Remember When",
  "description" : "Paulie shows up at Tony's house to tell him he's learned the Feds are looking into a murder case from the early 1980s. In fact it was Tony's first killing where he made his 'bones'. Tony decides he and Paulie need to lay low for a while and they head off on a road trip to Florida. They reminisce about the old days but Paulie is definitely getting on Tony's nerves. They also find that many things along the route have changed over the years. Tony is particularly interested in knowing who may have told Johnny Sack about the fat joke directed at his wife. Uncle Junior ..."
}, {
  "imdbId" : "0141842",
  "season" : "6",
  "episodeNumber" : "16",
  "title" : "Chasing It",
  "description" : "At the Borgata Casino, Tony decides to let it ride after winning at roulette. Tony loses everything he'd won, and then some, on 23. Meanwhile, Vito Jr. is going through a rebellious phase. Tony asks Phil to talk to Vito Jr. Phil grudgingly agrees. AJ proposes to Blanca over a nice dinner, promising her that he will rise from pizzeria night manager to restaurant chain owner in no time, and coaxes a \"yes\" out of her. At the Puerto Rican day parade, Blanca meets up with AJ and returns his engagement ring, telling him she just doesn't feel it."
}, {
  "imdbId" : "0141842",
  "season" : "6",
  "episodeNumber" : "17",
  "title" : "Walk Like a Man",
  "description" : "Christopher and Paulie are making a lot of money off selling stolen tools through Christopher's father-in-law, Al Lombardo. When some of Paulie's guys break into Al's store to take some of the equipment, Christopher goes ballistic and takes matters into his own hands. Paulie has his own way of getting back at him. Tony takes Christopher to task for not being around much. Christopher explains the temptations at places like the Bing but Tony is anything but sympathetic. Christopher is soon drinking again and it leads to tragedy. Tony tells Agent Dwight Harris about the ..."
}, {
  "imdbId" : "0141842",
  "season" : "6",
  "episodeNumber" : "18",
  "title" : "Kennedy and Heidi",
  "description" : "Tony travels to Las Vegas."
}, {
  "imdbId" : "0141842",
  "season" : "6",
  "episodeNumber" : "19",
  "title" : "The Second Coming",
  "description" : "Tony fails to reason with Phil as more problems increase with Anthony when his depression worsens and he attempts suicide."
}, {
  "imdbId" : "0141842",
  "season" : "6",
  "episodeNumber" : "20",
  "title" : "The Blue Comet",
  "description" : "The Beginning of the End. Phil finally puts the hits on the Soprano clan and Tony puts a hit on Phil which results in mistaken identity making everyone think its safe when its not and it results in a Death and Coma. After this happens Tony separates from his family to go into hiding as he sends Carmela, Janice, and the kids into hiding."
}, {
  "imdbId" : "0141842",
  "season" : "6",
  "episodeNumber" : "21",
  "title" : "Made in America",
  "description" : "Tony must now stay in hiding until Phil Leotardo has been dealt with. Carmela and the kids do not like the lifestyle they have been forced to adopt. Tony confronts Junior one last time."
}]