[{
  "imdbId" : "0068044",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Detour to Nowhere",
  "description" : "An insurance investigator tries to find an armored car carrying gold bullion that disappeared in the middle of a deserted Texas highway."
}, {
  "imdbId" : "0068044",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Let's Hear It for a Living Legend",
  "description" : "When a football player vanishes from the field in full view of network cameras and a live audience, it's up to Banacek to figure out how his kidnappers spirited him away without a trace."
}, {
  "imdbId" : "0068044",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Project Phoenix",
  "description" : "The multi-million dollar Phoenix, prototype for a revolutionary new car, disappears from a non-stop train en route to Boston - flat-car included. Banacek is called in to find the missing vehicle before a huge insurance claim must be paid."
}, {
  "imdbId" : "0068044",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "No Sign of the Cross",
  "description" : "A golden cross, on it's way from a Mexican church to an American gangster anxious to reform his image, turns into worthless junk without ever leaving the possession of the couriers sent to deliver it. Banacek must figure out where and how the switch was pulled off."
}, {
  "imdbId" : "0068044",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "A Million the Hard Way",
  "description" : "Banacek must figure out who stole a million dollars from a supposedly tamper-proof display case."
}, {
  "imdbId" : "0068044",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "To Steal a King",
  "description" : "A king's ransom in precious coins vanishes from a hotel-suite vault while the owners sleep only a few feet away. Banacek arrives to figure out how the impossible to open vault was so easily breached without a sign left behind."
}, {
  "imdbId" : "0068044",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Ten Thousand Dollars a Page",
  "description" : "When a priceless book vanishes from a sealed display case in a room that no thief could possibly escape, it's up to Banacek to show how someone beat the supposedly foolproof alarms to make off with the artifact."
}, {
  "imdbId" : "0068044",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "The Greatest Collection of Them All",
  "description" : "Banacek figures out how $23 million worth of paintings vanished from a moving truck transporting them from New York to Boston."
}, {
  "imdbId" : "0068044",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "The Two Million Clams of Cap'n Jack",
  "description" : "Just before Cap'n Jack's seafood restaurant franchise is set to go public, millions of dollars in stock certificates are stolen from a non-stop elevator, leaving Banacek to find them before someone walks through walls with a fortune."
}, {
  "imdbId" : "0068044",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "No Stone Unturned",
  "description" : "\"Man in Harmony,\" a 3-ton, 11-foot tall sculpture is missing at its gala unveiling. The 5-foot pedestal to which it was attached is all that remains to mark the theft. A ransom demand threatening to turn the large stone into gravel unless $500,000 is paid further complicates the case. Working, and competing, with a Boston Insurance Company colleague, Banacek has only two days to find the statue and collect his fee."
}, {
  "imdbId" : "0068044",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "If Max Is So Smart, Why Doesn't He Tell Us Where He Is?",
  "description" : "One morning Max - a huge, complex computer system - is missing from the locked, alarmed and guarded building he filled just the night before. Banacek steps in to find out how tons of computer machinery could be sneaked out leaving only bare walls."
}, {
  "imdbId" : "0068044",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "The Three Million Dollar Piracy",
  "description" : "A three-million dollar wedding coach, being sent overseas, disappears shortly after being placed into a shipping container and loaded aboard ship, under the watchful eyes of two Boston Insurance Company employees. Enter Banacek, who must figure out the puzzling theft and find the coach before the ship sails to collect his ten percent."
}, {
  "imdbId" : "0068044",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "The Vanishing Chalice",
  "description" : "A one-of-a-kind Greek chalice worth 1.5 million dollars is stolen in front of many witnesses."
}, {
  "imdbId" : "0068044",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "Horse of a Slightly Different Color",
  "description" : "How can a valuable, highly recognizable thoroughbred horse start a practice run around an open racetrack and be an unknown nag when it reaches the finish line? Bet on Banacek to solve the puzzle before the horse thieves make tracks with the real article."
}, {
  "imdbId" : "0068044",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "Rocket to Oblivion",
  "description" : "A small but powerful prototype engine sits sealed in a rotating display case in the middle of a crowded trade-show floor. A power failure turns out the lights for a few seconds, and when the lights return, the rocket engine has vanished. Banacek must beat his competition to the solution before Federal agents step in."
}, {
  "imdbId" : "0068044",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "Fly Me- If You Can Find Me",
  "description" : "A charter company jetliner makes an emergency landing at a small desert airstrip, blowing all of its tires and leaving a shaken flight crew. The next morning finds the pilot left guarding the plane dead and the airstrip empty of the immovable aircraft. Enter Banacek - in a chauffeur-driven jeep - to sort out the convolutions of pilots, stewardesses, old business partners and more to learn where the crippled plane has gone."
}, {
  "imdbId" : "0068044",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "Now You See Me, Now You Don't",
  "description" : "A stage magician vanishes in the middle of his act, as he is about to be arrested on suspicion of a $1,750,000 securities fraud. Banacek is called in to try to recover the missing money and solve the mystery of the disappearing man."
}]
