[{
  "imdbId" : "0071003",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "The Ripper",
  "description" : "When a rash of serial murders suddenly begins in the Chicago area, Kolchak establishes a similarity between the new killings and the murders committed by Jack The Ripper. The killer soon reveals himself to possess superhuman characteristics, and Kolchak suspects that they may be dealing with the original Ripper after all."
}, {
  "imdbId" : "0071003",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "The Zombie",
  "description" : "An old black woman uses voodoo to resurrect her dead son to kill those who murdered him, and to kill those like Kolchak who would interfere."
}, {
  "imdbId" : "0071003",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "They Have Been, They Are, They Will Be...",
  "description" : "Kolchak is witness to a bizarre manifestation when an unseen force decimates a building and causes a cache of lead ingots to vanish into thin air. He soon draws a connection between the disturbance and a series of incidents where both animals and human beings are turning up dead, the marrow mysteriously sucked out of their bones."
}, {
  "imdbId" : "0071003",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "The Vampire",
  "description" : "Carl is determined to kill a beautiful, but extremely vicious, female vampire unknowingly unearthed by a road construction crew."
}, {
  "imdbId" : "0071003",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "The Werewolf",
  "description" : "Kolchak is on assignment to interview singles aboard a cruise ship, and finds out some kind of wolf creature is killing passengers during the full moon."
}, {
  "imdbId" : "0071003",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Firefall",
  "description" : "Kolchak discovers the murdered spirit of a gangster is incinerating his former enemies, and is trying to take over the body of a music conductor."
}, {
  "imdbId" : "0071003",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "The Devil's Platform",
  "description" : "Kolchak discovers a young rising politician, has made a deal with the Devil to murder off his competition through incidents made to look like accidents."
}, {
  "imdbId" : "0071003",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Bad Medicine",
  "description" : "A Native American legend materializes in Chicago, and Carl discovers it when he investigates the mysterious deaths of two wealthy society matrons who possessed priceless jewels. When the murders increase, Kolchak learns that the force at work is know as The Diablero, a being cursed to roam the Earth in search of valuable gems."
}, {
  "imdbId" : "0071003",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "The Spanish Moss Murders",
  "description" : "A pair of seemingly unrelated deaths are connected by the fact that each victim had a small amount of Spanish Moss on the body. When more murders occur, Kolchak is able to determine that each victim is indeed connected to a comatose Cajun man who is part of a sleep experiment where he is denied the ability to dream. The man's subconscious is able to physically manifest a vengeful monstrosity, the \"Paramafait\", a legendary Cajun boogeyman who dispatches anybody who wronged the sleeping man. Kolchak's intention to stop the Paramafait marks him for death, unless he can ..."
}, {
  "imdbId" : "0071003",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "The Energy Eater",
  "description" : "Carl finds a spirit like monster is eating up the structure of a new hospital and draining patients of their protein."
}, {
  "imdbId" : "0071003",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "Horror in the Heights",
  "description" : "Residents of Roosevelt Heights are being caught off guard, and killed, by a flesh eating demon with the ability to appear as a person they know and trust."
}, {
  "imdbId" : "0071003",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "Mr. R.I.N.G.",
  "description" : "Kolchak investigates a US military backed project called R.I.N.G. (Robomatic Internalized Nerve Ganglia), which is a robot that uses deadly force to defend itself against those who would harm it."
}, {
  "imdbId" : "0071003",
  "season" : "1",
  "episodeNumber" : "13",
  "title" : "Primal Scream",
  "description" : "An arctic oil-drilling expedition unearths some strange organic matter, cells which begin to spontaneously multiply. When the cooling unit in their storage facility fails, the cells grow into a violent and deadly life-form, a murderous ape-man. Kolchak finds the feature story he's planning on writing about the murders blocked by the authorities at every turn, and it seems that pressure from the large corporation which sponsored the drilling is threatening to squelch the truth about the murders."
}, {
  "imdbId" : "0071003",
  "season" : "1",
  "episodeNumber" : "14",
  "title" : "The Trevi Collection",
  "description" : "Kolchak finds an evil witch in the high fashion industry, who is maiming and killing her competitors."
}, {
  "imdbId" : "0071003",
  "season" : "1",
  "episodeNumber" : "15",
  "title" : "Chopper",
  "description" : "Former members of a biker gang from the 50s are being decapitated, and a key witness claims that the murders are being committed by a headless figure on a motorcycle wielding a sword. Kolchak pieces the story together and finds that the specter is out to avenge his death due to some rather unusual circumstances surrounding his burial."
}, {
  "imdbId" : "0071003",
  "season" : "1",
  "episodeNumber" : "16",
  "title" : "Demon in Lace",
  "description" : "A female demon, takes over the bodies recently killed young women, so she can seduce handsome young men and scare them to death."
}, {
  "imdbId" : "0071003",
  "season" : "1",
  "episodeNumber" : "17",
  "title" : "Legacy of Terror",
  "description" : "Reporter Carl Kolchak investigates college men dying of heart attacks and Chicago citizens having their hearts cut out by Aztecs."
}, {
  "imdbId" : "0071003",
  "season" : "1",
  "episodeNumber" : "18",
  "title" : "The Knightly Murders",
  "description" : "A ghostly knight is making a habit out of executing certain persons responsible for the 'desecration' of his burial site; that is, anybody involved with the creation of a restaurant/disco near the knight's resting place. Kolchak catches on when he happens to be in the wrong place at the wrong time and witnesses one of the murders with his own eyes. An axe that's been blessed is the only thing that will stop the ghost from exacting his gruesome revenge."
}, {
  "imdbId" : "0071003",
  "season" : "1",
  "episodeNumber" : "19",
  "title" : "The Youth Killer",
  "description" : "Kolchak discovers a very attractive woman who maintains her youth and beauty by sacrificing young men and women to ancient Greek gods."
}, {
  "imdbId" : "0071003",
  "season" : "1",
  "episodeNumber" : "20",
  "title" : "The Sentry",
  "description" : "Kolchak tries to find some kind of reptilian monster that has been killing construction workers after they open a new tunnel, nearly 2 miles underground."
}]