[{
  "imdbId" : "0106179",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Pilot",
  "description" : "Agent Dana Scully is instructed to debunk an FBI project dubbed \"The X-Files,\" paranormal cases that have been reopened by Agent Fox Mulder."
}, {
  "imdbId" : "0106179",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Deep Throat",
  "description" : "Mulder and Scully investigate the mysterious case of a military test pilot who disappeared after experiencing strange psychotic behaviour."
}, {
  "imdbId" : "0106179",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Squeeze",
  "description" : "Mulder and Scully search for a humanoid killer whose savage murder spree reoccurs every 30 years."
}, {
  "imdbId" : "0106179",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Conduit",
  "description" : "Mulder becomes obsessed with solving a case that closely parallels an \"encounter\" he experienced as a child."
}, {
  "imdbId" : "0106179",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "The Jersey Devil",
  "description" : "Mulder and Scully track a legendary creature that has roamed the New Jersey countryside for over 40 years."
}, {
  "imdbId" : "0106179",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Shadows",
  "description" : "Mulder and Scully investigate the deaths of two men believed to have been killed by a powerful psychokinetic force."
}, {
  "imdbId" : "0106179",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Ghost in the Machine",
  "description" : "On Halloween, Mulder and Scully investigate the death of a corporate executive who may have been murdered by a thinking computer."
}, {
  "imdbId" : "0106179",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Ice",
  "description" : "Mulder and Scully are sent to investigate when a team of geophysicists stationed at a remote Alaskan outpost are killed by a parasitic alien life form."
}, {
  "imdbId" : "0106179",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "Space",
  "description" : "When a space shuttle mission is sabotaged, Mulder suspects it may be the work of an alien spirit that inhabits the body of a former Gemini astronaut."
}, {
  "imdbId" : "0106179",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "Fallen Angel",
  "description" : "The future of the X-Files project is jeopardized after Mulder secretly infiltrates the government cover-up of a UFO crash."
}, {
  "imdbId" : "0106179",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "Eve",
  "description" : "Mulder and Scully search for two missing girls who disappeared after their fathers were murdered in an identical fashion."
}, {
  "imdbId" : "0106179",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "Fire",
  "description" : "Mulder and Scully join forces with an inspector from Scotland Yard when a man with pyrokinetic powers stalks members of the British aristocracy."
}, {
  "imdbId" : "0106179",
  "season" : "1",
  "episodeNumber" : "13",
  "title" : "Beyond the Sea",
  "description" : "Scully believes that the pyschic predictions of a death row inmate are the only hope in the kidnapping of two college students."
}, {
  "imdbId" : "0106179",
  "season" : "1",
  "episodeNumber" : "14",
  "title" : "Gender Bender",
  "description" : "A religious sect becomes the prime suspect in a murder spree."
}, {
  "imdbId" : "0106179",
  "season" : "1",
  "episodeNumber" : "15",
  "title" : "Lazarus",
  "description" : "The consciousness of a dangerous criminal possesses an FBI agent who is also Scully's ex-boyfriend."
}, {
  "imdbId" : "0106179",
  "season" : "1",
  "episodeNumber" : "16",
  "title" : "Young at Heart",
  "description" : "A criminal believed to have died in a prison years earlier wages a vendetta against Mulder."
}, {
  "imdbId" : "0106179",
  "season" : "1",
  "episodeNumber" : "17",
  "title" : "E.B.E.",
  "description" : "Mulder and Scully become the focus of a disinformation campaign when they attempt to trace the government's secret transport of an alien life form."
}, {
  "imdbId" : "0106179",
  "season" : "1",
  "episodeNumber" : "18",
  "title" : "Miracle Man",
  "description" : "The agents investigate a ministry led by a man whose son possesses the power to heal, and to kill, with a touch of his hand."
}, {
  "imdbId" : "0106179",
  "season" : "1",
  "episodeNumber" : "19",
  "title" : "Shapes",
  "description" : "A creature, possibly from Native American lore, is suspected of killing a man, bringing Mulder and Scully to the Indian reservation where the attack occurred in order to uncover its identity."
}, {
  "imdbId" : "0106179",
  "season" : "1",
  "episodeNumber" : "20",
  "title" : "Darkness Falls",
  "description" : "A group of loggers working in a remote forest unearths thousands of deadly insectlike creatures that paralyze and cocoon their victims. Scully, Mulder and a few others end up trapped there."
}, {
  "imdbId" : "0106179",
  "season" : "1",
  "episodeNumber" : "21",
  "title" : "Tooms",
  "description" : "Eugene Tooms, a supernatural killer whom Mulder helped incarcerate, is released on parole."
}, {
  "imdbId" : "0106179",
  "season" : "1",
  "episodeNumber" : "22",
  "title" : "Born Again",
  "description" : "An 8-year-old girl is the prime suspect in a series of bizzare, seemingly unrelated deaths."
}, {
  "imdbId" : "0106179",
  "season" : "1",
  "episodeNumber" : "23",
  "title" : "Roland",
  "description" : "When scientists at an aeronautics lab die under mysterious circumstances, the agents suspect a mentally challenged janitor may be the culprit."
}, {
  "imdbId" : "0106179",
  "season" : "1",
  "episodeNumber" : "24",
  "title" : "The Erlenmeyer Flask",
  "description" : "Deep Throat tips Mulder to a critically important case involving a missing fugitive and the cloning of extraterrestrial viruses."
}, {
  "imdbId" : "0106179",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "Little Green Men",
  "description" : "With the X-Files shut down, Mulder travels to Puerto Rico on a tip from his mentor in the Senate to uncover the reason behind the sudden reactivation of a remote long abandoned SETI-like communications station."
}, {
  "imdbId" : "0106179",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "The Host",
  "description" : "Mulder pursues a humanoid, parasitic organism that uses sewage systems as its home."
}, {
  "imdbId" : "0106179",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "Blood",
  "description" : "Mulder and Scully investigate a series of violent killings committed by seemingly normal residents of a small town."
}, {
  "imdbId" : "0106179",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "Sleepless",
  "description" : "Mulder is on the manhunt for a Vietnam veteran who can project his consciousness into other people's minds to kill them. Mulder and Agent Krycek try to uncover the conspiracy behind the killer's powers."
}, {
  "imdbId" : "0106179",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "Duane Barry",
  "description" : "A former FBI agent who claims he was abducted by aliens takes several people hostage. Mulder agree to be the negotiator."
}, {
  "imdbId" : "0106179",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "Ascension",
  "description" : "Mulder and Agent Krycek are in a race against time to find and rescue abducted Scully before crazed Duane Barry can take her to what he believes to be his alien puppet masters."
}, {
  "imdbId" : "0106179",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "3",
  "description" : "While Agent Scully is still missing, Agent Mulder embarks upon an investigation involving vampires in Los Angeles, subsequently becoming involved with a sultry female vampire who yearns to escape her lifestyle."
}, {
  "imdbId" : "0106179",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "One Breath",
  "description" : "Scully's comatose body is discovered at a local hospital and her life is hanging in the balance. When Mr. X shows Mulder the high price he'd have to pay if he truly wants justice for Scully, Mulder must choose between hope and revenge."
}, {
  "imdbId" : "0106179",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "Firewalker",
  "description" : "At a remote outpost, scientists watch as their camera picks up a moving shadow on the inside of a smoldering hot volcano, too hot for any living creature to survive. Mulder and Scully arrive and notice that everyone is acting strangely."
}, {
  "imdbId" : "0106179",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "Red Museum",
  "description" : "A vegan religious cult is accused of kidnapping local teenagers for some type of ritual. Mulder and Scully begin to suspect that a different kind of conspiracy is at play when Scully sees Deep Throat's killer in town."
}, {
  "imdbId" : "0106179",
  "season" : "2",
  "episodeNumber" : "11",
  "title" : "Excelsis Dei",
  "description" : "Mulder links a series of violent attacks at a convalescent home, including the brutal rape of a nurse, to angry spirits beyond the grave."
}, {
  "imdbId" : "0106179",
  "season" : "2",
  "episodeNumber" : "12",
  "title" : "Aubrey",
  "description" : "A pregnant police woman experiences visions that lead her to the remains of two FBI agents who went missing in the 1940s while on the trail of a serial killer that later got caught. The killings begin again but the only suspect is now 77."
}, {
  "imdbId" : "0106179",
  "season" : "2",
  "episodeNumber" : "13",
  "title" : "Irresistible",
  "description" : "Scully and Mulder hunt down a fetishist who collects pieces of the dead."
}, {
  "imdbId" : "0106179",
  "season" : "2",
  "episodeNumber" : "14",
  "title" : "Die Hand Die Verletzt",
  "description" : "The agents investigate a murder in a small town populated by devil worshippers."
}, {
  "imdbId" : "0106179",
  "season" : "2",
  "episodeNumber" : "15",
  "title" : "Fresh Bones",
  "description" : "The death of a Marine, who allegedly committed suicide, unearths a disturbing truth at a Haitian refugee camp."
}, {
  "imdbId" : "0106179",
  "season" : "2",
  "episodeNumber" : "16",
  "title" : "Colony",
  "description" : "When someone sends Mulder and Scully obituaries showing three separate but identical men apparently having died, the agents investigate, but things take an unexpected turn when Mulder receives a call from his father."
}, {
  "imdbId" : "0106179",
  "season" : "2",
  "episodeNumber" : "17",
  "title" : "End Game",
  "description" : "Mulder is forced to make an impossible choice, when the alien bounty hunter gives him an ultimatum - Scully's life for Samantha's."
}, {
  "imdbId" : "0106179",
  "season" : "2",
  "episodeNumber" : "18",
  "title" : "Fearful Symmetry",
  "description" : "In a small town in Idaho, a man is killed by what seems to be an invisible elephant. Mulder's investigation into the local zoo, its owners and a local animal rights group uncovers evidence of insidious alien experiments."
}, {
  "imdbId" : "0106179",
  "season" : "2",
  "episodeNumber" : "19",
  "title" : "Død Kalm",
  "description" : "The crew of a U.S. military ship that disappeared in the Norwegian Sea is found dead from what seems to be rapid aging. Thinking it's another Philadelphia Experiment, Mulder boards the ghost ship along with Scully and a local skipper."
}, {
  "imdbId" : "0106179",
  "season" : "2",
  "episodeNumber" : "20",
  "title" : "Humbug",
  "description" : "The agents search for a killer in a Florida town inhabited by sideshow performers."
}, {
  "imdbId" : "0106179",
  "season" : "2",
  "episodeNumber" : "21",
  "title" : "The Calusari",
  "description" : "The agents investigate when a young boy's family is plagued by a series of tragic accidents."
}, {
  "imdbId" : "0106179",
  "season" : "2",
  "episodeNumber" : "22",
  "title" : "F. Emasculata",
  "description" : "As Scully investigates the spread of a deadly contagion at a prison, Mulder tracks down two escaped convicts infected with the disease."
}, {
  "imdbId" : "0106179",
  "season" : "2",
  "episodeNumber" : "23",
  "title" : "Soft Light",
  "description" : "Scully's former student, Det. Kelly Ryan, asks the agents to help her catch a runaway government scientist responsible for several mysterious disappearances. Mulder realizes that the man is deathly afraid of his shadow for some reason."
}, {
  "imdbId" : "0106179",
  "season" : "2",
  "episodeNumber" : "24",
  "title" : "Our Town",
  "description" : "Reports of foxfire on a field in Dudley, Arkansas lead Mulder and Scully to a bizarre situation regarding the townsfolk. Employees of the Chaco Chicken Corporation are displaying bizarre behavior, and the death rate is slowly increasing."
}, {
  "imdbId" : "0106179",
  "season" : "2",
  "episodeNumber" : "25",
  "title" : "Anasazi",
  "description" : "Mulder receives an encrypted computer disk containing the defense department's top secret files on extraterrestrial life and becomes a target. Scully takes him to a Navajo family that unearthed a buried secret to decipher the disk."
}, {
  "imdbId" : "0106179",
  "season" : "3",
  "episodeNumber" : "1",
  "title" : "The Blessing Way",
  "description" : "A furious pursuit of Agent Mulder is underway, and more importantly, the government wants the data tape he carried. Agent Scully, against all odds, searches to uncover his whereabouts, persisting that he is alive when all others deny it."
}, {
  "imdbId" : "0106179",
  "season" : "3",
  "episodeNumber" : "2",
  "title" : "Paper Clip",
  "description" : "As a government hit squad closes in on the agents, Mulder searches for clues about his father's involvement in a top secret project."
}, {
  "imdbId" : "0106179",
  "season" : "3",
  "episodeNumber" : "3",
  "title" : "D.P.O.",
  "description" : "The agents investigate the deaths of several young people who were apparently struck by lightning in the same small town."
}, {
  "imdbId" : "0106179",
  "season" : "3",
  "episodeNumber" : "4",
  "title" : "Clyde Bruckman's Final Repose",
  "description" : "A grumpy old man with psychic powers that show him how someone will die assists the agents with the hunt for a crazed killer who targets psychics. He also cryptically reveals to Mulder and Scully their own ultimate fates."
}, {
  "imdbId" : "0106179",
  "season" : "3",
  "episodeNumber" : "5",
  "title" : "The List",
  "description" : "Enemies of a prison inmate who was executed in the electric chair begin dying one by one."
}, {
  "imdbId" : "0106179",
  "season" : "3",
  "episodeNumber" : "6",
  "title" : "2Shy",
  "description" : "Shy, overweight women are being pursued online by a suitor who courts them with Italian poetry. The women are being found dead, their corpses stripped of flesh."
}, {
  "imdbId" : "0106179",
  "season" : "3",
  "episodeNumber" : "7",
  "title" : "The Walk",
  "description" : "A quadruple amputee becomes the prime suspect in a series of bizarre deaths at an army hospital."
}, {
  "imdbId" : "0106179",
  "season" : "3",
  "episodeNumber" : "8",
  "title" : "Oubliette",
  "description" : "A woman experiences a psychic connection with a teenager held captive by a deranged man."
}, {
  "imdbId" : "0106179",
  "season" : "3",
  "episodeNumber" : "9",
  "title" : "Nisei",
  "description" : "An \"alien autopsy\" videotape and a murder spark Mulder's search for a strange creature. Scully looks for information about her disappearance."
}, {
  "imdbId" : "0106179",
  "season" : "3",
  "episodeNumber" : "10",
  "title" : "731",
  "description" : "Mulder becomes trapped aboard a train rigged with an explosive device. Scully searches for the truth behind the government's secret experiments."
}, {
  "imdbId" : "0106179",
  "season" : "3",
  "episodeNumber" : "11",
  "title" : "Revelations",
  "description" : "Mulder and Scully attempt to protect a boy, whose death could trigger the coming of Armageddon, from a possibly demonic serial killer who targets people with stigmatas."
}, {
  "imdbId" : "0106179",
  "season" : "3",
  "episodeNumber" : "12",
  "title" : "War of the Coprophages",
  "description" : "While looking for signs of alien ships in the sky above a small town, Mulder learns of a series of deaths supposedly caused by metallic cockroaches. He turns to sexy entomologist Bambi for help, which makes Scully angrily rush to his aid."
}, {
  "imdbId" : "0106179",
  "season" : "3",
  "episodeNumber" : "13",
  "title" : "Syzygy",
  "description" : "A rare alignment of the planets gives two homicidal teenage girls dangerous telekinetic powers while simultaneously driving their small town insane with satanic panic. Mulder's interest in the local female detective makes Scully jealous."
}, {
  "imdbId" : "0106179",
  "season" : "3",
  "episodeNumber" : "14",
  "title" : "Grotesque",
  "description" : "After a serial killer, who claims to have killed people under the influence of a demon, is arrested, the murders continue. Meanwhile Mulder, who believes that the demon might have picked someone new, goes neck-deep in the investigation."
}, {
  "imdbId" : "0106179",
  "season" : "3",
  "episodeNumber" : "15",
  "title" : "Piper Maru",
  "description" : "The agents investigate the mystery surrounding a sunken World War II aircraft."
}, {
  "imdbId" : "0106179",
  "season" : "3",
  "episodeNumber" : "16",
  "title" : "Apocrypha",
  "description" : "Mulder uncovers clues about a cover-up involving an alien entity and a sunken World War II aircraft. Scully pursues the man who murdered her sister."
}, {
  "imdbId" : "0106179",
  "season" : "3",
  "episodeNumber" : "17",
  "title" : "Pusher",
  "description" : "A seemingly unmotivated murderer, who can apparently talk his victims into killing themselves is on the loose and it is up to Mulder and Scully to study the clues left to them by the person and capture him."
}, {
  "imdbId" : "0106179",
  "season" : "3",
  "episodeNumber" : "18",
  "title" : "Teso dos Bichos",
  "description" : "Mulder and Scully investigate the disappearance of several members of an archaeological team that in Ecuador excavated an ancient burial urn supposedly protected by the vengeful spirit of the jaguar and had it sent to a museum in Boston."
}, {
  "imdbId" : "0106179",
  "season" : "3",
  "episodeNumber" : "19",
  "title" : "Hell Money",
  "description" : "Mulder, Scully and a local Chinese American cop investigate a deadly secret lottery run by the Triads in San Francisco's Chinatown district. The game is free to play but losing will cost you more than an arm and a leg."
}, {
  "imdbId" : "0106179",
  "season" : "3",
  "episodeNumber" : "20",
  "title" : "Jose Chung's 'From Outer Space'",
  "description" : "Scully recounts the investigation of an alleged UFO encounter for the famous quirky author Jose Chung's latest novel. The case gives a whole new meaning to the term Rashomon effect. Chung later returns in"
}, {
  "imdbId" : "0106179",
  "season" : "3",
  "episodeNumber" : "21",
  "title" : "Avatar",
  "description" : "Skinner, depressed over the fact that his wife is divorcing him, has a one night stand with a stranger who's found murdered in the morning. Mulder tries to prove Skinner's innocence but Skinner refuses to cooperate for some reason."
}, {
  "imdbId" : "0106179",
  "season" : "3",
  "episodeNumber" : "22",
  "title" : "Quagmire",
  "description" : "Mulder suspects that a beast similar to the Loch Ness Monster is responsible for the deaths of several people who reside near a large lake. Frustrated Scully insightfully confronts Mulder about the futility of their work on X-Files."
}, {
  "imdbId" : "0106179",
  "season" : "3",
  "episodeNumber" : "23",
  "title" : "Wetwired",
  "description" : "Mulder and Scully investigate a series of murders linked to a mysterious device that alters television signals causing paranoid hallucinations. One of them falls victim to it."
}, {
  "imdbId" : "0106179",
  "season" : "3",
  "episodeNumber" : "24",
  "title" : "Talitha Cumi",
  "description" : "After his mother suffers a stroke under strange circumstances, Mulder searches for a strange, benevolent alien man that possesses miraculous healing powers."
}, {
  "imdbId" : "0106179",
  "season" : "4",
  "episodeNumber" : "1",
  "title" : "Herrenvolk",
  "description" : "With his mother on deathbed and the alien bounty hunter in pursuit, Mulder decides to put the alien healer in mortal danger for a chance to finally uncover the whole truth behind the alien conspiracy. Meanwhile, Mr. X's cover is blown."
}, {
  "imdbId" : "0106179",
  "season" : "4",
  "episodeNumber" : "2",
  "title" : "Home",
  "description" : "The remains of a murdered deformed infant lead the agents to a family of murderous, inbred, animal-like brothers living on a secluded farm in a remote section of Pennsylvania."
}, {
  "imdbId" : "0106179",
  "season" : "4",
  "episodeNumber" : "3",
  "title" : "Teliko",
  "description" : "Mulder believes a creature from an African folktale may be responsible for the disappearance of several black men in the Philadelphia area."
}, {
  "imdbId" : "0106179",
  "season" : "4",
  "episodeNumber" : "4",
  "title" : "Unruhe",
  "description" : "Photos of a hellish sight from the mind of a psychopath who abducts women makes Mulder think that the man has the ability of psychic photography."
}, {
  "imdbId" : "0106179",
  "season" : "4",
  "episodeNumber" : "5",
  "title" : "The Field Where I Died",
  "description" : "Agents Mulder and Scully investigate a doomsday religious cult, which inadvertently draws Mulder into recalling a past life and how Scully and others were there with him in the field where he died during the American Civil War."
}, {
  "imdbId" : "0106179",
  "season" : "4",
  "episodeNumber" : "6",
  "title" : "Sanguinarium",
  "description" : "Patients undergoing cosmetic surgery die horrible deaths at the hands of doctors possessed by witchcraft."
}, {
  "imdbId" : "0106179",
  "season" : "4",
  "episodeNumber" : "7",
  "title" : "Musings of a Cigarette Smoking Man",
  "description" : "The Lone Gunmen reveal the (possibly fake) secret history of the Smoking Man to Mulder with focus on three episodes from his life - the assassination of JFK, his attempts at becoming a novelist and one of his UFO cover ups."
}, {
  "imdbId" : "0106179",
  "season" : "4",
  "episodeNumber" : "8",
  "title" : "Tunguska",
  "description" : "A tip from Krycek takes Mulder to a gulag in Tunguska, Russia where prisoners are being used for experiments with the black oil alien virus. Meanwhile, Scully's colleague is infected with the same virus which lay dormant in a meteorite."
}, {
  "imdbId" : "0106179",
  "season" : "4",
  "episodeNumber" : "9",
  "title" : "Terma",
  "description" : "Mulder tries to stop a Russian supersoldier from destroying the site in North America where the black oil virus can be excavated. Scully is jailed after she refuses to reveal Mulder's whereabouts at a Senate subcommittee hearing."
}, {
  "imdbId" : "0106179",
  "season" : "4",
  "episodeNumber" : "10",
  "title" : "Paper Hearts",
  "description" : "An incarcerated serial killer claims Mulder's sister was one of his many victims."
}, {
  "imdbId" : "0106179",
  "season" : "4",
  "episodeNumber" : "11",
  "title" : "El Mundo Gira",
  "description" : "Desperate illegal immigrant dubbed El Chupacabra who can't speak any English becomes patient zero for a possibly alien infection and goes on the run from INS, the FBI and his own brother who blames him for the death of his girlfriend."
}, {
  "imdbId" : "0106179",
  "season" : "4",
  "episodeNumber" : "12",
  "title" : "Leonard Betts",
  "description" : "A headless corpse of a paramedic walks out of the hospital morgue triggering a manhunt for a man with unimaginable regenerative powers, that come at a terrible cost. The case makes Scully realize in shock that she may not be well."
}, {
  "imdbId" : "0106179",
  "season" : "4",
  "episodeNumber" : "13",
  "title" : "Never Again",
  "description" : "Mulder takes a vacation to visit Graceland while sending disaffected Scully to Philadelphia to look into Russians with ties to UFOs. She becomes attracted to a secretly unstable young divorcee whose tattoo is telling him to kill women."
}, {
  "imdbId" : "0106179",
  "season" : "4",
  "episodeNumber" : "14",
  "title" : "Memento Mori",
  "description" : "Scully attempts to come to terms with her inoperable cancer. Meanwhile Mulder and the Lone Gunmen break into a high-security research lab to find the cure that could save her life."
}, {
  "imdbId" : "0106179",
  "season" : "4",
  "episodeNumber" : "15",
  "title" : "Kaddish",
  "description" : "After a Jewish man is murdered in a Jewish community, his killers are murdered, too. Mulder and Scully have to determine whether someone is exacting vengeance or are larger forces are at work."
}, {
  "imdbId" : "0106179",
  "season" : "4",
  "episodeNumber" : "16",
  "title" : "Unrequited",
  "description" : "An embittered Vietnam War veteran who can apparently somehow make himself invisible to everyone around him is murdering military officials. In order to attempt to stop him, Mulder and Scully must first uncover his motives."
}, {
  "imdbId" : "0106179",
  "season" : "4",
  "episodeNumber" : "17",
  "title" : "Tempus Fugit",
  "description" : "While investigating the unexplained crash of a commercial airliner the agents' search for answers leads to the bottom of a desolate lake and a startling discovery involving Mulder's alien abductee friend Max Fenig."
}, {
  "imdbId" : "0106179",
  "season" : "4",
  "episodeNumber" : "18",
  "title" : "Max",
  "description" : "Mulder and Scully continue their investigation into what really caused the airliner to crash, as the military insidiously begins to cover up the truth and even tries to murder the agents. Someone close to Scully is killed in the process."
}, {
  "imdbId" : "0106179",
  "season" : "4",
  "episodeNumber" : "19",
  "title" : "Synchrony",
  "description" : "A mysterious old man is killing scientists working on the development of a cryobiologic compound. He freezes them to death with this same compound that doesn't even exist yet."
}, {
  "imdbId" : "0106179",
  "season" : "4",
  "episodeNumber" : "20",
  "title" : "Small Potatoes",
  "description" : "Five unrelated women in a small town give birth to babies with small tails. The prime suspect is a man who can shape shift into whomever he wants."
}, {
  "imdbId" : "0106179",
  "season" : "4",
  "episodeNumber" : "21",
  "title" : "Zero Sum",
  "description" : "A swarm of bees mysteriously kill a postal worker in an enclosed restroom. Assistant Director Skinner covers up the evidence. Mulder investigates Skinner's apparent involvement with the crime."
}, {
  "imdbId" : "0106179",
  "season" : "4",
  "episodeNumber" : "22",
  "title" : "Elegy",
  "description" : "Apparitions of women killed by a serial killer start appearing to people. Mulder figures they may be harbingers of death for those who see them. Scully is skeptical until she sees one. Their only lead is an autistic psychiatric patient."
}, {
  "imdbId" : "0106179",
  "season" : "4",
  "episodeNumber" : "23",
  "title" : "Demons",
  "description" : "Covered in blood and suffering from amnesia, Mulder pieces together the events of the last few days, but the trail leads to a double murder that appears to have been committed with Mulder's weapon."
}, {
  "imdbId" : "0106179",
  "season" : "4",
  "episodeNumber" : "24",
  "title" : "Gethsemane",
  "description" : "Mulder fights to prove that a discovery frozen in the mountains of Canada is irrefutable evidence of alien life, but his quest for the truth only leads to more lies and an unthinkable conclusion."
}, {
  "imdbId" : "0106179",
  "season" : "5",
  "episodeNumber" : "1",
  "title" : "Redux",
  "description" : "Mulder accesses a facility that may hold a cure for Scully's illness. Scully performs an experiment in hopes of determining the origin of the disease."
}, {
  "imdbId" : "0106179",
  "season" : "5",
  "episodeNumber" : "2",
  "title" : "Redux II",
  "description" : "Scully is hospitalized after collapsing, while Mulder receives help from a most unlikely source as he continues to search for a cure for Scully's illness."
}, {
  "imdbId" : "0106179",
  "season" : "5",
  "episodeNumber" : "3",
  "title" : "Unusual Suspects",
  "description" : "In May 1989, the Lone Gunmen meet for the first time when they assist a woman who claims the government plans to use civilians in a secret experiment."
}, {
  "imdbId" : "0106179",
  "season" : "5",
  "episodeNumber" : "4",
  "title" : "Detour",
  "description" : "In the unexplored woods of Florida's Apalachicola National Forest, Mulder and Scully investigate the disappearances of two land surveyors and a boy's claims that he and his father were attacked by an invisible creature."
}, {
  "imdbId" : "0106179",
  "season" : "5",
  "episodeNumber" : "5",
  "title" : "The Post-Modern Prometheus",
  "description" : "in this surreal, comical take on Frankenstein, Mulder and Scully arrive in a small rural town to investigate claims of a monster obsessed with Cher that's sedating and impregnating the local women."
}, {
  "imdbId" : "0106179",
  "season" : "5",
  "episodeNumber" : "6",
  "title" : "Christmas Carol",
  "description" : "While visiting family for Christmas at her brother's San Diego home, Scully receives a mysterious phone call that leads to the investigation of a woman's suicide and a young girl who may be the daughter of Scully's deceased sister Melissa."
}, {
  "imdbId" : "0106179",
  "season" : "5",
  "episodeNumber" : "7",
  "title" : "Emily",
  "description" : "Scully deeply wants to adopt three-year-old Emily Sim, only to discover that the young girl has developed a serious illness. Mulder arrives in San Diego to help investigate what may be a sinister conspiracy behind it."
}, {
  "imdbId" : "0106179",
  "season" : "5",
  "episodeNumber" : "8",
  "title" : "Kitsunegari",
  "description" : "Robert Patrick Modell, aka \"Pusher,\" has recovered from his injuries and escaped from a prison hospital. Mulder and Scully lead the manhunt even as Modell may be using his powerful mind-control capabilities to target Fox for revenge."
}, {
  "imdbId" : "0106179",
  "season" : "5",
  "episodeNumber" : "9",
  "title" : "Schizogeny",
  "description" : "A teenager becomes the prime suspect in his stepfather's odd murder. Mulder is not buying it since the man was literally swallowed by the ground. After another parent is killed, the suspicion falls on someone close to the kids."
}, {
  "imdbId" : "0106179",
  "season" : "5",
  "episodeNumber" : "10",
  "title" : "Chinga",
  "description" : "Rumors of witchcraft and sorcery surrounding a bizarre murder at a supermarket in a small New England fishing town lead Scully, who's on vacation, to a little girl and a cursed doll that may be hiding a murderous presence."
}, {
  "imdbId" : "0106179",
  "season" : "5",
  "episodeNumber" : "11",
  "title" : "Kill Switch",
  "description" : "The brutal murder of a renowned computer programmer leads Mulder and Scully to investigate an artificial intelligence program loose on the Internet that has begun evolving on its own."
}, {
  "imdbId" : "0106179",
  "season" : "5",
  "episodeNumber" : "12",
  "title" : "Bad Blood",
  "description" : "Scully and Mulder each recount their version of events that led Mulder to drive a stake through the heart of a Texas teenager he claims was a vampire."
}, {
  "imdbId" : "0106179",
  "season" : "5",
  "episodeNumber" : "13",
  "title" : "Patient X",
  "description" : "Mulder and Scully search for answers when separate groups of alien abductees are burned alive. They meet a woman with an implant in her neck and symptoms similar to Scully."
}, {
  "imdbId" : "0106179",
  "season" : "5",
  "episodeNumber" : "14",
  "title" : "The Red and the Black",
  "description" : "Scully undergoes hypnosis to recall her experiences on the bridge where the group of abductees was burned alive. Krycek provides the consortium with a vaccine for the black oil and tells Mulder of the planned colonization and alien rebels."
}, {
  "imdbId" : "0106179",
  "season" : "5",
  "episodeNumber" : "15",
  "title" : "Travelers",
  "description" : "In 1990 Mulder investigates the death of a man who disappeared in 1952 before he could be charged in a series of bizarre killings. The retired agent who worked the 1952 case recounts the facts to Mulder and the connection to his father."
}, {
  "imdbId" : "0106179",
  "season" : "5",
  "episodeNumber" : "16",
  "title" : "Mind's Eye",
  "description" : "The prime suspect in a murder case is a woman who has been blind since birth, leading Mulder and Scully to conclude she may possess the ability to see through a killer's eyes."
}, {
  "imdbId" : "0106179",
  "season" : "5",
  "episodeNumber" : "17",
  "title" : "All Souls",
  "description" : "When a girl dies a mysterious death, Scully and Mulder discover more girls' lives are at stake in a divine battle of good versus evil."
}, {
  "imdbId" : "0106179",
  "season" : "5",
  "episodeNumber" : "18",
  "title" : "The Pine Bluff Variant",
  "description" : "Mulder goes undercover to infiltrate a militia group armed with a deadly pathogen and wanted for domestic terrorism. Scully becomes suspicious when Mulder lets a suspect escape but she learns that his assignment may be a suicide mission."
}, {
  "imdbId" : "0106179",
  "season" : "5",
  "episodeNumber" : "19",
  "title" : "Folie a Deux",
  "description" : "Paranoid telemarketer takes his coworkers and Mulder hostage claiming that their boss is a disguised insectoid monster that's literally turning the workers one by one into his zombie drones."
}, {
  "imdbId" : "0106179",
  "season" : "5",
  "episodeNumber" : "20",
  "title" : "The End",
  "description" : "A government assassin is caught trying to kill child chess prodigy Gibson Praise during an international chess tournament. Mulder's old flame Agent Diana Fowley arrives to help on the case but Scully is suspicious of her."
}, {
  "imdbId" : "0106179",
  "season" : "6",
  "episodeNumber" : "1",
  "title" : "The Beginning",
  "description" : "After the events of"
}, {
  "imdbId" : "0106179",
  "season" : "6",
  "episodeNumber" : "2",
  "title" : "Drive",
  "description" : "A man tormented by a piercing sound that could make his head explode unless he heads west as fast as possible takes Mulder hostage to drive for him, while Scully rushes to find the cause of this affliction that also killed the man's wife."
}, {
  "imdbId" : "0106179",
  "season" : "6",
  "episodeNumber" : "3",
  "title" : "Triangle",
  "description" : "Mulder boards the wreck of a legendary missing WWII ship that suddenly appeared in the Bermuda Triangle. The ship turns out to be a time portal. Now Scully must use all of her wits to try and get the unwilling FBI to help her save him."
}, {
  "imdbId" : "0106179",
  "season" : "6",
  "episodeNumber" : "4",
  "title" : "Dreamland",
  "description" : "An anonymous tip finally brings Mulder and Scully to the mecca of all UFO lore, Area 51. But when the agents witness the flight of a mysterious craft there, Mulder and one of the Men in Black, Fletcher, somehow switch bodies - and lives."
}, {
  "imdbId" : "0106179",
  "season" : "6",
  "episodeNumber" : "5",
  "title" : "Dreamland II",
  "description" : "Scully begins to suspect that her partner's strange behavior is more than it appears to be, while Mulder fights to return his life to normal before it's too late."
}, {
  "imdbId" : "0106179",
  "season" : "6",
  "episodeNumber" : "6",
  "title" : "How the Ghosts Stole Christmas",
  "description" : "On Christmas Eve, Mulder and Scully find themselves trapped in a haunted house with two ghosts who are determined to prove just how lonely the holiday can be."
}, {
  "imdbId" : "0106179",
  "season" : "6",
  "episodeNumber" : "7",
  "title" : "Terms of Endearment",
  "description" : "A pregnant woman's baby is snatched away from her belly by a devil. Agent Spender believes the case is a joke, but Mulder decides to look into it on his own anyway. His investigation focuses on the woman's husband."
}, {
  "imdbId" : "0106179",
  "season" : "6",
  "episodeNumber" : "8",
  "title" : "The Rain King",
  "description" : "When Mulder and Scully investigate a man who claims he can control the rain in a small, drought-stricken Kansas town, they encounter a force more powerful than the weather."
}, {
  "imdbId" : "0106179",
  "season" : "6",
  "episodeNumber" : "9",
  "title" : "S.R. 819",
  "description" : "When Skinner is infected with an unknown disease and receives a mysterious phone call telling him he has 24 hours to live, Scully and Mulder rush to find a cure and those responsible."
}, {
  "imdbId" : "0106179",
  "season" : "6",
  "episodeNumber" : "10",
  "title" : "Tithonus",
  "description" : "A rookie agent asks for Scully's help in proving that a quaint crime scene photographer is a serial killer. With some help from a bored Mulder, Scully discovers the man's actual dark secret. And an old prophecy regarding Scully comes true."
}, {
  "imdbId" : "0106179",
  "season" : "6",
  "episodeNumber" : "11",
  "title" : "Two Fathers",
  "description" : "The alien rebels return to kill abductees including Scully and Cassandra Spender. With the Syndicate in shambles, the Cigarette Smoking Man reveals the truth to Agent Spender hoping that he will continue his work."
}, {
  "imdbId" : "0106179",
  "season" : "6",
  "episodeNumber" : "12",
  "title" : "One Son",
  "description" : "Everyone prepares in their own way for the alien rebels' bloody endgame after which nothing will ever be the same again. Mulder and Scully try their best to stop the bloodshed and save Spender's mother."
}, {
  "imdbId" : "0106179",
  "season" : "6",
  "episodeNumber" : "13",
  "title" : "Agua Mala",
  "description" : "As a hurricane bears down on the Florida coast, the agents search for a sea monster that Arthur Dales believes is responsible for the disappearance of a couple and their son."
}, {
  "imdbId" : "0106179",
  "season" : "6",
  "episodeNumber" : "14",
  "title" : "Monday",
  "description" : "A woman desperately attempts to change the outcome of the events of a day she is forced to relive again and again in which her boyfriend explodes a bomb during a failed bank robbery killing everyone inside, including Mulder and Scully."
}, {
  "imdbId" : "0106179",
  "season" : "6",
  "episodeNumber" : "15",
  "title" : "Arcadia",
  "description" : "On their first assignment after being reinstated to the X-Files, Scully and Mulder go undercover as husband and wife in a high-class planned community where several couples have gone missing."
}, {
  "imdbId" : "0106179",
  "season" : "6",
  "episodeNumber" : "16",
  "title" : "Alpha",
  "description" : "A series of murders is blamed on a mythical Asian dog that supposedly escaped from the US cryptozoologist who caught it. Mulder asks a reclusive female dog expert for help which angers Scully. The woman leaves him a special gift."
}, {
  "imdbId" : "0106179",
  "season" : "6",
  "episodeNumber" : "17",
  "title" : "Trevor",
  "description" : "An escaped convict, who seems to have gained the ability to pass through solid objects as well as people, which kills them, goes looking for the $90,000 he hid somewhere after the bank robbery for which he was imprisoned. Mulder and Scully must find the deadly convict before he can get to his ex-girlfriend and the money."
}, {
  "imdbId" : "0106179",
  "season" : "6",
  "episodeNumber" : "18",
  "title" : "Milagro",
  "description" : "A strange writer infatuated with Scully moves in next door to Mulder and proceeds to slowly bewitch her through his writing. Mulder investigates the man and realizes that he may be behind a series of killings involving psychic surgery."
}, {
  "imdbId" : "0106179",
  "season" : "6",
  "episodeNumber" : "19",
  "title" : "The Unnatural",
  "description" : "Searching through an FBI reference book, Mulder finds a photograph of Arthur Dales with a baseball team and the alien bounty hunter. Mulder goes to Arthur Dales' house to ask him about the photograph. There he finds Arthur Dales' brother, also named Arthur. Mr. Dales proceeds to tell Mulder a story of a 1940s Negro baseball player in Roswell named Josh Exley who was closing in on breaking some professional baseball records. Mr. Dales tells how he was assigned to protect this player from the KKK and that Exley was actually an alien."
}, {
  "imdbId" : "0106179",
  "season" : "6",
  "episodeNumber" : "20",
  "title" : "Three of a Kind",
  "description" : "While infiltrating a defense contractor conference in Las Vegas, The Lone Gunmen are reunited with Susanne Modeski, the mysterious woman who disappeared 10 years earlier after the trio first came together to help her."
}, {
  "imdbId" : "0106179",
  "season" : "6",
  "episodeNumber" : "21",
  "title" : "Field Trip",
  "description" : "The skeletal remains of a young couple are found after they have been missing for only three days in an area known for UFO activity. Mulder and Scully have different experiences in the investigation but nothing is quite as it seems."
}, {
  "imdbId" : "0106179",
  "season" : "6",
  "episodeNumber" : "22",
  "title" : "Biogenesis",
  "description" : "Mulder believes metallic objects discovered on the coast of West Africa are proof of the extraterrestrial origin of life on Earth. He falls mentally ill under the apparent influence of the artifact while Scully goes to Africa for answers."
}, {
  "imdbId" : "0106179",
  "season" : "7",
  "episodeNumber" : "1",
  "title" : "The Sixth Extinction",
  "description" : "Scully and a colleague try to decipher the symbols on the spaceship beached in Africa before their rival can take over the dig, but the ship starts recreating the Plagues of Egypt. Skinner and Kritschgau test Mulder's telepathic ability."
}, {
  "imdbId" : "0106179",
  "season" : "7",
  "episodeNumber" : "2",
  "title" : "The Sixth Extinction II: Amor Fati",
  "description" : "Scully searches for Mulder after the Cigarette Smoking Man takes him from the hospital for unknown purposes. An unconscious Mulder dreams of a better life away from his mission and the X-Files. But perhaps he is being led astray."
}, {
  "imdbId" : "0106179",
  "season" : "7",
  "episodeNumber" : "3",
  "title" : "Hungry",
  "description" : "Rob Roberts has an addiction to human brains. As he tries to control this overpowering hunger and turn his life around, Mulder and Scully try to find out who the brain-eating monster is."
}, {
  "imdbId" : "0106179",
  "season" : "7",
  "episodeNumber" : "4",
  "title" : "Millennium",
  "description" : "In this backdoor series finale to"
}, {
  "imdbId" : "0106179",
  "season" : "7",
  "episodeNumber" : "5",
  "title" : "Rush",
  "description" : "A high school boy is accused of the violent murder of a sheriff's deputy. Mulder believes he is innocent. The agents find that someone with super-human speed may be the culprit."
}, {
  "imdbId" : "0106179",
  "season" : "7",
  "episodeNumber" : "6",
  "title" : "The Goldberg Variation",
  "description" : "A man is tossed off the top of a 29 story building by gangsters. Amazingly, he gets up and walks away unscathed. Mulder and Scully investigate when Mulder suspects this man may have paranormal abilities. The man in question may just be the luckiest man on Earth."
}, {
  "imdbId" : "0106179",
  "season" : "7",
  "episodeNumber" : "7",
  "title" : "Orison",
  "description" : "Five years have passed since Scully escaped from Donnie Pfaster, an obsessed death fetishist. When Reverend Orison helps the madman escape from prison he immediately turns to the one that got away...Scully."
}, {
  "imdbId" : "0106179",
  "season" : "7",
  "episodeNumber" : "8",
  "title" : "The Amazing Maleeni",
  "description" : "Mulder and Scully investigate the apparent murder of a magician who was decapitated just minutes after he was able to perform the trick of turning his head around 360 degrees. The agents are perplexed when Scully discovers during the autopsy that the deceased died well before he performed his final trick."
}, {
  "imdbId" : "0106179",
  "season" : "7",
  "episodeNumber" : "9",
  "title" : "Signs & Wonders",
  "description" : "A man is found dead in his locked car, killed from over a hundred snake bites. However, no evidence of snakes being present is found. The man was a former member of a religious cult that believes in snake handling. Mulder and Scully believe that this snake death was no accident, and that it may have been a murder involving this snake handling cult."
}, {
  "imdbId" : "0106179",
  "season" : "7",
  "episodeNumber" : "10",
  "title" : "Sein und Zeit",
  "description" : "The strange disappearance of a little girl leads Mulder to make connections with previous unexplained cases of missing children. Scully believes he is becoming obsessed with the case by associating it with the abduction of his sister."
}, {
  "imdbId" : "0106179",
  "season" : "7",
  "episodeNumber" : "11",
  "title" : "Closure",
  "description" : "With help from a police psychic, Mulder continues to search for clues about Samantha's abduction and ultimately finds the long sought after answers concerning her fate."
}, {
  "imdbId" : "0106179",
  "season" : "7",
  "episodeNumber" : "12",
  "title" : "X-Cops",
  "description" : "The investigation of a neighborhood monster isn't too weird for the crew of"
}, {
  "imdbId" : "0106179",
  "season" : "7",
  "episodeNumber" : "13",
  "title" : "First Person Shooter",
  "description" : "A murder inside the high-tech world of a virtual reality game leads Scully to battle a deadly digital character in order to save Mulder's life."
}, {
  "imdbId" : "0106179",
  "season" : "7",
  "episodeNumber" : "14",
  "title" : "Theef",
  "description" : "Voodoo appears to be involved in the murder of a prominent doctor's father-in-law. Mulder and Scully work to stop the killer who uses hex-craft to exact his revenge on the doctor's family."
}, {
  "imdbId" : "0106179",
  "season" : "7",
  "episodeNumber" : "15",
  "title" : "En Ami",
  "description" : "Agent Scully lets sympathy cloud her better judgment when she accompanies the Cigarette Smoking Man on a road trip and wonders if he's as evil as she always thought."
}, {
  "imdbId" : "0106179",
  "season" : "7",
  "episodeNumber" : "16",
  "title" : "Chimera",
  "description" : "Mulder and Scully are on a stakeout of a female serial-killer of prostitutes. Mulder gets called away from the stakeout by Skinner to investigate the disappearance of federal judge's daughter. The strange appearance of a raven shortly before she went missing leads Mulder to believe this case may have paranormal significance."
}, {
  "imdbId" : "0106179",
  "season" : "7",
  "episodeNumber" : "17",
  "title" : "All Things",
  "description" : "Scully is finishing up the autopsy of a person at a hospital. A file mix-up involving the autopsy folder and another patient's x-ray leads Scully to discover a former lover of hers has been admitted at the hospital. Meeting with him again causes Scully to re-examine the decisions she has made in her life, leading to her where she is to today."
}, {
  "imdbId" : "0106179",
  "season" : "7",
  "episodeNumber" : "18",
  "title" : "Brand X",
  "description" : "A potential witness in a high-profile tobacco case under Skinner's supervision is found dead in his bathroom from mysterious circumstances. Skinner asks Mulder and Scully to assist him in the investigation. They find a man who smokes a unique kind of cigarettes, the second-hand smoke of which, has deadly results for the inhaler."
}, {
  "imdbId" : "0106179",
  "season" : "7",
  "episodeNumber" : "19",
  "title" : "Hollywood A.D.",
  "description" : "A screenwriter tags along with Mulder and Scully as they investigate a church bombing. The case becomes the plot of a Hollywood movie, but the agents find their case, and themselves, distorted on the big screen."
}, {
  "imdbId" : "0106179",
  "season" : "7",
  "episodeNumber" : "20",
  "title" : "Fight Club",
  "description" : "Two strikingly similar women, who do not know one another, cause people to erupt into violence upon each other, whenever these two women come in contact. Mulder and Scully set out to solve the mystery of this unexplained violence involving the two women."
}, {
  "imdbId" : "0106179",
  "season" : "7",
  "episodeNumber" : "21",
  "title" : "Je Souhaite",
  "description" : "Two brothers have a less than helpful genie who grants their wishes with disastrous consequences. Mulder comes into possession of the same genie, and his wishes garner similar results."
}, {
  "imdbId" : "0106179",
  "season" : "7",
  "episodeNumber" : "22",
  "title" : "Requiem",
  "description" : "Seven years after their first case, Mulder and Scully return to Bellefleur, Oregon to see Billy Miles and investigate a new series of abductions in the local forest, risking their partnership and lives."
}, {
  "imdbId" : "0106179",
  "season" : "8",
  "episodeNumber" : "1",
  "title" : "Within",
  "description" : "New Deputy Director Kersh has Agent John Doggett investigate the missing Mulder case. Doggett's skeptical treatment of Mulder's disappearance puts a thorn in Scully and Skinner's sides."
}, {
  "imdbId" : "0106179",
  "season" : "8",
  "episodeNumber" : "2",
  "title" : "Without",
  "description" : "Scully leads Skinner and an unhappy Doggett to Arizona to protect child prodigy Gibson Praise from an alien bounty hunter disguised as the missing Mulder."
}, {
  "imdbId" : "0106179",
  "season" : "8",
  "episodeNumber" : "3",
  "title" : "Patience",
  "description" : "Scully isn't exactly warm to Doggett on their first X-File together in which they investigate a human bat."
}, {
  "imdbId" : "0106179",
  "season" : "8",
  "episodeNumber" : "4",
  "title" : "Roadrunners",
  "description" : "Doggett is a little dismayed when Scully investigates a murder in a barely inhabited town in Utah without him. When Scully's car breaks down and she finds the town people aren't as sweet as they seem she struggles to find a way out of the demented town."
}, {
  "imdbId" : "0106179",
  "season" : "8",
  "episodeNumber" : "5",
  "title" : "Invocation",
  "description" : "Doggett and Scully once again butt heads on their latest X-File which involves a boy who has returned after being missing for ten years but still appears to be seven years old, the age he was the day he was abducted."
}, {
  "imdbId" : "0106179",
  "season" : "8",
  "episodeNumber" : "6",
  "title" : "Redrum",
  "description" : "A man lives the most recent 5 days of his life backwards and finds out that he is the main suspect in the murder of his wife."
}, {
  "imdbId" : "0106179",
  "season" : "8",
  "episodeNumber" : "7",
  "title" : "Via Negativa",
  "description" : "While Scully tends to her secret, Doggett and Skinner team up to find and somehow stop a cult leader who can kill people in their dreams."
}, {
  "imdbId" : "0106179",
  "season" : "8",
  "episodeNumber" : "8",
  "title" : "Surekill",
  "description" : "Doggett and Scully investigate two shady brothers who run a rat extermination business, one of whom may be a killer with X-Ray vision."
}, {
  "imdbId" : "0106179",
  "season" : "8",
  "episodeNumber" : "9",
  "title" : "Salvage",
  "description" : "A man believed to be dead from Gulf War Syndrome comes back to life and slowly turns into metal while taking revenge on those who made him that way."
}, {
  "imdbId" : "0106179",
  "season" : "8",
  "episodeNumber" : "10",
  "title" : "Badlaa",
  "description" : "A small Indian man on a creaky cart with powers of illusion is believed to have the ability to take over people's bodies and kill them by leaping into their anal cavity. Doggett and Scully try to stop his gruesome killing spree."
}, {
  "imdbId" : "0106179",
  "season" : "8",
  "episodeNumber" : "11",
  "title" : "The Gift",
  "description" : "Skinner and Doggett investigate a case Mulder was working on before he disappeared involving a family and a monster straight from Native American lore."
}, {
  "imdbId" : "0106179",
  "season" : "8",
  "episodeNumber" : "12",
  "title" : "Medusa",
  "description" : "Doggett takes to the Boston subways to try to figure out where a deadly agent that is killing citizens is coming from."
}, {
  "imdbId" : "0106179",
  "season" : "8",
  "episodeNumber" : "13",
  "title" : "Per Manum",
  "description" : "Scully stumbles upon a woman whose abductee experience and symptoms are amazingly similar. The fear now is that both their upcoming births will be to non-human offspring."
}, {
  "imdbId" : "0106179",
  "season" : "8",
  "episodeNumber" : "14",
  "title" : "This Is Not Happening",
  "description" : "Jeremiah Smith appears out of nowhere and formerly dead abductees are coming back to life, giving Scully and Skinner the idea that Mulder may have a shot at still being alive."
}, {
  "imdbId" : "0106179",
  "season" : "8",
  "episodeNumber" : "15",
  "title" : "Deadalive",
  "description" : "Three months after Mulder's funeral, another alien abductee's body comes back to life. Skinner exhumes Mulder hoping that he too can be revived. Skinner faces an impossible decision when Krycek offers him a vaccine that can save Mulder."
}, {
  "imdbId" : "0106179",
  "season" : "8",
  "episodeNumber" : "16",
  "title" : "Three Words",
  "description" : "Mulder requests reassignment to the X-Files but is denied by Kersh. When a man with information about an alien invasion is killed on the White House lawn, Mulder conducts his own investigation to find further evidence of colonization."
}, {
  "imdbId" : "0106179",
  "season" : "8",
  "episodeNumber" : "17",
  "title" : "Empedocles",
  "description" : "Upon being fired, an office worker murders his employers, believed to be under the influence of pure evil. Agent Reyes believes this evil may be linked to the death of Doggett's son."
}, {
  "imdbId" : "0106179",
  "season" : "8",
  "episodeNumber" : "18",
  "title" : "Vienen",
  "description" : "Doggett and Mulder unwillingly team up investigating an oil rig where some mysterious murders have happened and the possibility of the Black Oil being involved is a haunting reality."
}, {
  "imdbId" : "0106179",
  "season" : "8",
  "episodeNumber" : "19",
  "title" : "Alone",
  "description" : "A bizarre reptilian creature captures Doggett and his new Mulder-obsessed partner underground and only an X-Files deposed Mulder can help them."
}, {
  "imdbId" : "0106179",
  "season" : "8",
  "episodeNumber" : "20",
  "title" : "Essence",
  "description" : "The X-Files team must protect Agent Scully and her unborn child as groups of Super Soldiers try to stop her pregnancy."
}, {
  "imdbId" : "0106179",
  "season" : "8",
  "episodeNumber" : "21",
  "title" : "Existence",
  "description" : "Agents Mulder, Doggett and Skinner investigate (along with Alex Krycek) the Super Soldier conspiracy, while Scully goes into hiding to have her child."
}, {
  "imdbId" : "0106179",
  "season" : "9",
  "episodeNumber" : "1",
  "title" : "Nothing Important Happened Today",
  "description" : "While Doggett's investigation of Deputy Director Kersh hits difficulties, the agents encounter a beautiful woman with the ability to remain submerged underwater."
}, {
  "imdbId" : "0106179",
  "season" : "9",
  "episodeNumber" : "2",
  "title" : "Nothing Important Happened Today II",
  "description" : "Doggett attempts to uncover the truth about a woman with superhuman abilities who is somehow connected to scientific experiments being conducted in a lab aboard a secret ship that stays at sea year round."
}, {
  "imdbId" : "0106179",
  "season" : "9",
  "episodeNumber" : "3",
  "title" : "Dæmonicus",
  "description" : "A professor/inmate in a psychiatric ward may be influencing other men to kill ritualistically. Though Doggett sees it as pure manipulation, Reyes can't help but suspect none else but the devil himself possessing the professor's body."
}, {
  "imdbId" : "0106179",
  "season" : "9",
  "episodeNumber" : "4",
  "title" : "4-D",
  "description" : "Agent Dogget has been shot and hospitalized. The only suspect is his partner. However, she was 14 miles away when the shooting occurred. The team sticks together to solve the case of being in two places at one time."
}, {
  "imdbId" : "0106179",
  "season" : "9",
  "episodeNumber" : "5",
  "title" : "Lord of the Flies",
  "description" : "Doggett and Reyes investigate a teenage boy who may have the ability to control insects and uses it to kill. Scully and a pushy, pompous, flirtatious entomologist assist them."
}, {
  "imdbId" : "0106179",
  "season" : "9",
  "episodeNumber" : "6",
  "title" : "Trust No 1",
  "description" : "Mulder contacts Scully which sets off a chain of events involving an NSA man obsessed with speaking and giving information to Mulder."
}, {
  "imdbId" : "0106179",
  "season" : "9",
  "episodeNumber" : "7",
  "title" : "John Doe",
  "description" : "Doggett wakes up in Mexico and can't remember his name or what he is doing there. His only clues are small flashbacks of a child (his son) and two mysterious marks on his head."
}, {
  "imdbId" : "0106179",
  "season" : "9",
  "episodeNumber" : "8",
  "title" : "Hellbound",
  "description" : "Reyes finds herself inexplicably connected to a case involving ex-cons who are being skinned."
}, {
  "imdbId" : "0106179",
  "season" : "9",
  "episodeNumber" : "9",
  "title" : "Provenance",
  "description" : "A man is chased from the Canada/US border and reportedly burned alive though his body is not found. Meanwhile, in the burned remains, the FBI finds papers with the same UFO markings Scully found in Africa."
}, {
  "imdbId" : "0106179",
  "season" : "9",
  "episodeNumber" : "10",
  "title" : "Providence",
  "description" : "Scully's baby becomes a bargaining chip for a psychotic UFO cult that feels the baby is ultimately connected to a UFO they have uncovered."
}, {
  "imdbId" : "0106179",
  "season" : "9",
  "episodeNumber" : "11",
  "title" : "Audrey Pauley",
  "description" : "Reyes is seriously injured in a car accident and finds herself in a hospital similar to purgatory with other hospital patients suffering from serious traumas. Slowly they all begin to disappear. Meanwhile, in the real world, Doggett refuses to accept his friend's 'mortal' wounds and uses a bizarre hospital employee to both connect with Reyes in the other-world and capture a 'Dr. Death.'"
}, {
  "imdbId" : "0106179",
  "season" : "9",
  "episodeNumber" : "12",
  "title" : "Underneath",
  "description" : "After thirteen years in prison, a man named Fassl is released and cleared of murder charges when DNA evidence proves he had nothing to do with the murder of an entire family though he was present on the scene. Doggett, who made the arrest, refuses to accept Fassl's innocence and pursues the case again."
}, {
  "imdbId" : "0106179",
  "season" : "9",
  "episodeNumber" : "13",
  "title" : "Improbable",
  "description" : "Reyes, Doggett, and Scully are pulled into a bizarre serial murder case involving the number '3', numerology on a whole, and an eccentric man who likes to play checkers."
}, {
  "imdbId" : "0106179",
  "season" : "9",
  "episodeNumber" : "14",
  "title" : "Scary Monsters",
  "description" : "Reyes and Doggett, with the aid of a young Mulder-worshiping FBI agent, investigate a father who is exhibiting bizarre behavior regarding his son who he has kept hidden from the outside world."
}, {
  "imdbId" : "0106179",
  "season" : "9",
  "episodeNumber" : "15",
  "title" : "Jump the Shark",
  "description" : "The Lone Gunmen, with the (unwanted) aide of Morris Fletcher, must stop a destructive virus from entering the populace."
}, {
  "imdbId" : "0106179",
  "season" : "9",
  "episodeNumber" : "16",
  "title" : "William",
  "description" : "A disfigured man attacks Doggett trying to retrieve X-Files for Mulder...but he might be Mulder himself."
}, {
  "imdbId" : "0106179",
  "season" : "9",
  "episodeNumber" : "17",
  "title" : "Release",
  "description" : "An eerily brilliant cadet from Scully's class directs Doggett to a current murder case that may have something to do with a case that went unsolved 9 years prior - the murder of Doggett's young son."
}, {
  "imdbId" : "0106179",
  "season" : "9",
  "episodeNumber" : "18",
  "title" : "Sunshine Days",
  "description" : "Reyes and Doggett investigate two murders revolving around a house that is, at some points in time, identical to the Brady Bunch house."
}, {
  "imdbId" : "0106179",
  "season" : "9",
  "episodeNumber" : "19",
  "title" : "The Truth",
  "description" : "Mulder's return leads to him being tried for murder before a military tribunal where he seeks to prove the very existence of an alien conspiracy and justify the maintenance of the X-Files."
}, {
  "imdbId" : "0106179",
  "season" : "10",
  "episodeNumber" : "1",
  "title" : "My Struggle",
  "description" : "After the collapse of their relationship, former FBI agents Fox Mulder and Dana Scully are reunited by a TV host who promotes conspiracy theories about the government and believes that alien abductions are actually false flag operations."
}, {
  "imdbId" : "0106179",
  "season" : "10",
  "episodeNumber" : "2",
  "title" : "Founder's Mutation",
  "description" : "A scientist working for the DOD commits suicide. Mulder and Scully start an investigation only to discover a secret mutation experiment."
}, {
  "imdbId" : "0106179",
  "season" : "10",
  "episodeNumber" : "3",
  "title" : "Mulder & Scully Meet the Were-Monster",
  "description" : "Mulder questions his faith in the unexplained. He attempts to gather proof of the existence of the new creature he and Scully investigate before jumping to conclusions."
}, {
  "imdbId" : "0106179",
  "season" : "10",
  "episodeNumber" : "4",
  "title" : "Home Again",
  "description" : "Scully receives bad news about her family while away on a case. Mulder finds a strange paint sample at the crime scene which leads him to the left-handed artist that created the main suspect. This brings back memories to Scully."
}, {
  "imdbId" : "0106179",
  "season" : "10",
  "episodeNumber" : "5",
  "title" : "Babylon",
  "description" : "When a terrorist ends up in a coma, a pair of younger FBI agents ask Mulder and Scully for help communicating with the man, resembling them when their adventure first began and reminding them of just how far they have come."
}, {
  "imdbId" : "0106179",
  "season" : "10",
  "episodeNumber" : "6",
  "title" : "My Struggle II",
  "description" : "Mulder and Scully uncover a shocking truth with global ramifications."
}, {
  "imdbId" : "0106179",
  "season" : "11",
  "episodeNumber" : "1",
  "title" : "My Struggle III",
  "description" : "Mulder and Scully learn that they aren't the only ones desperately searching for their long-lost son, William. The very fate of the world may depend on the outcome."
}, {
  "imdbId" : "0106179",
  "season" : "11",
  "episodeNumber" : "2",
  "title" : "This",
  "description" : "A chilling secret is revealed when an old friend reaches out to Mulder and Scully in a seemingly impossible way."
}, {
  "imdbId" : "0106179",
  "season" : "11",
  "episodeNumber" : "3",
  "title" : "Plus One",
  "description" : "Mulder and Scully investigate a case involving several deaths where the victims previously reported encountering their own doppelgangers. The clues lead to a pair of fraternal twins playing a dangerous game telepathically."
}, {
  "imdbId" : "0106179",
  "season" : "11",
  "episodeNumber" : "4",
  "title" : "The Lost Art of Forehead Sweat",
  "description" : "Exploring the idea of The Mandela Effect, in which large groups of people remember an alternate history, Mulder and Scully find out how the X-Files themselves may really have originated."
}, {
  "imdbId" : "0106179",
  "season" : "11",
  "episodeNumber" : "5",
  "title" : "Ghouli",
  "description" : "When a pair of teenage girls attack one another, each believing the other to be a monster, Mulder and Scully find that their investigation could possibly lead back to their long-lost son, William."
}, {
  "imdbId" : "0106179",
  "season" : "11",
  "episodeNumber" : "6",
  "title" : "Kitten",
  "description" : "Skinner goes AWOL when his past comes back to haunt him. As Mulder and Scully try to track him down, their growing mistrust of him reaches its apex."
}, {
  "imdbId" : "0106179",
  "season" : "11",
  "episodeNumber" : "7",
  "title" : "Rm9sbG93ZXJz",
  "description" : "In a world of ever-increasing automation and artificial intelligence, Mulder and Scully find themselves targets in a deadly game of cat and mouse."
}, {
  "imdbId" : "0106179",
  "season" : "11",
  "episodeNumber" : "8",
  "title" : "Familiar",
  "description" : "Mulder and Scully suspect that darker forces are at play as they investigate a brutal animal attack on a little boy in Connecticut."
}, {
  "imdbId" : "0106179",
  "season" : "11",
  "episodeNumber" : "9",
  "title" : "Nothing Lasts Forever",
  "description" : "While investigating human organ theft, Mulder and Scully uncover a mysterious cult consumed with macabre rituals."
}, {
  "imdbId" : "0106179",
  "season" : "11",
  "episodeNumber" : "10",
  "title" : "My Struggle IV",
  "description" : "Mulder and Scully rush to find an on-the-run William while the Cigarette Smoking Man pushes forward with his ultimate plan."
}]