[{
  "imdbId" : "4159076",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Pilot - Part 1",
  "description" : "Six strangers awake amnesic on a marooned and damaged spacecraft. Quickly however they discover their personal talents and from there struggle to understand who they are and what has happened to them."
}, {
  "imdbId" : "4159076",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Pilot - Part 2",
  "description" : "The motley crew discover a small mining colony on a planet that happens to be the target of big corporations. Discovering their identities brings each one to question who they really are."
}, {
  "imdbId" : "4159076",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Episode #1.3",
  "description" : "While en route to the nearest space station, the ship suffers another mysterious malfunction -- their FTL fails in the middle of a gamma radiation storm. This makes the crew think a saboteur may be aboard."
}, {
  "imdbId" : "4159076",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Episode #1.4",
  "description" : "The lookalike for One goes on the attack, only to reveal a disturbing truth about his doppelganger."
}, {
  "imdbId" : "4159076",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Episode #1.5",
  "description" : "While recovering a damaged ship, some of its dead crew are discovered. They were slaughtered by an animalistic attack, but what happened to the attacker?"
}, {
  "imdbId" : "4159076",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Episode #1.6",
  "description" : "5 builds a mind probe that reveals some of her hidden memories. She experiences some of 4's past and discovers why she's on the ship."
}, {
  "imdbId" : "4159076",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Episode #1.7",
  "description" : "The crew gains access to the secret room, and discovers an android and an ill woman who reveals a connection to Three."
}, {
  "imdbId" : "4159076",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Episode #1.8",
  "description" : "The crew stops at a space station to refuel and rest, but Six has a different agenda - revenge."
}, {
  "imdbId" : "4159076",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "Episode #1.9",
  "description" : "4 travels to talk with his brother about their father's murder, but it's a trap."
}, {
  "imdbId" : "4159076",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "Episode #1.10",
  "description" : "Forced to team up with another team of mercenaries the crew are assigned to steal an unknown package from a rival corporation."
}, {
  "imdbId" : "4159076",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "Episode #1.11",
  "description" : "Double crossed by the mercenaries the crew must save themselves and retake the ship before they are turned over to the Galactic Authorities."
}, {
  "imdbId" : "4159076",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "Episode #1.12",
  "description" : "The team's handler sends the crew on another mission to retrieve a scientist being held against his will."
}, {
  "imdbId" : "4159076",
  "season" : "1",
  "episodeNumber" : "13",
  "title" : "Episode #1.13",
  "description" : "Crew members are targeted and paranoia mounts as they search for the perpetrator; the person responsible for the mind-wipe makes a move."
}, {
  "imdbId" : "4159076",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "Welcome to Your New Home",
  "description" : "The crew awakens to find themselves prisoners on the Hyperion-8 Maximum Security Galactic Detention Facility."
}, {
  "imdbId" : "4159076",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "Kill Them All",
  "description" : "Imprisoned in Hyperion-8, the crew must negotiate attempted assassinations, extraditions, and behind-the-scenes machinations as they plot their escape."
}, {
  "imdbId" : "4159076",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "I've Seen the Other Side of You",
  "description" : "A computer glitch makes the crew turn against one another."
}, {
  "imdbId" : "4159076",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "We Were Family",
  "description" : "Three reconnects with his former crew; the Android finds herself in unique company."
}, {
  "imdbId" : "4159076",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "We Voted Not to Space You",
  "description" : "The Android goes undercover to help the crew track a dangerous, yet familiar, foe."
}, {
  "imdbId" : "4159076",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "We Should Have Seen This Coming",
  "description" : "Nyx's plan to make some money has an ulterior motive."
}, {
  "imdbId" : "4159076",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "She's One of Them Now",
  "description" : "The crew goes after Alicia Reynaud looking for answers."
}, {
  "imdbId" : "4159076",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "Stuff to Steal, People to Kill",
  "description" : "A Blink Drive test goes awry, propelling the Raza to a parallel reality."
}, {
  "imdbId" : "4159076",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "Going Out Fighting",
  "description" : "The crew takes a dangerous mission inside Dwarf Star Technologies in a desperate bid to save their ailing leader."
}, {
  "imdbId" : "4159076",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "Take the Shot",
  "description" : "An uploaded computer virus from an unknown source wreaks havoc with the crew, the Android and the ships main computer. The crews pasts are used against them and the Android is tested."
}, {
  "imdbId" : "4159076",
  "season" : "2",
  "episodeNumber" : "11",
  "title" : "Wish I'd Spaced You When I Had the Chance",
  "description" : "Inspector Kierken chases the crew spotted by GA while shopping on a planetary station. Three and Five are cut off and depend on each other to survive. Six is almost back to full trust and suggests an interesting perspective for the crew."
}, {
  "imdbId" : "4159076",
  "season" : "2",
  "episodeNumber" : "12",
  "title" : "Sometimes in Life You Don't Get to Choose",
  "description" : "Sometimes In Life You Don't Get to Choose"
}, {
  "imdbId" : "4159076",
  "season" : "2",
  "episodeNumber" : "13",
  "title" : "But First, We Save the Galaxy",
  "description" : "The crew of the Raza works to prevent the destruction of a space station and prevent an all out corporate war."
}, {
  "imdbId" : "4159076",
  "season" : "3",
  "episodeNumber" : "1",
  "title" : "Being Better Is So Much Harder",
  "description" : "The survivors of the EOS 7 bombing fight to stay alive and find the rest of their crew."
}, {
  "imdbId" : "4159076",
  "season" : "3",
  "episodeNumber" : "2",
  "title" : "It Doesn't Have to Be Like This",
  "description" : "Ryo Ishido is now the emperor of Zairon. Who makes an enemy of his former allies."
}, {
  "imdbId" : "4159076",
  "season" : "3",
  "episodeNumber" : "3",
  "title" : "Welcome to the Revolution",
  "description" : "After the crew receives a distress call from a former associate, they find themselves having to broker a peace deal during the midst of an uprising."
}, {
  "imdbId" : "4159076",
  "season" : "3",
  "episodeNumber" : "4",
  "title" : "All the Time in the World",
  "description" : "Unbeknownst to the rest of the crew, THREE has been trapped in a time loop, reliving the same day over and over."
}, {
  "imdbId" : "4159076",
  "season" : "3",
  "episodeNumber" : "5",
  "title" : "Give It Up, Princess",
  "description" : "The crew of the Raza track a data file across the galaxy in an attempt to strike a blow against Ferrous, and save the life of a young woman."
}, {
  "imdbId" : "4159076",
  "season" : "3",
  "episodeNumber" : "6",
  "title" : "One Last Card to Play",
  "description" : "Familiar faces from the past return, causing havoc and forcing our crew to scramble to save their already damaged reputations."
}, {
  "imdbId" : "4159076",
  "season" : "3",
  "episodeNumber" : "7",
  "title" : "Wish I Could Believe You",
  "description" : "An injured crew member is haunted by the life they left behind, unaware of the dangers lurking in the present."
}, {
  "imdbId" : "4159076",
  "season" : "3",
  "episodeNumber" : "8",
  "title" : "Hot Chocolate",
  "description" : "While providing safe transport for some allies, The Raza comes under attack from within."
}, {
  "imdbId" : "4159076",
  "season" : "3",
  "episodeNumber" : "9",
  "title" : "Isn't That a Paradox?",
  "description" : "The Blink Drive self activates and sends the crew of the Raza 600 years back in time to the friendly 21st century suburbia. They must try to fit in while searching for answers. Only the local kids become suspicious."
}, {
  "imdbId" : "4159076",
  "season" : "3",
  "episodeNumber" : "10",
  "title" : "Built, Not Born",
  "description" : "While helping the Android's friend Victor, the crew find answers about Two's past."
}, {
  "imdbId" : "4159076",
  "season" : "3",
  "episodeNumber" : "11",
  "title" : "The Dwarf Star Conspiracy",
  "description" : "One of the Android's newly discovered memories leads the crew to a suspicious Dwarf Star facility on Nova 17."
}, {
  "imdbId" : "4159076",
  "season" : "3",
  "episodeNumber" : "12",
  "title" : "My Final Gift to You",
  "description" : "Ryo invites his former crew to Zairon in a final attempt to secure the Blink Drive and his victory over Pyr."
}, {
  "imdbId" : "4159076",
  "season" : "3",
  "episodeNumber" : "13",
  "title" : "Nowhere to Go",
  "description" : "The Raza's crew discover the secret shipyard and attempt to unite Ferrous's enemies before the ships come online."
}]