[{
  "imdbId" : "0053496",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "View from the Villa",
  "description" : "The killing of a man who embezzled five million dollars of gold bullion prompts NATO agent John Drake to investigate. He questions people around Rome to find the victim's girlfriend, whom he suspects will be his best lead, but no one seems to know who nor where she is. A clue on a painting finally leads him to a country residence. It soon becomes clear others are in search of the loot,and will do anything to get it."
}, {
  "imdbId" : "0053496",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Time to Kill",
  "description" : "When a professor's murdered in broad daylight, NATO agent John Drake's enlisted to track down the assassin. He heads for a remote hunting lodge in Austria, where the suspect, Hans Vogeler, is known to visit. Things get complicated when he unwittingly finds himself handcuffed to a woman, whom he suspects of being an enemy agent, but he must to bring her along as he tracks the assassin."
}, {
  "imdbId" : "0053496",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Josetta",
  "description" : "A foreign senator is murdered in the presence of his blind relative, Josetta. Rioting ensues due to a rumor the American government was behind the killing, and NATO agent John Drake's sent in. He quickly identifies the murderer with clues provided by Josetta. However, in order to get more positive proof, he needs the criminal to make an incriminating move. Drake concocts a plan to make the assassin believe Josetta can see, in order to weaken his confidence and trick him into making a mistake."
}, {
  "imdbId" : "0053496",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "The Blue Veil",
  "description" : "Drake is senty to the Arabian desert where, psoing as a hard-drinking deadbeat, he gains access to a mine and finds the evidence he needs tto help a stranded showgirl return to England."
}, {
  "imdbId" : "0053496",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "The Lovers",
  "description" : "Drake receives a surprise telephone call from an old enemy, Miguel Torres."
}, {
  "imdbId" : "0053496",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "The Girl in Pink Pajamas",
  "description" : "A young lady is found wandering the countryside, incoherent, but she seems to know something of a planned surgery on President Varnold, the leader of a friendly country, even though it's been kept secret. The president has been is in critical condition since an assassination attempt, so security is very tight, John Drake suspects the assassin's will try again, and are planning to do something during the surgery, but what? The clue lies in the young woman with amnesia, and slowly, her memory returns, and the details of a deadly plot become clear. Will Drake be able to ..."
}, {
  "imdbId" : "0053496",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Position of Trust",
  "description" : "A corrupt Arabian government is selling opium directly to wholesalers, and secret agent John Drake hopes to halt their trade. He visits the country and strategically befriends Captain Aldrich, an Englishman and minor official at the Ministry of Health. Drake coaxes Aldrich into losing a large sum of money, then offers help in exchange for a list of opium buyers. Aldrich believes he is doing the right thing and helps Drake to the records. But while photographing the necessary information, Drake's camera is confiscated by the authorities."
}, {
  "imdbId" : "0053496",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "The Lonely Chair",
  "description" : "Patrick Laurence, a wealthy, wheelchair-bound man, has access to top-secret documents. Therefore when his daughter goes missing, Drake fears the kidnappers are after more than just money. He meets with Laurence and discovers he is planning to meet the crooks' demands. Drake knows that giving them what they want will be no guarantee of the daughter's safety, and after persuading Laurence to let him help, disguises himself as the wealthy cripple for a visit to the criminal's hideout."
}, {
  "imdbId" : "0053496",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "The Sanctuary",
  "description" : "Liamond, a rebel jailed several years ago for a bombing incident, is being released and is on his way to a new job in Scotland. Secret agent John Drake suspects Liamond's future employer, Crawford, is up to no good, and takes his place as the new employee. Drake discovers that Crawford has been running a base for Irish rebels from what appears to be a highly-guarded bird sanctuary. Things go awry when Crawford announces an old friend of Liamond's will be arriving, and John Drake, fearing his cover will be blown, takes a drastic step to salvage the mission."
}, {
  "imdbId" : "0053496",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "An Affair of State",
  "description" : "John Drake visits the tiny nation of San Pablo to investigate an apparent suicide. The victim, Winfield, was a US treasury representative with a reputation for spending lavishly on women and gambling. That reputation is debunked by, non other than, Winfield's wife, who also informs Drake that Winfield made mention of a big discovery just before disappearing. Drake is able to prove that Winfield was murdered and that the Minister of Police was complicit in his death. He takes his case to the Minister of Finance, only to discover that he too cannot be trusted."
}, {
  "imdbId" : "0053496",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "The Key",
  "description" : "Secret information has been leaking from the US embassy in Vienna. John Drake plants a fake document with one of two people who knew of the info, US agent Logan, who locks it away in a safe. When the planted info leaks out, Logan immediately becomes the prime suspect. However, it turns out that someone else has a duplicate key to the safe. Drake begins to suspect that things are not as they seem, and sets a trap for the traitor to lead him to the enemy contact."
}, {
  "imdbId" : "0053496",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "The Sisters",
  "description" : "The British suspect that \"Nadia,\" a professor seeking asylum in their country, may be an impostor. John Drake is sent to rescue her sister out of a Slavosk jail in order to test her identity. After spending some time together, each woman denies the other is her sister. It's up to Drake to determine who is telling the truth, and who is the impostor."
}, {
  "imdbId" : "0053496",
  "season" : "1",
  "episodeNumber" : "13",
  "title" : "The Prisoner",
  "description" : "After receiving a death sentence in a foreign country, American James Carpenter has spent the last five years seeking refuge in an American embassy. It is secret agent John Drake's task to get Carpenter safely out of the country. For his mission, Drake goes in search of a similar-looking man to Carpenter, and finds a perfect dead ringer in concert pianist Oscar Schumak. In order for his plan to succeed, he must convince the foreign authorities that Carpenter is really Schumak, and vice-versa; and furthermore, he must find a way to get them both safely out of the ..."
}, {
  "imdbId" : "0053496",
  "season" : "1",
  "episodeNumber" : "14",
  "title" : "The Traitor",
  "description" : "John Drake trails a foreign agent to Kashmir, hoping to discover how he is passing secret information out of the country. He discovers the agent's contact to be a woman named Louise Goddard. After paying a visit to the mountain dwelling where she and her husband live, his cover is blown, forcing events to a head quickly. Due to a health condition of Louise's husband, bringing him down from the mountain could be deadly. Drake must decide the best way to proceed."
}, {
  "imdbId" : "0053496",
  "season" : "1",
  "episodeNumber" : "15",
  "title" : "Colonel Rodriguez",
  "description" : "Colonel Rodriguez, the Chief of Police on an island nation, takes an American journalist into custody as a scapegoat for his country's problems. The journalist's wife is contacted about a letter that could incriminate Rodriguez and release her husband. John Drake sets out to get the evidence, but after several setbacks, he must bluff his way into securing the journalist's freedom."
}, {
  "imdbId" : "0053496",
  "season" : "1",
  "episodeNumber" : "16",
  "title" : "The Island",
  "description" : "Two professional assassins that John Drake is escorting to the United States force an airplane down on a desert island. Drake finds no sign of life until he meets with an old hermit. The two criminals have gotten to him first, however, and convinced him that Drake and the flight stewardess are the dangerous ones. Drake fears the hermit is in danger from the real criminals, and tries to find a way to get them back into his custody and off the island."
}, {
  "imdbId" : "0053496",
  "season" : "1",
  "episodeNumber" : "17",
  "title" : "Find and Return",
  "description" : "The British government are after a woman named Vanessa, wanted for alleged espionage. John Drake visits the foreign country where she is staying with friends and works out a plan to infiltrate her villa. However, his task becomes more difficult when he discovers that another agent working for the opposite side is also after Vanessa."
}, {
  "imdbId" : "0053496",
  "season" : "1",
  "episodeNumber" : "18",
  "title" : "The Girl Who Liked G.I.'s",
  "description" : "The death of a G.I. working on top secret projects prompts concern. Secret agent John Drake learns that the G.I. was killed shortly after seeing a German girl, and suspecting she may be behind his death, arranges a date with her. He comes under attack himself soon afterward. But Drake believes there may be more to this mystery and begins investigating a camera belonging to the dead G.I."
}, {
  "imdbId" : "0053496",
  "season" : "1",
  "episodeNumber" : "19",
  "title" : "Name, Date and Place",
  "description" : "Drake investigates a rash of killings, all linked by the way in which the victims were killed. He suspects an organization specializing in murders is behind the deaths and makes contact with them. Following their instructions, he provides the name, date, and place of an imaginary \"victim\". Drake then takes one further step in hopes of snaring the criminals - he poses as the intended target."
}, {
  "imdbId" : "0053496",
  "season" : "1",
  "episodeNumber" : "20",
  "title" : "The Vacation",
  "description" : "While on his way to a vacation, Drake recognizes a fellow airline passenger as a professional assassin. He decides to investigate, only to be mistaken for the assassin by one of the assassin's contacts. Hoping to eventually turn the case over to the police, he plays along until he receives the identity of his intended \"target\". But the more he asks around, the more he begins to wonder what is really going on."
}, {
  "imdbId" : "0053496",
  "season" : "1",
  "episodeNumber" : "21",
  "title" : "The Conspirators",
  "description" : "A British diplomat is murdered in an attempt to cover up a scandal. John Drake believes the diplomat's wife is also in danger, but when he is unable to convince her to leave her castle hideout, he insists on staying himself. Drake believes the criminals will eventually show their hand. But with a number of suspicious characters hanging around, just how or when remains an open question."
}, {
  "imdbId" : "0053496",
  "season" : "1",
  "episodeNumber" : "22",
  "title" : "The Honeymooners",
  "description" : "A local man is killed when he enters the room of newlyweds Ted and Joan Baker at a far east hotel. Mr. Baker is jailed after confessing to the crime. When Drake makes a startling discovery about the murder, he looks for a way to free Baker without the country's President losing face. But when his initial plan fails, Drake must orchestrate a jailbreak."
}, {
  "imdbId" : "0053496",
  "season" : "1",
  "episodeNumber" : "23",
  "title" : "The Gallows Tree",
  "description" : "The fingerprints of a man believed to be dead for ten years show up in a stolen car. John Drake follows a lead to northern Scotland, and finds him and his daughter working a tavern called the Gallows Tree. The man claims he is no longer involved with spying for either side. It's up to Drake to discover the truth."
}, {
  "imdbId" : "0053496",
  "season" : "1",
  "episodeNumber" : "24",
  "title" : "The Relaxed Informer",
  "description" : "John Drake intercepts a recording from an enemy agent. The voice on the recording belongs to Ruth, a translator for his government, but when Drake confronts her about the message, she claims to know nothing of it. Drake investigates her ties to a reclusive sect in hopes of finding an answer."
}, {
  "imdbId" : "0053496",
  "season" : "1",
  "episodeNumber" : "25",
  "title" : "The Brothers",
  "description" : "A mail bag with important documents is stolen by the Morelli brothers. John Drake orchestrates a jailbreak for a woman named Lita, who has ties to the brothers and can lead him to their hideout. The brothers soon agree to turn over the bag for a fee. However, they plan to kill Drake as soon as the money is theirs."
}, {
  "imdbId" : "0053496",
  "season" : "1",
  "episodeNumber" : "26",
  "title" : "The Journey Ends Halfway",
  "description" : "Numerous people have disappeared along an escape route to freedom. John Drake follows in the steps of one of the missing men, discovering that the would-be refugees are being killed during part of the journey. Drake attempts to discover who in the chain of command is responsible for the murders."
}, {
  "imdbId" : "0053496",
  "season" : "1",
  "episodeNumber" : "27",
  "title" : "Bury the Dead",
  "description" : "Drake investigates the suspicious death of a NATO agent, Tony. Drake believes Tony was murdered while investigating a group of gun smugglers, and looks to his house and fiancée for clues. Drake's investigation not only turns up the gunrunners, but a shocking surprise about Tony's fate."
}, {
  "imdbId" : "0053496",
  "season" : "1",
  "episodeNumber" : "28",
  "title" : "Sabotage",
  "description" : "After losing several planes over a politically unstable area of Southeast Asia, John Drake is called in to assist the troubled airline. He takes the role of a steward aboard one of the planes in hopes of infiltrating the organization. At first, all goes according to plan. But Drake finds himself in trouble with the group after opening a flask he was instructed not to tamper with."
}, {
  "imdbId" : "0053496",
  "season" : "1",
  "episodeNumber" : "29",
  "title" : "The Contessa",
  "description" : "A freak accident leads to the discovery of a drug smuggling ring, which leads to John Drake posing as one of the smugglers. Drake soon makes contact with a Contessa; who's husband's purported to be the one behind the operation,"
}, {
  "imdbId" : "0053496",
  "season" : "1",
  "episodeNumber" : "30",
  "title" : "The Leak",
  "description" : "Drake is sent to North Africa to investigate the frequency with which employees at an atomic energy plant are being taken ill - apparently suffering from radiation."
}, {
  "imdbId" : "0053496",
  "season" : "1",
  "episodeNumber" : "31",
  "title" : "The Trap",
  "description" : "Beth, a worker at the London Embassy, leaves for Venice without receiving permission. Fearing she, or some of her knowledge may fall into the wrong hands, John Drake follows her, and finds her, along with her fiancé and his mother, at a hotel. But when she and her fiancé's mother leave to pay their respects to a dead relative, Drake fears something's not right."
}, {
  "imdbId" : "0053496",
  "season" : "1",
  "episodeNumber" : "32",
  "title" : "The Actor",
  "description" : "A radio program in Hong Kong has been secretly transmitting military information to the Chinese mainland. John Drake takes the role of an actor at the radio station. Once he discovers how the secret messages are coded and transmitted, he attempts to root out just who at the station is involved in the operation."
}, {
  "imdbId" : "0053496",
  "season" : "1",
  "episodeNumber" : "33",
  "title" : "The Hired Assassin",
  "description" : "Drake's assigned to stop an assassination attempt, and hopefully discourage the perpetrators from any further attempts. Passing himself off as a professional, hoping the group planning the attack takes notice and hires him."
}, {
  "imdbId" : "0053496",
  "season" : "1",
  "episodeNumber" : "34",
  "title" : "The Deputy Coyannis Story",
  "description" : "Aid from the International Monetary Fund is clearly not reaching its targets in an underdeveloped country. John Drake is sent to see who in the government is getting rich from the deal while the population continues to live in poverty. The death of the populist leader's son provides the perfect opportunity for Drake to probe around unsuspected."
}, {
  "imdbId" : "0053496",
  "season" : "1",
  "episodeNumber" : "35",
  "title" : "Find and Destroy",
  "description" : "While on a holiday in Rio, John Drake is approached by British intelligence about locating and destroying a submarine that has drifted ashore nearby. Drake goes in search of the craft, but finds himself in a race against time when another group also shows interest in the crashed sub."
}, {
  "imdbId" : "0053496",
  "season" : "1",
  "episodeNumber" : "36",
  "title" : "Under the Lake",
  "description" : "Large amounts of counterfeit currency have been arriving in Switzerland from all over the world. Drake has been assigned to follow a lead suspect, Gunther Klaus, and pretends to show interest in his daughter in order to throw him off the track. However, Klaus soon begins to suspect that Drake is more than a common American tourist."
}, {
  "imdbId" : "0053496",
  "season" : "1",
  "episodeNumber" : "37",
  "title" : "The Nurse",
  "description" : "A dramatic meetng with a Scottish nurse in the heart of an Arabian desert plunges Drake into a mission to save the son and heir of an Arabian king who has been assassinated."
}, {
  "imdbId" : "0053496",
  "season" : "1",
  "episodeNumber" : "38",
  "title" : "The Dead Man Walks",
  "description" : "When all the members of a research team experimenting in tropical plant diseases are believed to have died in suspicious circumstances, Drake is sent to Kashmir where crops are being devastated by a new strain of virus."
}, {
  "imdbId" : "0053496",
  "season" : "1",
  "episodeNumber" : "39",
  "title" : "Deadline",
  "description" : "When rioting breaks out in Victoria, Africa, secret agent John Drake must pose as a gunrunner in order to meet the man behind the violence, Khano. He makes his way into Khano's confidence, and hoping to put an end to the killings, takes Khano's wife to see firsthand the devastation her husband is causing."
}]