[{
  "imdbId" : "0118480",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Children of the Gods",
  "description" : "Col. O'Neill is brought out of retirement to lead a new expedition back to Abydos, only to find an old friend, a new enemy and a far wider use of the stargate."
}, {
  "imdbId" : "0118480",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "The Enemy Within",
  "description" : "The team, now designated SG-1 (initially there will be nine exploration teams in all, more will be added later) are planning their next foray through the gate as they try to map out the variety of sites available to them and locate their missing friends. O'Neill asks that Teal'c be allowed to join his team but Gen. Hammond thinks that will be unlikely given that he is the host for a Goa'uld. Unknown to anyone, however, is that O'Neill's close friend, Maj. Charles Kawalsky, leader of SG-2, has been infected by a Goa'uld, an immature version that has not yet taken ..."
}, {
  "imdbId" : "0118480",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Emancipation",
  "description" : "While exploring a world populated by Mongol descendants, Capt. Carter is abducted as a wife of a local warlord."
}, {
  "imdbId" : "0118480",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "The Broca Divide",
  "description" : "The Stargate base is put in deadly peril when it is contaminated with a dangerous infection which causes its victims to become mindlessly animalistic brutes."
}, {
  "imdbId" : "0118480",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "The First Commandment",
  "description" : "The SG-1 team is sent after the SG-9 team that has failed to return. They find that SG-9's captain, having been treated like a god by planetary inhabitants, is drunk with power and is tyrannizing them. Can they overcome him?"
}, {
  "imdbId" : "0118480",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Cold Lazarus",
  "description" : "When Jack is injured unintentionally by a crystal alien, the alien duplicates Jack's form and out of fear of retribution tries to heal Jack. He returns to Earth in place of Jack, while Jack is still unconscious on the planet, to find the one thing he feels will accomplish this; the one thing that cannot be found again. Meanwhile, the 'real' Jack has returned and is trying to convince SGC that he is who he says he is."
}, {
  "imdbId" : "0118480",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "The Nox",
  "description" : "With the Stargate program in danger of being terminated, the team is under pressure to find technology. Visiting a planet where they believe there is a creature that possesses the secret of invisibility, they encounter Apophis and his guards. Both sides receiving mortal wounds, they are aided by the planet's inhabitants, the Nox, a gentle people with a very large secret."
}, {
  "imdbId" : "0118480",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Brief Candle",
  "description" : "On the planet Argos, Kynthia seduces Colonel O'Neil, which gives him an Argosian lifespan of only a 100 days. As his skin turns the color of death, will the SG-1 team succeed finding a cure?"
}, {
  "imdbId" : "0118480",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "Thor's Hammer",
  "description" : "SG-1 goes to the planet Cimmeria in search of allies against the Goa'uld. Upon arrival, Jack and Teal'c are trapped in a labyrinth, where the only exit is through Thor's Hammer, a device to destroy Goa'uld, but preserve the host. Daniel Jackson must destroy the device that could someday have saved his wife in order to free his friends."
}, {
  "imdbId" : "0118480",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "The Torment of Tantalus",
  "description" : "Daniel Jackson discovers that the Stargate was activated in 1945 and a young professor went through, never to return. Together with his still living fiancée, the SG1 team discover the now aged professor, naked and trapped in a decaying fortress, containing the secrets of an Ancient alliance. Will they be able to rescue him and escape to earth in time?"
}, {
  "imdbId" : "0118480",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "Bloodlines",
  "description" : "It is time for Teal'c's son Rya'c to have his primtal. Can Teal'c stop his son from being implanted with a goa'uld and becoming a slave to Apophis?"
}, {
  "imdbId" : "0118480",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "Fire and Water",
  "description" : "O'Neill, Carter and Teal'c return through the Stargate shell-shocked and distressed to announce that Daniel Jackson was killed. But Jackson was captured by the last survivor of an aquatic race, who planted false memories in the other members of SG1. Can the team remember and return to rescue Daniel?"
}, {
  "imdbId" : "0118480",
  "season" : "1",
  "episodeNumber" : "13",
  "title" : "Hathor",
  "description" : "The Goa'uld Hathor (one of the mothers of all Goa'uld), brainwashes the men of the SGC with pheromones, and nearly makes Jack a host to a larva conceived with Daniel. She flees after the unaffected women of Stargate Command retake the facility."
}, {
  "imdbId" : "0118480",
  "season" : "1",
  "episodeNumber" : "14",
  "title" : "Singularity",
  "description" : "SG-1 rescues a small girl who turns out to have had an inoperable Naquadah bomb put in her by Nirrti to destroy the SGC. Ultimately the girl is given to the care of Janet Fraiser, the SGC medic, after they discover that the bomb will dissolve if she is kept away from the Stargate."
}, {
  "imdbId" : "0118480",
  "season" : "1",
  "episodeNumber" : "15",
  "title" : "Cor-ai",
  "description" : "SG1 travel to a planet where Teal'c is recognised as once having been head Jaffa to Apophis. He is arrested for the murder of a villager and put on trial for his life. Then other Jaffa attack the village. Will SG1 be able to save Teal'c and prove that he has changed allegiance?"
}, {
  "imdbId" : "0118480",
  "season" : "1",
  "episodeNumber" : "16",
  "title" : "Enigma",
  "description" : "On their first visit to a new planet, SG-1 finds it subject to totally destructive volcanic activity and saves ten natives, the Tollan, a far more technologically advanced society. Their leader Omoc isn't grateful, nor interested in such a primitive race as the earthlings or any of the 'even more primitive' planets which are prepared to host them. Only one Tollan, Narim, shows an active interest in life on earth, especially in captain Samantha Carter and the cat Schrodinger she gives him, explaining his planet was destroyed after the Tolan supplied an unlimited energy..."
}, {
  "imdbId" : "0118480",
  "season" : "1",
  "episodeNumber" : "17",
  "title" : "Solitudes",
  "description" : "Following a Stargate technical defect, O'Neill and Carter are stranded next to a Stargate in a cave on an icy wasteland. O'Neill is severely wounded and both are freezing. Will the SGC find and rescue them in time?"
}, {
  "imdbId" : "0118480",
  "season" : "1",
  "episodeNumber" : "18",
  "title" : "Tin Man",
  "description" : "Upon arrival on planet PX3,989 the team are rendered unconscious. When they wake, they return to Earth, but soon find out that they are Androids. The team must return to the planet to find out what happened to their real bodies."
}, {
  "imdbId" : "0118480",
  "season" : "1",
  "episodeNumber" : "19",
  "title" : "There But for the Grace of God",
  "description" : "While collecting artifacts on a distant planet, Daniel Jackson is knocked out after touching a mirror-like object. He awakens in the same room but is unable to locate the other members of SG-1. Assuming that they left without him, he dials up his return home but gets there to find that he is in a different reality. In this world, General Jack O'Neill and Catherine Langford are in charge of the Stargate program; Hammond is a Colonel reporting to O'Neill; and Sam Carter is a civilian scientist working on the project (and also engaged to O'Neill). More importantly, Earth..."
}, {
  "imdbId" : "0118480",
  "season" : "1",
  "episodeNumber" : "20",
  "title" : "Politics",
  "description" : "The Stargate team must justify the project's continuation when a doubtful senator, Head of the Congressional Military Appropriations Committee, comes to review the project's performance."
}, {
  "imdbId" : "0118480",
  "season" : "1",
  "episodeNumber" : "21",
  "title" : "Within the Serpent's Grasp",
  "description" : "General Hammond has tried everything to get the senates decision to shut down his space program undone, but the president personally refuses to 'commit political suicide': the Stargate will be buried. Daniel's insistence the danger for earth as a whole outweighs everything convinces his military SG-1 colleagues to ignore the commander general's command and dial the address the goa'ald invasion started from in the parallel dimension he visited. They arrive not on a planet but a new, superior type of starship, already launched by hyper-drive. A 'video' proves it belongs..."
}, {
  "imdbId" : "0118480",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "The Serpent's Lair",
  "description" : "As the Goa'uld attack fleet approach Earth, all four members of the SG-1 team are taken prisoner. They get help from an unexpected source when Bre'tac, Teal'c's mentor, reveals that he is on board. Apophis has delayed the attack until his son Klorel is revived, giving them some time to prepare. SG-1 has used all of the C4 on one of the two ships but must find a way to dispose of the second. Back at Stargate Command, Lt. Col. Bert Samuels arrives as a Pentagon liaison officer but also reveals a new weapon they have developed. General Hammond is dubious. They begin to ..."
}, {
  "imdbId" : "0118480",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "In the Line of Duty",
  "description" : "Samantha Carter becomes the hostess of a Goa'uld when she was trying to save the life of the previous host."
}, {
  "imdbId" : "0118480",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "Prisoners",
  "description" : "SG1 inadvertently help a desperate criminal and is charged and sentenced as accessories to his crime. They are banished to a desolate, brutal penal colony and strike a deal with a powerful female prisoner to help them escape. But is this prisoner hiding something from them?"
}, {
  "imdbId" : "0118480",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "The Gamekeeper",
  "description" : "Exploring a strange and beautiful garden, SG1 comes across a dome containing a race that are connected to machines. The team are captured by the machines and rendered unconscious, but awake to find themselves reliving pivotal moments of their lives, over and over again. Then they discover it is virtual reality and a mysterious keeper appears to persuade them to try different outcomes for the moments. But can the team escape his clutches, when they don't know what is real and what is not?"
}, {
  "imdbId" : "0118480",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "Need",
  "description" : "Whilst walking through a forest on a planet, Jackson saves the life of a beautiful princess who is about to kill herself. SG1 is taken prisoner, but Daniel is freed by the ruler when he finds out that he saved his daughter. The rest of SG1 is sent to work in the mines for the rest of their lives. Jackson falls in love with the princess, but also becomes intoxicated by frequent use of a Sarcophagus. Will he come to his senses before the rest of SG1 are worked to death?"
}, {
  "imdbId" : "0118480",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "Thor's Chariot",
  "description" : "O'Neill and the team return to Cimmeria, the planet where they destroyed Thor's Hammer to help Teal'c escape. They find that the Goa'uld have invaded and many of the people are dead. Can they help to find Thor's weapons to fight off the invasion before they are all captured or killed?"
}, {
  "imdbId" : "0118480",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "Message in a Bottle",
  "description" : "SG-1 discovers an ancient artifact and brings it back to the SGC. Ariving at the SGC, it becomes active, pins O'Neill to the gate room wall, and unleashes a virus into him."
}, {
  "imdbId" : "0118480",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "Family",
  "description" : "Teal'c's son Rya'c is kidnapped by Apophis and SG1 tries to rescue him. When Rya'c is recovered he denounces his father and helps to capture the team. They escape, but will they be able to return to Earth and cure Rya'c?"
}, {
  "imdbId" : "0118480",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "Secrets",
  "description" : "Whilst O'Neill and Carter head to Washington to be decorated by the President and find a security leak, Jackson and Teal'c go to Abydos (after they unbury their stargate) to see Sha're's father. They arrive to tell him that they have been unsuccessful in finding Sha're, only to discover that she is already on Abydos. But they find that she is pregnant by Apophis and the baby holds the secrets of the Goa'uld."
}, {
  "imdbId" : "0118480",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "Bane",
  "description" : "Whilst off-world, the team is attacked by giant insects, one of which stings Teal'c on the back. The bug has actually implanted a virus that converts Teal'c into a living incubator for hundreds of more insects and Teal'c is being eaten alive. The only way to save him is to capture another venomous bug and create an antidote, but time is running out."
}, {
  "imdbId" : "0118480",
  "season" : "2",
  "episodeNumber" : "11",
  "title" : "The Tok'ra: Part 1",
  "description" : "When Teal'c makes Sam Carter realize how valuable the knowledge left by Tok'ra Jolinar in her brain and the chance for an alliance can be, they convince general Hammond to let SG-1 attempt a meeting. They arrive on a planet which is deserted on the surface, but are awaited by well-camouflaged, armed Tok'ra who bring them to tunnels which they create by means of a mysterious crystal, which can also undo them afterward. Both parties are quiet suspicious, the team feels like captives, and indeed the Tok'ra leader Yosuuf fears they cannot be released at least until the ..."
}, {
  "imdbId" : "0118480",
  "season" : "2",
  "episodeNumber" : "12",
  "title" : "The Tok'ra: Part 2",
  "description" : "The attempt to forge an alliance with the Tok'ra seems a miserable failure, as SG-1 is practically imprisoned as a security risk and considered virtually hostile because 'blending' by accepting to host a symbiont is a bridge too far for each of them. When SG-3 arrives and informs Sam about her cancer-terminal father General Jacob Carter's fast worsening condition, she realizes the symbiont's healing powers, confirmed to apply to cancer, make hosting an offer to good to refuse for him. Garshaw allows Sam and Jack to return and convince both generals to allow the plan, ..."
}, {
  "imdbId" : "0118480",
  "season" : "2",
  "episodeNumber" : "13",
  "title" : "Spirits",
  "description" : "SG-11 failed to report regularly while mining trinium, a vital mineral for earth's defense against the goa'uld. SG-1 finds them missing, all traces cease at the site of arrow-heads made from trinium. Then they are all sedated by such arrow and brought to the village of Tonané, whose earthly tribal ancestry Daniel identifies by its animal totems, however soon awake and released, even returned their guns and promised to get their friends back too from the wolf spirit T'akaya and the raven-shaped supreme spirit Xe'ls. The council of elders refuses to allow resuming the ..."
}, {
  "imdbId" : "0118480",
  "season" : "2",
  "episodeNumber" : "14",
  "title" : "Touchstone",
  "description" : "A climate control device is stolen from a planet and SG1 is accused of the theft. They have to find it and restore it before the planet freezes. Then weather on Earth starts to unexpectedly change and the team believe that the device has been stolen by rogue NID agents. Will they find it in time and how did the NID travel off world?"
}, {
  "imdbId" : "0118480",
  "season" : "2",
  "episodeNumber" : "15",
  "title" : "The Fifth Race",
  "description" : "SG1 travels to a Stargate where O'Neill looks into a strange device that downloads information into his brain. Back on Earth, he starts to speak using a strange language. Carter and Teal'c try to find a solution and become trapped on a burning hot planet, when the Stargate fails to dial out. O'Neill solves the problem by designing a solution, but then he designs a device. But for what purpose?"
}, {
  "imdbId" : "0118480",
  "season" : "2",
  "episodeNumber" : "16",
  "title" : "A Matter of Time",
  "description" : "SG10 are on a planet when one of the binary stars becomes a black hole. They try to escape by dialing Earth, but fail to get back. The SGC sends a probe and sees the black hole, but then they find they cannot disengage the wormhole and the gravitational effects are starting to effect Earth."
}, {
  "imdbId" : "0118480",
  "season" : "2",
  "episodeNumber" : "17",
  "title" : "Holiday",
  "description" : "The next planet visited by SG-1 holds an unusual surprise: the only person by its star-gate is an old, sick man, known to Teal'c as Machello, since decades a famous adversary of the goa'uld, who even developed his own technology to fight them, was captured and tortured but escaped. He joins them to earth, but Daniel, who touched his recording device, wakes up in the dying body of Machello, which is only discovered after the alien walked of, given a clean bill of health by Dr. Fraiser, in Daniel's body, determined to enjoy life as an earthling, teaming up with homeless..."
}, {
  "imdbId" : "0118480",
  "season" : "2",
  "episodeNumber" : "18",
  "title" : "Serpent's Song",
  "description" : "Following on a Tok'ra tip, SG-1 goes to a planet where they find the hated Apophis, nearly dying and under attack by death-gliders. They get back with him, realizing he was tortured by a rival system-lord, with lasting harm. Apophis demands sanctuary, provided Dr. Fraiser can save his life, at least on account of the human host, but without a sarcophagus the prognosis for his symbiont is lousy; he offers all his Goa'uld knowledge in exchange for a new host, i.e. his life, revealing he was defeated by the terrible Sokar, once supreme system lord till an alliance lead ..."
}, {
  "imdbId" : "0118480",
  "season" : "2",
  "episodeNumber" : "19",
  "title" : "One False Step",
  "description" : "While testing new technology, a UAV malfunctions and crashes on a planet. SG-1 goes to determine the cause of the malfunction, but discovers that their presence may be causing serious injury to the planet's primitive inhabitants."
}, {
  "imdbId" : "0118480",
  "season" : "2",
  "episodeNumber" : "20",
  "title" : "Show and Tell",
  "description" : "When an incoming wormhole is established at the SGC, the iris is over-ridden and opened. A young boy appears and tells the SGC that they are in terrible danger from a group of terrorists. But these terrorists are invisible creatures and they are determined to wipe out all humans to prevent them being used as hosts to the Goa'uld."
}, {
  "imdbId" : "0118480",
  "season" : "2",
  "episodeNumber" : "21",
  "title" : "1969",
  "description" : "A solar flare sends SG-1 back in time thirty years to 1969. Captured by military police at Cheyenne Mountain, they escape with the help of a young Hammond and then must find the Stargate so they can return to the present."
}, {
  "imdbId" : "0118480",
  "season" : "2",
  "episodeNumber" : "22",
  "title" : "Out of Mind",
  "description" : "When Colonel O'Neill wakes up, he is told by new staff everything in the star-base is different because he was just revived after 79 years of cryogenic hibernation, as sole survivor of a disastrous SG-1 mission on a goa'uld-ruled planet. He accepts to undergo a 'high tech hypnosis' to retrieve information of use in the present war against them which is going badly, involving earth's ten endangered colonies on other planets. However Major General Trofsky, the new base commander, and his female assistant tell Daniel and Sam, in different sections, that each of them is ..."
}, {
  "imdbId" : "0118480",
  "season" : "3",
  "episodeNumber" : "1",
  "title" : "Into the Fire",
  "description" : "O'Neill, Carter and Jackson are trapped on Hathor's planet. Teal'c and Hammond go to Chulak to forge a rescue plan and recover the team."
}, {
  "imdbId" : "0118480",
  "season" : "3",
  "episodeNumber" : "2",
  "title" : "Seth",
  "description" : "Stargate is visited by general Jacob Carter on a mission -actually requested by his symbiont Selmak, who wants him to deal with his long-repressed break-up with Sam's brother Mark- to ask SG-1's help in the hunt for the sole system-lord the Tok'Ra never tracked down, Seth, the Egyptian god of chaos and total evil, who plausibly never left earth but hides as Ra put a high price on his head. Daniel finds a plausible series of Seth-cults, each ending in a blood-bad for followers, the latest being outside Seattle, led by Seth Fargo. Jacob and SG-1 arrange to take over the..."
}, {
  "imdbId" : "0118480",
  "season" : "3",
  "episodeNumber" : "3",
  "title" : "Fair Game",
  "description" : "The Asgard and three Goa'uld System Lords meet at Stargate Command to negotiate a treaty modification, but subterfuge and treachery threaten not only the success of the negotiations, but Earth itself."
}, {
  "imdbId" : "0118480",
  "season" : "3",
  "episodeNumber" : "4",
  "title" : "Legacy",
  "description" : "When the SG-1 team discover a sealed chamber of dead Goa'ulds, Daniel Jackson is exposed to the parasites that killed them and threaten to drive him insane."
}, {
  "imdbId" : "0118480",
  "season" : "3",
  "episodeNumber" : "5",
  "title" : "Learning Curve",
  "description" : "While enjoying the help of a planet's super precocious children for a project, the team discovers their horrific imposed fate when they reach a certain age."
}, {
  "imdbId" : "0118480",
  "season" : "3",
  "episodeNumber" : "6",
  "title" : "Point of View",
  "description" : "The quantum mirror Daniel found in \"There But for the Grace of God\" brings to Area 51 an alternate Kawalsky and Dr. Carter from another reality, this time one where Sam never joined the military but became Jack's wife and the Goa'uld just overran earth. Dr. Carter begins suffering from temporal entropic cascade failure, a paradoxical effect of having two versions of the same person in the same reality and realises that she must return to her own reality or both Sams will eventually perish. SG-1 embark to the alternate reality to intercede and prevent the Goa'uld from ..."
}, {
  "imdbId" : "0118480",
  "season" : "3",
  "episodeNumber" : "7",
  "title" : "Deadman Switch",
  "description" : "While on a mission to recover a UAV, SG1 are captured by a Bounty Hunter working for evil System Lord Sokar. He tells them there is a bounty on their capture, but offers to let them go if they help him capture a Goa'uld. The Goa'uld turns out to be a Tok'Ra. Can the team persuade the Bounty Hunter to release the Tok'Ra, but prevent SG1 from being handed over to Sokar?"
}, {
  "imdbId" : "0118480",
  "season" : "3",
  "episodeNumber" : "8",
  "title" : "Demons",
  "description" : "SG-1 lands on a planet where a culturally 'medieval Catholic' community lives in fear of a demon of Unas's species, which regularly collects human sacrifices to Satan, in fact hosts for system lord Sokar's army. When Simon implores SG-1 to spare his beloved Mary and take him instead, they even nurse her chicken pox. Simon hopes they are sent by God to deliver them from the satanic burden, but the canon who rules the village as 'spiritual' leader faithful to Sokar fears his authority challenged, which rests on his right to select the 'damned soul' to be sacrificed, ..."
}, {
  "imdbId" : "0118480",
  "season" : "3",
  "episodeNumber" : "9",
  "title" : "Rules of Engagement",
  "description" : "SG1 come across another SG team being attacked by Jaffa. They offer to help but are shot by the SG team members. When they awake, they find out that the other SG team are Jaffa, loyal to Apophis, who are planning to infiltrate Earth. Can SG1 convince them that Apophis is dead before the Jaffa fight to the death?"
}, {
  "imdbId" : "0118480",
  "season" : "3",
  "episodeNumber" : "10",
  "title" : "Forever in a Day",
  "description" : "Responding to a help cry from Kasuf, SG-1 and more USAF wipe out a Goa'uld Jaffa guard to save most Abydonian slaves. When Amaunet turns her hand device on Daniel, he can't bring himself to shoot his beloved wife Sha're, but Tel'c saves him by fatally staff-shooting her; Abydononian funeral tradition squashes his hope of a sarcophagus resurrection. Crushed by grief, Daniel has apparitions by Sha're and once released from hospital resigns from SGC, claiming the quest for his wife was his reason to join; his former research assistant Dr. Robert Rothman succeeds him in ..."
}, {
  "imdbId" : "0118480",
  "season" : "3",
  "episodeNumber" : "11",
  "title" : "Past and Present",
  "description" : "The team discovers an early industrial world with suffering from collective amnesia and has no elderly people."
}, {
  "imdbId" : "0118480",
  "season" : "3",
  "episodeNumber" : "12",
  "title" : "Jolinar's Memories",
  "description" : "Martouf leads a Tok'ra delegation with crushing news for Carter: her father Jacob/Selmak has been captured by Sokar and imprisoned on Netu, an Egyptian name for hell, on a moon of planet Delmal, from where nobody returns to suffer eternal torture, only Jolinar ever escaped. SG-1 mounts a rescue operation with Martouf, top-priority being any information Selmak can offer about Sokar's plan to subjugate the other system lords, an unprecedented threat for all humanoids in the galaxy. Teal'c must pilot a goa'uld ship and keep it in orbit as landing is impossible except by ..."
}, {
  "imdbId" : "0118480",
  "season" : "3",
  "episodeNumber" : "13",
  "title" : "The Devil You Know",
  "description" : "Now Apophis has revealed himself, he promises the prisoners to overturn Sokar, which requires extracting an irresistibly valuable secret, to which end he drugs Sam with the truth serum 'blood of Sokar' and implants a memory device plus the drug to torture Jack in the persona of his dead kid son and Daniel for the location of his Harsesis son; Martouf's love for Jolinar makes him betray the Tok'ra are on planet Etnac- a convincing lie, so Apophis's plan to earn Sokar's gratitude and then kill him when rewarded with the lordship of Netu is on a shaky basis... Teal'c ..."
}, {
  "imdbId" : "0118480",
  "season" : "3",
  "episodeNumber" : "14",
  "title" : "Foothold",
  "description" : "After a vain search for Amaumet and the Harsesis boy on an unexplored planet, SG-1 is told there is a chemical leak and gets sedating injections in the infirmary. In fact star-base has been taken over by body-snatching aliens, as Teal'c and Sam discover, who are immune because of his symbiont and her Jolinar-remnants. Teal'c is captured while giving Sam the chance to escape; she meets with Colonel Harry Maybourne, who alas believes and brought the alien-possessed Jack and Daniel, who claim it's paranoia caused by the leaked chemical; during a flight back, Sam is able ..."
}, {
  "imdbId" : "0118480",
  "season" : "3",
  "episodeNumber" : "15",
  "title" : "Pretense",
  "description" : "The SG-1 team is requested by the Tollan to participate in a trial concerning Skaara and whether he has control of his body or the Goa'uld parasite, Klorel."
}, {
  "imdbId" : "0118480",
  "season" : "3",
  "episodeNumber" : "16",
  "title" : "Urgo",
  "description" : "The SG1 team embark on a trip to visit a planet with an idyllic beach, but as soon as they step through the stargate, they find they are back in the SGC. They thought that they just left, but have been missing for hours. They soon discover that an alien device has been implanted in their brains and a being called Urgo reveals himself to the team. But no one else can see him and he is extremely irritating. Will they be able to extract him before they lose their minds?"
}, {
  "imdbId" : "0118480",
  "season" : "3",
  "episodeNumber" : "17",
  "title" : "A Hundred Days",
  "description" : "After a cataclysmic meteorite bombardment, Col. Jack O'Neil finds himself stranded on a primitive planet with its stargate apparently permanently inaccessible."
}, {
  "imdbId" : "0118480",
  "season" : "3",
  "episodeNumber" : "18",
  "title" : "Shades of Grey",
  "description" : "Col. O'Neill is dismissed from the SGC for stealing alien technology, and is subsequently approached to participate in an even more covert Stargate operation."
}, {
  "imdbId" : "0118480",
  "season" : "3",
  "episodeNumber" : "19",
  "title" : "New Ground",
  "description" : "Whilst redialing old Stagate addresses, the SGC discovers that a gate that was previously buried has become uncovered. They send a probe through and find two archaeologists. However, when they travel through the Stargate, they find that it is located in a in civil war: one continent believes that the people were created by a Goa'uld, whilst their enemy believes that humans arrived from another planet - by the Stargate. O'Neill, Carter and Jackson are captured by the authorities and questioned, but Teal'c is wounded and blinded. Can he help SG-1 escape the hostiles and..."
}, {
  "imdbId" : "0118480",
  "season" : "3",
  "episodeNumber" : "20",
  "title" : "Maternal Instinct",
  "description" : "Teal'c's Master Bra'tac arrives unannounced, carrying his dying apprentice Moac, rare survivors of a massive ground attack on planet Chulack by Apophis, who now controls the late Sokar's massive armies. As he could have wiped out the Jaffa by space weapons, he must be looking for something- or someone: his consort Amaumet's Harsesis child; Daniel only knew the boy is in Osiris's hiding for Seth, Kheb, which he nor Teal'c can locate, but Bra'tac knows that is a legendary planet the Goa'uld fear and loathe, and combining with Daniel's Pharaonic mythology knowledge it ..."
}, {
  "imdbId" : "0118480",
  "season" : "3",
  "episodeNumber" : "21",
  "title" : "Crystal Skull",
  "description" : "The SGC send a MALP to a huge pyramid and inside they discover a crystal skull like the one Jackson's grandfather found many years before. SG1 visit the planet and whilst Daniel is looking into the eyes of the skull, as his grandfather did, an energy field envelops him. Teal'c fires his Zat at the skull, but Daniel has disappeared. Carter collapses and the team minus Daniel return to the SGC. Teal'c returns to collect the crystal skull, but will he be able to find Daniel?"
}, {
  "imdbId" : "0118480",
  "season" : "3",
  "episodeNumber" : "22",
  "title" : "Nemesis",
  "description" : "While taunting Carter leave means leaving to have fun, not staying behind for more research, Jack is suddenly beamed aboard the spaceship of the Asgar Thor, who explains he is dying, and his ship falling victim in the war against the Beliskner to replicators, an all-infesting kind of mechanical bugs which literally devour it to multiply, the transport and self-destruction mechanisms are now also disabled but their next target will be earth if they manage to land. Jack contacts SGC, asking advice and forbidding SG-1 to join him, but they do after the general overrules ..."
}, {
  "imdbId" : "0118480",
  "season" : "4",
  "episodeNumber" : "1",
  "title" : "Small Victories",
  "description" : "SG-1 has to deal with a Replicator infestation on a Russian sub on Earth while Major Carter advises the Asgardians about combating the menace in their space."
}, {
  "imdbId" : "0118480",
  "season" : "4",
  "episodeNumber" : "2",
  "title" : "The Other Side",
  "description" : "SGC is contacted by an advanced and embattled alien human civilization seeking military assistance, but their exact reasons for it become increasingly suspect."
}, {
  "imdbId" : "0118480",
  "season" : "4",
  "episodeNumber" : "3",
  "title" : "Upgrades",
  "description" : "The SGC is visited by Tok'Ra called Anise who brings some armbands used by the soldiers of a long extinct race, supposed to increase the abilities of the wearers. O'Neill, Carter and Jackson put the armbands on and it improves their physical strength, but it also causes them to make rash decisions. can they get the armbands off before they cause their deaths?"
}, {
  "imdbId" : "0118480",
  "season" : "4",
  "episodeNumber" : "4",
  "title" : "Crossroads",
  "description" : "An old love of Teal'C approaches the SGC and the Tok'ra claiming that her Goa'uld symbiote has been convinced to defect with their help."
}, {
  "imdbId" : "0118480",
  "season" : "4",
  "episodeNumber" : "5",
  "title" : "Divide and Conquer",
  "description" : "When an SG member tries to assassinate the Tok'Ra leader, it is believed that some of the SGC have been converted into za'tarc - programmed assassins. The Tok'Ra Anise comes to the SGC with Lantash, to try and test the SG members. But the za'tarc detector suggests that O'Neill and Carter are actually za'tarcs. Is this correct and is there another za'tarc at the SGC?"
}, {
  "imdbId" : "0118480",
  "season" : "4",
  "episodeNumber" : "6",
  "title" : "Window of Opportunity",
  "description" : "Col. O'Neill and Teal'c realize they and their friends are trapped in a time loop."
}, {
  "imdbId" : "0118480",
  "season" : "4",
  "episodeNumber" : "7",
  "title" : "Watergate",
  "description" : "The SGC learn that the Russians have a Stargate of their own and they need the Americans' help with their problems with it that are affecting them both."
}, {
  "imdbId" : "0118480",
  "season" : "4",
  "episodeNumber" : "8",
  "title" : "The First Ones",
  "description" : "Whilst on an archaeological dig at the original Goa'uld home world, Jackson is captured by a young Unas. He tries to communicate with it and slowly builds a rapport. Meanwhile, SG1 comes to the planet to find Jackson and they soon realise that some of the SG members there may have been taken over by Goa'uld. Will they be able to discover which ones in time to rescue Daniel."
}, {
  "imdbId" : "0118480",
  "season" : "4",
  "episodeNumber" : "9",
  "title" : "Scorched Earth",
  "description" : "On the Enkarans' new home, SG-1 discovers a giant spaceship is threatening the colonists as it terraforms the planet."
}, {
  "imdbId" : "0118480",
  "season" : "4",
  "episodeNumber" : "10",
  "title" : "Beneath the Surface",
  "description" : "The SG1 team awake to find they have lost their memories. They believe they are workers in an underground power station. They are told that they are helping to preserve life during an ice age. In truth they are slave labor to a huge domed city above and when Teal'c starts to recover his memory and is given another amnesia treatment he forgets his Kelnorim and starts to die. Will the others recover their memories in time to save him?"
}, {
  "imdbId" : "0118480",
  "season" : "4",
  "episodeNumber" : "11",
  "title" : "Point of No Return",
  "description" : "The SGC is contacted by a strange man called Martin, a conspiricist who believes he is an alien. The question is, how does Martin know about the Stargate and how come he has a gate address and is he being drugged by others?"
}, {
  "imdbId" : "0118480",
  "season" : "4",
  "episodeNumber" : "12",
  "title" : "Tangent",
  "description" : "While testing a new spacefighter made from Goa'uld parts, Col. Neill and T'Leac are trapped when a hidden automatic recall function takes over and sends it into space."
}, {
  "imdbId" : "0118480",
  "season" : "4",
  "episodeNumber" : "13",
  "title" : "The Curse",
  "description" : "When one of Daniel's professors dies in a lab explosion which might be related to the Goa'ulds, he comes back to Chicago to investigate what really happened."
}, {
  "imdbId" : "0118480",
  "season" : "4",
  "episodeNumber" : "14",
  "title" : "The Serpent's Venom",
  "description" : "Teal'c is on his home planet, Chulak, where there is rebellion among the Jaffa warriors. He is betrayed as a sacrilegious sholva (traitor) by Rak'nor, son of a Jaffa friend of his father, and handed to Terac, the torturer of system lord Heru'ur. Ignorant of his fate, the other SG-1 members join Jacob in a risky attempt to take hold of a space mine using a Tok'ra ship piloted by Jacob. En route to the Apophis' spaceship, the expedition finds out that Teal'c is being offered as a confidence-building present from Heru'ur to cement an alliance against the other system ..."
}, {
  "imdbId" : "0118480",
  "season" : "4",
  "episodeNumber" : "15",
  "title" : "Chain Reaction",
  "description" : "General Hammond mysteriously retires from the SGC and a new general is brought in, who breaks up SG-1: Daniel and Sam are scientists, Teal'c is with SG-3 and O'Neill commands a new SG-1. O'Neill tries to convince Gen. Hammond to return, but he finds out that someone ordered Hammond to leave or they would hurt his grandchildren. While the others are occupying the new general, O'Neill tries to find out who that \"someone\" is. Thereto he must place his trust in the one person he hates most: Maybourne."
}, {
  "imdbId" : "0118480",
  "season" : "4",
  "episodeNumber" : "16",
  "title" : "2010",
  "description" : "In 2010, Robert Kinsey is president of a brave new world since he concluded the alliance with the Aschen, a race discovered by SG-1 which lets humanity enjoy its far advanced science and technology, including a vaccine against aging. Sam is now a civilian scientist, married to ambassador Joe Faxon, whose only worry is failing to get pregnant. When she double-checks the Ashen doctor Mollem's computer with Dr. Fraser, who felt superfluous given superior medicine, they discover human fertility is down 90% worldwide in three years. Sam, Daniel and Teal'c turn to retired ..."
}, {
  "imdbId" : "0118480",
  "season" : "4",
  "episodeNumber" : "17",
  "title" : "Absolute Power",
  "description" : "When a \"chosen\" boy found on planet Abydos is brought to SGC, he sends a telepathic message, causing Daniel Jackson's personality to undergo disturbing changes. Will the rest of SG-1 be able to solve the mystery of the boy's origin before he becomes a power-hungry warmonger?"
}, {
  "imdbId" : "0118480",
  "season" : "4",
  "episodeNumber" : "18",
  "title" : "The Light",
  "description" : "SG-5's Lieutenant Barber commits suicide by jumping into the Stargate shortly after a mission on a planet where a since about 200 years abandoned Goa'uld palace is studied by Daniel, who soon develops violent mood swings and is committed to hospital with a neurotransmitter brain condition, presumed fatal after all other SG-5 members die; alas meanwhile SG-3 has visited the planet, finding only the light installation Daniel reported as particularly fascinating and human teenage boy Loran, who hid for Daniel's expedition but now tells Jack he was left there by his ..."
}, {
  "imdbId" : "0118480",
  "season" : "4",
  "episodeNumber" : "19",
  "title" : "Prodigy",
  "description" : "Carter decides to inspire a brilliant but difficult Air Force cadet by introducing her to the SGC program."
}, {
  "imdbId" : "0118480",
  "season" : "4",
  "episodeNumber" : "20",
  "title" : "Entity",
  "description" : "When the SGC probes a new planet, an alien energy entity there responds by invading the SGC's computer systems, and then Major Carter herself."
}, {
  "imdbId" : "0118480",
  "season" : "4",
  "episodeNumber" : "21",
  "title" : "Double Jeopardy",
  "description" : "On planet Juna, SG-1 minus Daniel gets a hostile welcome from the local warriors leader Darian, who seems incredulous they even dared to return. They loyally deliver Sam and Teal'c, the particularly hated sho'va (Jaffa traitor) to Cronus (who took over as system lord after SG-1 helped chase Heru'ur) and told them to bury the Stargate. Cronus orders Darian to decapitate Daniel by staff weapon- to find his head is robotic. Cronus's obvious astonishment makes Darian doubt his divinity. At SGC, Harlan urge them to go on a mission. The master robot-creator tells them that ..."
}, {
  "imdbId" : "0118480",
  "season" : "4",
  "episodeNumber" : "22",
  "title" : "Exodus",
  "description" : "SG-1 delivers their newly confiscated Goa'uld mothership to help the Tok'ra evacuate their planet and deal with their disinformed Goa'uld spy in their midst."
}, {
  "imdbId" : "0118480",
  "season" : "5",
  "episodeNumber" : "1",
  "title" : "Enemies",
  "description" : "Stranded in another galaxy while fleeing their attack on Apophis' fleet, that proves just the beginning of their problems as multiple enemies appear."
}, {
  "imdbId" : "0118480",
  "season" : "5",
  "episodeNumber" : "2",
  "title" : "Threshold",
  "description" : "To help Teal'c mind clear again, SG-1 asks Bra'tac to help. Bra'tac removes Teal'c's Gou'ald and Teal'c is forced to remember certain memories of his past. The real Teal'c in the end. SG-1 is glad to have him back."
}, {
  "imdbId" : "0118480",
  "season" : "5",
  "episodeNumber" : "3",
  "title" : "Ascension",
  "description" : "After being rendered unconscious during an expedition, Carter's subsequently ordered furlough is interrupted by a mysterious being with a message and growing affection for her."
}, {
  "imdbId" : "0118480",
  "season" : "5",
  "episodeNumber" : "4",
  "title" : "The Fifth Man",
  "description" : "When SG-1 flees from an expedition with Col. O'Neill and some mysterious team member named, Tyler, whom no one else knows about, stranded, the fitness of the team is questioned."
}, {
  "imdbId" : "0118480",
  "season" : "5",
  "episodeNumber" : "5",
  "title" : "Red Sky",
  "description" : "When SG-1 inadvertently dooms a planet upon arrival, the team must overcome Asgardian diplomacy and indigenous religious prejudice to put things right."
}, {
  "imdbId" : "0118480",
  "season" : "5",
  "episodeNumber" : "6",
  "title" : "Rite of Passage",
  "description" : "When Cassandra collapses at home, she is taken to the SGC for treatment. A retrovirus is causing her to emit an EM field and she expresses a need to return to her planet for an initiation ritual. SG-1 investigates and finds a Goa'uld laboratory, probably having belonged to Nirrti, meant for experimentation on the planet's population. They find that the ritual is part of the experiment, a time when Nirrti studies her subjects and cures them when she is done. SG-1 has found a way to cure Cassandra, but now all that remains to be found is Nirrti."
}, {
  "imdbId" : "0118480",
  "season" : "5",
  "episodeNumber" : "7",
  "title" : "Beast of Burden",
  "description" : "When Daniel's Unas friend, Chaka, is captured by another world's slavers, SG-1 goes to that world to rescue him."
}, {
  "imdbId" : "0118480",
  "season" : "5",
  "episodeNumber" : "8",
  "title" : "The Tomb",
  "description" : "SG-1 teams up with a Russian task force to investigate the disappearance of a Russian SG team on P2X-338. They discover that the Russian SG team released a creature that killed Marduk, a Goa'uld, in his sarcophagus. SG-1 must trust their Russian partners in order to escape the ziggurat alive."
}, {
  "imdbId" : "0118480",
  "season" : "5",
  "episodeNumber" : "9",
  "title" : "Between Two Fires",
  "description" : "With the death of Omac, the subsequent sudden Tollan reconsideration of their tech embargo leads to SG-1 suspecting a government conspiracy."
}, {
  "imdbId" : "0118480",
  "season" : "5",
  "episodeNumber" : "10",
  "title" : "2001",
  "description" : "SG-1 makes contact with the Aschen, unaware of that their homeworld is one they were warned previously from the future to be considered off-limits."
}, {
  "imdbId" : "0118480",
  "season" : "5",
  "episodeNumber" : "11",
  "title" : "Desperate Measures",
  "description" : "Carter gets kidnapped and taken to an abandoned hospital where two doctors work to study the remains of Jolinar. She finds out that they have a Gou-ald, taken from the Russians, and are planning to put it inside a man named Adrian Conrad, to heal his sickness. They need Carter to tell them how to get the Goa'uld out after he's healed. O'Neill believes the government is involved with Carter's disappearance and contacts Maybourne. Together, with Daniel and Teal'c, they find Carter but also find out that the Goa'uld has escaped inside Conrad's body."
}, {
  "imdbId" : "0118480",
  "season" : "5",
  "episodeNumber" : "12",
  "title" : "Wormhole X-Treme!",
  "description" : "A strange ship is headed towards Earth, and the SGC suspects that Martin Lloyd and his companions may have something to do with it. O'Neill is sent to speak to Martin and is assigned as a military consultant on Martin's new show, \"Wormhole X-treme!\", which uncannily resembles SG-1 despite Martin once again losing his memory. His former shipmates stall Carter and Daniel by throwing them off the trail and into the hands of the NID."
}, {
  "imdbId" : "0118480",
  "season" : "5",
  "episodeNumber" : "13",
  "title" : "Proving Ground",
  "description" : "While SG-1 is conducting training exercises for new recruits, Jack gets a call about a \"foothold\" situation. Wounded by compromised officers, O'Neill must lead the recruits in retaking the SGC."
}, {
  "imdbId" : "0118480",
  "season" : "5",
  "episodeNumber" : "14",
  "title" : "48 Hours",
  "description" : "When Teal'c is trapped in the Stargate buffer, the team must juggle the technical challenges along with personal, interdepartmental and diplomatic rivalries to rescue him in time."
}, {
  "imdbId" : "0118480",
  "season" : "5",
  "episodeNumber" : "15",
  "title" : "Summit",
  "description" : "In a Tok'ra plan to wipe out the Goa'uld, Daniel goes undercover as Yu's servant to release a poison at a meeting of the system lords. Meanwhile a Goa'uld attack on the Tok'ra base leaves the rest of SG-1 with their hands full."
}, {
  "imdbId" : "0118480",
  "season" : "5",
  "episodeNumber" : "16",
  "title" : "Last Stand",
  "description" : "As the Goa'uld summit continues, Daniel finds himself face to face with Osiris. He fools him in the same fashion as he did with Yu, but cannot bring himself to cause the death of Sarah, Osiris's host. He remains to uncover information about the unknown master of Osiris. Lantash, having taken Lt. Elliot as a host, guides the rest of SG-1 in escaping the fallen Tok'ra base."
}, {
  "imdbId" : "0118480",
  "season" : "5",
  "episodeNumber" : "17",
  "title" : "Fail Safe",
  "description" : "A large asteroid is discovered on a heading straight towards Earth. If it hits, all life on Earth would likely be destroyed. SG-1 initiates a plan to repair a crashed Goa'uld cargo ship and deliver a naqahdah bomb to destroy the asteroid before it hits."
}, {
  "imdbId" : "0118480",
  "season" : "5",
  "episodeNumber" : "18",
  "title" : "The Warrior",
  "description" : "A new leader has risen among the Free Jaffa, K'tano, former First Prime of Imhotep. SG-1, accompanied by Bra'tac, seeks an alliance between the Tau'ri and the large force he has amassed."
}, {
  "imdbId" : "0118480",
  "season" : "5",
  "episodeNumber" : "19",
  "title" : "Menace",
  "description" : "On an alien planet SG-1 discovers an inactive android is the only survivor of the destruction of her civilization. They bring her back to the SGC for study and manage to reactivate her. Things take a turn for the worse when she \"makes\" a replicator bug for Daniel."
}, {
  "imdbId" : "0118480",
  "season" : "5",
  "episodeNumber" : "20",
  "title" : "The Sentinel",
  "description" : "To fix a mistake caused by the fake SG team, the real SG-1 must enlist the help of two convicts. The threat of an approaching Goa'uld mothership stresses the repair of the Sentinel."
}, {
  "imdbId" : "0118480",
  "season" : "5",
  "episodeNumber" : "21",
  "title" : "Meridian",
  "description" : "As Jackson suffers from a fatal dose of radiation, he struggles with the value of his life while his friends deal with the emotional and diplomatic repercussions."
}, {
  "imdbId" : "0118480",
  "season" : "5",
  "episodeNumber" : "22",
  "title" : "Revelations",
  "description" : "Osiris engages in space combat with Thor over a violation of the protected planets treaty. Freyr arrives at the SCG bringing news of Thor's death and asking SG-1 to mount a rescue mission to retrieve an Asgard scientist from the planet in question. Upon their arrival Heimdall informs them that Thor still lives and has been taken captive by the Goa'uld. O'Neill and Teal'c transport over to the mothership to rescue him from the clutches of Anubis."
}, {
  "imdbId" : "0118480",
  "season" : "6",
  "episodeNumber" : "1",
  "title" : "Redemption: Part 1",
  "description" : "Master Bra'tac arrives with bad news: Teal'c's wife is deathly ill, and Teal'c leaves to be with her. Shortly thereafter, the gate is opened but nothing comes through. Then Carter discovers a very low power signal that is slowly building an overload powerful enough to destroy the Earth."
}, {
  "imdbId" : "0118480",
  "season" : "6",
  "episodeNumber" : "2",
  "title" : "Redemption: Part 2",
  "description" : "Anubis' weapon continues to threaten Earth. Various plans are tried until Jonas Quinn suggests something simple that just might work. Meanwhile, Master Bra'tac has discovered the planet from which Anubis is launching the attack. He, Teal'c and Rya'c journey there to put a stop to it."
}, {
  "imdbId" : "0118480",
  "season" : "6",
  "episodeNumber" : "3",
  "title" : "Descent",
  "description" : "When SGC detects an Goa'uld ship in orbit, SG-1 is dispatched with Jacob Carter to investigate. They find the ship to be abandoned with no discernible life signs and Sam determines it to be the same used to kidnap Thor. Once on board the Goa'uld vessel, they find that the crew had initiated a self destruct sequence. O'Neill would very much like to salvage the ship despite Jacob's warnings that it could be a Trojan horse. An examination of the computer core reveals that Thor may have been able to introduce a virus but Jacob was right: it's an ambush and the ship soon ..."
}, {
  "imdbId" : "0118480",
  "season" : "6",
  "episodeNumber" : "4",
  "title" : "Frozen",
  "description" : "The SG-1 team travels to the Antarctic science station when the scientists there discover an ancient body in the ice. The age of the ice core samples would indicate that the body predates mankind. As they thaw the body, it comes to life. It's a young woman who they call Ayiana. As Ayiana gains strength, those around her all fall ill having contracted an unknown virus which they believe Ayiana carried. The new arrival also shows healing powers and can seemingly cure any illness just by touch. As she does so however she weakens to the point of death. In the end, only ..."
}, {
  "imdbId" : "0118480",
  "season" : "6",
  "episodeNumber" : "5",
  "title" : "Nightwalkers",
  "description" : "After Sam receives an emergency call from geneticist Dr. Richard Fleming, SGC learns that he has been working for Immunotech a company owned by Adrian Conrad, who implanted himself with a Goa'uld symbiote in order to cure himself. Fleming has now gone missing and General Hammond orders Sam, Jonas and Teal'c to investigate. They head to Oregon when Fleming lived and worked and learn from the local Sheriff that Fleming isn't the first Immunotech worker to disappear. The locals are acting strangely and seem to suffer from memory lapses. What they eventually find is a ..."
}, {
  "imdbId" : "0118480",
  "season" : "6",
  "episodeNumber" : "6",
  "title" : "Abyss",
  "description" : "The Tok'ra Thoran arrives at SGC to advise that Col. O'Neill, who had been with the Tok'ra recovering from his illness, walked out of the Tok'ra base and now cannot be found. In fact, O'Neill is now a prisoner of the Goa'uld system lord Ba'al. While with the Tok'ra O'Neill had agreed to been implanted with a symbiote which would allow him to heal. Sam explains that that only the symbiote could have the base and O'Neill would know nothing of it. In fact, O'Neill doesn't know where he is, isn't aware of the information wants and seemingly will be tortured until he talks..."
}, {
  "imdbId" : "0118480",
  "season" : "6",
  "episodeNumber" : "7",
  "title" : "Shadow Play",
  "description" : "Stargate Command is approached by representatives of Jonas Quinn's home planet seeking military hardware. Their world is divided into three territories and there is a long history of war among them. Jonas' country fears that the other two territories are about to sign a non-aggression pact thus making them vulnerable to attack. In return for arms, they are offering an abundance of naquadria. SGC isn't about to get involved in what amounts to a civil war but there's another possible outcome when Jonas' one-time professor, Doctor Kieran, tells them of an underground ..."
}, {
  "imdbId" : "0118480",
  "season" : "6",
  "episodeNumber" : "8",
  "title" : "The Other Guys",
  "description" : "SG-1 is providing security for three scientists who are conducting research on a far-off planet. Goa'uld warlord Khonsu arranges to capture the SG-1 team and O'Neill tells Jay Felder, nominally the group's leader, to use the gate and head back to SGC. Felder is quite enamored with SG-1, admiring their exploits and daring-do. Rather than follow O'Neill's orders, Felder and another scientist, Simon Coombs, transport themselves up to the Goa'uld ship. What the scientists don't know is that SG-1's capture is a ruse to allow Khonsu, who is actually a Tok'ra, to pass on ..."
}, {
  "imdbId" : "0118480",
  "season" : "6",
  "episodeNumber" : "9",
  "title" : "Allegiance",
  "description" : "The Tok'ra are forced to evacuate their newly established base under attack from the Goa'uld. They flee to the SGC's Alpha site. Tensions rise between the allied factions, the Free Jaffa, Tau'ri, and Tok'ra. Jacob and Selmac feel the end of the Tok'ra is near and Sam finds a Naquadah generator has been sabotaged to function as a bomb. Jack suspects the recently arrived Tok'ra and attempts to weed out the traitor."
}, {
  "imdbId" : "0118480",
  "season" : "6",
  "episodeNumber" : "10",
  "title" : "Cure",
  "description" : "SG-1 makes first contact with the planet Pangera. It seems to be a peaceful world that have recently discovered ancient Goa'uld ruins. They offer Earth their greatest discovery, a drug called Tetronin, which they say keeps them entirely disease free. In return, they want the gate addresses for specific worlds, most of which turn out to be Goa'uld home worlds. An investigation further reveals that the wonder drug is based on Goa'uld symbiotes and the Pangerans reveal another secret - they have a symbiote queen, found in the ancient ruins. When a Pangeran guard is ..."
}, {
  "imdbId" : "0118480",
  "season" : "6",
  "episodeNumber" : "11",
  "title" : "Prometheus",
  "description" : "A television news crew has unearthed information about an Air Force project called \"Prometheus\". They believe it to be a generator, but know it uses Trinium, an element not found on Earth. In order to keep them quiet the Air Force allows them to film the X-303, a spaceship based on Asgard technologies, otherwise known as Prometheus. Things turn south when the news crew arm themselves and hold the Prometheus, as well as Sam and Jonas, hostage."
}, {
  "imdbId" : "0118480",
  "season" : "6",
  "episodeNumber" : "12",
  "title" : "Unnatural Selection",
  "description" : "Having regained control of the X-303, the SG-1 team finds itself in an unknown part of space. Rescue comes in the form of the Asgard, specifically Thor, who needs their help. The Asgard home world has been overrun by the Replicators and they require SG-1's help as well as the relatively low tech X-303. The Asgard had set a trap for the Replicators and hoped to use a time dilation device that would give them the time they need to find a way to defeat them. The problem is that the Replicators have turned off the device and the Asgard want SG-1 to go in and activate it. ..."
}, {
  "imdbId" : "0118480",
  "season" : "6",
  "episodeNumber" : "13",
  "title" : "Sight Unseen",
  "description" : "SG-1 brings back an Ancient device, the purpose of which is unknown. When Jonas touched it the device activated. Upon reaching the SGC Jonas sees a large red insect fly into a wall, but no one else can confirm his sighting. The SGC is put into lockdown, but nothing is found. Jonas suspects that the Ancient device is causing his hallucinations, but to his dismay it is set to be shipped to Area 51. When Teal'c and Jack see the bugs as well, General Hammond decides to let Jonas take a crack at deciphering the Ancient text on the device."
}, {
  "imdbId" : "0118480",
  "season" : "6",
  "episodeNumber" : "14",
  "title" : "Smoke & Mirrors",
  "description" : "Senator Kinsey is shot in the chest at a public event, killing him just before his party's presidential nomination. Jack is arrested for the murder, and General Hammond assigns the rest of SG-1 to uncover the truth."
}, {
  "imdbId" : "0118480",
  "season" : "6",
  "episodeNumber" : "15",
  "title" : "Paradise Lost",
  "description" : "Former Colonel Harry Maybourne comes to Jack with a proposition: Jack gets him a presidential pardon and Harry shows them the advanced weapons cache that Simmons was trying to get to. They go through with the deal, but Harry attempts to double cross SG-1. He manages to get through the portal leading to the cache, but with one unexpected item, Jack. They find themselves in a field and Harry's zat is missing. Jack, however, still has his P-90. Harry reveals that they are not at a weapons cache, but rather a utopia. He meant to live out the rest of his life there and ..."
}, {
  "imdbId" : "0118480",
  "season" : "6",
  "episodeNumber" : "16",
  "title" : "Metamorphosis",
  "description" : "The Russian SG team brings back a man who claims that his people are being experimented on by Nirrti. SG-1 investigate where the experiments are conducted, with the Russian SG team as backup. The inhabitants worship Nirrti as their god and savior from a terrible plague. SG-1 attempts to use the same device Nirrti used on the people to reverse the mutations, but the people turn on them at the arrival of Nirrti."
}, {
  "imdbId" : "0118480",
  "season" : "6",
  "episodeNumber" : "17",
  "title" : "Disclosure",
  "description" : "The US and Russia reveal Stargate Command and its operations to representatives of the other permanent members of the United Nations Security Council."
}, {
  "imdbId" : "0118480",
  "season" : "6",
  "episodeNumber" : "18",
  "title" : "Forsaken",
  "description" : "On a mission to observe a nebula, SG-1 finds a crashed ship and its three human survivors. They soon come under fire from an pair of aliens bearing the weapons of the survivors. They repel the attack, but one of the three is wounded. She is taken to the SGC for treatment while Sam attempts to repair the ship. Jack and Teal'c feel that there is more to the relationship between the aliens and these humans, and attempt to trap an alien."
}, {
  "imdbId" : "0118480",
  "season" : "6",
  "episodeNumber" : "19",
  "title" : "The Changeling",
  "description" : "Teal'c is having strange nightmares featuring Apophis in which he is human and a firefighter with the rest of his team alongside him."
}, {
  "imdbId" : "0118480",
  "season" : "6",
  "episodeNumber" : "20",
  "title" : "Memento",
  "description" : "On a shakedown cruise of the Prometheus, the ship's hyperdrive regulator becomes irreparably damaged. A nearby planet was listed on the cartouche of addresses found on Abydos and thus may have a stargate. After a short jump towards the planet, the naquadria reactor overloads and must be jettisoned. After the reactor explodes above the planet causing damage, the fate of SG-1 and the crew of the Prometheus is in the hands of a once Goa'uld-controlled world that they're off to a rough start with."
}, {
  "imdbId" : "0118480",
  "season" : "6",
  "episodeNumber" : "21",
  "title" : "Prophecy",
  "description" : "On a routine mission, SG-1 encounters a civilization desperate to be freed from the clutches of a Goa'uld. While on the planet, Jonas falls ill and is suspended from active duty. His mysterious illness is diagnosed as a brain tumor but gives him the unbelievable ability to glimpse the future, a future where O'Neill and SG-1 are walking into a trap!"
}, {
  "imdbId" : "0118480",
  "season" : "6",
  "episodeNumber" : "22",
  "title" : "Full Circle",
  "description" : "Riding in the elevator at SGC, O'Neill is visited by Daniel Jackson who needs his help. Daniel tells him that Anubis is headed for Abydos to search for something called the Eye of Ra, a relic that would make Anubis all-powerful. It's essential that SG-1 go to Abydos and secure the Eye but no has seen it - including Daniel - nor has anyone ever been able to find it. On the planet they see their old friend Skaara and with Daniel's help locate the Eye. They also find a tablet that speaks of a lost city of the ancients. When Anubis and his troops land in force there is ..."
}, {
  "imdbId" : "0118480",
  "season" : "7",
  "episodeNumber" : "1",
  "title" : "Fallen",
  "description" : "A group of nomads on an alien planet find Daniel Jackson naked in the middle of ruins and take him in. Jonas translates the tablet Daniel said was important and discovers that it describes the last city the Ancients were building before the plague. He surmises that the list of addresses Jack put into the computer while storing the Ancient data were Ancient outposts in temporal order. Thus the last of the addresses should be the \"City of the Lost\". SG-1 visits the planet and happens upon the nomadic people, now inhabiting the ruins of the Ancient city. There they find ..."
}, {
  "imdbId" : "0118480",
  "season" : "7",
  "episodeNumber" : "2",
  "title" : "Homecoming",
  "description" : "Anubis's superweapon has been put out of commission, but Yu's fleet has been diverted to the other side of the galaxy by Yu himself, allowing Anubis to escape into hyperspace. Jonas has been captured by Anubis and Daniel is still aboard Anubis's ship, evading capture. Anubis uses the mind probe on Jonas, learns of Naquadria, and begins his attack on Kelowna. The Kelownans seek aid from the SGC. Jack and Sam arrive on Langara to discover that they have given Anubis Naquadria in order to secure their safety. They communicate with Daniel who is attempting to free Jonas. ..."
}, {
  "imdbId" : "0118480",
  "season" : "7",
  "episodeNumber" : "3",
  "title" : "Fragile Balance",
  "description" : "A teenage boy shows up at the SGC claiming to be Jack O'Neill. He recalls a dream in which an Asgard was studying him. They determine that they must find this Asgard to fix what has been done to Jack."
}, {
  "imdbId" : "0118480",
  "season" : "7",
  "episodeNumber" : "4",
  "title" : "Orpheus",
  "description" : "In a firefight with Jaffa, Teal'c takes a staff blast to the gut. Without his symbiote, he cannot regenerate as he once did. Daniel feels that he cannot remember something important, so he goes searching through the logs for any sign of his lost knowledge. Teal'c expresses his feelings that the Tritonin has made him weak."
}, {
  "imdbId" : "0118480",
  "season" : "7",
  "episodeNumber" : "5",
  "title" : "Revisions",
  "description" : "SG-1 investigate a seemingly idyllic and subtly advanced human colony sheltered inside an energy dome on an otherwise inhospitable planet."
}, {
  "imdbId" : "0118480",
  "season" : "7",
  "episodeNumber" : "6",
  "title" : "Lifeboat",
  "description" : "While exploring an crashed alien ship full of passengers in cryostasis, an alien force has downloaded a number of their consciousnesses into Daniel."
}, {
  "imdbId" : "0118480",
  "season" : "7",
  "episodeNumber" : "7",
  "title" : "Enemy Mine",
  "description" : "When a SG geological exploration mission runs into deadly conflict with an indigenous Unas clan, Daniel gets Chaka to help seek an accord with it."
}, {
  "imdbId" : "0118480",
  "season" : "7",
  "episodeNumber" : "8",
  "title" : "Space Race",
  "description" : "In exchange for new tech for the SGC, Warrick Finn asks for their help to win a dangerous spaceship competition."
}, {
  "imdbId" : "0118480",
  "season" : "7",
  "episodeNumber" : "9",
  "title" : "Avenger 2.0",
  "description" : "To save his job, Dr. Felger tests a new virus on the Stargate Network to help control it and it ends up disabling it instead."
}, {
  "imdbId" : "0118480",
  "season" : "7",
  "episodeNumber" : "10",
  "title" : "Birthright",
  "description" : "After being saved by a group of free female Jaffa, SG-1 is taken to the females' homeworld to meet their leader, Ishta. Ishta proposes an alliance between her all-female rebel group, Haktil, and the Tau'ri. The Tau'ri offer her Tritonin to supplant their practice of taking the symbiotes from defeated Jaffa in the service of the Goa'uld. However, since Tritonin has only had two test subjects, Teal'c and Bra'tac, they are cautious to spread it among their ranks."
}, {
  "imdbId" : "0118480",
  "season" : "7",
  "episodeNumber" : "11",
  "title" : "Evolution: Part 1",
  "description" : "Bra'tac and Teal'c encounter a heavily armed enemy with shielding protecting him from Goa'uld weaponry who took out two Goa'uld's personal guards. They barely manage to defeat him and bring him back to SGC for study, but this new threat poses a greater problem for the Tau'ri."
}, {
  "imdbId" : "0118480",
  "season" : "7",
  "episodeNumber" : "12",
  "title" : "Evolution: Part 2",
  "description" : "The Tau'ri and Tok'ra have used their captured super-soldier to determine his planet of origin. Though with Daniel, Dr. Lee, and the Ancient device they found in the hands of Honduran kidnappers, SGC must find a way to retrieve them if they are to have any chance of defeating the newly encountered super- soldiers."
}, {
  "imdbId" : "0118480",
  "season" : "7",
  "episodeNumber" : "13",
  "title" : "Grace",
  "description" : "During an engine cool down break from hyperspace travel the crew of the Prometheus, with Major Carter as an advisor, encounter a space craft of unknown configuration. They hail the ship to no avail; the unknown craft opens fire upon the Prometheus. Carter attempts to override the safety protocols on the hyperdrive to make a short jump into a gas cloud, but in the attempt is knocked unconscious. She awakes to find the ship devoid of all its crew and, as she tries to escape the gas cloud by herself, she begins to hallucinate."
}, {
  "imdbId" : "0118480",
  "season" : "7",
  "episodeNumber" : "14",
  "title" : "Fallout",
  "description" : "Jonas Quinn returns to SGC to ask for assistance in saving his nation. He explains that the Naquadriah was originally Naquadah and a Goa'uld started a chain reaction to transform all of his planet's Naquadah into Naquadriah. A large vein of Naquadah has just been affected and the Kelownan scientists believe that the transformation will cause this large a deposit to explode, taking their entire nation with it."
}, {
  "imdbId" : "0118480",
  "season" : "7",
  "episodeNumber" : "15",
  "title" : "Chimera",
  "description" : "Maj. Carter has been set up with her brother Mark's friend Pete Shanahan, a cop from Denver who thinks Carter works for the Air Force in a simple research capacity. Daniel Jackson is being visited in his dreams by his former lover, Sarah Gardner, who was possessed by the Goa'uld system lord Osiris."
}, {
  "imdbId" : "0118480",
  "season" : "7",
  "episodeNumber" : "16",
  "title" : "Death Knell",
  "description" : "At the new Alpha site, Sam Carter and Selmak (the symbiote carried by Jacob Carter, her father) are working on a new weapon to defeat the Anubis superdrones when the the planet is attacked by a fleet of Goa'uld ships. Carter escapes with the prototype weapon before the base auto-destruct is activated but finds herself being pursued by a superdrone."
}, {
  "imdbId" : "0118480",
  "season" : "7",
  "episodeNumber" : "17",
  "title" : "Heroes: Part 1",
  "description" : "The president has asked a documentarian to SGC to create a film about its operations. His arrival is unwelcome to most and he begins to clash with the base personnel. Nevertheless, he conducts his interviews with SG-1 and the scientists in the employ of SGC. Meanwhile, an off-world SG team finds the remains of an Ancient city."
}, {
  "imdbId" : "0118480",
  "season" : "7",
  "episodeNumber" : "18",
  "title" : "Heroes: Part 2",
  "description" : "The documentarian still a thorn in their side, SGC encounters an unforeseen predicament. With half of SG-13 off-world engaging enemy Jaffa, SG teams 1, 5, and 7 go in as backup. In the midst of heavy fire, O'Neill takes a staff blast to the chest. Many deaths from the encounter hit SGC hard and Senator Kinsey orders a full investigation into the matter."
}, {
  "imdbId" : "0118480",
  "season" : "7",
  "episodeNumber" : "19",
  "title" : "Resurrection",
  "description" : "Agent Barrett of the NID calls SG-1 to Los Angeles for a consult on a mass murdering of a rogue sleeper cell by a young woman. There they find many Goa'uld artifacts relating to Sekhmet, a subordinate of Ra. But how this operation is related to the Goa'uld eludes SG-1."
}, {
  "imdbId" : "0118480",
  "season" : "7",
  "episodeNumber" : "20",
  "title" : "Inauguration",
  "description" : "The newly inaugurated President of the United States is briefed by the Head of the Joint Chiefs of Staff on the Stargate program. Former Senator, now Vice President, Kinsey attempts to get his running mate to back his policies for the program, but the president decides to look into the situation himself. Kinsey gets Richard Woolsey to convince the president of his agenda."
}, {
  "imdbId" : "0118480",
  "season" : "7",
  "episodeNumber" : "21",
  "title" : "Lost City: Part 1",
  "description" : "Vice President Kinsey briefs Dr. Weir on the Stargate program before her meeting with the president. SG teams 1, 3, and 5 go off-world to attempt the extraction of a newly found Ancient repository device. Upon arriving at the location of the device, SG-1 comes under fire from Goa'uld ships. With no other way to disallow Anubis from claiming the knowledge for himself, Jack submits himself to the dangerous device."
}, {
  "imdbId" : "0118480",
  "season" : "7",
  "episodeNumber" : "22",
  "title" : "Lost City: Part 2",
  "description" : "With Jack having the knowledge of the Ancient repository once again in his mind, he and Daniel attempt to unearth the location of the lost city of the Ancients. Bra'tac, bringing with him the news of an impending attack on the Tau'ri by Anubis, takes Teal'c to help him acquire ships and warriors for the defense of Earth. Dr. Weir attempts to cope with the overwhelming nature of her new job, while also dealing with the unrelenting ego of Vice President Kinsey."
}, {
  "imdbId" : "0118480",
  "season" : "8",
  "episodeNumber" : "1",
  "title" : "New Order: Part 1",
  "description" : "In a last ditch effort, O'Neill activated an Ancient weapon in the Antarctic to defeat Anubis. With Jack still in stasis in the Ancient outpost buried in Antarctica, SG-1 tries to contact the Asgard. Meanwhile their new leader, Dr. Elizabeth Weir, tries to decide what to do about a request for peace talks from the Goa'uld System Lords."
}, {
  "imdbId" : "0118480",
  "season" : "8",
  "episodeNumber" : "2",
  "title" : "New Order: Part 2",
  "description" : "The Asgard fleet has managed to destroy the Replicator ship, with Carter aboard, but cannot contain the debris. Talks break down with the System Lords, ending in a Ha'tak being dispatched to test Earth's new defensive capabilities. The Prometheus waits to engage the incoming enemy, but Thor arrives in the Daniel Jackson, with Teal'c aboard. They enlist the help of Daniel and Jack, still in stasis, to remove the threat of the replicators to the new Asgard homeworld."
}, {
  "imdbId" : "0118480",
  "season" : "8",
  "episodeNumber" : "3",
  "title" : "Lockdown",
  "description" : "General O'Neill is still in the early days of commanding the SGC and faces a major problem when newly arrived Russian Col. Alexi Vaselov collapses in his quarters. Dr. Brightman's belief that Vaselof may be contagious seems correct when Daniel, who was with the Russian when he collapsed, apparently goes mad and tries to leave the base through the gate. O'Neill locks down the SGC but the problem isn't contagion: the essence of Anubis is alive and well and seeking a new host."
}, {
  "imdbId" : "0118480",
  "season" : "8",
  "episodeNumber" : "4",
  "title" : "Zero Hour",
  "description" : "As the new head of the SGC, General O'Neill is beginning to feel the weight of his load, and he starts to have second thoughts about the whole idea, questioning his own competency."
}, {
  "imdbId" : "0118480",
  "season" : "8",
  "episodeNumber" : "5",
  "title" : "Icon",
  "description" : "The discovery of the Stargate creates a war between two nations on the planet Tegalus with Daniel in the middle of it."
}, {
  "imdbId" : "0118480",
  "season" : "8",
  "episodeNumber" : "6",
  "title" : "Avatar",
  "description" : "Dr. Lee is adapting a virtual reality chair for use as a training device. Teal'c thinks its current scenario is all too easy and agrees to work with them to make it more realistic. He enters the game scenario and is quickly \"killed\" at which point the chair shocks him. Lee says it must be part of its basic construct. As the scenario resets - it's an invasion of SGC by Goa'uld - Teal'c is repeatedly killed and shocked putting him in danger. The computer program is set up to learn after each scenario and the challenge for Teal'c increases at every turn. Daniel ..."
}, {
  "imdbId" : "0118480",
  "season" : "8",
  "episodeNumber" : "7",
  "title" : "Affinity",
  "description" : "Having obtained permission to live off the base, Teal'c rents an apartment telling neighbors that he has recently arrived from Mozambique. He's under orders to keep a low profile but can't seem to help himself when it comes to helping his neighbors. He helps one of who is about to be assaulted by three thugs but it's his next door neighbor who seems to need assistance. Krista is having problems with her boyfriend Doug. Teal'c soon realizes that he is beating her and warns him that should he hurt her, Teal'c will kill him. It all becomes very difficult when Doug is ..."
}, {
  "imdbId" : "0118480",
  "season" : "8",
  "episodeNumber" : "8",
  "title" : "Covenant",
  "description" : "Owner and CEO of Colson Industries declares in a press conference that there is alien life and that he has proof. SGC fails in its attempts to keep him quiet on the battle over the Antarctic. However, they are greatly surprised when the proof he shows the media are not his satellite images, but a living Asgard."
}, {
  "imdbId" : "0118480",
  "season" : "8",
  "episodeNumber" : "9",
  "title" : "Sacrifices",
  "description" : "Teal'c is unhappy with his son's plans to marry. Ishta arrives bringing news that Hak'tyl may be compromised. Complications arise when O'Neill allows Hak'tyl to inhabit SGC until a new homeworld is found for them."
}, {
  "imdbId" : "0118480",
  "season" : "8",
  "episodeNumber" : "10",
  "title" : "Endgame",
  "description" : "When the Stargate gets beamed out of SGC in the middle of the night, Teal'c is stranded off-world. Dr. Jackson and Colonel Carter attempt to recover the gate."
}, {
  "imdbId" : "0118480",
  "season" : "8",
  "episodeNumber" : "11",
  "title" : "Gemini",
  "description" : "The replicator Carter and the real Carter work together with the disruptor signal. The replicator has a different plan."
}, {
  "imdbId" : "0118480",
  "season" : "8",
  "episodeNumber" : "12",
  "title" : "Prometheus Unbound",
  "description" : "General Hammond returns to SGC to take Dr. Jackson with him on a trip to Atlantis onboard the Prometheus. In the middle of their trip, the Prometheus picks up a distress signal and Hammond decides to investigate. Things get sticky when a Kull Warrior takes control of the Prometheus, leaving Hammond and his crew, minus Daniel Jackson, behind in a damaged Alkesh."
}, {
  "imdbId" : "0118480",
  "season" : "8",
  "episodeNumber" : "13",
  "title" : "It's Good to Be King",
  "description" : "SG-1 is sent to warn Harry Maybourne that the goa'uld System Lord Ares is coming to the planet where he was banished, and in the process they find what may be an Ancient time machine."
}, {
  "imdbId" : "0118480",
  "season" : "8",
  "episodeNumber" : "14",
  "title" : "Full Alert",
  "description" : "Ex-Vice President Kinsey comes to Jack informing him of the Trust's activities including what seems to be a plan for the Russians to reclaim the Stargate they lent to the United States. He decides to use Kinsey as their inside man with the Trust. Kinsey wears a wire for his meeting with the Trust to set up a meeting with a high-ranking Russian general. The plan goes south when the signals get jammed just as the Trust makes an astounding revelation to Kinsey and they beam out."
}, {
  "imdbId" : "0118480",
  "season" : "8",
  "episodeNumber" : "15",
  "title" : "Citizen Joe",
  "description" : "A man breaks into Jack's house and hold him at gunpoint claiming that Jack ruined his life. Seven years ago he came upon an Ancient artifact at a garage sale that allows him to see all of SG-1's missions."
}, {
  "imdbId" : "0118480",
  "season" : "8",
  "episodeNumber" : "16",
  "title" : "Reckoning: Part 1",
  "description" : "After a long absence Jacob Carter returns to the SGC to tell Jack that the galaxy is under threat of takeover by the Replicators. The Goa'uld are under attack from the Replicators and are quickly being eliminated. Baal's armies are being destroyed and he arrives at SGC to suggest they work together to defeat their common enemy. Carter's doppelganger, RepliCarter, is leading the attack and she has kidnapped Daniel Jackson in the hope of learning of any weapons the Ancients may have created that could defeat them. Carter gets help from an unexpected source - the Ancient..."
}, {
  "imdbId" : "0118480",
  "season" : "8",
  "episodeNumber" : "17",
  "title" : "Reckoning: Part 2",
  "description" : "All galactic forces are focusing on the planet Dakara where there may be an Ancient device that could stop the Replicators. Sam and her father Jacob are already there trying to enter the room where they hope to find the weapon. When they do find it they get help from an unexpected corner. Baal has taken to visiting O'Neill - via a holographic image - urging him to join forces with the Goa'uld to destroy the Replicators. Teal'c and Master Bra'tac meanwhile have joined the other members of the free Jaffa for what may be their final attack against the Goa'uld. As for ..."
}, {
  "imdbId" : "0118480",
  "season" : "8",
  "episodeNumber" : "18",
  "title" : "Threads",
  "description" : "Daniel finds himself in a strange time and place - a diner where Oma is working as a waitress. She gives him a clear choice - he can choose to die or to ascend but if it's the latter, he will not be able to help his friends fight Anubis, who has yet to be disposed of. He strikes up a conversation with another patron, Jim, who has his own take on the situation. Sam meanwhile decides the time has come for her fiancé to meet her father Jacob. Jacob is not well however, something he has kept from Sam for several weeks. After Pete surprises her - he thinks he's found the ..."
}, {
  "imdbId" : "0118480",
  "season" : "8",
  "episodeNumber" : "19",
  "title" : "Moebius: Part 1",
  "description" : "With the threats of both the Replicators and the Goa'uld greatly diminished and the sister ship to the Prometheus, the Deadalus, now under construction, SG-1 is anxious to get a ride on the new ship. However, the mood is somewhat darkened by a phone call informing Dr. Jackson of Catherine Langford's death. After the funeral, Catherine's niece gives Daniel \"a few odds and ends\" that her aunt wanted him to have. Upon delivery it is discovered that almost her entire collection was shipped to Daniel's lab. He finds in one of her books a possible location of a ZPM, but ..."
}, {
  "imdbId" : "0118480",
  "season" : "8",
  "episodeNumber" : "20",
  "title" : "Moebius: Part 2",
  "description" : "SG-1 has changed the course of history and made SGC virtually non-existent. Doctors Carter and Jackson have helped Brigadier General Hammond to find the Antarctic Stargate, but are not being allowed to help any further. They help Jack to power up the time machine, and he gets Hammond to allow them on the mission to find Teal'c."
}, {
  "imdbId" : "0118480",
  "season" : "9",
  "episodeNumber" : "1",
  "title" : "Avalon: Part 1",
  "description" : "With a new commander of the SGC comes a new leader of SG-1, Lt. Col. Cameron Mitchell, a former fighter pilot who flew an F-302 in the battle over Antarctica. However, he is deterred by the fact that all the other members of SG-1 are leaving for other ventures: Teal'c to manage the Jaffa Nation, Carter to Area 51 for alien R&D, and Dr. Jackson to Atlantis as an Ancient expert. Mitchell endeavors to keep the members of SG-1 for himself, but they are increasingly tough to convince."
}, {
  "imdbId" : "0118480",
  "season" : "9",
  "episodeNumber" : "2",
  "title" : "Avalon: Part 2",
  "description" : "Upon finding Merlin's testing grounds, Dr. Jackson, Teal'c, Col. Mitchell, and Vala uncover the hidden treasure including a book that tells the story of the Ancients coming to Earth from another galaxy and a strange alien device."
}, {
  "imdbId" : "0118480",
  "season" : "9",
  "episodeNumber" : "3",
  "title" : "Origin",
  "description" : "Daniel and Vala have used the Ancient device to inhabit the bodies of people in the Alterans' home galaxy. They have been taken by a prior of the Ori to meet the Doyen, one who speaks with the Ori, their gods. Daniel surmises that the Ori are what the Alterans who became the Ancients left behind and have ascended in a similar fashion, but without the restrictions."
}, {
  "imdbId" : "0118480",
  "season" : "9",
  "episodeNumber" : "4",
  "title" : "The Ties That Bind",
  "description" : "Vala returns to SGC upon having been separated from Daniel for a little under an hour. The effects of the bracelets have not diminished even though they have been removed. In order to get the effects reversed, Mitchell, Jackson, and Vala must deal with many people that Vala has used over the years to gain favors."
}, {
  "imdbId" : "0118480",
  "season" : "9",
  "episodeNumber" : "5",
  "title" : "The Powers That Be",
  "description" : "Vala leads SG-1 to a planet where the priors have visited with a plan to keep them from worshiping the Ori. Once there she reveals that the symbiote that once held her ruled over this planet. She feels that keeping them in allegiance to her will hinder the spread of Origin to this world."
}, {
  "imdbId" : "0118480",
  "season" : "9",
  "episodeNumber" : "6",
  "title" : "Beachhead",
  "description" : "A prior of the Ori has established an ever-growing forcefield on a Jaffa-controlled planet. A minor Goa'uld, but also the one who engineered the multiple gate connections required for the defeat of the Replicators, comes to the SGC with information on the event and offers his help."
}, {
  "imdbId" : "0118480",
  "season" : "9",
  "episodeNumber" : "7",
  "title" : "Ex Deus Machina",
  "description" : "Following the death of a Jaffa on Earth and the disappearance of a prominent businessman, SG-1 starts an investigation into what remains of the Trust and into the actions of the Jaffa Nation. They discover that Baal is hiding on Earth after losing his forces to the Jaffa and that the Jaffa are secretly attempting his capture."
}, {
  "imdbId" : "0118480",
  "season" : "9",
  "episodeNumber" : "8",
  "title" : "Babylon",
  "description" : "SG-1 investigates a planet that is said to be the home of the Warriors of Sodan, a legendary tribe of Jaffa said to have not served the Goa'uld in hundreds of years. In an encounter with the warriors, Mitchell deals a deadly blow to one of the Sodan and is captured and taken to their village. There he awaits a battle to the death as punishment for his crime."
}, {
  "imdbId" : "0118480",
  "season" : "9",
  "episodeNumber" : "9",
  "title" : "Prototype",
  "description" : "In an attempt to observe what may be an undiscovered black hole, Carter is sent to the wrong planet. She returns with this information and begins diagnostics on the dialing computer. When they find that nothing is wrong on their end, Carter theorizes that the gate is keeping people out by redirecting them to a random planet. She cracks the code keeping them out and SG-1 goes to investigate the planet."
}, {
  "imdbId" : "0118480",
  "season" : "9",
  "episodeNumber" : "10",
  "title" : "The Fourth Horseman: Part 1",
  "description" : "A prior has convinced Gerak, leader of the Jaffa Nation, into following Origin. He is attempting to make Origin a state religion for the Jaffa. Teal'c and Bra'tac attempt to make a case against the Ori, but to no avail. Meanwhile, a \"prior plague\" has breached SGC and spread to the rest of Colorado."
}, {
  "imdbId" : "0118480",
  "season" : "9",
  "episodeNumber" : "11",
  "title" : "The Fourth Horseman: Part 2",
  "description" : "The plague continues to spread among the US population and the President has quarantined the nation. Teal'c is pleading with the Jaffa High Council to reject Origin, but Gerak arrives, having been transformed by the Ori into a prior. Cameron and Daniel seek the blood of the prior that caused the plague in order to cure it, but have once again been captured by the Sodan."
}, {
  "imdbId" : "0118480",
  "season" : "9",
  "episodeNumber" : "12",
  "title" : "Collateral Damage",
  "description" : "On another planet, Mitchell is placed under arrest for the murder of a scientist."
}, {
  "imdbId" : "0118480",
  "season" : "9",
  "episodeNumber" : "13",
  "title" : "Ripple Effect",
  "description" : "SG-1 returns early from a mission only to realize that they and Gen. Landry aren't on the same page as far as the the mission they've just completed is concerned. The confusion is quickly resolved when the \"real\" SG-1 returns at the correct time. Dr. Lam examines them all and concludes that they are identical and thinks they might be clones. Sam however thinks they may have come from a parallel universe as the result of the black hole they created when they destroyed the Ori beachhead. As more SG-1 teams arrive from other alternate universes, one of them includes Dr. ..."
}, {
  "imdbId" : "0118480",
  "season" : "9",
  "episodeNumber" : "14",
  "title" : "Stronghold",
  "description" : "Leader of the Hak'tyl and their representative on the Jaffa High Council, Ka'lel has fallen in with those who work against a democratic Jaffa nation. Things worsen when she incapacitates and turns a well-spoken brother Jaffa who promoted democracy. Bra'tac comes to Hayes and SG-1 for help in finding a now missing Teal'c and uncovering the shadowy dealings in the Jaffa High Council. On Earth, Mitchell gets an old friend of his into a hospital where alien-based technology is used; hopefully, the advances they have made will be able to cure what ails him."
}, {
  "imdbId" : "0118480",
  "season" : "9",
  "episodeNumber" : "15",
  "title" : "Ethon",
  "description" : "A contact within the Rand Protectorate comes to Earth with news that the Ori have given his people a superweapon to use against the Caledonian Federation in exchange for their conversion to Origin. SG-1 plans to turn the people from their newfound religion and destroy the superweapon."
}, {
  "imdbId" : "0118480",
  "season" : "9",
  "episodeNumber" : "16",
  "title" : "Off the Grid",
  "description" : "While investigating the source of an addictive corn-like crop, SG-1 becomes involved in a firefight. They are forced to fall back to the gate, but as Daniel is dialing both the Stargate and the DHD are beamed away."
}, {
  "imdbId" : "0118480",
  "season" : "9",
  "episodeNumber" : "17",
  "title" : "The Scourge",
  "description" : "SG-1 is tasked to accompany members of the International Oversight Advisory, including Richard Woolsey, on a tour of the Gamma site. The visitors are suitably impressed but everyone is put in danger when a carnivorous insect escapes from the lab. The base is locked down and no one is allowed to travel through the gate. The bug is linked to the Ori - it's appeared on several planets that they've visited - and Daniel thinks it may be their follow-up to the virus. SG-1 and the IOA visitors take refuge in a cave but Gen. Landrey is left with little choice but to flood the..."
}, {
  "imdbId" : "0118480",
  "season" : "9",
  "episodeNumber" : "18",
  "title" : "Arthur's Mantle",
  "description" : "Sam manages to activate an Ancients' device they found at the Glastonbury site and she and Mitchell are shifted into a phase that makes them invisible to everyone. Daniel soon figures out just what is going on but Dr. Lee's proposed solution sends Daniel to the same plane as Sam and Mitchell. There he is able to translate information explaining that Merlin had created a weapon against the Ori - and provides a gate address where it can be found. Meanwhile, Teal'c travels to a Jaffa planet that has sent out a distress call. The two events are related."
}, {
  "imdbId" : "0118480",
  "season" : "9",
  "episodeNumber" : "19",
  "title" : "Crusade",
  "description" : "Using the Ancients communication technology Vala, who is in the Ori galaxy, contacts the SGC. She tells them that after being sucked into the wormhole she awoke in a bed in a village much like the one she and Daniel had visited when they used the communication stones. The locals think she fell from the sky - a gift from the gods - and befriends the gentle Tomin, a devout follower of the Ori who has a bad leg. Vala has two pieces of information for the SGC: first, she is pregnant though insists that she didn't have sex with anyone; and second, the Ori have been ..."
}, {
  "imdbId" : "0118480",
  "season" : "9",
  "episodeNumber" : "20",
  "title" : "Camelot",
  "description" : "Based on the information Vala gave them, SG-1 travels to the planet where Merlin may have hidden his secret weapon to defeat ascended beings. There they find an appropriately medieval village and learn that Merlin kept a library there. The locals have never been inside owing to a curse that on anyone who dares enter but SG-1 finds a way in. Once inside, they find a secret chamber that may reveal the location of the weapon. SGC meanwhile have located the Ori's supergate. Sam's attempt to get control of it is too late and four Ori make their way through. In the ensuing ..."
}, {
  "imdbId" : "0118480",
  "season" : "10",
  "episodeNumber" : "1",
  "title" : "Flesh and Blood",
  "description" : "As the Ori invasion continues, Vala and Daniel must deal with their leader, Vala's young daughter, who is rapidly aged by the Ori to serve their purposes."
}, {
  "imdbId" : "0118480",
  "season" : "10",
  "episodeNumber" : "2",
  "title" : "Morpheus",
  "description" : "The team goes off-world and ends up in serious trouble. Meanwhile, Landry is faced with having to decide whether or not Vala can be trusted to remain at the SGC."
}, {
  "imdbId" : "0118480",
  "season" : "10",
  "episodeNumber" : "3",
  "title" : "The Pegasus Project",
  "description" : "While Daniel and Vala search for Merlin's anti-Ori weapon in Atlantis' library, Mitchell, McKay and Carter try to to dial the Ori Supergate in the Milky Way."
}, {
  "imdbId" : "0118480",
  "season" : "10",
  "episodeNumber" : "4",
  "title" : "Insiders",
  "description" : "The SGC-base is approached by an al-kesh glider which lets itself be taken down, so they can capture Ba'al, who offers to exchange the necessary information to find Merlin's weapon for human help to eliminate his clones, which want to kill him. They mistrust his story, as does NIS-agent Malcolm Barrett, who however fails to take over the investigation. Since the captive might actually be a clone, several missions to different planets retrieve and capture all clones, but which is the real Ba'al, and what are his true intentions?"
}, {
  "imdbId" : "0118480",
  "season" : "10",
  "episodeNumber" : "5",
  "title" : "Uninvited",
  "description" : "A mysterious creature targets members of Stargate Command one by one."
}, {
  "imdbId" : "0118480",
  "season" : "10",
  "episodeNumber" : "6",
  "title" : "200",
  "description" : "Martin Lloyd seeks out SG-1 for assistance when his failed TV show based on the real Stargate program becomes a feature film."
}, {
  "imdbId" : "0118480",
  "season" : "10",
  "episodeNumber" : "7",
  "title" : "Counterstrike",
  "description" : "SG-1 is caught in the middle of a war after the Jaffa use a powerful weapon to kill 10,000 Ori followers."
}, {
  "imdbId" : "0118480",
  "season" : "10",
  "episodeNumber" : "8",
  "title" : "Memento Mori",
  "description" : "Vala is kidnapped by agents of the Trust who are trying to find an ancient treasure when an accident causes Vala to forget who she is."
}, {
  "imdbId" : "0118480",
  "season" : "10",
  "episodeNumber" : "9",
  "title" : "Company of Thieves",
  "description" : "Cameron Mitchell must go undercover inside the Lucian Alliance to find the location of the hijacked Odyssey."
}, {
  "imdbId" : "0118480",
  "season" : "10",
  "episodeNumber" : "10",
  "title" : "The Quest: Part 1",
  "description" : "During their Quest for the Sangraal SG-1 must join forces with their enemy and face a real-life dragon."
}, {
  "imdbId" : "0118480",
  "season" : "10",
  "episodeNumber" : "11",
  "title" : "The Quest: Part 2",
  "description" : "The SG-1 team hadn't counted on a real dragon as the guardian, until one flies out, breathing fire. However, Daniel thinks the Sangraal probably is a hologram. They escape, but the dragon follows them outside. Ba'al admits not to know its secret name, while Daniel believes that the name probably holds power over it. While they guess, Cam thinks of luring the dragon to blow it up, but the C4 barely impresses its digestion. Daniel makes it disappear by using Morgan LeFay's name in Ancient, Ganos Lal. They find it had guarded the frozen 'grave' of the realm's ..."
}, {
  "imdbId" : "0118480",
  "season" : "10",
  "episodeNumber" : "12",
  "title" : "Line in the Sand",
  "description" : "When an entire people may suffer the fatal wrath of a Prior of the Ori for not converting, General Landry orders Carter to try out an experimental device based on Merlin's technology to transport their whole village. The test works, but before they can activate it on a sufficiently large scale, an Ori force takes the village, wounds Sam and kills villagers near the Stargate before Vala's very eyes. Her husband, Tomin, captures her but claims to not love her. He is ordered, as punishment for being deceived by her, to re-educate her. Sam and Cam are able to activate the..."
}, {
  "imdbId" : "0118480",
  "season" : "10",
  "episodeNumber" : "13",
  "title" : "The Road Not Taken",
  "description" : "After an experiment to increase the range of Merlin's device goes terribly wrong, Sam has an accident which transports her to a parallel universe, where SG-1 has a very different composition, since history was changed by a failed attack by one Ori ship... and a whole fleet is expected soon. She insists upon abandoning the -killed- parallel Carter's line of work and pursues hiding the entire parallel Earth. It works! Even when the Ori fire at their position, nobody is hurt. The parallel Hank Landry is President, and three years prior had imposed permanent Martial Law. ..."
}, {
  "imdbId" : "0118480",
  "season" : "10",
  "episodeNumber" : "14",
  "title" : "The Shroud",
  "description" : "Daniel Jackson, who was left behind fighting off Adria while the other SG1-members escaped trough the Stargate, is found working as a Prior: the best in the business, who doesn't need to use any threats to talk people into conversion to Origin. Hoping there is still some of his personality left, the team (plus General Jack O'Neill) kidnaps him. Daniel explains how he temporarily has Merlin's personality and knowledge in himself, and had deliberately allowed Adria to turn him into a Prior, while delaying to finish Merlin's weapon she'd wanted, meanwhile hoping to get ..."
}, {
  "imdbId" : "0118480",
  "season" : "10",
  "episodeNumber" : "15",
  "title" : "Bounty",
  "description" : "SG-1 blows up three transport ships in a row; Netan puts a price on their heads. General Landry grants the team members spare time on Earth. Daniel spends it researching in a library, where he meets a bounty hunter who tries to seduce him, then switches to her handgun... but is taken out by a bus. Sam gives a lecture on Air Force technological progress together with Dr. Bill Lee; a sniper nearly misses, but is taken out with an experimental weapon they'd brought along to demonstrate. Teal'c is injured by surprise at a Jaffa camp and successfully traps the killer to ..."
}, {
  "imdbId" : "0118480",
  "season" : "10",
  "episodeNumber" : "16",
  "title" : "Bad Guys",
  "description" : "When SG-1, minus Carter, investigates a previously unexplored planet expecting to find themselves in a pyramid, they are astounded to find themselves in a museum. Finding a party occurring in the lobby, they decide to leave and make first contact later, but they find that the DHD is a replica and thus incapable of getting them home. They are discovered and believed to be rebels and are forced to take hostages to buy time for their escape."
}, {
  "imdbId" : "0118480",
  "season" : "10",
  "episodeNumber" : "17",
  "title" : "Talion",
  "description" : "Teal'c and Bra'tac are among the numerous victims -though only wounded- of several bomb attacks killing 32 men at a summit in the Jaffa settlement Dar Eshkalon. As soon as physically able, he swears to avenge them personally, suspecting the honor-less, ambitious warrior Arkad; General Landry refuses to sanction a killing mission without solid proof, but cannot stop Teal'c going it alone. Bra'tac explains to Daniel Arkad's sinister past, probably even murdering Teal'c mother. Information from resistance on another planet indicates Arkad is in league with the Ori and a ..."
}, {
  "imdbId" : "0118480",
  "season" : "10",
  "episodeNumber" : "18",
  "title" : "Family Ties",
  "description" : "Stargate's HQ gets a video message from Vala's most unreliable father Jacek on the planet Robak- he claims to know about the late Arkad's plans to attack and blow up Earth, even about the several cloaked, naquadah-laden cargo ships in orbit, and offers details in exchange for sanctuary. General Landry asks Dr. Lam to help him resume contact with her mother Kim, his ex. Even after the cargoes are found and blown up, Vala abhors her dad's entry. The general asks her to go easy on him, realizing that he, too, neglected his daughter because of his career, even if Jacek's ..."
}, {
  "imdbId" : "0118480",
  "season" : "10",
  "episodeNumber" : "19",
  "title" : "Dominion",
  "description" : "Vala gambles, wins a cargo ship, but is found cheating; then Adria appears, throws everyone out and claims she has a new Ori fleet and an operational intergalactic Stargate. Vala tells her scary daughter how she helped Daniel, after a dream, reading the mysterious clava thessara-symbol's mystery, which led to a single planet address, where Athena's treasure house must be; after a disastrous visit there, the team refused to follow the next interpretation, fearing it's just a trap set up by Adria, so Vala is declared a security risk, grounded and confined to Area 51, ..."
}, {
  "imdbId" : "0118480",
  "season" : "10",
  "episodeNumber" : "20",
  "title" : "Unending",
  "description" : "General Landry accompanies SG-1 on a mission to collect the knowledge of the Asgard. When the Ori show up however, Sam is forced to evacuate the crew and Landry and SG-1 stay aboard, but are stuck helpless in a time dilation field for decades."
}]