[{
  "imdbId" : "0057765",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "The Vulcan Affair",
  "description" : "In the pilot episode, UNCLE agent Napoleon Solo is assigned to foil an assassination plot by Thrush. The criminal organization's target is a delegation from the newly independent African nation, Western Natumba. The plot is under the supervision of Andrew Vulcan, a U.S. industrialist secretly working for Thrush. Solo recruits an old flame of Vulcan's as part of his plan."
}, {
  "imdbId" : "0057765",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "The Iowa-Scuba Affair",
  "description" : "Napoleon Solo travels to Iowa, the site of a secret U.S. Air Force base, after a saboteur turns up there. A group wants to hijack a secret U.S. plane as part of a plan to overthrow a South American nation."
}, {
  "imdbId" : "0057765",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "The Quadripartite Affair",
  "description" : "UNCLE agents Napoleon Solo and Illya Kuraykin face a four-cornered conspiracy comprised of an ambitious woman (Gervaise Ravel), her wealthy boyfriend (Harold Bufferton), a disgraced military officer and a scientist who has devised a chemical that induces fear. Solo and Kuryakin are helped by the daughter (Marion Raven) of a man killed as a result of the conspiracy."
}, {
  "imdbId" : "0057765",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "The Shark Affair",
  "description" : "UNCLE agents Solo and Kuryakin are assigned to investigate hijackings at sea, where people are abducted from ships by a ship flying a pirate flag. The lead pirate, Captain Shark, believes the world will soon inevitably be destroyed by World War III and views his ship as a modern-day Noah's Ark."
}, {
  "imdbId" : "0057765",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "The Deadly Games Affair",
  "description" : "U.N.C.L.E. and Thrush race to find a Nazi scientist, who worked for Adolf Hitler, after an SS officer assigned to guard the scientist turns up dead. The scientist, who now teaches under the name Professor Amadeus, has Hitler in suspended animation. He needs a person with the same blood type of Hitler's; the Nazi leader will need a completely new blood supply to come out of suspended animation. Amadeus discovers that Solo is the right blood type..."
}, {
  "imdbId" : "0057765",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "The Green Opal Affair",
  "description" : "Solo investigates a Thrush plot to tamper with the minds of prominent people only to find out he has been expected all along. Now, Thrush intends to tamper with his brain, figuring the agent will eventually be promoted and be turned into a pawn of the criminal organization."
}, {
  "imdbId" : "0057765",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "The Giuoco Piano Affair",
  "description" : "Solo and Kuryakin pursue Gervaise Ravel and Harold Bufferton, the surviving conspirators of The Quadripartite Affair. To draw them out of hiding, Solo will use Marion Raven as bait and utilize a variation of the Guioco Piano chess opening to make the operation a success."
}, {
  "imdbId" : "0057765",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "The Double Affair",
  "description" : "Thrush seeks to control 'Project Earthsave', an energy source to be used if Earth is ever invaded. Toward that end, the group has used plastic surgery to make one of its operatives into a double for Napoleon Solo. Solo is scheduled to lead a team of UNCLE agents who are acting as couriers with the new combination for the Project Earthsave vault."
}, {
  "imdbId" : "0057765",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "The Project Strigas Affair",
  "description" : "A diplomat seeks to heighten tensions between East and West. UNCLE is to neutralize him but not, Waverly says, in a way he becomes a 'cause celebre'. Solo and Kuryakin devise a con game with a false secret (dubbed Project Strigas) and recruit a talented engineer who abruptly quit a lucrative job to start his own business."
}, {
  "imdbId" : "0057765",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "The Finny Foot Affair",
  "description" : "Solo is trying to track down a chemical agent that hastens the aging process."
}, {
  "imdbId" : "0057765",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "The Neptune Affair",
  "description" : "Solo seeks to find a group of scientists who are trying to start World War III. Chemicals that are destroying the Russian grain harvest are being launched by rockets off the West Coast of the United States."
}, {
  "imdbId" : "0057765",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "The Dove Affair",
  "description" : "Solo steals a dove-shaped medal from the body of the leader of a European nation as the corpse lies in state. The medal has information concerning Thrush personnel operating in the country. The UNCLE agent must contend with Satine, a master spy in the employ of the European nation as well as the country's security police, who are working for officials under the control of Thrush. Solo is assisted by Miss Taub, who is supervising a group of students on a European tour."
}, {
  "imdbId" : "0057765",
  "season" : "1",
  "episodeNumber" : "13",
  "title" : "The King of Knaves Affair",
  "description" : "A deposed leader of a Middle Eastern nation, now living in Rome, is conspiring to ruin the economy of his country. Solo and Kuryakin adopt cover identities as part of a plan to foil the plot."
}, {
  "imdbId" : "0057765",
  "season" : "1",
  "episodeNumber" : "14",
  "title" : "The Terbuf Affair",
  "description" : "Solo and Kuryakin, spending some off-time in Rome, are approached by Clara, an old flame of Solo's. She seeks Solo's help so Emil, a gypsy leader, can escape Terbuf along with papers that implicate the corrupt leadership of that country. Kuryakin tags along. His knowledge of gypsies and clear head (where Clara is concerned) will be of great assistance to Solo."
}, {
  "imdbId" : "0057765",
  "season" : "1",
  "episodeNumber" : "15",
  "title" : "The Deadly Decoy Affair",
  "description" : "Solo and Kuryakin are told to escort a captured Thrush official, Egon Stryker, to Washington. Meantime, Waverly transports a man the agents are told is a double for Stryker. A Thrush team keeps trying to whisk Stryker away."
}, {
  "imdbId" : "0057765",
  "season" : "1",
  "episodeNumber" : "16",
  "title" : "The Fiddlesticks Affair",
  "description" : "The mysterious Hemingway causes havoc at UNCLE headquarters in New York through various means, including tampering with the facility's water supply and electrical system. This occurs on the eve of an important conference where UNCLE will host leaders from around the world. Meanwhile, Thrush's Dr. Egret and Riley, a Thrush mole inside UNCLE, conspire to assassinate the leaders. Solo and Kuryakin try to figure out Hemingway's motives. Virtually the entire episode takes place at UNCLE headquarters."
}, {
  "imdbId" : "0057765",
  "season" : "1",
  "episodeNumber" : "17",
  "title" : "The Yellow Scarf Affair",
  "description" : "An UNCLE agent transporting a Thrush device is killed when members of a revived Thugee cult in India rob a plane and cause it to crash. Solo picks up the trail of the murdered agent. He must deal with both Thrush and the cult."
}, {
  "imdbId" : "0057765",
  "season" : "1",
  "episodeNumber" : "18",
  "title" : "The Mad, Mad Tea Party Affair",
  "description" : "The mysterious Hemingway causes havoc at UNCLE headquarters in New York through various means, including tampering with the facility's water supply and electrical system. This occurs on the eve of an important conference where UNCLE will host leaders from around the world. Meanwhile, Thrush's Dr. Egret and Riley, a Thrush mole inside UNCLE, conspire to assassinate the leaders. Solo and Kuryakin try to figure out Hemingway's motives. Virtually the entire episode takes place at UNCLE headquarters."
}, {
  "imdbId" : "0057765",
  "season" : "1",
  "episodeNumber" : "19",
  "title" : "The Secret Sceptre Affair",
  "description" : "Solo is on a personal mission to help Col. Morgan, who was Solo's commanding officer during the Korean War. Kuryakin accompanies Solo. The agents become involved in a conspiracy where all is not what it appears."
}, {
  "imdbId" : "0057765",
  "season" : "1",
  "episodeNumber" : "20",
  "title" : "The Bow-Wow Affair",
  "description" : "A relative of Waverly's is being threatened if he doesn't sell shares in a company at a fraction of their value. Kuryakin is assigned to the affair, where his knowledge of gypsies proves useful. Solo, recuperating from a knee injury, provides limited assistance."
}, {
  "imdbId" : "0057765",
  "season" : "1",
  "episodeNumber" : "21",
  "title" : "The Four-Steps Affair",
  "description" : "Thrush seeks to assassinate the 10-year-old boy leader, who has brought peace to a formerly violent country."
}, {
  "imdbId" : "0057765",
  "season" : "1",
  "episodeNumber" : "22",
  "title" : "The See-Paris-And-Die Affair",
  "description" : "A pair of cousins has robbed a diamond syndicate of a huge amount of diamonds. They are blackmailing the syndicate; if they're not paid, they'll flood the international market, devaluing diamonds everywhere. Both UNCLE and Thrush are seeking to find the diamonds."
}, {
  "imdbId" : "0057765",
  "season" : "1",
  "episodeNumber" : "23",
  "title" : "The Brain-Killer Affair",
  "description" : "Thrush poisons Waverly, with plans to subject him to a procedure that affects the brain. The criminal organization has already experimented on others, turning a shipping magnate and a diplomat into failures."
}, {
  "imdbId" : "0057765",
  "season" : "1",
  "episodeNumber" : "24",
  "title" : "The Hong Kong Shilling Affair",
  "description" : "A single shilling is the object of a hunt between UNCLE and criminal groups in Hong Kong."
}, {
  "imdbId" : "0057765",
  "season" : "1",
  "episodeNumber" : "25",
  "title" : "The Never-Never Affair",
  "description" : "An UNCLE translator, Mandy Stevenson, seeks excitement. Solo, feeling sorry for her, 'recruits' Mandy to be a courier. In reality, she is only supposed to get Waverly more pipe tobacco. Things go askew when Mandy is given actual valuable information (a list of Thrush agents in France). UNCLE and Thrush comb New York to find Mandy."
}, {
  "imdbId" : "0057765",
  "season" : "1",
  "episodeNumber" : "26",
  "title" : "The Love Affair",
  "description" : "UNCLE investigates Brother Love, a religious figure, who uses his traveling revival to surreptitiously kidnap leading scientists for a new THRUSH operation."
}, {
  "imdbId" : "0057765",
  "season" : "1",
  "episodeNumber" : "27",
  "title" : "The Gazebo in the Maze Affair",
  "description" : "G. Emory Partridge is seeking revenge on Solo and UNCLE for foiling a plot seven years earlier. Partridge kidnaps Kuryakin as part of a trap."
}, {
  "imdbId" : "0057765",
  "season" : "1",
  "episodeNumber" : "28",
  "title" : "The Girls of Nazarone Affair",
  "description" : "UNCLE and Thrush seek a formula that accelerates healing. The Thrush forces are led by Dr. Egret."
}, {
  "imdbId" : "0057765",
  "season" : "1",
  "episodeNumber" : "29",
  "title" : "The Odd Man Affair",
  "description" : "UNCLE, seeking to infiltrate a meeting of terrorists, reluctantly recruits former agent Albert Sully, a supposed expert on one of the attending terrorists. In reality, he knows no more than UNCLE does and, in turns, seeks the help of a woman from his past."
}, {
  "imdbId" : "0057765",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "Alexander the Greater Affair: Part One",
  "description" : "A mysterious U.S. industrialist, Mr. Alexander, steals a new type of nerve gas from the U.S. Army. He leaves behind a small tablet with the number eight on it. Solo and Kuryakin investigate, with the help of Alexander's ex-wife Tracey, who seeks Alexander to sign her final divorce papers. The trio finds Alexander's parents working like slaves at a Greece rock quarry with the number five painted all around. After freeing the parents (and avoiding Alexander's thugs), they travel to a temple where they are captured by Alexander. It turns out Alexander plans to take over an Asian nation, breaking each of the Ten Commandments along the way."
}, {
  "imdbId" : "0057765",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "Alexander the Greater Affair: Part Two",
  "description" : "Solo, Kuryakin and Tracey escape Alexander's death trap. The scene shifts to Washington and Virginia. Alexander breaks commandment No. 7 by seducing a prince's wife. He is planning on breaking No. 6 (Thou Shall Not Kill) and when that is done, his plot will be complete. Solo is menaced by a muscular thug while Kuryakin is endangered by employees of Alexander's farm in Virginia."
}, {
  "imdbId" : "0057765",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "The Ultimate Computer Affair",
  "description" : "Thrush is developing an 'ultimate computer', which, if it becomes fully operational, will mean the criminal organization even more formidable. The device is housed in a Thrush facility that uses a South American prison as a front. Kuryakin infiltrates it as a prisoner while Solo pretends to be the husband of an international prison inspector, Salty Oliver."
}, {
  "imdbId" : "0057765",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "The Foxes and Hounds Affair",
  "description" : "A magician has developed a mind-reading device and offers it to UNCLE. The problem is Thrush, led by rivals Victor Marton and Miss Belmont, also is seeking the machine."
}, {
  "imdbId" : "0057765",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "The Discotheque Affair",
  "description" : "Solo and Kuryakin investigate a Thrush operation which uses a a discotheque as a front."
}, {
  "imdbId" : "0057765",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "The Re-Collectors Affair",
  "description" : "The Re-Collectors are hunting down Nazis, who had stolen priceless art works. Solo and Kuryakin investigate and discover the situation really is more complicated."
}, {
  "imdbId" : "0057765",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "The Arabian Affair",
  "description" : "Thrush, at a base in the Middle East, is developing a 'vaporizer', which dissolves almost any object. Kuryakin tries to enlist the assistance of a tribe of Arabs to help. Solo, meanwhile, convinces a soon-to-be retired Thrushman that he'll live longer if he switches sides."
}, {
  "imdbId" : "0057765",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "The Tigers Are Coming Affair",
  "description" : "In India, Solo and Kuryakin investigate a prince, who holds a deadly secret."
}, {
  "imdbId" : "0057765",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "The Deadly Toys Affair",
  "description" : "The son of a Thrush scientist is one of the most brilliant minds ever. UNCLE seeks to prevent the boy from ever working for Thrush."
}, {
  "imdbId" : "0057765",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "The Cherry Blossom Affair",
  "description" : "The search for a volcano-activating device takes Napoleon Solo (Robert Vaughn) and Illya Kuryakin (David McCallum) to Japan, where they must find Thrush's Far East headquarters."
}, {
  "imdbId" : "0057765",
  "season" : "2",
  "episodeNumber" : "11",
  "title" : "The Virtue Affair",
  "description" : "Mr. Robspierre, a descendant of the original Robspierre, plans to launch a nuclear missile and destroy France's vineyards. By doing so, he hopes to restore the virtue of France. Solo works to protect the daughter of a scientist Robspierre abducted while Kuryakin infiltrates Robspierre's operation."
}, {
  "imdbId" : "0057765",
  "season" : "2",
  "episodeNumber" : "12",
  "title" : "The Children's Day Affair",
  "description" : "Thrush is operating a school for boys which really is training young assassins. The school's next target is an UNCLE gathering of top officials."
}, {
  "imdbId" : "0057765",
  "season" : "2",
  "episodeNumber" : "13",
  "title" : "The Adriatic Express Affair",
  "description" : "Solo and Kuryakin, aboard the Adriatic Express from Vienna to Venice, are seeking a Thrush chemical that can end the reproductive process in life forms. We meet Madame Nemirovitch, who claims to be the founder of Thrush."
}, {
  "imdbId" : "0057765",
  "season" : "2",
  "episodeNumber" : "14",
  "title" : "The Yukon Affair",
  "description" : "G. Emory Partridge returns, this time operating out of the Yukon, to again endanger Solo and Kuryakin."
}, {
  "imdbId" : "0057765",
  "season" : "2",
  "episodeNumber" : "15",
  "title" : "The Very Important Zombie Affair",
  "description" : "El Supremo, the corrupt ruler of a Caribbean nation, abducts an opposition leader who had been under the protection of U.N.C.L.E. Solo and Kuryakin travel to El Supremo's country to free the opposition leader and bring down El Supremo."
}, {
  "imdbId" : "0057765",
  "season" : "2",
  "episodeNumber" : "16",
  "title" : "The Dippy Blonde Affair",
  "description" : "Thrush is conducting an operation using a mortuary as a front. One Thrushman appears to commit suicide. Another is falling for the 'dead' man's girlfriend. UNCLE is using the girlfriend, whose name is Jojo Tyler and the 'dippy blonde' of the episode title, to break the operation."
}, {
  "imdbId" : "0057765",
  "season" : "2",
  "episodeNumber" : "17",
  "title" : "The Deadly Goddess Affair",
  "description" : "Solo and Kuryakin lock horns with Colonel Hubris, a Thrush operative. They also run into trouble with the local police."
}, {
  "imdbId" : "0057765",
  "season" : "2",
  "episodeNumber" : "18",
  "title" : "The Birds and the Bees Affair",
  "description" : "Thrush wipes out UNCLE's Geneva station with a strain of small, almost invisible, killer bees. The criminal organization next wants to use the bees on UNCLE's New York headquarters."
}, {
  "imdbId" : "0057765",
  "season" : "2",
  "episodeNumber" : "19",
  "title" : "The Waverly Ring Affair",
  "description" : "Thrush has a mole inside UNCLE's New York headquarters. All signs point to George Dennell, a good-natured UNCLE employee who envies enforcement agents such as Solo and Kuryakin. Dennell protests he is innocent and Solo takes a big chance on George."
}, {
  "imdbId" : "0057765",
  "season" : "2",
  "episodeNumber" : "20",
  "title" : "The Bridge of Lions Affair: Part 1",
  "description" : "A scientist has developed a machine that reverses the aging process. UNCLE races Thrush for the device. An aging British politician and his manipulative wife will be key players in the outcome."
}, {
  "imdbId" : "0057765",
  "season" : "2",
  "episodeNumber" : "21",
  "title" : "The Bridge of Lions Affair: Part II",
  "description" : "A British politician's career is suddenly rejuvenated after he's been exposed to a device that reverses the aging process. But he's also a prisoner. He needs additional treatments and the machine is now under the control of Thrush and the politician's manipulative wife."
}, {
  "imdbId" : "0057765",
  "season" : "2",
  "episodeNumber" : "22",
  "title" : "The Foreign Legion Affair",
  "description" : "Kuryakin, who has photographed Thrush codes needed by UNCLE, is captured by the criminal organization. He parachutes, with a stewardess, from a chartered aircraft over the North African desert. They end up at a Foreign Legion post, still manned by Basil Calhoun, who doesn't know the legion has been disbanded. Both Solo and Thrush are trying to get to Kuryakin."
}, {
  "imdbId" : "0057765",
  "season" : "2",
  "episodeNumber" : "23",
  "title" : "The Moonglow Affair",
  "description" : "After Solo and Kuryakin are sidelined, Waverly turns to two agents: April Dancer, a young woman, and Mark Slate, a veteran operative who, it turns out, is older than 40, the retirement age for enforcement agents."
}, {
  "imdbId" : "0057765",
  "season" : "2",
  "episodeNumber" : "24",
  "title" : "The Nowhere Affair",
  "description" : "Solo, on the verge of capture by Thrush, takes Capsule B, which induces amnesia."
}, {
  "imdbId" : "0057765",
  "season" : "2",
  "episodeNumber" : "25",
  "title" : "The King of Diamonds Affair",
  "description" : "The title refers to criminal Rafael Delgado, an expert diamond thief. He's involved with a band of criminals, who dress in British style (bowler hats and umbrellas) but who speak Italian. It's implied they are Mafia types trying to pass themselves off as British. Delgado, even while in prison, has pulled off a stunning robbery with the help of the gang. So many diamonds are missing it could affect the world's economy."
}, {
  "imdbId" : "0057765",
  "season" : "2",
  "episodeNumber" : "26",
  "title" : "The Project Deephole Affair",
  "description" : "Thrush mistakes Buzz Conway for a scientist. Solo and Kuryakin use that to their advantage while trying to smash a Thrush operation headed by Marvin Elom. Narcissus Darling, a Thrush femme fatale, also is involved."
}, {
  "imdbId" : "0057765",
  "season" : "2",
  "episodeNumber" : "27",
  "title" : "The Round Table Affair",
  "description" : "Mafia types have taken control of Ingolstein, a small European country. The tiny nation has no extradition treaty, providing criminals with refuge."
}, {
  "imdbId" : "0057765",
  "season" : "2",
  "episodeNumber" : "28",
  "title" : "The Bat Cave Affair",
  "description" : "Count Zark, a Thrush agent, operates out of Transylvania and has developed a worldwide menace involving bats. Meanwhile, UNCLE is checking out a young woman who seems capable of reading the minds of others. Solo and Kuryakin discover how both events are related."
}, {
  "imdbId" : "0057765",
  "season" : "2",
  "episodeNumber" : "29",
  "title" : "The Minus-X Affair",
  "description" : "Professor Lillian Stemmler is collaborating with Thrush. She has developed two formulas: Plus X, which heightens the senses, and Minus X, which temporarily transforms people into child-like morons. Thrush intends to use both to steal U.S. military secrets."
}, {
  "imdbId" : "0057765",
  "season" : "2",
  "episodeNumber" : "30",
  "title" : "The Indian Affairs Affair",
  "description" : "Thrushman L.C. Carson has kidnapped Chief Highcloud of the Cardiac tribe of Indians in Oklahoma. The criminal organization also is menacing the chief's daughter, Charisma, who dances in New York. It turns out Thrush is working on a hydrogen bomb on the Cardiac reservation. Solo leads a group of Indians, all riding motorcycles, in a climatic fight with the Thrush forces."
}, {
  "imdbId" : "0057765",
  "season" : "3",
  "episodeNumber" : "1",
  "title" : "The Her Master's Voice Affair",
  "description" : "A school on Long Island has a student body made up of teenaged children of scientists and other prominent people. Thrush is secretly running the facility and programming the students to steal secrets from their parents. Kuryakin acts as a bodyguard for the teenaged daughter of a scientist while Solo infiltrates the school."
}, {
  "imdbId" : "0057765",
  "season" : "3",
  "episodeNumber" : "2",
  "title" : "The Sort of Do-It-Yourself Dreadful Affair",
  "description" : "Solo is attacked by a cyborg (a mostly electronic being with some human organs) while on a mission. Later, it's discovered that a Thrush front company is seeking a $1 billion loan. Eventually, Solo and Kuryakin uncover a plot to mass produce cyborgs."
}, {
  "imdbId" : "0057765",
  "season" : "3",
  "episodeNumber" : "3",
  "title" : "The Galatea Affair",
  "description" : "Solo (Robert Vaughn) and Kuryakin (David McCallum) narrowly escape an attempt on their lives in Venice. Solo has caught pneumonia as a result of a swim in the Venice canals. As a result, he is replaced on the mission by Mark Slate (Noel Harrison). Slate is to prepare a stripper to take the place of a woman in the employ of Thrush (Joan Collins in a dual role)."
}, {
  "imdbId" : "0057765",
  "season" : "3",
  "episodeNumber" : "4",
  "title" : "The Super-Colossal Affair",
  "description" : "Mobsters are using the production of a movie as a front for an operation involving Las Vegas -- dropping a giant stink bomb on the city."
}, {
  "imdbId" : "0057765",
  "season" : "3",
  "episodeNumber" : "5",
  "title" : "The Monks of St. Thomas Affair",
  "description" : "Thrush is operating out of a monastery it has taken over. The criminal organization plans to destroy the Louvre with a ray gun."
}, {
  "imdbId" : "0057765",
  "season" : "3",
  "episodeNumber" : "6",
  "title" : "The Pop Art Affair",
  "description" : "Thrushman Mark Ole has developed a chemical that induces fatal hiccups. He operates out of Greenwich Village in New York City and uses a gang of beatniks."
}, {
  "imdbId" : "0057765",
  "season" : "3",
  "episodeNumber" : "7",
  "title" : "The Thor Affair",
  "description" : "Munitions magnate Brutus Thor intends to assassinate a Ghandi-like figure who protests for peace. Solo and Kuryakin must stop a plan to blow up a disarmament conference where Thor's target will deliver a major speech."
}, {
  "imdbId" : "0057765",
  "season" : "3",
  "episodeNumber" : "8",
  "title" : "The Candidate's Wife Affair",
  "description" : "Thrush kidnaps the wife of a U.S. presidential candidate and substitutes a double."
}, {
  "imdbId" : "0057765",
  "season" : "3",
  "episodeNumber" : "9",
  "title" : "The Come with Me to the Casbah Affair",
  "description" : "UNCLE and Thrush are seeking a Thrush code book in Algiers."
}, {
  "imdbId" : "0057765",
  "season" : "3",
  "episodeNumber" : "10",
  "title" : "The Off-Broadway Affair",
  "description" : "Thrush is planning to tap into UNCLE's main computer in New York City. To do so, the criminal organization is bankrolling a musical play that will provide cover for the group's real plan."
}, {
  "imdbId" : "0057765",
  "season" : "3",
  "episodeNumber" : "11",
  "title" : "The Concrete Overcoat Affair: Part I",
  "description" : "Thrush, led by the nervous Louis Strago and his assassin secretary Miss Diketon, has embarked on an ambitious project. The organization has recruited a Nazi scientist who once theorized by changing the Gulf Stream, you could make Iceland into a lush, green country and make Europe into a frozen wasteland. Thrush is prepared to make the scientist's dream a reality. By the end of Part I, Napoleon Solo faces a forced marriage to a relative of retired gangsters while Illya Kuryakin is being tortured by Miss Diketon."
}, {
  "imdbId" : "0057765",
  "season" : "3",
  "episodeNumber" : "12",
  "title" : "The Concrete Overcoat Affair: Part II",
  "description" : "Napoleon Solo sets off for a Thrush island, from where the criminal organization will fire nuclear missiles to alter the path of the Gulf Stream. During the course of events, Solo enters into an uneasy alliance with retired gangsters; Miss Diketon betrays Thrush leader Louis Strago; and Illya Kuryakin nearly drowns"
}, {
  "imdbId" : "0057765",
  "season" : "3",
  "episodeNumber" : "13",
  "title" : "The Abominable Snowman Affair",
  "description" : "Solo and Kuryakin investigate a plot in Ghupat, a nation in the Himalayas."
}, {
  "imdbId" : "0057765",
  "season" : "3",
  "episodeNumber" : "14",
  "title" : "The My Friend the Gorilla Affair",
  "description" : "Kuryakin is captured while investigating a mysterious threat in an African country. Solo is sent to pick up his trail. The agent encounters a woman simply named Girl who has a pet gorilla named Baby. For reasons not readily apparent, Solo at one point dances with the gorilla."
}, {
  "imdbId" : "0057765",
  "season" : "3",
  "episodeNumber" : "15",
  "title" : "The Jingle Bells Affair",
  "description" : "The leader of a country (who appears to be modeled on Nikita Kruschev) is visiting New York City. Solo and Kuryakin must protect him from assassination attempts."
}, {
  "imdbId" : "0057765",
  "season" : "3",
  "episodeNumber" : "16",
  "title" : "The Take Me to Your Leader Affair",
  "description" : "Scientist Dr. Adrian Cool informs UNCLE that his radio telescope is showing a spaceship heading to Earth. At the same time, Dr. Cool's daughter is kidnapped. All of this has been devised by evil industrialist Simon Sparrow as a means to grab power for himself."
}, {
  "imdbId" : "0057765",
  "season" : "3",
  "episodeNumber" : "17",
  "title" : "The Suburbia Affair",
  "description" : "UNCLE and Thrush have tracked a scientist, missing for 10 years, to a suburban community."
}, {
  "imdbId" : "0057765",
  "season" : "3",
  "episodeNumber" : "18",
  "title" : "The Deadly Smorgasbord Affair",
  "description" : "Thrush hopes to use a 'suspended animation' device, invented by Dr. A.C. Nillson, against UNCLE."
}, {
  "imdbId" : "0057765",
  "season" : "3",
  "episodeNumber" : "19",
  "title" : "The Yo-Ho-Ho and a Bottle of Rum Affair",
  "description" : "Kuryakin is stranded on a freighter carrying cargo bound for a Thrush operation. Thrush has a device that can cause tidal waves and is demanding $10 billion for not using it."
}, {
  "imdbId" : "0057765",
  "season" : "3",
  "episodeNumber" : "20",
  "title" : "The Napoleon's Tomb Affair",
  "description" : "Tunick, the leader of a former French colony, is the subject of a plot led by his No. 2 official. That official wants to manipulate Tunick into stealing Napoleon's tomb, a move that will embarrass the leader and drive him from office."
}, {
  "imdbId" : "0057765",
  "season" : "3",
  "episodeNumber" : "21",
  "title" : "The It's All Greek to Me Affair",
  "description" : "Solo and Kuryakin endure a series of misadventures involving Greek bandits and a stolen UNCLE codebook."
}, {
  "imdbId" : "0057765",
  "season" : "3",
  "episodeNumber" : "22",
  "title" : "The Hula Doll Affair",
  "description" : "Thrush steals a powerful UNCLE-developed explosive hidden in a hula doll. The explosive will detonate if heated to 90 degrees Fahrenheit. This is bad news because New York is in the midst of a heat wave. Solo and Kuryakin must also contend with a pair of brothers, each vying for power within a New York Thrush operation."
}, {
  "imdbId" : "0057765",
  "season" : "3",
  "episodeNumber" : "23",
  "title" : "The Pieces of Fate Affair",
  "description" : "A young woman's novel reads uncomfortably similar to UNCLE cases involving Thrush. UNCLE investigates whether the woman, who has lost her memory following an attack, may have had access to secret Thrush records."
}, {
  "imdbId" : "0057765",
  "season" : "3",
  "episodeNumber" : "24",
  "title" : "The Matterhorn Affair",
  "description" : "UNCLE and Thrush are seeking a missing piece of microfilm."
}, {
  "imdbId" : "0057765",
  "season" : "3",
  "episodeNumber" : "25",
  "title" : "The Hot Number Affair",
  "description" : "The pattern of a dress is really a Thrush code. UNCLE and Thrush are each trying to get the dress."
}, {
  "imdbId" : "0057765",
  "season" : "3",
  "episodeNumber" : "26",
  "title" : "The When in Roma Affair",
  "description" : "Solo plants a stolen Thrush formula on an innocent woman tourist. Both UNCLE and Thrush are seeking the formula."
}, {
  "imdbId" : "0057765",
  "season" : "3",
  "episodeNumber" : "27",
  "title" : "The Apple a Day Affair",
  "description" : "Solo (Robert Vaughn) faces Thrush agents, a girl (Jeannine Reilly), her shotgun-toting father (Gil Lamb) and a preacher (Dub Taylor), as he and Kuryakin (David McCallum) search for exploding apples."
}, {
  "imdbId" : "0057765",
  "season" : "3",
  "episodeNumber" : "28",
  "title" : "The Five Daughters Affair: Part I",
  "description" : "A scientist, Dr. True, has developed a process for extracting gold from seawater. He dies just as he is performing a demonstration for Solo and Kuryakin. His death has been arranged by Thrush. However, Dr. True has scattered his formula to 'the four winds' -- stepdaughters he has around the world. Both UNCLE and Thrush pursue the formula. As part I ends, Solo, Kuryakin and Sandy, Dr. True's natural daughter, are left tied up in an UNCLE plane by Thrush operatives. The Thrushman parachute to safety as the UNCLE plane flies on with no one at the controls."
}, {
  "imdbId" : "0057765",
  "season" : "3",
  "episodeNumber" : "29",
  "title" : "The Five Daughters Affair: Part II",
  "description" : "The UNCLE agents free themselves and get control of the UNCLE plane just before it runs out of fuel. Solo and Kuryakin, accompanied by Sandy True, resume their search for the late Dr. True's formula. They are dogged by Randolph, a Thrushman, accompanied by his 'karate killers'. They all eventually wind up at a secret Thrush installation where the criminal organization plans to use Dr. True's process to produce gold on a massive scale."
}, {
  "imdbId" : "0057765",
  "season" : "3",
  "episodeNumber" : "30",
  "title" : "The Cap and Gown Affair",
  "description" : "Alexander Waverly is scheduled to receive an honorary degree at his alma mater, Blair University. UNCLE is on guard to protect Waverly against an assassination attempt by Thrush."
}, {
  "imdbId" : "0057765",
  "season" : "4",
  "episodeNumber" : "1",
  "title" : "The Summit-Five Affair",
  "description" : "In Berlin, an UNCLE employee is killed just as he is sending a message to Waverly about a security breach. This occurs just before UNCLE's Summit Five conference, when the leaders of UNCLE's five regions meet and new communications codes are activated. Solo is a suspect in the killing and is subjected to an intense interrogation. Solo and Kuryakin must find the real traitor before it's too late."
}, {
  "imdbId" : "0057765",
  "season" : "4",
  "episodeNumber" : "2",
  "title" : "The Test Tube Killer Affair",
  "description" : "Thrush is using a fencing school in Mexico as a cover. Inside, young men are being trained to be 'perfect' killers. They can even turn emotion on and off. Professor Stoller, the head of the operation, has selected his prize pupil, Greg Martin, to demonstrate how effective the trainees can be. Martin is to blow up a dam in Greece and destroy a small town in the process. Solo and Kuryakin desperately try to stop the young Thrushman. Complicating matters is a young woman who has fallen in love with Martin."
}, {
  "imdbId" : "0057765",
  "season" : "4",
  "episodeNumber" : "3",
  "title" : "The 'J' for Judas Affair",
  "description" : "Thrush plans to assassinate industrialist Mark Tenza and take over his business empire."
}, {
  "imdbId" : "0057765",
  "season" : "4",
  "episodeNumber" : "4",
  "title" : "The Prince of Darkness Affair: Part I",
  "description" : "Dr. Kharmusi, a criminal scientist, has developed a 'thermal prism', which generates intense heat beams. UNCLE recruits Luther Sebastian, wanted for various crimes in 22 countries, because he designed the kind of safe where Kharmusi keeps the prism. Napoleon Solo infiltrates Kharmusi's base of operations as an amoral businessman while Illya Kuryakin and Sebastian work to steal the device. However, Annie, whose boyfriend was framed for murder by Sebastian, complicates matters."
}, {
  "imdbId" : "0057765",
  "season" : "4",
  "episodeNumber" : "5",
  "title" : "The Prince of Darkness Affair: Part II",
  "description" : "Solo, Kuryakin and Annie narrowly escape a deathtrap set by Luther Sebastian, whose Third Way cult now has the 'thermal prism' developed by the late Dr. Kharmusi. Sebastian next intends to hijack a U.S. rocket so he can launch the prism into orbit and blackmail the world."
}, {
  "imdbId" : "0057765",
  "season" : "4",
  "episodeNumber" : "6",
  "title" : "The Master's Touch Affair",
  "description" : "Mandor, a former high-ranking Thrush official, supposedly has defected to UNCLE. In reality, he is providing information that will weaken his enemies within Thrush; Mandor is angling to take over Thrush in a power play. However, a former Mandor associate is hunting him. Mandor arranges it so that Illya Kuryakin is captured, forcing UNCLE to kill the Thrushman hunting Mandor. Napoleon Solo must rescue Kuryakin and then deal with Mandor."
}, {
  "imdbId" : "0057765",
  "season" : "4",
  "episodeNumber" : "7",
  "title" : "The THRUSH Roulette Affair",
  "description" : "Barnaby Partridge, an ambitious Thrush operative, runs a casino in the Caribbean, where he brainwashes prominent visitors. Solo recruits a businessman who's still in love with a woman in Partridge's employ. Kuryakin, meanwhile, is captured while infiltrating the casino. The Russian agent is programmed to kill Solo."
}, {
  "imdbId" : "0057765",
  "season" : "4",
  "episodeNumber" : "8",
  "title" : "The Deadly Quest Affair",
  "description" : "Karmak, given up for dead by Napoleon Solo and Illya Kuryakin, kidnaps Kuryakin to extract his revenge on Solo. Solo must find Kuryakin, who is somewhere in a 10-block area of condemned buildings, before 6 a.m. or else the Russian UNCLE agent will die."
}, {
  "imdbId" : "0057765",
  "season" : "4",
  "episodeNumber" : "9",
  "title" : "The Fiery Angel Affair",
  "description" : "Kuryakin foils an assassination attempt on Angela Abaca, an Evita Peron-like leader of a South American country. Authorities initially jail him, mistakenly believing he's part of the plot. Instead, he's hailed as a hero, which now impedes his ability to protect Angela. Solo is sent to the country and masquerades as a mercenary. Solo learns that Thrush has collaborators inside the government. Meanwhile, Angela makes it difficult for Kuryakin to protect her."
}, {
  "imdbId" : "0057765",
  "season" : "4",
  "episodeNumber" : "10",
  "title" : "The Survival School Affair",
  "description" : "Kuryakin is sent to UNCLE's secret training school on a remote island. He has to find out which trainee among of a soon-to-graduate group is really a mole for Thrush. Helping him is another agent posing as a trainee. Kuryakin must also deal with the obsessive head of the school, Jules Cutter."
}, {
  "imdbId" : "0057765",
  "season" : "4",
  "episodeNumber" : "11",
  "title" : "The Gurnius Affair",
  "description" : "A Nazi scientist is sprung from a German prison, with Solo and Kuryakin in pursuit. While the scientist escapes, one of the plotters is killed. Kuryakin impersonates the man and travels to South America. Solo goes to the continent separately, but cannot shake a woman photographer who had been on the scene when the scientist escaped. It turns out Thrush is financing the plot, which involves a mind-control ray, which is to be used on Washington just as the president is scheduled to speak before Congress."
}, {
  "imdbId" : "0057765",
  "season" : "4",
  "episodeNumber" : "12",
  "title" : "The Man from THRUSH Affair",
  "description" : "UNCLE sends Solo and Petros, another agent, to Irbos, an island near Greece. They discover that Dr. Killman, a Thrush scientist, has enslaved the island's population to build a new destructive device. Filene, a Thrush official who has just arrived on the island, is accidentally killed during a fight. Solo takes his place, the basis of the episode title. Meanwhile, Petros is captured. Thrush is impatient and is ready to end Dr. Killman's project, complicating Solo's situation."
}, {
  "imdbId" : "0057765",
  "season" : "4",
  "episodeNumber" : "13",
  "title" : "The Maze Affair",
  "description" : "Thrush, after an unsuccessful attempt to blow up UNCLE's New York headquarters, decides on a more elaborate scheme. The title refers to how Thrush's new plan takes various twists and turns. If Solo and Kuryakin don't figure out the puzzle, UNCLE headquarters will be demolished."
}, {
  "imdbId" : "0057765",
  "season" : "4",
  "episodeNumber" : "14",
  "title" : "The Deep Six Affair",
  "description" : "Thrush covets a new nuclear submarine, which will be launched from England. The criminal organization also employs the woman who is engaged to marry Brian Morton, UNCLE's top enforcement agent in Europe. Waverly joins Solo and Kuryakin in England and takes a direct role in the affair."
}, {
  "imdbId" : "0057765",
  "season" : "4",
  "episodeNumber" : "15",
  "title" : "The Seven Wonders of the World Affair: Part I",
  "description" : "Robert Kingsley, a top UNCLE official who is based in Hong Kong, mysterious disappears. He is recruiting top people in various fields. He wants to end 'the never-ending battle' between good and evil 'in favor of good'. His method: a 'docility' gas. Napoleon Solo and Illya Kuryakin are sent to find Kingsley. What Kingsley doesn't realize is his wife is allied with Thrush, which is financing his dream."
}, {
  "imdbId" : "0057765",
  "season" : "4",
  "episodeNumber" : "16",
  "title" : "The Seven Wonders of the World Affair: Part II",
  "description" : "In the series finale, Napoleon Solo and Illya Kuryakin must oppose both former UNCLE official Robert Kingsley's forces as well as Thrush. Solo, in a strongly worded talk to Kingsley's 'Seven Wonders of the World', spells out why Kingsley's dream is a nightmare. Unable to convince them, he and Kuryakin face a firing squad."
}]
