[{
  "imdbId" : "0092402",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Blipverts",
  "description" : "Top TV reporter Max Edison discovers Network 23 is experimenting with advertising that is lethal to some viewers. His boss tries to kill him and copy his mind to a controllable simulation. Instead Edison survives - and Max Headroom is born."
}, {
  "imdbId" : "0092402",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Rakers",
  "description" : "Theora's brother gets involved in \"raking\" - a violent underground sport that is a cross between skateboarding and roller-derby."
}, {
  "imdbId" : "0092402",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Body Banks",
  "description" : "While Max attempts to fill the many gaps in his and Edison's memory, a young woman goes missing, revealing the shadowy world of involuntary organ donation."
}, {
  "imdbId" : "0092402",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Security Systems",
  "description" : "The CEO of Security Systems, the world's largest security center, fears there may be danger behind the possible purchase of her company by an unknown buyer."
}, {
  "imdbId" : "0092402",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "War",
  "description" : "Edison and the Network 23 team are dumbfounded when a lesser rival network appears to be always at the scenes of recent terrorist attacks for the big ratings-drawing exclusives."
}, {
  "imdbId" : "0092402",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "The Blanks",
  "description" : "A group of unidentified anarchists who are known only as Blanks terrorize the city's central computer systems."
}, {
  "imdbId" : "0092402",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "Academy",
  "description" : "While Blank Reg publicly fights for his freedom and his life for a crime he didn't commit, Theora recruits Bryce to help track down the real culprits. But does Bryce know more about the advanced tech crime than he's willing to admit?"
}, {
  "imdbId" : "0092402",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "Deities",
  "description" : "An old flame of Edison's who has become the leader of a controversial new age church desperately wants Max's technology to help the church fulfill its shallow promises of a computer-enhanced afterlife."
}, {
  "imdbId" : "0092402",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "Grossberg's Return",
  "description" : "Grossberg wages a grim vendetta against Edison and Network 23 by taking firm control of their arch rival Network 66."
}, {
  "imdbId" : "0092402",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "Dream Thieves",
  "description" : "Following the death of an old colleague who was found literally drained of life, Edison races to expose the deadly process of recording and broadcasting dreams. But is the audience's own demand for the innovative new program too great to conquer?"
}, {
  "imdbId" : "0092402",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "Whacketts",
  "description" : "Viewers are unable to tear their eyes away from a seemingly mindless new game show called \"Whackets.\" Meanwhile, Big-Time is finally on top of the ratings. But is Big-Time just a pawn in a much larger game of addiction?"
}, {
  "imdbId" : "0092402",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "Neurostim",
  "description" : "Zik Zak comes up with a new promotional giveaway called the Neurostim bracelet which implants the perfect life into your imagination and gives you the drive to make it happen no matter what the cost."
}, {
  "imdbId" : "0092402",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "Lessons",
  "description" : "Education becomes a crime when Blanks start pirating elite educational programming for poor children."
}, {
  "imdbId" : "0092402",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "Baby Grobags",
  "description" : "An old friend of Theora's goes to the lab to pick up her in vitro baby only to find out it's been kidnapped. Theora and Edison make it their personal mission to expose the truth behind the disappearances of other babies."
}]