[{
  "imdbId" : "0108758",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "First Contact",
  "description" : "Devon Adair and her crew are searching a new home for the human race. The colonization of \"Earth 2\" is difficult. Some government forces want to destroy the ship of the colonists. But they manage to escape and arrive in orbit around \"Earth 2\". There the crew has to face some technical problems and they crash land on the planet. Soon they find out that the Earth like planet is inhabited by intelligent humanoid life forms..."
}, {
  "imdbId" : "0108758",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "The Man Who Fell to Earth (Two)",
  "description" : "With narration by Danziger, the colonists discover more from the indigenous humanoid aliens, and find a human, Gaal, who claims creatures beat him near death. He also claims to be an astronaut that landed on planet G889, but several are uncertain of his truthfulness and suspicious of him. But the colonists believe they cannot leave a human behind, so they invite him to join them on the journey to New Pacifica. He teaches them that the Koba's poison doesn't kill them, but leaves them in a coma like state for several days. They race back to recover the Commander, whom ..."
}, {
  "imdbId" : "0108758",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Life Lessons",
  "description" : "With narration by True, Gaal tries to gain her confidence in order to obtain a vehicle. Meanwhile Yale searches for the meaning of Gaal's E2 tattoo. Finally Danziger must find his daughter and confront Gaal."
}, {
  "imdbId" : "0108758",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Promises, Promises",
  "description" : "With narration by Alonzo, Uly's health severely deteriorates as the Terrians suffer under Gaal's use of shock collars on them. After a scouting trip, Denziger leads a party to confront Gaal again and help to heal Uly."
}, {
  "imdbId" : "0108758",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "A Memory Play",
  "description" : "With narration by Adair, the colonists find other crew members dead or gravely ill. As Dr. Heller searches for the cause and cure for the illness, Adair considers whether the ship was sabotaged."
}, {
  "imdbId" : "0108758",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Natural Born Grendlers",
  "description" : "With narration by Yale, some problems intensify. Morgan seeks to escape reality, Alonzo suffers from severe depression, and the colonists need to supplement their food supply. Bess now tries to barter with a Grendler."
}, {
  "imdbId" : "0108758",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Water",
  "description" : "With narration by Bess, the colonists face a dwindling water supply. Having a scan showing water 12Km away, Adair and Danzinger take 6 empty drums and ride the dune-rail, but encounter Terrians."
}, {
  "imdbId" : "0108758",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "The Church of Morgan",
  "description" : "With narration by Julia, the feeling of loneliness is adversely affecting the marriage status of Morgan and Bess. Meanwhile, at the urging of Reilly, Dr. Heller addresses the growing symbiosis between Uly and the Terrians."
}, {
  "imdbId" : "0108758",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "The Enemy Within",
  "description" : "Julia hopes the secret injection of Uly's DNA will make her the link to the Terrians. When her V.R. visit with Reilly is disclosed by True, Julia's conflict of Project-physician/Council-patriot is considered by the group."
}, {
  "imdbId" : "0108758",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "Redemption",
  "description" : "With narration by Devon, Alonzo seeks and returns Julia to the camp. Yale is then the first to be shot by a deadly assailant, identified later by Reilly as a Z.E.D. The group must now find him and stop the threat."
}, {
  "imdbId" : "0108758",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "Moon Cross",
  "description" : "With narration by Alonzo, the approaching winter prompts Uly to reveal the location of Mary's garden, a vacated dome. Alonzo later meets Mary, a woman whose strange past is revealed when the moons cross in the sky."
}, {
  "imdbId" : "0108758",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "Better Living Through Morganite: Part 1",
  "description" : "With narration by Morgan, the group finds a new remarkable substance, which he names Morganite. As Yale increasingly appears to become a danger to others, Morgan sets the geolock, which petrifies a 1Km zone."
}, {
  "imdbId" : "0108758",
  "season" : "1",
  "episodeNumber" : "13",
  "title" : "Better Living Through Morganite: Part 2",
  "description" : "With narration by Morgan, Mary appears with the Terrians who want retribution against Bess, Morgan and Yale. As the group struggles to break the lock code and restore the affected area, the sun stones reveal the truth of Yale's past."
}, {
  "imdbId" : "0108758",
  "season" : "1",
  "episodeNumber" : "14",
  "title" : "Grendlers in the Myst",
  "description" : "With narration by Danziger, the scouts chase a Grendler to locate its stash. The group also receives mysterious transmissions by a Dell to a Whalen and a primitive hut is found. Finally, True learns the truth about her mother."
}, {
  "imdbId" : "0108758",
  "season" : "1",
  "episodeNumber" : "15",
  "title" : "The Greatest Love Story Never Told",
  "description" : "Having gotten lost and dragged into a cave, Danziger lies ill in a bed. As stipulated through a dream, Devon seeks to search for him alone and meets Sheppard, who surprisingly knows her very well."
}, {
  "imdbId" : "0108758",
  "season" : "1",
  "episodeNumber" : "16",
  "title" : "Brave New Pacifica",
  "description" : "After the group plans to scout ahead toward New Pacifica, a Grendler ransacks Julia's medical supplies and later kidnaps her. Devon, Danziger and Alonzo search to find where she is and why the Grendler can obtain seawater."
}, {
  "imdbId" : "0108758",
  "season" : "1",
  "episodeNumber" : "17",
  "title" : "The Boy Who Would Be Terrian King",
  "description" : "As Uly celebrates his ninth birthday, his adult self from the future contacts Devon to persuade her to help him evade the authorities determined to wipe his Terrian-traits from his DNA. Meanwhile, Yale and True nurse a sick koba to health."
}, {
  "imdbId" : "0108758",
  "season" : "1",
  "episodeNumber" : "18",
  "title" : "After the Thaw",
  "description" : "(Day 109) While foraging for food during the harsh winter, Julia finds a Terrian body frozen in the ice. The hope of learning more about the native inhabitants turns to fear as strange things start to happen around the camp."
}, {
  "imdbId" : "0108758",
  "season" : "1",
  "episodeNumber" : "19",
  "title" : "Survival of the Fittest",
  "description" : "With narration by Danziger, a scout team, in search for much needed supplies, finds that Cargo Pod 09 has been completely looted. Now in need of rescue after crashing the Rail, Danziger and Alonzo pursue a Grendler for its stash."
}, {
  "imdbId" : "0108758",
  "season" : "1",
  "episodeNumber" : "20",
  "title" : "Flower Child",
  "description" : "Scouting in all directions, Danziger, Bess and Morgan come upon colorful flower buds which burst open throwing a golden powder in their faces. The flower pollen carries a sickness that causes them to emit a golden vapor."
}, {
  "imdbId" : "0108758",
  "season" : "1",
  "episodeNumber" : "21",
  "title" : "All About Eve",
  "description" : "Facing an unknown illness where they progressively deteriorate, the colonists find the remains of a Venus class Council research ship containing several cold sleep crypts. The 2 survivors are distressed they are not back on Earth."
}]