[{
  "imdbId" : "0813715",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Unaired Premiere Episode",
  "description" : "In New York, Peter Petrelli is the younger brother of Nathan Petrelli, an overly ambitious and unscrupulous candidate for the next New York congressman. Peter begins having strange dreams and begins to believe that he can fly, but Nathan is skeptic to his younger brother's claims. Peter decides to prove his theory and jumps from the roof of a building in an alley and his brother flies and saves him... revealing that Nathan has the ability to fly, not Peter. In Texas, cheerleader Claire Bennet learns that she is literally indestructible and can not harm herself or die...."
}, {
  "imdbId" : "0813715",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Chapter One 'Genesis'",
  "description" : "In Manhattan, Peter Petrelli is the younger brother Nathan Petrelli an overly ambitious and unscrupulous candidate for the next New York congressman, and he dreams and believes that he can fly. He decides to prove his theory and jumps from the roof of a building in an alley and his brother flies and saves him. In Texas, cheerleader Claire Bennet learns that she is literally indestructible and can not harm herself or die. She saves a fireman in a fire in a train, but does not take the credit. In Tokyo, Hiro Nakamura believes he can control time and space continuum. In ..."
}, {
  "imdbId" : "0813715",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Chapter Two 'Don't Look Back'",
  "description" : "When Nikki wakes up, she sees the two criminals dead in her garage. She brings her son and finds a brand new Cadillac in her name and the bodies in the trunk, with instructions and a map to bury the corpses in the desert. Peter awakes in the hospital and his mother tells him that his father was depressed and committed suicide. When Peter decides to jump from the terrace of his building, his brother Nathan discloses that both can fly. Hiro is teleported to the Times Square and finds a comic book written by Isaac Mendez telling his saga. He goes to Isaac studio, finds ..."
}, {
  "imdbId" : "0813715",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Chapter Three 'One Giant Leap'",
  "description" : "As the \"Heroes\" continue to test their newfound extraordinary abilities, Claire tries to maintain a normal social life when a romance with the football quarterback takes a tragic turn. While Hiro convinces his friend that they are destined to travel to America to save the world, a frightened Niki follows instructions from a mysterious, unknown source that directs her to the middle of the desert. Meanwhile, Nathan uses Peter's accident to propel his political campaign. The elusive Sylar is being hunted by both Matt and the FBI, as well as Suresh, whose father's journal..."
}, {
  "imdbId" : "0813715",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Chapter Four 'Collision'",
  "description" : "Suresh finally tracks down one of his father's fabled genetically advanced \"supermen.\" In Las Vegas, Hiro's plan backfires when he cautiously turns time to his advantage at the gambling tables. Niki's mafia debtors use their leverage to their benefit in a more elaborate scheme, while Nathan pays a personal visit to a wealthy Vegas contributor to raise additional campaign funds. Following a tragic turn at a bonfire, Claire's uncanny healing abilities are put to the ultimate test, but according to Isaac's paintings, her future could be fraught with even more peril. ..."
}, {
  "imdbId" : "0813715",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Chapter Five 'Hiros'",
  "description" : "Niki is questioned by police about her fugitive husband's whereabouts; Matt's relationship with his wife, Janice, benefits from his mind-reading abilities; Claire divulges her secret to her father; Hiro has a violent run-in with Las Vegas high rollers; Peter receives a life-changing message; and Mohinder contemplates leaving New York---and his father's research---behind."
}, {
  "imdbId" : "0813715",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Chapter Six 'Better Halves'",
  "description" : "Hiro and his buddy embark on their heroic journey to New York, when they are stopped by a Vegas high-roller who offers them a deal they can't refuse. As H.R.G sets up a meeting for his daughter Claire with her biological parents, she hopes that questions about her newfound indestructibility can be answered. Meanwhile, Isaac receives another confusing call from Hiro, but Peter is there this time to pick up the phone and relay a life-saving message. Suresh bids farewell to Eden as he heads back to India to bury his father. An unexpected visitor shows up at Niki's home."
}, {
  "imdbId" : "0813715",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Chapter Seven 'Nothing to Hide'",
  "description" : "Lyle Bennett learns of his sister Claire's secret after watching her video of her trying to kill herself. Hiro Nakamura helps D.L. Hawkins save a woman from a burning car by freezing time. Isaac Mendez has gone M.I.A. with his painting."
}, {
  "imdbId" : "0813715",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "Chapter Eight 'Seven Minutes to Midnight'",
  "description" : "Back in India Mohinder has weird dreams about his parents. Audrey and Matt talk to Ted."
}, {
  "imdbId" : "0813715",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "Chapter Nine 'Homecoming'",
  "description" : "As Homecoming approaches in Odessa, Claire's father makes an effort to save Claire's life. Peter, having tried to contact Hiro, flies to Texas in his effort to save the cheerleader. Hiro decided to head back in time in an effort to save the waitress, and Suresh can't get a dream out of his head and feels it has some answers about him and his father."
}, {
  "imdbId" : "0813715",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "Chapter Ten 'Six Months Ago'",
  "description" : "Claire Bennett is at home reading when the cheer leading captain walk in with a uniform and informs Claire that another cheerleader dropped out and the spot is hers if she wants it. Hiro Nakamura has traveled back in time to the Texas diner but realize he can't after she tells him she has a terminal disease. Nathan Petrelli and Peter Petrelli are preparing to take down their dad D.L. Hawkins and Niki Sanders are newly weds. Chandra Suresh has come to America to find and contact the people he thinks have taken an evolutionarily step. Sylar is the first but doesn't ..."
}, {
  "imdbId" : "0813715",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "Chapter Eleven 'Fallout'",
  "description" : "The question on everyone's mind regarding the cheerleader is that, since she's still alive, does the bomb still go off? This is especially true for Hiro, who meets with Isaac to discuss their next course of action. Having confessed her abilities to her father, Claire seeks other answers that her friends and family can not give. Having captured Sylar, Claire's father keeps him in a room of total darkness, totally unaware of Sylar's true strength."
}, {
  "imdbId" : "0813715",
  "season" : "1",
  "episodeNumber" : "13",
  "title" : "Chapter Twelve 'Godsend'",
  "description" : "Nathan stops at nothing when it comes to getting some kind of help for his unconscious brother. Hiro goes on a hunt for the sword he's seen in Isaac's paintings. Nikki tries to convince the police of her need for help in dealing with her split personality."
}, {
  "imdbId" : "0813715",
  "season" : "1",
  "episodeNumber" : "14",
  "title" : "Chapter Thirteen 'The Fix'",
  "description" : "Peter Petrelli learns the man in his dream is one of them and has the power to stay invisible. Niki Sanders is given a shot to sedate her. Hiro is determined to find the Samurai Sword. Nathan Petrelli goes to Mohinder Suresh to see if he can help Peter control his power. Zach goes to help Claire Bennet hack her father's computer in order to learn about her real mom and dad, but he and Claire are forced to lie about why he is there when Mr. Bennet comes home from work early. When Hiro Nakamura and Ando go to pick up the car, they are taken hostage. A psychiatrist ..."
}, {
  "imdbId" : "0813715",
  "season" : "1",
  "episodeNumber" : "15",
  "title" : "Chapter Fourteen 'Distractions'",
  "description" : "Claire finds it increasingly difficult to keep lying to her father, all the while knowing exactly what has happened all around her, while she makes plans to visit her biological mother. Nikki's husband makes a deal for her release. Hiro's father wants him to return to Japan, and he scrambles to find a way to stay his own course, searching for the sword. Peter convinces Claude to help him understand his own powers, including Claude's invisibility."
}, {
  "imdbId" : "0813715",
  "season" : "1",
  "episodeNumber" : "16",
  "title" : "Chapter Fifteen 'Run!'",
  "description" : "While the scandalous truth about Claire's real father is revealed, her adoptive mother faces a crisis. Matt takes a job as a bodyguard for a crooked attorney, which puts him in the cross hairs of Linderman's new assassin. Hiro and Ando return to Las Vegas to find the sword, but get sidetracked by a damsel in distress. Suresh finds someone on the list and unknowingly puts himself in grave danger. Meanwhile, Simone turns to some unlikely help in her and Nathan's struggle to find Peter."
}, {
  "imdbId" : "0813715",
  "season" : "1",
  "episodeNumber" : "17",
  "title" : "Chapter Sixteen 'Unexpected'",
  "description" : "Peter painfully learns that someone close may have betrayed him and Claude. Matt's world spirals out of control when radioactive man Ted Sprague and Hana Gitelman, a fierce young woman with \"wireless\" mental abilities, drop into his life. After blood is spilled, Hiro makes a difficult decision about his mission. Claire is unable to contain her anger at her father."
}, {
  "imdbId" : "0813715",
  "season" : "1",
  "episodeNumber" : "18",
  "title" : "Chapter Seventeen 'Company Man'",
  "description" : "H.R.G.'s past catches up to him as Matt and Ted Sprague, come to Texas looking for answers, and take him, his wife, son and Claire hostage -- leading to a tragic, explosive showdown."
}, {
  "imdbId" : "0813715",
  "season" : "1",
  "episodeNumber" : "19",
  "title" : "Chapter Eighteen 'Parasite'",
  "description" : "With the election and NYC's destruction looming, Nathan has a disturbing face-to-face meeting with the shadowy Linderman. Hiro's attempt to steal the sword steers him into a grim new direction. Suresh makes a breakthrough on \"the list\" -- at great cost. D.L. begins to suspect all is not well at home. Isaac paints his most terrible painting yet. New \"hero\" Candice Wilmer makes an illusive debut."
}, {
  "imdbId" : "0813715",
  "season" : "1",
  "episodeNumber" : "20",
  "title" : "Chapter Nineteen '.07%'",
  "description" : "After \"helping\" Suresh search for more people with special abilities, Sylar's rampage continues with two \"heroes\" being confronted by the stronger-powered serial killer. Nathan must factor what he's learned from Linderman into difficult decisions that will shape the future -- for him, his family, New York City and the world. As Thompson uses every tool at his disposal to find Claire, Linderman drafts Jessica into his far-reaching plans. Meanwhile, Hiro's resolve to \"save the world\" strengthens in the face of a grim reality."
}, {
  "imdbId" : "0813715",
  "season" : "1",
  "episodeNumber" : "21",
  "title" : "Chapter Twenty 'Five Years Gone'",
  "description" : "This episode takes us five years into the future with Hiro and Ando. We meet a brunette Claire Bennet, a \"very different\" Matt Parkman, and a Niki/Jessica that have combined into one individual."
}, {
  "imdbId" : "0813715",
  "season" : "1",
  "episodeNumber" : "22",
  "title" : "Chapter Twenty-One 'The Hard Part'",
  "description" : "Hiro and Ando return from the future, and start looking for Mr. Isaac. Bennet, Parkman and Sprague are on their way to New York. Peter tries to convince Claire not to go to Paris, but this gets much harder when she sees Thompson with Nathan."
}, {
  "imdbId" : "0813715",
  "season" : "1",
  "episodeNumber" : "23",
  "title" : "Chapter Twenty-Two 'Landslide'",
  "description" : "Peter feels the need to control his newly absorbed power, as he overhears Sylar's thoughts on the streets of New York. Mohinder finds another hero and agrees to help find a cure for her fatal disease, as Parkman and Bennet close in on the building they are in, looking for a link that could set them free. Nikki/Jessica and DL are convinced that Linderman is behind their son's disappearance, as Linderman convinces their son to do a job for him."
}, {
  "imdbId" : "0813715",
  "season" : "1",
  "episodeNumber" : "24",
  "title" : "Chapter Twenty-Three 'How to Stop an Exploding Man'",
  "description" : "Can Sylar be stopped? Will Linderman's vision live on with Nathan? What will it take for Peter to save the world, what sacrifices will be made? With all the horrible predictions unfolding before them the heroes face moments of pain and peril in Kirby Plaza."
}, {
  "imdbId" : "0813715",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "Chapter One 'Four Months Later...'",
  "description" : "Four months after the events of Peter's explosion, we find the heroes at different places in their lives. Claire, HRG and family try to stay below the radar in their new town, but a classmate of Claire's with some powers of his own knows there's something different about her. Matt Parkman and Mohinder Suresh are now guardians of Molly Parker, who has been suffering from horrible nightmares about the man who is more evil than Sylar. Mohinder and HRG are still trying to take the company down. Kaito Nakamura and Angela Petrelli receive ominous notices of their impending ..."
}, {
  "imdbId" : "0813715",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "Chapter Two 'Lizards'",
  "description" : "At the behest of his new employers, Dr. Suresh travels to Haiti to treat a potential virus victim. The patient turns out to be a familiar face. Claire's secret may be out when a fellow student sees her regenerate a limb; that student may have his own secret however. Matt Parkman investigates a murder that affects one one of the Heroes. In 17th century Japan, Hiro is doing his best to ensure that Takezo Sensei lives up to his reputation. He has to take things into his own hands however. In Ireland, Peter Petrelli finds himself with no memory but re-discovering some of ..."
}, {
  "imdbId" : "0813715",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "Chapter Three 'Kindred'",
  "description" : "Now back from Haiti, Dr. Suresh finds that his new lab in New York is Isaac Mendez's old loft. He finds the 8th of Isaac's paintings but it holds bad news for a major character. Claire is concerned that her classmate will reveal her secret but he reveals a secret of his own. Peter Petrelli assists his newfound friends and begins to question whether he wants to know his identity and his past. Still in 17th century Japan, Hiro forces the issue with Takezo Kensei in order to ensure that he lives up to his legendary status. Niki Sanders travels to New Orleans to leave ..."
}, {
  "imdbId" : "0813715",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "Chapter Four 'The Kindness of Strangers'",
  "description" : "Micah warms his way into his cousin's heart by using his powers. Matt gets closer to finding some answers surrounding the mysterious mark on Hiro's father's photo and asks Molly to help him. Nathan's mother confesses to killing Hiro's father, and Claire grows closer to the classmate who can fly."
}, {
  "imdbId" : "0813715",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "Chapter Five 'Fight or Flight'",
  "description" : "Afraid of losing the love he thinks he's found, Peter denies his past and doesn't look in the box while an unknown woman tries to track him down. Parkman and Nathan are led to Philadelphia to track down Matt's father, unknowingly being led into a trap where Nathan stumbles into the city that blew up after all. Mohindar takes Molly to the Company in search of help for her, just as Nikki shows up, while another hero begins to discover her powers in Texas."
}, {
  "imdbId" : "0813715",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "Chapter Six 'The Line'",
  "description" : "Having lied to her father about joining the cheerleaders, Claire decides the time has come to teach the team captain a lesson when she is told that she didn't make the squad. Having convinced Monica to come to New York, Dr. Suresh isn't at all comfortable when the Company asks him use her as a guinea pig for a variant of the vaccine. The Company backs down but he learns that Niki Sanders has been assigned to work with him. Alejandro and Maya make it to the US border only to be stopped by a citizens border patrol unit. Having painted a Menendez-like painting, Peter ..."
}, {
  "imdbId" : "0813715",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "Chapter Seven 'Out of Time'",
  "description" : "Peter Petrelli finds himself in a future New York City where a virus has devastated the world's population. As he gradually regains him memory, he recognizes his mother who urges him to use his Hiro-like powers to go back in time and stop the virus before it begins. Claire and West's relationship reaches a crisis point when West realizes that her father is the same man who once kidnapped him. Suresh's loyalty to HRG man is starting to wear thin and he finally admits what he has been up to. Nathan learns that brother Peter is alive. Matt Parkman finally confronts his ..."
}, {
  "imdbId" : "0813715",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "Chapter Eight 'Four Months Ago...'",
  "description" : "In flashbacks, we learn what happened to the heroes in the four months after the events at Kirby Plaza. Maja learns of her deadly powers at her brother Alejandro's wedding. Niki starts a Company-sponsored drug program but stops taking the medication only to realize that another hidden personality has emerged. Imprisoned by the Company, Peter Petrelli meets the now familiar Adam Monroe and we learn how he ended up in the shipping container destined for Ireland."
}, {
  "imdbId" : "0813715",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "Chapter Nine: Cautionary Tales",
  "description" : "Hiro learns of his father's death and travels back in time to save him only to realize that he must let events unfold as fate intended. He does however recognize his father's killer. Matt Parkman realizes that he has the ability to implant thoughts in other people's minds. He wants to know the identity of the woman in the photo with his father. When Bob and Suresh kidnap Claire Bennet, HRG and West set out to rescue her but get their own bargaining chip beforehand."
}, {
  "imdbId" : "0813715",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "Chapter Ten 'Truth & Consequences'",
  "description" : "Peter Petrelli and Adam Monroe track down another founding member of the Company and learn the location of virus 183. Maya learns how to control her powers but Alejandro' distrust of Sylar leads to a deadly confrontation. Niki returns to New Orleans and tells Micah about her medical condition. When his backpack is stolen, Micah and Monica set off to retrieve it, but things don't work out as planned. Hiro decides to avenge his father's death and goes after Adam. Claire, grieving over her father's death, decides to go public with her powers in a bid to stop the Company."
}, {
  "imdbId" : "0813715",
  "season" : "2",
  "episodeNumber" : "11",
  "title" : "Chapter Eleven 'Powerless'",
  "description" : "Nathan, Matt and Hiro confront Peter and Adam at the Company's facility in Odessa, TX where Adam's intentions become apparent. Micah confides in his mother and working together, he and Niki set off to rescue Monica but with deadly results. Maya and Sylar visit Dr. Suresh and she finally realizes what Sylar is really up to. Noah Bennet visits his family and begs Claire not to publicly reveal her secret."
}, {
  "imdbId" : "0813715",
  "season" : "3",
  "episodeNumber" : "1",
  "title" : "Chapter One 'The Second Coming'",
  "description" : "In order to change the course of history, a scared and cynical Peter Petrelli travels back in time from four years to the day his brother Nathan revealed the existence of the super-humans and was the one who shot him. In attempting to capture future Peter, Matt Parkman gets teleported to a desolate African landscape. In Japan, Hiro takes control of his father's company when, courtesy of a DVD, he and Ando receive instructions from Hiro's late father about a deadly secret contained in the office safe. Hiro can't help but open the safe and the contents are promptly ..."
}, {
  "imdbId" : "0813715",
  "season" : "3",
  "episodeNumber" : "2",
  "title" : "Chapter Two 'The Butterfly Effect'",
  "description" : "A egoistical and super-charged Sylar goes to the Company to kill all the leaders, and inadvertently releases 12 super-powered criminals from the place's notorious Level 5 prison block during a fight with Elle. Peter, trapped in the body of one of the criminals, is set free as well and is forced to team up with a group for a crime spree. Meanwhile, Future Peter tries to fix his mistake with Nathan, as Angela takes over the company in the wake of Bob Bishop's murder and frees Nohan Bennett to help the Company track down the 12 escapees to bring them back, or eliminate ..."
}, {
  "imdbId" : "0813715",
  "season" : "3",
  "episodeNumber" : "3",
  "title" : "Chapter Three 'One of Us, One of Them'",
  "description" : "Noah Bennett is stunned when Angela Petrelli assigns him a brainwashed Sylar as his new partner to track down the escapees from the notorious Level 5, as Peter, still trapped in the body of Jesse the Sonic Man, is forced to team up with a trio of deadly super villains who are on a murderous crime spree by holding up a local bank. Future Peter eventually releases Present Peter from his body-cell and shows him his dark future. In Africa, Matt learns more about his spiritual guide, Usutu, who also has the ability to paint the future. Meanwhile, Hiro and Ando track ..."
}, {
  "imdbId" : "0813715",
  "season" : "3",
  "episodeNumber" : "4",
  "title" : "Chapter Four 'I Am Become Death'",
  "description" : "Having time-traveled four years in the future, the future Peter shows his younger counterpart that people have access to drugs that give them various super powers and some of them will destroy the world. Past Peter is forced to run from the dark and evil future versions of Claire, Daphne, and Knox, all of whom work as killers for government agencies to track him down. Past Peter is forced to look for allies and finds one in a very subdued version of Sylar. From his spot in Africa, Matt Parkman has a vision of his future in four years in which he is married to ..."
}, {
  "imdbId" : "0813715",
  "season" : "3",
  "episodeNumber" : "5",
  "title" : "Chapter Five 'Angels and Monsters'",
  "description" : "Claire attempts to destroy her first target, Stephen Canfield. Hiro attempts to become friends with Daphne."
}, {
  "imdbId" : "0813715",
  "season" : "3",
  "episodeNumber" : "6",
  "title" : "Chapter Six 'Dying of the Light'",
  "description" : "Fellow villains Knox and Daphne are sent by their emissary, Maury Parkman, on a quest to recruit Hiro and others to the Pinehearst fold. Adam Monroe is brought before the ringleader, who turns out to be the most powerful villain, who uses his power to heal. Matt Parkman arrives back in New York from his African adventure, and is confronted by Daphne with an offer to join their organization, but he instead wants a commitment from her. Hiro and Ando teleport to Africa to try to make contact with Usutu, the vision painter, for information on the persons behind all the ..."
}, {
  "imdbId" : "0813715",
  "season" : "3",
  "episodeNumber" : "7",
  "title" : "Chapter Seven 'Eris Quod Sum'",
  "description" : "Tracy and Nathan try to save themselves from a dangerous Mohinder who wants to use their synthetic power laced DNA to find a way to remove Mayas/his own powers. Mohinder turns to the dangerous, power-stealing Arthur Petrelli to help Maya, and in return, Mr. Petrelli asks for Mohinder's help in developing the secret formula to give people powers. Meanwhile, Sylar is given the task by the comatose Angela to save Peter from Arthur at Pinehearst, where he was captured and rendered powerless by his him. Also, Daphne is ordered by Mr. Petrelli to kill Matt, but finds the ..."
}, {
  "imdbId" : "0813715",
  "season" : "3",
  "episodeNumber" : "8",
  "title" : "Chapter Eight 'Villains'",
  "description" : "Under the guidance of Usutu, Hiro has a vision back in time one year ago to determine what forced Arthur Petrelli to fake his death and create Pinehearst. In the past, Hiro also watches the early days of the Company and how Mr. Petrelli and Mr. Linderman founded it, and their falling out with Angela who saw them as a threat to both Nathan and Peter. Also in the past, Meredith Gordon's origins are shown of how she was captured by Thompson to work for the Company, and of life of crime with her half-brother, whom is the blue-flame fire-starter Flint. Also, Sylar makes a ..."
}, {
  "imdbId" : "0813715",
  "season" : "3",
  "episodeNumber" : "9",
  "title" : "Chapter Nine 'It's Coming'",
  "description" : "Barely escaping from the evil and powerful Arthur Petrelli, Ando forces Hiro to teleport them back to Japan only to discover that Mr. Petrelli has erased most of Hiro's mind and who thinks he's 10-years-old, and still in school. Ando must try find a way to make Hiro remember his powers. Meanwhile, Sylar tries to reason with the captive Elle to force out her anger and to learn how to take her powers without killing her. Mr. Petrelli sends Knox and Flint out after Claire and Peter who try to find a way to outwit their pursuers. Matt Parkman tries to scan the comatose ..."
}, {
  "imdbId" : "0813715",
  "season" : "3",
  "episodeNumber" : "10",
  "title" : "Chapter Ten 'The Eclipse Part 1'",
  "description" : "Having reestablished control over the Company, Angela sends Nathan and Peter to Hatai to find the power-suppressing Hatian to bring him back to the USA to help in their fight against Arthur Petrelli and the evil Pinehurst. Hiro and Ando travel to New York to come back into the fold and ask for Parkman's help. Hiro, having lost part of his mind, but not his powers, teleports himself, Ando and Parkman to Kansas to Daphine's home to find out what Mr. Petrelli has on her. Also, Sylar teams up with Elle to try to capture Clare to bring her to Pinehurst to give her to ..."
}, {
  "imdbId" : "0813715",
  "season" : "3",
  "episodeNumber" : "11",
  "title" : "Chapter Eleven 'The Eclipse - Part 2'",
  "description" : "In Haiti, Peter and the Haitian try to rescue Nathan who has been captured by the sinister Baron Samdei and his militia army. At Pinehurst, Mohinder finds himself a captive by Arthur who wants his powers back for a grand master plan, in which Mohinder attempts to find Maya to ask for help since she may be powerless too. In Kansas, Matt Parkman learns the true nature of Daphne without her super speed, while Ando and an immature Hiro seek answers to their powerlessness in a comic book store in the late Isaac Mendez's '9th Wonders' series detailing their conflict as it ..."
}, {
  "imdbId" : "0813715",
  "season" : "3",
  "episodeNumber" : "12",
  "title" : "Chapter Twelve 'Our Father'",
  "description" : "Having traveled back in time 16 years, the immature Hiro seeks out his late mother to try to get his memories back, while Claire has a run-in with a younger Noah Bennett when he was assigned by the company to look after the infant Claire and how she may have become the catalyst for the secret formula. Back in the present, Nathan returns to Pinehurst where Tracy introduces him to a group of U.S. Marines that Arthur has recruited to be his army of super-solders once Mohinder gets the catalyst for the ability-giving formula correct and which hopes the formula will be ..."
}, {
  "imdbId" : "0813715",
  "season" : "3",
  "episodeNumber" : "13",
  "title" : "Chapter Thirteen 'Dual'",
  "description" : "Noah, Claire, Angela, and Meredith find themselves trapped at the Primatech by Sylar who locks them in the building and subjects them all to various mind games. Meanwhile, Matt, Daphne, and Ando seek refuge at the Mendez loft where Daphne plans to steal a sample of the power-giving formula to give to Ando who wants to rescue the powerless Hiro still trapped 16 years in the past, who continues to struggle to find his true origins with his younger self. Back in the present, Peter faces off against Nathan, Tracy and the security detail at Pinehurst to stop Mohinder from ..."
}, {
  "imdbId" : "0813715",
  "season" : "3",
  "episodeNumber" : "14",
  "title" : "Chapter One 'A Clear and Present Danger'",
  "description" : "Two months after the destruction of both the Primatech and Pinehurst, and the death of Arthur Petrelli, the now-villainous Nathan returns with a vengeance by persuading the U.S. President and the government to round up all people with abilities for containment and disposal, leading to Claire, Ando, Peter, as well as Tracy to become fugitives from the people who were their former allies. In Japan, a powerless Hiro tries to live through the super-charger Ando as his latest partner. In New York, Peter struggles to find a life for himself as a paramedic, but finds that ..."
}, {
  "imdbId" : "0813715",
  "season" : "3",
  "episodeNumber" : "15",
  "title" : "Chapter Two 'Trust and Blood'",
  "description" : "Following the plane crash, the surviving heroes must team up with one another to try to survive the manhunt. Claire is quickly captured by Noah who takes charge of a \"kill squad\" to find the remaining people with abilities while Nathan deals with the overzealous 'hunter' Emile Danko whom becomes obsessed with tracking down all people with special abilities in his own lethal way. Mohinder and a powerless Hiro must rely on Matt Parkman's spiritual guide to help them. Daphne makes contact with Ando to help her find Matt, unaware of the people now targeting them. In New ..."
}, {
  "imdbId" : "0813715",
  "season" : "3",
  "episodeNumber" : "16",
  "title" : "Chapter Three 'Building 26'",
  "description" : "Imprisoned inside the super-secret 'Building 26' which is Nathan's base of operations to experiment and terminate people with abilities, Tracy struggles to survive various \"heat\" experiments as well as wait for an opportunity to try to escape. While the ruthless Hunter Davko obsessively continues to track down the heroes with the obsession of killing them all, Nathan deals with the President of the USA who begins to investigate Nathan's activities and tactics to hunt down the \"targets\". Meanwhile, Syler continues his quest to locate his biological father with both ..."
}, {
  "imdbId" : "0813715",
  "season" : "3",
  "episodeNumber" : "17",
  "title" : "Chapter Four 'Cold Wars'",
  "description" : "Peter, Matt, and Mohinder drug and abduct Noah \"H.R.G.\" Bennet and hold him captive in a seedy motel room so Matt can interrogate him to find out more about the people hunting them down, but predictably, it does not go as planned as Benett plans to turn them against each other, while Nathan and the sadistic Danko are looking for him. Noah's background story is revealed about how Nathan approached him to help the government's plan to round up people with special powers, and his awkward alliance with Danko who has his own agenda... as does Nathan."
}, {
  "imdbId" : "0813715",
  "season" : "3",
  "episodeNumber" : "18",
  "title" : "Chapter Five 'Exposed'",
  "description" : "Following a tip from their anonymous source \"Rebel\", Matt and Peter hurry to rescue Daphne from the holding facilities in 'Building 26' in Washington, and to find evidence that may expose the government's plans to capture those with powers. Meanwhile, Sylar uncovers the truth about his mother after he experiences past memories of his father at a disused diner located deep in the New Mexico desert which makes him dump Luke and head off to look for his biological father. In California, Claire must find a way to sneak Alex out of her house which is under observation by ..."
}, {
  "imdbId" : "0813715",
  "season" : "3",
  "episodeNumber" : "19",
  "title" : "Chapter Six 'Shades of Gray'",
  "description" : "Now on his own, Sylar finally finds his biological father, Samson Gray, a reclusive, lung-cancer ridden taxidermist, to confront him with questions about his past, but soon learns that Samson is not who he appears to be. Meanwhile, Nathan continues to lock horns with Danko over the hunter's tactics to eliminate people with abilities, after he tries to frame Parkman for an attempted suicide bombing. This leads to both Nathan and Danko going behind each others back to unseat the other. Nathan becomes wary about Danko going rogue and the hunter interrogating Tracy, as ..."
}, {
  "imdbId" : "0813715",
  "season" : "3",
  "episodeNumber" : "20",
  "title" : "Chapter Seven 'Cold Snap'",
  "description" : "The identity of \"Rebel\" is revealed with chilling consequences - Emmy Award-Winner Zeljko Ivanek, Brea Grant and Swoosie Kurtz Guest Star."
}, {
  "imdbId" : "0813715",
  "season" : "3",
  "episodeNumber" : "21",
  "title" : "Chapter Eight 'Into Asylum'",
  "description" : "Denko is approached by Sylar with an offer to help him to find an elusive shape-shifting person, despite the fact that they don't trust each other. Meanwhile, Peter and Angela hide out in a church where she seeks a path of redemption from everything that she has allowed to happen to her, while Bennett is put in charge of finding both of them. In Mexico, Clare and Nathan hide out in a seedy motel where she takes advantage of her own abilities to win money in a drinking shot contest when they run short on money."
}, {
  "imdbId" : "0813715",
  "season" : "3",
  "episodeNumber" : "22",
  "title" : "Chapter Nine 'Turn and Face the Strange'",
  "description" : "Hiro and Ando set out to find Matt Parkman with his infant son, but soon learn that the infant's powers hinder their travel plans. Meanwhile, the shape shifting Sylar begins to use his new powers to harass Bennet by impersonating his wife, Sandra, knowing he will find out. An angry Matt Parkman begins investigating the sadistic Danko to see revenge for Daphne's death and learns more about his pursuer when he meets his Slavic girlfriend Alena. Mohinder learns more about his father's work about a mysterious place called Coyote Sands in which Angela and Peter make ..."
}, {
  "imdbId" : "0813715",
  "season" : "3",
  "episodeNumber" : "23",
  "title" : "Chapter Ten '1961'",
  "description" : "Angela has nightmares. She gets the family to go back to Coyote Sands with her to dig up graves, and find her sister."
}, {
  "imdbId" : "0813715",
  "season" : "3",
  "episodeNumber" : "24",
  "title" : "Chapter Eleven 'I Am Sylar'",
  "description" : "Sylar begins to feel confused and more uncertain about himself when his new shape-changing powers begins to get out of control. He begins to imagine his late mother giving him advice on what to do, while Danko continues to use him to find and kill people with abilities and wants to zero in on 'Rebel'. When Sylar discovers that Rebel is in fact Micah Sanders, he saves him. Sylar decides to change his ways after figuring out that Danko is plotting a so-called 'Final Solution' to exterminate all people with abilities once and for all. Meanwhile, Parkman plans to return ..."
}, {
  "imdbId" : "0813715",
  "season" : "3",
  "episodeNumber" : "25",
  "title" : "Chapter Twelve 'An Invisible Thread'",
  "description" : "Nathan and Peter try to find the shape-shifting Sylar before he can make contact with the President and assume his form as well. Clare goes off to try to stop Sylar on her own, only to end up as a captive. Meanwhile, Hiro and Ando make a rash attempt at stopping time so they can break into Building 26. They hope to free those that still survive and have powers, while Danko, framed by Sylar for the murder of an agent, has a talk with Noah Bennett over their views on fighting this war. Elsewhere, Angela meets with Matt to ask for his help to save Nathan, when she has a ..."
}, {
  "imdbId" : "0813715",
  "season" : "4",
  "episodeNumber" : "1",
  "title" : "Chapter One 'Orientation'",
  "description" : "Claire, back home in California, begins attending college, but is having difficulty adjusting when a mysterious death of a student during the orientation puts her back in the spotlight. In Japan, Hiro and Ando continue their quest to help people with abilities and go so much as to advertise themselves. Meanwhile, Angela fears Nathan/Syler will discover his true identity. Matt tries to settle down back in Los Angeles and raise his son and not worry about unexpected visitors. Elsewhere, Peter is using his ability for good when a mysterious carnival clan, led by Samuel ..."
}, {
  "imdbId" : "0813715",
  "season" : "4",
  "episodeNumber" : "2",
  "title" : "Chapter One 'Jump, Push, Fall'",
  "description" : "Peter returns to his job as a paramedic, saving people with the help of Mohinder's abilities. In Japan, Hiro feels that he is not in control of his power and believes himself to be dying. Meanwhile, Samuel, Lydia and Edgar use their abilities to find other Heroes in their quest to bring more into their fold. Also, Tracy continues to hunt down and kill former Building 26 employees by using her new water-liquidation powers to drown them, and she zeros in on Danko, as well as Noah. Clare deals with her secret being revealed by a student who witnesses her fall from a ..."
}, {
  "imdbId" : "0813715",
  "season" : "4",
  "episodeNumber" : "3",
  "title" : "Chapter Two 'Ink'",
  "description" : "Samuel continues searching for the whereabouts of the soul of his brother. He begins to focus on Peter by using his ink-transparency powers to investigate Peter. Meanwhile, Claire deals with her secret being outed when Gretchen pressures her to tell the truth. But Noah, comes for a visit and immediately suspects that Gretchen knows about Clair's power. In Los Angeles, Matt Parkman continues dealing with Sylar's ghost taunting him and it hinders his latest case of trying to nail a suspected drug supplier. Also, a new 'hero' with powers is introduced; a young deaf woman..."
}, {
  "imdbId" : "0813715",
  "season" : "4",
  "episodeNumber" : "4",
  "title" : "Chapter Three 'Acceptance'",
  "description" : "As Hiro's life continues to hang in the balance, he distracts himself with saving the lives of others. Meanwhile, Angela tries to help the new \"Nathan\" remember his past, at the risk of his remembering too much. Elsewhere, Tracy is determined to get her old job back, but soon realizes that she needs to make more of an impact."
}, {
  "imdbId" : "0813715",
  "season" : "4",
  "episodeNumber" : "5",
  "title" : "Chapter Four 'Hysterical Blindness'",
  "description" : "Samuel prepares for new additions to his family, while Lydia warns him of the consequences. Claire discovers that her roommate Gretchen may have a hidden agenda. Meanwhile, Peter finds an unexpected way to connect with Emma, who would prefer to stay distant. Elsewhere, a different side of Sylar emerges as he desperately tries to remember the person he used to be."
}, {
  "imdbId" : "0813715",
  "season" : "4",
  "episodeNumber" : "6",
  "title" : "Chapter Five 'Tabula Rasa'",
  "description" : "Under Samuel's guidance, Sylar starts on a path to rediscover his true identity. Hiro helps Emma accept and understand the great possibilities that go along with having an ability. Meanwhile, Peter enlists HRG to help him find a healer who can save Hiro's life."
}, {
  "imdbId" : "0813715",
  "season" : "4",
  "episodeNumber" : "7",
  "title" : "Chapter Six 'Strange Attractors'",
  "description" : "Matt goes to extreme measures to extinguish Sylar, who continues to torment him. Elsewhere, H.R.G. calls in a favor from Tracy to save a troubled young boy whose misfortunes resemble her own. While Claire and Gretchen are being hazed by their new sorority sisters, they realize pledging might not be their biggest problem."
}, {
  "imdbId" : "0813715",
  "season" : "4",
  "episodeNumber" : "8",
  "title" : "Chapter Seven 'Once Upon a Time in Texas'",
  "description" : "When Hiro travels three years into the past, he has a second chance to save Charlie from the hands of Sylar. However, Samuel's presence serves to complicate Hiro's mission even further. Elsewhere, H.R.G.'s past with his Primatech partner is revealed."
}, {
  "imdbId" : "0813715",
  "season" : "4",
  "episodeNumber" : "9",
  "title" : "Chapter Eight 'Shadowboxing'",
  "description" : "Claire is determined to get to the bottom of the Sorority Rush attacks on her own, until H.R.G. intervenes only to realize he may be the source of her troubles. Meanwhile, Peter's new ability is a perfect fit for his job and gives him the opportunity to help Emma accept her new life. Elsewhere, Sylar's battle at gaining full control over Matt's body escalates -- with potentially dangerous implications at stake."
}, {
  "imdbId" : "0813715",
  "season" : "4",
  "episodeNumber" : "10",
  "title" : "Chapter Nine 'Brother's Keeper'",
  "description" : "Samuel learns just how powerful he can become and takes dangerous measures to reach his full potential. Meanwhile, as Tracy begins to lose control of her ability, one of her own comes in harms way."
}, {
  "imdbId" : "0813715",
  "season" : "4",
  "episodeNumber" : "11",
  "title" : "Chapter Ten 'Thanksgiving'",
  "description" : "H.R.G. hosts a non-traditional Thanksgiving dinner by inviting Claire over at his apartment for dinner. But the dinner becomes more awkward and uncomfortable when Noah invites his former co-worker Lauren, while Noah's ex-wife, Sandra, also shows up with her newest beau, a younger man named Doug Douglas, whom like her also has a small dog fetish. Clair is also conflicted about where she wants to be, in which Noah invites over Gretchen to try to lift up her spirits. Meanwhile, the Petrelli family gets a surprise guest at their table when Sylar shows up having reclaimed ..."
}, {
  "imdbId" : "0813715",
  "season" : "4",
  "episodeNumber" : "12",
  "title" : "Chapter Eleven 'The Fifth Stage'",
  "description" : "H.R.G. is greeted by some unexpected visitors and Samuel's grand plan begins to come to fruition. Meanwhile, Peter struggles to accept the truth and takes extreme measures to get what he wants. Elsewhere, Claire's journey leads her to an unexpected destination."
}, {
  "imdbId" : "0813715",
  "season" : "4",
  "episodeNumber" : "13",
  "title" : "Chapter Twelve 'Upon This Rock'",
  "description" : "Samuel goes off and tries to bring Emma into the fold by manipulating her about how special her sight-of-sound powers are, while back at the Sullivan Brothers Carnival, Claire becomes more suspicious about Samuel's intentions and deals with not only Samuel's right hand, Replicating Man, Eli, but also the Puppet Master Eric Doyle. A delirium-stricken Hiro returns to Japan and tries to convince Ando in code-talk to help rescue Mohinder from a lunatic asylum in Florida where Hiro forcibly placed him for protection from Samuel."
}, {
  "imdbId" : "0813715",
  "season" : "4",
  "episodeNumber" : "14",
  "title" : "Chapter Thirteen 'Let It Bleed'",
  "description" : "Claire attends Nathan's funeral while Peter struggles with his grief in his own way by wanting to seek revenge. Meanwhile, Noah and Lauren interrogate a captured Edgar for information to where to find Samuel's carnival. Elsewhere, Sylar returns to Samuel's carnival where he and Lydia try to find a way to emotionally get inside the killer's head to make him see what is troubling him."
}, {
  "imdbId" : "0813715",
  "season" : "4",
  "episodeNumber" : "15",
  "title" : "Chapter Fourteen 'Close to You'",
  "description" : "H.R.G. recruits Matt to help him take down Samuel, as they use his long-lost love, Vanessa, to lure him to them, but Samuel has his own plans for Vanessa in the works. Meanwhile, Hiro and Ando go to extreme lengths to save Dr. Suresh. Elsewhere, Peter's introduction of Emma to his mother brings forth visions of a very grim future."
}, {
  "imdbId" : "0813715",
  "season" : "4",
  "episodeNumber" : "16",
  "title" : "Chapter Fifteen 'Pass/Fail'",
  "description" : "Hiro's life hangs in the balance as his brain tumor worsens, prompting him to subconsciously deal with some of his past decisions. Meanwhile, Sylar pays Claire an unexpected visit to get answers as to why he isn't quite himself. Elsewhere, Samuel's plan to impress his long-lost love, Vanessa, takes a terrifying turn."
}, {
  "imdbId" : "0813715",
  "season" : "4",
  "episodeNumber" : "17",
  "title" : "Chapter Sixteen 'The Art of Deception'",
  "description" : "H.R.G. enacts his plan to take down the Carnival with the help of Lauren and Suresh. Sylar visits Matt looking to understand his desire to make a human connection, but Matt has a plan of his own. Meanwhile, Peter warns Emma of Samuel's intentions after his grim vision of the future."
}, {
  "imdbId" : "0813715",
  "season" : "4",
  "episodeNumber" : "18",
  "title" : "Chapter Seventeen 'The Wall'",
  "description" : "Peter is forced to travel into Sylar's mind to ask for him to save Emma and the two of them find themselves in a limbo state-like deserted city where they try to find a way out. Meanwhile, Samuel tries to further manipulate Claire by showing the past of Noah's in image flashbacks showing his first wife, and the reasons why he came to work for The Company. Also, a wounded Lauren meets with Emma for medical treatment and to try to get her to listen about Samuel's nefarious plans."
}, {
  "imdbId" : "0813715",
  "season" : "4",
  "episodeNumber" : "19",
  "title" : "Chapter Eighteen 'Brave New World'",
  "description" : "Samuel's ultimate plan spells disaster for thousands - Ray Park, Deanne Bray and Elisabeth Rohm Guest Star."
}]