[{
  "imdbId" : "0460690",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "First Responders",
  "description" : "Bob Brown enters the Unit on a training mission in Idaho. An incident in Afghanistan had made it certain that more knowledge about mules was needed. His wife, Kim Brown, simultaneously moves into the Unit's compound where she gets a long row of shocking surprises. Amongst them, the hijacking of a grounded plane with 125 passengers close to her husband's location."
}, {
  "imdbId" : "0460690",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Stress",
  "description" : "The team, minus Bob, goes to Africa to retrieve a satellite. Meanwhile, Bob is tasked with a job he finds humiliating and is interrogated by the FBI. Kim puts aside frustration to help another wife."
}, {
  "imdbId" : "0460690",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "200th Hour",
  "description" : "Jonas is sent to Indonesia to rescue a group of American missionaries in hiding. Back at home, Bob gets caught out in a training exercise performed in front of a senator."
}, {
  "imdbId" : "0460690",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "True Believers",
  "description" : "While protecting the Mexican Drug Minister, the team shifts into high gear to rescue his family after they are kidnapped. Tiffy is upset when Mack is ordered some alone time, and Molly takes steps to protect the unit from an outside threat."
}, {
  "imdbId" : "0460690",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Non-Permissive Environment",
  "description" : "When an assassination is called off too late, the unit must separate and find their own ways home. Back at home, the Blane's daughter returns from college unexpectedly."
}, {
  "imdbId" : "0460690",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Security",
  "description" : "The team goes under cover at the Iranian embassy in Lebanon seeking evidence of the sale of nuclear materials by Russia to Iran. Tiffy is observed meeting someone at a hotel."
}, {
  "imdbId" : "0460690",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Dedication",
  "description" : "While on the way to a mission, another team's helicopter is forced to make a crash landing, and Blane must decide whether to follow orders and abandon them. Back at home, Molly discovers some disturbing things about Ron Cheals."
}, {
  "imdbId" : "0460690",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "SERE",
  "description" : "The unit takes on a grueling exercise of torture and humiliation."
}, {
  "imdbId" : "0460690",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "Eating the Young",
  "description" : "Jonas and his team must track down and destroy a shipment of surface-to-air missiles after negotiations for their purchase break down."
}, {
  "imdbId" : "0460690",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "Unannounced",
  "description" : "Bob advises Jonas to cancel a dignitary's planned visit after someone blows Bob's cover while he's training soldiers in Africa."
}, {
  "imdbId" : "0460690",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "Exposure",
  "description" : "The Day of the Dead offers the son of one of the fallen access to the team for his exposé on the unit, and one of the widows the opportunity to put Bob in a very compromising position."
}, {
  "imdbId" : "0460690",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "Morale, Welfare and Recreation",
  "description" : "The team investigates a bomb at an Atlanta bank. Bob takes Kim on a vacation."
}, {
  "imdbId" : "0460690",
  "season" : "1",
  "episodeNumber" : "13",
  "title" : "The Wall",
  "description" : "The team works with the French U.N. forces to serve a warrant on a Bosnian war criminal. Jonas discovers Molly's secret. Tiffy and Mack make decisions. Colonel Ryan makes a sudden announcement."
}, {
  "imdbId" : "0460690",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "Change of Station",
  "description" : "Tiffy and Mack deal with the consequences of his change of station, and the Unit has to stop a biological attack"
}, {
  "imdbId" : "0460690",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "Extreme Rendition",
  "description" : "The unit goes undercover in Bulgaria to find a former rogue member, and Molly makes a hard decision in order to take care of family,."
}, {
  "imdbId" : "0460690",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "The Kill Zone",
  "description" : "The unit is diverted from a mission to retrieve the body of another unit's ranger, and rescue his partner. Back at home, the wives deal with the fiancée of the dead man and his in-laws."
}, {
  "imdbId" : "0460690",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "Manhunt",
  "description" : "The Unit has to deal with an unexpected terrorist threat, while Kim is concerned after she sees her daughter speaking to an unknown teacher at her school."
}, {
  "imdbId" : "0460690",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "Force Majeure",
  "description" : "The Unit is sent into a North Carolina hurricane to rescue a brutal dictator, but a surprise awaits them at the hospital."
}, {
  "imdbId" : "0460690",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "Old Home Week",
  "description" : "The women prepare for Old Home Week, a fund raiser for the troops and their families; elsewhere the Diamond trade is used to find a terrorist, and Bob finds out a deep secret of the unit."
}, {
  "imdbId" : "0460690",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "Off the Meter",
  "description" : "A favor for Ron gets very complicated for Jonas and Bob; back at home, Tiffy's guilt causes her to take responsibility for another's accident with potentially devastating consequences."
}, {
  "imdbId" : "0460690",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "Natural Selection",
  "description" : "Bob and his translator survive a helicopter crash in remote Russia, but still must fight for their lives in extreme conditions without their gear, causing Bob to flashback to the selection process that got him into the Unit."
}, {
  "imdbId" : "0460690",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "Report by Exception",
  "description" : "The Unit is endangered when a senator leaks classified information to the press while they are on a mission to assassinate a country's oil minister."
}, {
  "imdbId" : "0460690",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "Bait",
  "description" : "Jonas has been captured in the Republic of Georgia and offers himself up as a bargaining chip for a prisoner exchange. When Colonel Ryan's efforts to gain cooperation from Washington fail, he sends the unit to make its own prisoner exchange. Meanwhile, Tiffy is facing a court trial she will surely lose. Charlotte still refuses to step up and tell the truth, but offers other help."
}, {
  "imdbId" : "0460690",
  "season" : "2",
  "episodeNumber" : "11",
  "title" : "Silver Star",
  "description" : "Jonas and his family celebrate his father winning the Silver Star, but there is trouble when a young soldier takes out his combat frustrations on his young wife. Meanwhile, Mack and Bob must help a man fly a plane after his pilot mysteriously dies."
}, {
  "imdbId" : "0460690",
  "season" : "2",
  "episodeNumber" : "12",
  "title" : "The Broom Cupboard",
  "description" : "Jonas is tasked by the President to not only keep a senator safe, but prevent her from messing with foreign policy. Back home, the women help Jeremy with a special project."
}, {
  "imdbId" : "0460690",
  "season" : "2",
  "episodeNumber" : "13",
  "title" : "Sub-Conscious",
  "description" : "Bob's first mission oversight assignment is jeopardized when Kim tells friends about a dream she had, and Jonas must deal with a reluctant captain in order to rescue a scientist."
}, {
  "imdbId" : "0460690",
  "season" : "2",
  "episodeNumber" : "14",
  "title" : "Johnny B. Good",
  "description" : "A mission where everything went wrong is dissected via flashbacks for the Major General amidst concerns of a UN inquiry, and stress affects everyone differently."
}, {
  "imdbId" : "0460690",
  "season" : "2",
  "episodeNumber" : "15",
  "title" : "The Water Is Wide",
  "description" : "Jonas and company are on a protection detail at the United Nations when several crises occur; elsewhere, Molly and Tiffy search for an MIA soldier."
}, {
  "imdbId" : "0460690",
  "season" : "2",
  "episodeNumber" : "16",
  "title" : "Games of Chance",
  "description" : "At the special operatives' version of the Olympics, Jonas and his team stumble across an actual threat; back home, Kim meets up with an old flame who throws her for a loop."
}, {
  "imdbId" : "0460690",
  "season" : "2",
  "episodeNumber" : "17",
  "title" : "Dark of the Moon",
  "description" : "When the unit is stranded with high-priority prisoners in Waziristan, they take refuge at a forward support base, but a CO who's not in command and a cocky sergeant not only jeopardize the mission but everyone's lives as well."
}, {
  "imdbId" : "0460690",
  "season" : "2",
  "episodeNumber" : "18",
  "title" : "Two Coins",
  "description" : "While in Israel to work out a solution to a suicide bomber threat, Charles falls for a soldier who takes him into danger. At home, Tiffy finds herself in a windfall and a crisis of conscience as she struggles to do what's right."
}, {
  "imdbId" : "0460690",
  "season" : "2",
  "episodeNumber" : "19",
  "title" : "The Outsiders",
  "description" : "Bob and Hector find themselves involved in tribal rituals when they are sent to Papua New Guinea to retrieve equipment; back at the base, Jonas and Mack deal with Crystal's revenge and its threat to the team."
}, {
  "imdbId" : "0460690",
  "season" : "2",
  "episodeNumber" : "20",
  "title" : "In Loco Parentis",
  "description" : "The Unit deals with a domestic school hostage situation. Tiffy's previous illicit affair begins to affect her daughter."
}, {
  "imdbId" : "0460690",
  "season" : "2",
  "episodeNumber" : "21",
  "title" : "Bedfellows",
  "description" : "While Bob is forced to make a difficult decision out in the field, Mack, convinced that Tiffy is having an affair, faces turmoil on the home front and ends up making a fateful decision."
}, {
  "imdbId" : "0460690",
  "season" : "2",
  "episodeNumber" : "22",
  "title" : "Freefall",
  "description" : "While Mack, Grey and Williams protect a Thai prince and his family on American soil, they stumble across palace intrigue, temptation, and plots inside the treacherous family that involve infidelity and murder. Can they save the Prince from his own murderous clan as well as from the external assassination attempts? Against Ryan's better judgment, a battle-worn Jonas joins Bob on a mission to bring down a terrorist leader. But after a dangerous parachute jump from over 40,000 feet, a mid-air malfunction changes Jonas' number-one mission to saving Bob's life."
}, {
  "imdbId" : "0460690",
  "season" : "2",
  "episodeNumber" : "23",
  "title" : "Paradise Lost",
  "description" : "The Team's world collapses when they return from a successful mission to discover The Unit has been shut down and all Unit members are under governmental investigation for secret misdeeds of the past. This is no security drill, no training exercise: it's the real thing, and it's a noose around the neck of every Team member. The men learn The Unit will be disbanded and the men, court-martial ed; Ryan relieved of command and retired in disgrace, and the community that Molly and the other women have worked so hard to build will be shattered and scattered to the wind."
}, {
  "imdbId" : "0460690",
  "season" : "3",
  "episodeNumber" : "1",
  "title" : "Pandemonium: Part 1",
  "description" : "The team members scramble to make sense of the disintegration of the unit, some in interrogation and others a continent away in Panama, and Colonel Ryan makes an unpleasant discovery."
}, {
  "imdbId" : "0460690",
  "season" : "3",
  "episodeNumber" : "2",
  "title" : "Pandemonium: Part Two",
  "description" : "Mack has been abducted for more torture, and the unit reunites to rescue him and clear their names."
}, {
  "imdbId" : "0460690",
  "season" : "3",
  "episodeNumber" : "3",
  "title" : "Always Kiss Them Goodbye",
  "description" : "Nerve gas is stolen and the team is sent to retrieve it - a task made more complicated when it goes airborne and the pilot is dead. Back at home, Mack and Tiffy have domestic issues that require Col. Ryan's interference."
}, {
  "imdbId" : "0460690",
  "season" : "3",
  "episodeNumber" : "4",
  "title" : "Every Step You Take",
  "description" : "Bob, Williams and Grey are charged with rescuing a group of Embassy personnel and their families who are under attack in Abidjan, while Jonas tests his daughter's strength and conviction when she decides to enlist."
}, {
  "imdbId" : "0460690",
  "season" : "3",
  "episodeNumber" : "5",
  "title" : "Inside Out",
  "description" : "Mack begins to bond with a hostage who may need to be sacrificed to save operatives' lives. Back at the base, Bob is distracted from training exercises when Kim is put on bed rest, and Tiffy resorts to an uncomfortable job when her past affects her future."
}, {
  "imdbId" : "0460690",
  "season" : "3",
  "episodeNumber" : "6",
  "title" : "M.P.s",
  "description" : "Jonas, Mack and Charles guard a spoiled singer in Iraq, and Bob is charged with surrendering a foreign prisoner to his country for execution. At the base, Hector pursues a waitress, aided by the women."
}, {
  "imdbId" : "0460690",
  "season" : "3",
  "episodeNumber" : "7",
  "title" : "Five Brothers",
  "description" : "When Charles is injured while the team rescues a journalist Jonas must try to save his life and still keep the mission on track, but it may not be enough. Back at home, Tiffy is victimized by a patron of the bar."
}, {
  "imdbId" : "0460690",
  "season" : "3",
  "episodeNumber" : "8",
  "title" : "Play 16",
  "description" : "The team deals with their loss, and Jonas vows revenge, putting the unit at risk with Washington."
}, {
  "imdbId" : "0460690",
  "season" : "3",
  "episodeNumber" : "9",
  "title" : "Binary Explosion",
  "description" : "Grey goes undercover because of his previous relationship with a suspect whose gang is dealing in dangerous explosive, and a CID's interference may derail the whole operation."
}, {
  "imdbId" : "0460690",
  "season" : "3",
  "episodeNumber" : "10",
  "title" : "Gone Missing",
  "description" : "Bob's crisis of conscience puts a mission at risk, and what started out as a gift for Molly exposes a deeply-held secret."
}, {
  "imdbId" : "0460690",
  "season" : "3",
  "episodeNumber" : "11",
  "title" : "Side Angle Side",
  "description" : "Jonas is asked to turn on an old friend, and things get complicated when Charlotte Canning reappears; at home, Kim fields a call from a depressed army wife who won't give up her location, and Charles feels guilty when he turns to Annie for comfort."
}, {
  "imdbId" : "0460690",
  "season" : "4",
  "episodeNumber" : "1",
  "title" : "Sacrifice",
  "description" : "Home-bound from a five-month mission, the team is called back into action when the vice president is assassinated and the president-elect goes to ground after his motorcade is attacked. Back at home the women are abruptly uprooted when it's feared their lives are in danger as well, and the resulting chaos reveals a deep secret."
}, {
  "imdbId" : "0460690",
  "season" : "4",
  "episodeNumber" : "2",
  "title" : "Sudden Flight",
  "description" : "While the women try to adapt to their new lives, the team sets a scientist up as bait, triggering the hijacking of their plane."
}, {
  "imdbId" : "0460690",
  "season" : "4",
  "episodeNumber" : "3",
  "title" : "Sex Trade",
  "description" : "The team tries to retrieve plutonium in Kosovo, and Jonas is forced into an ethical dilemma when he uses a sex slave to gather information. At the unit's new home base, Tiffy and Abby both face challenges at their new jobs."
}, {
  "imdbId" : "0460690",
  "season" : "4",
  "episodeNumber" : "4",
  "title" : "The Conduit",
  "description" : "The team runs concurrent missions in Columbia, but when congress gets involved there's a risk one of the operations will be left high and dry without a means of extraction. Back at home, the women run their own cover operation when a slip-up by Lissy causes the principal to suspect she's dangerous."
}, {
  "imdbId" : "0460690",
  "season" : "4",
  "episodeNumber" : "5",
  "title" : "Dancing Lessons",
  "description" : "The team is tasked with retrieving Dr. Rocha's family before he'll give up a terrorist target, the women are finally told the true reason for their displacement, and Jonas helps Molly with an assignment."
}, {
  "imdbId" : "0460690",
  "season" : "4",
  "episodeNumber" : "6",
  "title" : "Inquisition",
  "description" : "The team and Bridget play a complex mind game with a suspected terrorist. Back at home, Mack plays a game of his own to force the truth from Tiffy."
}, {
  "imdbId" : "0460690",
  "season" : "4",
  "episodeNumber" : "7",
  "title" : "Into Hell: Part One",
  "description" : "Mack's justice is delayed when Jonas' daughter, Betsy, goes MIA in Iraq and Col. Ryan joins the team trying to find her."
}, {
  "imdbId" : "0460690",
  "season" : "4",
  "episodeNumber" : "8",
  "title" : "Into Hell: Part Two",
  "description" : "Lives and careers are put on the line as the team crosses into Syria to rescue Betsy."
}, {
  "imdbId" : "0460690",
  "season" : "4",
  "episodeNumber" : "9",
  "title" : "Shadow Riders",
  "description" : "The team encounters numerous complications while delivering a bride - and a horse - to fulfill a brokered peace treaty in Afghanistan. At home, Bob and Kim begin a deeper operation with Isaac Reed."
}, {
  "imdbId" : "0460690",
  "season" : "4",
  "episodeNumber" : "10",
  "title" : "Misled and Misguided",
  "description" : "The team is held hostage by a D.O.D. Under-Secretary's demands that they fulfill a mission without the usual planning. At home, Kim is dismayed when she's told she has to return to Isaac Reed's home, and Bridget Sullivan faces a reckoning."
}, {
  "imdbId" : "0460690",
  "season" : "4",
  "episodeNumber" : "11",
  "title" : "Switchblade",
  "description" : "The team takes Dr. Metz into combat to rescue an embattled president, Charles meets the woman of his dreams - and more trouble than he could dream, and Kim reaches the breaking point."
}, {
  "imdbId" : "0460690",
  "season" : "4",
  "episodeNumber" : "12",
  "title" : "Bad Beat",
  "description" : "The team plays a deep game in Macau, negotiating the return of a member for the return of a CIA asset, but the price may be too high. At home, Kim is called into service yet again when Isaac Reed refuses to speak to anyone but her."
}, {
  "imdbId" : "0460690",
  "season" : "4",
  "episodeNumber" : "13",
  "title" : "The Spear of Destiny",
  "description" : "Jonas and Mack have a mystical experience when one is injured and the other is charged with stealing a valuable spear, Kim gets more than she bargained for when she accompanies Bob on a mission while he's in withdrawal."
}, {
  "imdbId" : "0460690",
  "season" : "4",
  "episodeNumber" : "14",
  "title" : "The Last Nazi",
  "description" : "Jonas accepts on off-book assignment from the new president, which success depends upon the team successfully eluding an Israeli hit squad. Elsewhere, Ryan's promotion opportunity brings back memories from his youth."
}, {
  "imdbId" : "0460690",
  "season" : "4",
  "episodeNumber" : "15",
  "title" : "Hero",
  "description" : "A training mission with a new recruit goes horribly wrong, sidelining the team just as Hector's killer is found. Meanwhile, Betsy's issues with her cover interview cause Jonas to help her prep, and Molly to worry about the stress she's experiencing."
}, {
  "imdbId" : "0460690",
  "season" : "4",
  "episodeNumber" : "16",
  "title" : "Hill 60",
  "description" : "Chlorine gas is used in an attack on the town, leaving Tiffy to save herself and her students, Mack and Bob to secure the apartments and Charles stranded on the road, while Sam and Jonas desperately try to locate the source before all the oxygen is gone."
}, {
  "imdbId" : "0460690",
  "season" : "4",
  "episodeNumber" : "17",
  "title" : "Flesh & Blood",
  "description" : "The team's mission is endangered when a sniper downs their helicopter, giving a death squad enough time to close in on Jonas' friend who they're to rescue. Back home, Ryan takes on a cover when he preys on an addict for information, and Joss finds Charles."
}, {
  "imdbId" : "0460690",
  "season" : "4",
  "episodeNumber" : "18",
  "title" : "Best Laid Plans",
  "description" : "The team combats domestic terrorism...from inside out."
}, {
  "imdbId" : "0460690",
  "season" : "4",
  "episodeNumber" : "19",
  "title" : "Whiplash",
  "description" : "When a team member assaults one of the unit's own, Jonas begins a manhunt that will change the team forever. Meanwhile, Mack has to face his demons in order to reach a woman who's taken a sick baby."
}, {
  "imdbId" : "0460690",
  "season" : "4",
  "episodeNumber" : "20",
  "title" : "Chaos Theory",
  "description" : "A random incident throws Jonas and Bob's carefully planned mission into chaos."
}, {
  "imdbId" : "0460690",
  "season" : "4",
  "episodeNumber" : "21",
  "title" : "Endgame",
  "description" : "While Jonas is tracking down a Russian terrorist cell, Molly is used as bait."
}, {
  "imdbId" : "0460690",
  "season" : "4",
  "episodeNumber" : "22",
  "title" : "Unknown Soldier",
  "description" : "The Unit must locate and diffuse three sets of dirty bombs headed for unknown locations across the United States."
}]
