[{
  "imdbId" : "0088513",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Pilot",
  "description" : "Disillusioned by his years as a spy, Robert McCall resigns from his job, determined to help people in need. His first two clients are a telecommunications employee who stumbles onto an extortion ring, and a woman threatened by a stalker."
}, {
  "imdbId" : "0088513",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "China Rain",
  "description" : "A Chinatown gang kidnap whom they believe is the son of a wealthy Chinese-American couple, unaware that he is actually the maid's child. Fearful that the police will not be able to get the boy back alive, the maid contacts Robert McCall."
}, {
  "imdbId" : "0088513",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "The Defector",
  "description" : "McCall's attempt to help a former agent defect from the USSR goes badly, leaving the man's daughter in peril. McCall is also asked by a teenage boy for help against a local gang of bullies."
}, {
  "imdbId" : "0088513",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "The Lock Box",
  "description" : "The Griffith family arrives in NYC on vacation from Duluth and things go wrong right from the start...their luggage is stolen by a gypsy cabbie and the hotel has lost their reservations. Bored and frustrated, Edie, the Griffiths 17 year old daughter wanders out of the hotel at night to do some exploring. She is lured into accepting a ride and finds herself abducted. The police can offer little help and with no one else to turn to they hire McCall to help find their daughter. His search will lead him into the seedy underworld of prostitution and an 'invitation only' ..."
}, {
  "imdbId" : "0088513",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Lady Cop",
  "description" : "A young New York City patrolwoman contacts McCall to help her take down a trio of dirty cops, which include her partner."
}, {
  "imdbId" : "0088513",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "The Confirmation Day",
  "description" : "Prior to his confirmation, a boy hires McCall to protect his father who is caught up in some crooked business deals, while at the same time protecting an aging stage actress from a stalker."
}, {
  "imdbId" : "0088513",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "The Children's Song",
  "description" : "On a camping trip, McCall and his estranged son Scott must band together to protect a young rape victim from a gang of hoodlums who also killed her boyfriend."
}, {
  "imdbId" : "0088513",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "The Distant Fire",
  "description" : "McCall meets an old Agency colleague who now hires himself out as a killer. His next target is an ambassador and his wife. He asks for McCall's help to save the wife because she is a woman they both used to love."
}, {
  "imdbId" : "0088513",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "Mama's Boy",
  "description" : "A mother turns to McCall when she discovers her teenage son is working for a dangerous drug dealer."
}, {
  "imdbId" : "0088513",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "Bump and Run",
  "description" : "McCall searches for a vigilante who is killing criminals in his name. Meanwhile, his colleague Kostmeyer protects a young woman from carjackers seeking revenge for a fallen member of their crew."
}, {
  "imdbId" : "0088513",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "Desperately",
  "description" : "A bored housewife is dared by her friend to pick up a guy which she does. He takes her to a hotel room but when they arrive there's a guy already there. The guy who brought her there pulls out a gun and kills the man there. She runs away and calls McCall but she doesn't want her husband to know what happened. When she tells him what happened, McCall deduces that the man is a professional killer so they go to the police and she tells her husband. But the assassin tracks her down through her friend."
}, {
  "imdbId" : "0088513",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "Reign of Terror",
  "description" : "A doctor takes over an inner city clinic, upon arriving she discovers that the previous doctor has a deal with the gang who runs the neighborhood to provide them with drugs in exchange for letting them stay there. But when she learns of this, she tells them that it ends. The gang then threatens her but she's not intimidated. But her assistant knowing she's in over her head calls McCall. But upon meeting him, she refuses to accept help from because she doesn't believe in violence."
}, {
  "imdbId" : "0088513",
  "season" : "1",
  "episodeNumber" : "13",
  "title" : "Back Home",
  "description" : "McCall is called by the tenants of an apartment building who are terrorized so that they would move out. They believe that the owner a wealthy man is doing this so he can tear down the building. McCall does a check on the man and discovers that he is looking for a hit man to kill his wife. So McCall approaches her and convinces her to come with him."
}, {
  "imdbId" : "0088513",
  "season" : "1",
  "episodeNumber" : "14",
  "title" : "Out of the Past",
  "description" : "McCall's ex-wife asks for his help when her current husband is threatened by a vengeful ex-con."
}, {
  "imdbId" : "0088513",
  "season" : "1",
  "episodeNumber" : "15",
  "title" : "Dead Drop",
  "description" : "McCall assembles a team of former colleagues to help an innocent bystander in danger when he is unwittingly involved in a smuggling operation. However, McCall runs into unexpected trouble with a smug bureaucrat gunning for Control's job."
}, {
  "imdbId" : "0088513",
  "season" : "1",
  "episodeNumber" : "16",
  "title" : "Wash-Up",
  "description" : "Two window-washers who want to form a union ask for McCall's help when they are threatened by their murderous employer. Meanwhile, McCall's housekeeper moves into his townhouse temporarily for a few days with her two young sons in tow."
}, {
  "imdbId" : "0088513",
  "season" : "1",
  "episodeNumber" : "17",
  "title" : "Torn",
  "description" : "McCall finds his attention divided when Jason Mazer from The Agency offers him a chance at revenge against an old enemy, while at the same time a young girl asks McCall to protect her and her mother against her abusive father."
}, {
  "imdbId" : "0088513",
  "season" : "1",
  "episodeNumber" : "18",
  "title" : "Unnatural Causes",
  "description" : "A serial killer is targeting New York's lonely single women who respond to a Lonely Hearts newspaper ad. His calling card is an orchid he pins to the body. Meanwhile, McCall is writing an article about Robert E Lee for a military magazine and trying to help a young actress from being exploited by a pimp."
}, {
  "imdbId" : "0088513",
  "season" : "1",
  "episodeNumber" : "19",
  "title" : "Breakpoint",
  "description" : "While attending a wedding, McCall is taken hostage by Middle Eastern terrorists seeking to capture and execute a philanthropist from their country."
}, {
  "imdbId" : "0088513",
  "season" : "1",
  "episodeNumber" : "20",
  "title" : "No Conscience",
  "description" : "A womanizer is grabbed by some people who demand that he give them something that one of the women he's been with gave him. He has no idea what they're talking about so he turns to McCall for help. After going through all the women he knows they hit a wall. That is until he remembers one other woman whom he met briefly."
}, {
  "imdbId" : "0088513",
  "season" : "1",
  "episodeNumber" : "21",
  "title" : "Unpunished Crimes",
  "description" : "A man goes to the CEO of a corporation and accuses them of stealing his invention, and when he presents proof the CEO tries to destroy it. He then orders that the man be taken care of. And when they fail, the man's son calls McCall. McCall checks the CEO out and learns that he may have ties to a terrorist group, so he approaches the man in charge of the group and together they run a game on the CEO."
}, {
  "imdbId" : "0088513",
  "season" : "1",
  "episodeNumber" : "22",
  "title" : "Pretenders",
  "description" : "McCall helps a rookie reporter who suspects her new neighbor of criminal activity. As McCall probes further, he discovers the man may have murderous intentions and is being protected by Control."
}, {
  "imdbId" : "0088513",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "Prelude",
  "description" : "When an investigative reporter is abducted. His daughter calls McCall and demands to know where her father is. It seems her father was doing a piece on a country's leader whom Agency helped get into power, whose turned into an oppressor and they want to know who the members of the opposition are. And she claims McCall was the man who helped him get into power. McCall tries to find him but is warned he's going to be stepping on some big toes."
}, {
  "imdbId" : "0088513",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "Nocturne",
  "description" : "A music critic overhears a voice in an elevator and identifies him as the man who had abducted her, raped and beaten her so badly that she lost her sight."
}, {
  "imdbId" : "0088513",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "A Community of Civilized Men",
  "description" : "McCall helps a woman who's being harassed by a guy. He warns him off. Later the woman is killed and McCall goes after the guy but it turns it wasn't him. And it also turns out it wasn't her whom the killer was after. McCall thinks it's the woman's daughter and when he goes to see her she doesn't know why so McCall offers to protect her. At the same time Control wants something from him."
}, {
  "imdbId" : "0088513",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "Joyride",
  "description" : "Some boys decide to take a hearse for a joyride. They find a casket inside filled with drugs. One of the boys decides to sell them, he is later killed. The father of another boy calls McCall for help. McCall learns that the owner of the drugs is a dangerous man and will do whatever he has to to get them back."
}, {
  "imdbId" : "0088513",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "Shades of Darkness",
  "description" : "A National Guard lieutenant witnesses a murder but the perpetrator escapes and the victim dies in his arms. He is arrested and accused of the crime. His priest, who was with McCall in the army, contacts the Equalizer for help."
}, {
  "imdbId" : "0088513",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "Nightscape",
  "description" : "A woman is brutally gang-raped on the NY subway and her husband tries to track down those responsible. She contacts McCall to help save her husband."
}, {
  "imdbId" : "0088513",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "Counterfire",
  "description" : "McCall is arrested for the murder of a blind man who had earlier thrown himself on McCall's car pretending to have been run down."
}, {
  "imdbId" : "0088513",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "The Line",
  "description" : "A young black man is killed accidentally when a watch group startles him. To protect themselves, they make it appear he was caught in the commission of a crime. And the police believe their claim. But his mother refuses to believe it and calls McCall to prove it. But her other son just wants to get a gun and go after them."
}, {
  "imdbId" : "0088513",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "Tip on a Sure Thing",
  "description" : "When a race between two horses is being highly touted the press is giving a lot of coverage to the underdog. And everyone seems to be betting on that horse. So a bookie takes all of the action and decides to ensure that the other horse will win. So he kidnaps the son of the underdog horse's jockey. The jockey's wife then calls McCall who advises them to call the police but the man refuses to do that. So McCall turns to an agent who is a gambler to help him find out who kidnapped the boy before the race begins."
}, {
  "imdbId" : "0088513",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "The Cup",
  "description" : "With McCall at his side, Kostmayer tries to help his brother, a priest, who refuses all assistance after being wounded in a drive-by shooting that kills a parishioner. They soon determine that Father Kostmayer has become privy to a KGB assassination plot revealed through the confession of the murdered man."
}, {
  "imdbId" : "0088513",
  "season" : "2",
  "episodeNumber" : "11",
  "title" : "Heartstrings",
  "description" : "When a woman's newborn baby disappears and the police are unable to help her, she calls McCall. After ruling out the possibility of her child being abducted for ransom or by disgruntled relative. McCall believes that her baby was taken by someone who deals with gray adoptions and when the mother who had earlier agreed to give her baby changed her mind, the person grabbed her child in desperation. McCall tries to find out who this mother is so he can find the broker. And when he finds the person who was going to adopt the baby, McCall learns he has ties to the Agency."
}, {
  "imdbId" : "0088513",
  "season" : "2",
  "episodeNumber" : "12",
  "title" : "High Performance",
  "description" : "A female construction worker while on the job thinks she saw a murder. She then calls McCall to help prove she wasn't seeing things. So he goes to where she saw it to check it out. Problem is that it's the skeletal structure of a building under construction and it's on a high level and he has a fear of heights."
}, {
  "imdbId" : "0088513",
  "season" : "2",
  "episodeNumber" : "13",
  "title" : "Beyond Control",
  "description" : "The death of a KGB mole forces Control to operate without the resources or knowledge of the Company; he asks for McCall's help to locate the stolen files of a secret committee while avoiding one of the KGB's top operatives."
}, {
  "imdbId" : "0088513",
  "season" : "2",
  "episodeNumber" : "14",
  "title" : "Carnal Persuasion",
  "description" : "A woman, whose husband was arrested for a crime she knows he didn't commit, is approached by the judge handling her husband's case and is propositioned by the man. She then calls McCall and tells him what happened. McCall first starts by asking another judge what she knows about the man, and learns that he appeared to come from out of nowhere, which means he is in someone's pocket. McCall then goes to see a friend of her husband who tells him that some criminal needs a man in his position for his smuggling operation but the man is honest and wouldn't be a part of it ..."
}, {
  "imdbId" : "0088513",
  "season" : "2",
  "episodeNumber" : "15",
  "title" : "Memories of Manon: Part 1",
  "description" : "Yvette Marcel who is Control's god daughter was grabbed by a couple of men, who then threatens to kill her father who is a Canadian agent unless she can find out who her father's informant known as Chrysalis is. She turns to Control who then asks Robert for help because her mother is someone Robert knew very well."
}, {
  "imdbId" : "0088513",
  "season" : "2",
  "episodeNumber" : "16",
  "title" : "Memories of Manon: Part 2",
  "description" : "After Marcel tells McCall of his connection to Yvette, he goes to make sure she's safe. But Dorgan who is desperate to know who Chrysalis is, grabs her. So McCall has to try and find a way to save her and get Dorgan off Marcel."
}, {
  "imdbId" : "0088513",
  "season" : "2",
  "episodeNumber" : "17",
  "title" : "Solo",
  "description" : "McCall falls for a woman framed in the murder of a police officer."
}, {
  "imdbId" : "0088513",
  "season" : "2",
  "episodeNumber" : "18",
  "title" : "A Place to Stay",
  "description" : "When a young girl from the suburbs runs away from an abusive home environment to live on the streets of New York, the girl's mother hires McCall to find her. He is thrust into the seedy underworld of child pornography in order to save her."
}, {
  "imdbId" : "0088513",
  "season" : "2",
  "episodeNumber" : "19",
  "title" : "Coal Black Soul",
  "description" : "A serial killer of middle-aged women wants McCall to kill him. Meanwhile, McCall begins a romance with a psychiatrist whom he saves from a peeper."
}, {
  "imdbId" : "0088513",
  "season" : "2",
  "episodeNumber" : "20",
  "title" : "First Light",
  "description" : "McCall is out of town appearing in a hearing being conducted by a Senator over an op (operation) Control did a few years ago on him, and McCall's testimony could take Control down. Scott and a friend are trying to help an old man who is being terrorized by someone. After McCall saves Control, he hurries home to help Scott."
}, {
  "imdbId" : "0088513",
  "season" : "2",
  "episodeNumber" : "21",
  "title" : "Hand and Glove",
  "description" : "When the father of a woman with psychological issues is murdered, McCall steps in to help."
}, {
  "imdbId" : "0088513",
  "season" : "2",
  "episodeNumber" : "22",
  "title" : "Re-Entry",
  "description" : "A boy who senses something is wrong with his father calls McCall to help him. McCall learns that he is being pressured to help some people rob his employer. McCall has a plan to help him but the people coercing the father grabs the boy and tells McCall not to interfere. So McCall has to find out how they knew about him and where the boy is."
}, {
  "imdbId" : "0088513",
  "season" : "3",
  "episodeNumber" : "1",
  "title" : "Blood & Wine: Part 1",
  "description" : "A woman who discovered her daughter's husband has a gun but couldn't find it when she tries to tell her daughter about calls McCall. McCall initially refuses to help until he sees the man following them. Later McCall thinks he's a terrorist, the Feds are looking for so he calls the agent in charge. He learns that they are being aided by a man who knows the terrorist who is now a priest whom McCall also knows and hates so he doesn't want to do anything with him."
}, {
  "imdbId" : "0088513",
  "season" : "3",
  "episodeNumber" : "2",
  "title" : "Blood & Wine: Part 2",
  "description" : "A terrorist blends in with visitors from all over the world at a Roman Catholic religious festival, His former partner, who repented and became a monk, arrives in New York City to search for him. The partner suspects that the terrorist will hit the religious festival to show his contempt for Christianity, in the guise of a priest he has murdered. The title is quite literal, because the terrorist plans to commit perhaps the ultimate act of blasphemy by pouring the poison into a chalice of wine -- which is to be converted to Christ's blood -- and serve it to a thousand ..."
}, {
  "imdbId" : "0088513",
  "season" : "3",
  "episodeNumber" : "3",
  "title" : "Suspicion of Innocence",
  "description" : "McCall is hired by the mother of a mentally challenged man falsely charged in the murder of his coworker."
}, {
  "imdbId" : "0088513",
  "season" : "3",
  "episodeNumber" : "4",
  "title" : "In the Money",
  "description" : "A banker on Wall Street commits suicide and the waitress he was dating also turns up dead. When the waitress' friend is almost murdered, McCall is dragged into the dark underbelly of Wall Street to seek answers."
}, {
  "imdbId" : "0088513",
  "season" : "3",
  "episodeNumber" : "5",
  "title" : "Encounter in a Closed Room",
  "description" : "A Russian scientist who's in New York City gets away from his security and goes to the home of a friend. Later some American agents show up and ask him if he wants to defect and when he says yes they take him in. The scientist's friend is later approached by someone who wants her to help them take the scientist out or else her parents will be killed. She then calls McCall and tries to neutralize them."
}, {
  "imdbId" : "0088513",
  "season" : "3",
  "episodeNumber" : "6",
  "title" : "Mission: McCall: Part 1",
  "description" : "When Scott can't find his father, he first calls Control but they give him the brush off. He later finds a message from his father telling him to contact a man named Dyson who also worked for the Agency and like McCall wanted out. Dyson tries to find him and thinks that the KGB might be involved, so he breaks out another former Agency operative, Harley Gage to help him. They discover that the KGB has nothing to do with happened to McCall."
}, {
  "imdbId" : "0088513",
  "season" : "3",
  "episodeNumber" : "7",
  "title" : "Mission: McCall: Part 2",
  "description" : "The KGB get McCall and take him to the Russian embassy. McCall was shot so they try to treat him before sending him to Russia. Dyson upon learning this tries to get him out by getting into the Embassy along with Gage. They tell Kostmayer to sit on Control because they fear he might try to stop them. Eventually his people find him and tries to contact someone at the Embassy. Eventually Dyson and Gage are caught."
}, {
  "imdbId" : "0088513",
  "season" : "3",
  "episodeNumber" : "8",
  "title" : "Shadow Play",
  "description" : ""
}, {
  "imdbId" : "0088513",
  "season" : "3",
  "episodeNumber" : "9",
  "title" : "Inner View",
  "description" : ""
}, {
  "imdbId" : "0088513",
  "season" : "3",
  "episodeNumber" : "10",
  "title" : "The Rehearsal",
  "description" : "McCall and Gage attend the rehearsal of a play in which the daughter of an associate will be starring. While she's in her dressing room, a shadowy figure tells her to leave. Later they discover that someone has cut the phone lines and booby trapped the theatre so when anyone comes inside, the bomb will go off. So they have to find the one who planted it so they can deactivate it. And it's while they wait that they discover that the people there know more than they are telling."
}, {
  "imdbId" : "0088513",
  "season" : "3",
  "episodeNumber" : "11",
  "title" : "Christmas Presence",
  "description" : ""
}, {
  "imdbId" : "0088513",
  "season" : "3",
  "episodeNumber" : "12",
  "title" : "A Dance on the Dark Side",
  "description" : ""
}, {
  "imdbId" : "0088513",
  "season" : "3",
  "episodeNumber" : "13",
  "title" : "The Child Broker",
  "description" : "A robbery gang of semi-homeless kids is run by a ruthless manipulator (Frank Whaley). One of the kids has a caring single mother who enlists the Equalizer to look into things. When the gang boss shows his true colours anytime the possibility arises to advance in the world, the boys and The Equalizer bring him to justice."
}, {
  "imdbId" : "0088513",
  "season" : "3",
  "episodeNumber" : "14",
  "title" : "Video Games",
  "description" : ""
}, {
  "imdbId" : "0088513",
  "season" : "3",
  "episodeNumber" : "15",
  "title" : "Something Green",
  "description" : "When the son of a woman who was fathered by a Swiss diplomat is missing, she calls McCall. He then talks to the boy's father and learns that he's in bed with some criminals who use him to get their money into Swiss banks. It seems he stole from them and it appears they grabbed his son to get him to return it but he claims that he sent the money out of the country. So McCall tries to shake the men who have the boy."
}, {
  "imdbId" : "0088513",
  "season" : "3",
  "episodeNumber" : "16",
  "title" : "The Mystery of Manon: Part 1",
  "description" : ""
}, {
  "imdbId" : "0088513",
  "season" : "3",
  "episodeNumber" : "17",
  "title" : "The Mystery of Manon: Part 2",
  "description" : ""
}, {
  "imdbId" : "0088513",
  "season" : "3",
  "episodeNumber" : "18",
  "title" : "No Place Like Home",
  "description" : ""
}, {
  "imdbId" : "0088513",
  "season" : "3",
  "episodeNumber" : "19",
  "title" : "Last Call",
  "description" : ""
}, {
  "imdbId" : "0088513",
  "season" : "3",
  "episodeNumber" : "20",
  "title" : "Regrets Only",
  "description" : "An attractive divorcee, Susan Foxworth, has become the target of malicious & vindictive stalking from her psychopathic ex-husband, Gary. Despite her repeated complaints to the police, they state they are powerless to act until her ex does something to harm her or her children. Susan turns to Robert McCall for help, who discovers some chilling facts about her ex-husband's past. When the psychopathic ex finds out that McCall is working for Susan, he breaks into her home in the hope of killing her, but McCall has set a clever trap for him..."
}, {
  "imdbId" : "0088513",
  "season" : "3",
  "episodeNumber" : "21",
  "title" : "Target of Choice",
  "description" : ""
}, {
  "imdbId" : "0088513",
  "season" : "3",
  "episodeNumber" : "22",
  "title" : "Always a Lady",
  "description" : ""
}, {
  "imdbId" : "0088513",
  "season" : "4",
  "episodeNumber" : "1",
  "title" : "The Last Campaign",
  "description" : "A woman who works for an ambitious Assemblyman learns he is planning to get a Senator to step down, thus paving the way for him to take the Senator's place, by threatening to reveal something from the Senator's past. She calls McCall. But when her boss finds out what she is doing, he has her committed. McCall tries to help her."
}, {
  "imdbId" : "0088513",
  "season" : "4",
  "episodeNumber" : "2",
  "title" : "Sea of Fire",
  "description" : "When some students at an inner city school get the blessing of a criminal to do whatever they want there. They start by assaulting one of the female students. When one of the students informs the principal what is happening to the girl, she then calls McCall for help. The student who told her about the assault is stabbed. McCall starts by being a new teacher and he takes the students who assaulted the girl to an autopsy and then has a man whom he knows \"died\" talk about what happened to him during his near-\"death\"."
}, {
  "imdbId" : "0088513",
  "season" : "4",
  "episodeNumber" : "3",
  "title" : "Riding the Elephant",
  "description" : ""
}, {
  "imdbId" : "0088513",
  "season" : "4",
  "episodeNumber" : "4",
  "title" : "Eighteen with a Bullet",
  "description" : ""
}, {
  "imdbId" : "0088513",
  "season" : "4",
  "episodeNumber" : "5",
  "title" : "The Day of the Covenant",
  "description" : ""
}, {
  "imdbId" : "0088513",
  "season" : "4",
  "episodeNumber" : "6",
  "title" : "Splinters",
  "description" : ""
}, {
  "imdbId" : "0088513",
  "season" : "4",
  "episodeNumber" : "7",
  "title" : "Making of a Martyr",
  "description" : ""
}, {
  "imdbId" : "0088513",
  "season" : "4",
  "episodeNumber" : "8",
  "title" : "The Sins of Our Fathers",
  "description" : ""
}, {
  "imdbId" : "0088513",
  "season" : "4",
  "episodeNumber" : "9",
  "title" : "The Visitation",
  "description" : ""
}, {
  "imdbId" : "0088513",
  "season" : "4",
  "episodeNumber" : "10",
  "title" : "Past Imperfect",
  "description" : ""
}, {
  "imdbId" : "0088513",
  "season" : "4",
  "episodeNumber" : "11",
  "title" : "Trial by Ordeal",
  "description" : "McCall is brought to testify before a committee. When he demands to know what is going he learns that Control is being charged with all sorts of infractions and if found guilty will be executed. So McCall offers to be his advocate."
}, {
  "imdbId" : "0088513",
  "season" : "4",
  "episodeNumber" : "12",
  "title" : "Silent Fury",
  "description" : "McCall tries to help a young woman who is one of the victims of a series of robberies directed against the deaf community. However, due to the fact that she seeks help from someone who can hear, she faces a great deal of hostility from her deaf boyfriend, as well as some of her peers."
}, {
  "imdbId" : "0088513",
  "season" : "4",
  "episodeNumber" : "13",
  "title" : "Lullaby of Darkness",
  "description" : "A psychopathic stockbroker, Joseph Morrison, is a habitual wife- and child-abuser who ruthlessly beats & humiliates his family. Because of his money & influence, he is able to avoid accountability for his actions. One night a neighbor in his apartment complex hears him attack his family, and she calls in The Equalizer. Morrison, however, hits McCall with a restraint order, and files a malicious lawsuit against his neighbor in retaliation for reporting him. McCall strikes back, however, by obtaining a video of Mr. Morrison's child giving grim details of physical abuse ..."
}, {
  "imdbId" : "0088513",
  "season" : "4",
  "episodeNumber" : "14",
  "title" : "17 Zebra",
  "description" : "A highly decorated NYC Paramedic, Gideon(William Atherton), is on an \"angel of death\" killing campaign targeting homeless winos. No one suspects a thing as he drugs them and it appears they die from heart attacks. A Skid row mission worker becomes aware that someone is doing this as his latest victim, though certified dead from a heart attack, was known to him to be in perfect health. He calls in McCall to find out who it is and stop them. It turns out there is more to Gideon's murder episodes than meets the eye as it becomes clear he suffers from an advanced state of..."
}, {
  "imdbId" : "0088513",
  "season" : "4",
  "episodeNumber" : "15",
  "title" : "Starfire",
  "description" : "A strange reclusive man(Michael Moriarity) calling himself \"Seti\" and claiming to be an alien from outer space has befriended a young girl, Amber. this episode by telling her he is being followed by other aliens bent on killing him. He shows her a strange futuristic device and has her promise to keep it hidden and safe after his imminent death. Amber contacts McCall whom, touched by her compassionate sincerity, discovers that \"Seti\" is actually a highly respected top secret aerospace engineer, and that he is being targeted by no less than Company assassins. Events ..."
}, {
  "imdbId" : "0088513",
  "season" : "4",
  "episodeNumber" : "16",
  "title" : "Time Present, Time Past",
  "description" : ""
}, {
  "imdbId" : "0088513",
  "season" : "4",
  "episodeNumber" : "17",
  "title" : "Prisoners of Conscience",
  "description" : "McCall tries to save a man who has been kidnapped by the man who killed his father."
}, {
  "imdbId" : "0088513",
  "season" : "4",
  "episodeNumber" : "18",
  "title" : "The Caper",
  "description" : ""
}, {
  "imdbId" : "0088513",
  "season" : "4",
  "episodeNumber" : "19",
  "title" : "Heart of Justice",
  "description" : "In a New York City courtroom, a pair of sociopathic rapists are released after their sleazy lawyer points out a technicality in their arrest & discovery of evidence that pointed exclusively to them. These low-lifes, Tony Santiago & Max Gorman, had savagely raped a pregnant woman and beat her with a steel pipe to prevent her from testifying against them. The attack left her brain-dead and on machines. Not long after their release, the woman's sister discovers her brother-in-law carrying a .38, and calls The Equalizer for help. When the husband confronts Santiago, he ..."
}, {
  "imdbId" : "0088513",
  "season" : "4",
  "episodeNumber" : "20",
  "title" : "Race Traitors",
  "description" : "A black family who moves into a white neighborhood is being terrorized by some white supremacists. So they turn to McCall for help who brings in Kostmayer and Stock to help. But things are a little difficult for Kostmayer cause the neighborhood where the family moved into is where he grew up. And he learns that a boy he knows is with the white supremacists."
}, {
  "imdbId" : "0088513",
  "season" : "4",
  "episodeNumber" : "21",
  "title" : "Endgame",
  "description" : "When a woman who was playing paint-ball kills someone because someone tampered with her gun, she is arrested and calls McCall. Her sister, a lawyer, wants to help her but she refuses. McCall looks into her background and discovers some interesting things."
}, {
  "imdbId" : "0088513",
  "season" : "4",
  "episodeNumber" : "22",
  "title" : "Suicide Squad",
  "description" : ""
}]