[{
  "imdbId" : "0068098",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Pilot",
  "description" : "The Swamp's Korean houseboy, Ho-Jon, is accepted to attend school at Hawkeye's alma mater. The camp raises money to send Ho-Jon to Maine by raffling a weekend in Tokyo with a nurse, much to the chagrin of Hot Lips and Burns."
}, {
  "imdbId" : "0068098",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "To Market, to Market",
  "description" : "After losing vital medical supplies to black marketeers, Hawkeye and Trapper attempt to make a deal to get them back. Henry gets a new antique oak desk."
}, {
  "imdbId" : "0068098",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Requiem for a Lightweight",
  "description" : "Trapper enters the inter-camp boxing tournament."
}, {
  "imdbId" : "0068098",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Chief Surgeon Who?",
  "description" : "When Hawkeye is appointed Chief Surgeon over Frank Burns, Burns and Houlihan go over Col. Blake's head to a general to protest the decision."
}, {
  "imdbId" : "0068098",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "The Moose",
  "description" : "Hawkeye is outraged when a visiting sergeant brings his 'moose' to camp - a young Korean woman he has bought to keep as his personal servant."
}, {
  "imdbId" : "0068098",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Yankee Doodle Doctor",
  "description" : "The 4077th is chosen as the site for a documentary featuring 'false heroics' about MASH units in Korea. After destroying the film, Hawkeye and Trapper make their own movie as a replacement."
}, {
  "imdbId" : "0068098",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Bananas, Crackers and Nuts",
  "description" : "Hawkeye feigns insanity to prove he needs a leave."
}, {
  "imdbId" : "0068098",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Cowboy",
  "description" : "A wounded cowboy is itching to get back to the states to keep his marriage intact, but his request is denied. Henry becomes the target of a mad bomber."
}, {
  "imdbId" : "0068098",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "Henry, Please Come Home",
  "description" : "When Col. Henry Blake is transferred to Tokyo and Frank starts imposing military discipline on the camp, the surgeons will do anything to get Henry back."
}, {
  "imdbId" : "0068098",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "I Hate a Mystery",
  "description" : "Hawkeye finds himself investigating a rash of petty thefts in the camp."
}, {
  "imdbId" : "0068098",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "Germ Warfare",
  "description" : "After tapping Frank Burns for blood, Hawkeye and Trapper's patient develops complications. They believe Frank has hepatitis and try to keep Frank from operating."
}, {
  "imdbId" : "0068098",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "Dear Dad",
  "description" : "Hawkeye writes his dad, describing the antics of the 4077th."
}, {
  "imdbId" : "0068098",
  "season" : "1",
  "episodeNumber" : "13",
  "title" : "Edwina",
  "description" : "The nurses refuse to date until their lonely colleague Edwina gets a date, so the men draw straws."
}, {
  "imdbId" : "0068098",
  "season" : "1",
  "episodeNumber" : "14",
  "title" : "Love Story",
  "description" : "After Radar gets a \"Dear John\" letter Hawkeye and Trapper try to help him with a new nurse who's into classical literature and music."
}, {
  "imdbId" : "0068098",
  "season" : "1",
  "episodeNumber" : "15",
  "title" : "Tuttle",
  "description" : "A little white lie about an imaginary officer balloons into an elaborate charade."
}, {
  "imdbId" : "0068098",
  "season" : "1",
  "episodeNumber" : "16",
  "title" : "The Ringbanger",
  "description" : "Hawkeye and Trapper hit it off with a wounded Colonel, but when they discover his combat zeal is costing lives, they conspire to keep him from returning to the front line."
}, {
  "imdbId" : "0068098",
  "season" : "1",
  "episodeNumber" : "17",
  "title" : "Sometimes You Hear the Bullet",
  "description" : "Hawkeye's childhood buddy drops by, and reveals that he is writing a book about his experiences in the infantry - experiences that may hit a little too close to home."
}, {
  "imdbId" : "0068098",
  "season" : "1",
  "episodeNumber" : "18",
  "title" : "Dear Dad, Again",
  "description" : "Hawkeye is bored and tired, the best time to pen another missive to his father. He describes Klinger's sheer white wedding gown, which does little to hide his white boxer shorts but is better than Hawkeye's naked dining fiasco. There is more fun to be had over Hotlips' recent tiff with Frank; he got drunk on gin and confided that his own brother used to call him Ferret Face. Radar is now a real, honest to goodness mail order graduate. But, Captain Casey, the new boy genius of their surgical team, is not really a doctor; Hawkeye's failure to throw the book at him ..."
}, {
  "imdbId" : "0068098",
  "season" : "1",
  "episodeNumber" : "19",
  "title" : "The Longjohn Flap",
  "description" : "A cold snap has everybody trying to get their hands on Hawkeye's thermal underwear."
}, {
  "imdbId" : "0068098",
  "season" : "1",
  "episodeNumber" : "20",
  "title" : "The Army-Navy Game",
  "description" : "The Army-Navy game back home holds everyone's attention (and everyone's bet money) until an artillery barrage forces the camp to dispose of an unexploded shell."
}, {
  "imdbId" : "0068098",
  "season" : "1",
  "episodeNumber" : "21",
  "title" : "Sticky Wicket",
  "description" : "Hawkeye moves out of the Swamp while brooding over a patient gone sour, while Frank rubs salt in the wound after suffering Hawkeye's insults to his surgical ability."
}, {
  "imdbId" : "0068098",
  "season" : "1",
  "episodeNumber" : "22",
  "title" : "Major Fred C. Dobbs",
  "description" : "Frank applies for a transfer out of the 4077, and Hawkeye and Trapper can't resist broadcasting his goodbye to Margaret through the camp P.A. The prospect of gold in the region gives Frank second thoughts."
}, {
  "imdbId" : "0068098",
  "season" : "1",
  "episodeNumber" : "23",
  "title" : "Ceasefire",
  "description" : "The camp erupts into celebration when they receive word that there's a ceasefire."
}, {
  "imdbId" : "0068098",
  "season" : "1",
  "episodeNumber" : "24",
  "title" : "Showtime",
  "description" : "A USO troupe entertains the 4077th in between the usual chaos."
}, {
  "imdbId" : "0068098",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "Divided We Stand",
  "description" : "Henry's orders to the 4077th to be on their best behavior when General Clayton sends a psychiatrist to evaluate them meet with mixed results. Will the team be broken up and sent to other units?"
}, {
  "imdbId" : "0068098",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "5 O'Clock Charlie",
  "description" : "Every day for the past six weeks, at 5:00 o'clock p.m. on the nose, a North Korean \"washout from Kamikaze school\" has let loose a bomb in the general direction of the hospital's sub-ammo dump. Very affectionately known as \"Five O'Clock Charlie,\" the only thing he hits on the nose is the time. Every day, Radar opens book on the day's exploits and takes bets on how close (in yards) Charlie will come to the sub-ammo dump. It is an occasion for cocktails and frivolity at 4077, not unlike the Kentucky Derby... until Frank demands Henry get him a \"nug\" from Brigadier Gen. ..."
}, {
  "imdbId" : "0068098",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "Radar's Report",
  "description" : "Radar reports on the comedies and tragedies of a typical 4077th week while Majors Houlihan and Burns try to get Cpl. Klinger transferred and Hawkeye falls hard for a nurse."
}, {
  "imdbId" : "0068098",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "For the Good of the Outfit",
  "description" : "Hawkeye and Trapper discover that a nearby town has been shelled by U.S. forces. When they pursue the issue, the army resists accepting responsibility."
}, {
  "imdbId" : "0068098",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "Dr. Pierce and Mr. Hyde",
  "description" : "After Hawkeye is kept awake in surgery for 3 days straight he decides to find out who started the war."
}, {
  "imdbId" : "0068098",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "Kim",
  "description" : "A wounded Korean boy captures the hearts of the 4077th especially Trapper who wants to adopt him."
}, {
  "imdbId" : "0068098",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "L.I.P. (Local Indigenous Personnel)",
  "description" : "Hawkeye helps a soon-to-be-discharged enlisted man who wants to marry a Korean girl and take her and their child back to the U.S."
}, {
  "imdbId" : "0068098",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "The Trial of Henry Blake",
  "description" : "Henry's on trial on charges that Frank and Margaret brought against him. So that Hawkeye and Trapper can't help Henry, the Majors put them under house arrest."
}, {
  "imdbId" : "0068098",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "Dear Dad... Three",
  "description" : "Hawkeye pens another letter to his father during a 'typical' day at the 4077th."
}, {
  "imdbId" : "0068098",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "The Sniper",
  "description" : "The 4077th deals with more than the usual mayhem when a sniper opens fire on the camp."
}, {
  "imdbId" : "0068098",
  "season" : "2",
  "episodeNumber" : "11",
  "title" : "Carry On, Hawkeye",
  "description" : "All the surgeons except for Hawkeye, and most of the support staff except for Margaret, Radar, and Mulcahey come down with the flu. In this Korea-wide epidemic, they can't even find someone to come in and help with casualties."
}, {
  "imdbId" : "0068098",
  "season" : "2",
  "episodeNumber" : "12",
  "title" : "The Incubator",
  "description" : "After an epic Swamp debauch to end all debauchery, the drunken duo give up on alcohol. They are upset when one of their patients has an infection which the 4077 cannot identify. They determine that the 4077 needs an incubator, so they call the Quartermaster. Capt. Sloan is from the 375th QMHQ COMSEAPAC SEOULSEC REPDEP...Hawkeye needs a drink. But, according to Sloan, an incubator is \"a luxury item.\" So the drunken duo go on a quest for luxury. They meet inept supply sergeants, hoarder, Major Morris, and the cupidinous Col. Lambert who is willing to give the guys what ..."
}, {
  "imdbId" : "0068098",
  "season" : "2",
  "episodeNumber" : "13",
  "title" : "Deal Me Out",
  "description" : "Radar hits a local with a jeep and a GI suffers from battle fatigue while Pierce and McIntyre clash with Frank Burns and the CID all during a poker game disguised as an officer's conference."
}, {
  "imdbId" : "0068098",
  "season" : "2",
  "episodeNumber" : "14",
  "title" : "Hot Lips and Empty Arms",
  "description" : "A friend's letter causes Margaret to re-evaluate her life in the 4077th and request a transfer."
}, {
  "imdbId" : "0068098",
  "season" : "2",
  "episodeNumber" : "15",
  "title" : "Officers Only",
  "description" : "In gratitude for Hawkeye and Trapper saving his son, a general donates an officer's club to the 4077th. Hawkeye and Trapper work to allow everyone access to the club."
}, {
  "imdbId" : "0068098",
  "season" : "2",
  "episodeNumber" : "16",
  "title" : "Henry in Love",
  "description" : "Family man Henry falls in love with 21-year-old ex-cheerleader Nancy Sue Parker, who is half his age. Nancy visits Henry at the camp and comes on to Hawkeye while Henry is in surgery."
}, {
  "imdbId" : "0068098",
  "season" : "2",
  "episodeNumber" : "17",
  "title" : "For Want of a Boot",
  "description" : "After months of waiting, Hawkeye finds that it may take more than a requisition form to get a new pair of boots."
}, {
  "imdbId" : "0068098",
  "season" : "2",
  "episodeNumber" : "18",
  "title" : "Operation Noselift",
  "description" : "Another day, another complaint to Gen. Mitchell, compliments of Hotlips, Inc. and Henry is tired of their constant abuse. To make matters worse, Private Danny Baker keeps going AWOL. With the help of Fr. Mulcahy, Hawkeye and Trapper get to the bottom of Baker's trouble: his huge nose. Hawkeye calls his old buddy, renowned plastic surgeon, Major Stanley \"Stosh\" Robbins, (Stuart Margolin) to perform the surgery...in exchange for a date with \"The Barracuda.\" The big problem: all elective surgery is against U.S. military regulations. Hotlips, Inc. are very suspicious. But..."
}, {
  "imdbId" : "0068098",
  "season" : "2",
  "episodeNumber" : "19",
  "title" : "The Chosen People",
  "description" : "A Korean family claims that the 4077th is set up on their farm and wants the unit to move; a Korean girl names Radar as the father of her child."
}, {
  "imdbId" : "0068098",
  "season" : "2",
  "episodeNumber" : "20",
  "title" : "As You Were",
  "description" : "The team delivers a baby, handles casualties and operates on Frank Burns' hernia during a power outage while Radar tries to divert friendly mortar fire falling too close to the camp."
}, {
  "imdbId" : "0068098",
  "season" : "2",
  "episodeNumber" : "21",
  "title" : "Crisis",
  "description" : "When enemy action cuts the supply lines to the 4077th in the middle of a freezing Korean winter, the unit struggles with a shortage of supplies and heating fuel."
}, {
  "imdbId" : "0068098",
  "season" : "2",
  "episodeNumber" : "22",
  "title" : "George",
  "description" : "A decorated GI confides to Hawkeye that he was beaten by his own unit for being gay but Frank Burns is outraged when he finds out from another source and tries to have the soldier dishonorably discharged."
}, {
  "imdbId" : "0068098",
  "season" : "2",
  "episodeNumber" : "23",
  "title" : "Mail Call",
  "description" : "Mail call yields goodies like photos and cookies (Trapper) and a huge knitted sweater (Hawkeye) but Henry gets only canceled checks. Frank's stock portfolio doubled since the war began but when he tells the guys they are less than thrilled. Margaret takes it as a near proposal of marriage. Klinger's father is dying for the 18th time; his file is full of familial death and pregnancy. Frank finds Hawkeye's letter to his father about Pioneer Aviation so Frank asks Radar to cable his brokers to liquidate and buy Pioneer. Radar has a pen pal named Mary Jo Carpenter; he ..."
}, {
  "imdbId" : "0068098",
  "season" : "2",
  "episodeNumber" : "24",
  "title" : "A Smattering of Intelligence",
  "description" : "A helicopter crash introduces the 4077 to Colonel Sam Flagg, the well-built (says Hotlips) paranoid with a broken arm who refuses all painkillers. Colonel Flagg (who can also be identified as Major Brooks, Lt. Carter, Ensign Troy and Capt. Louise Klein) is CIA. Meanwhile, Trapper's friend, Vinny Pratt, also drops in; Vinny is Intelligence (G-2) and he wants to find out what Flagg is doing. Flagg is BIG, so his operation must be crucial. Because of Fr. Mulcahy, Vinny cannot be Capt. Perkins the priest, so he becomes Capt. Stone, the engineer. Vinny Pratt introduces ..."
}, {
  "imdbId" : "0068098",
  "season" : "3",
  "episodeNumber" : "1",
  "title" : "The General Flipped at Dawn",
  "description" : "A visiting general, appearing to be more eccentric than the usual army brass and a stickler for regulations, tries to move the camp closer to the front and court martial Hawkeye before they discover that he's completely loony."
}, {
  "imdbId" : "0068098",
  "season" : "3",
  "episodeNumber" : "2",
  "title" : "Rainbow Bridge",
  "description" : "Hawkeye and Trapper are Tokyo-bound, Frank is jealous; but Trapper wants 3 days without amputating something. Father and Henry bring shopping lists but Radar brings news of more casualties. Thirty-six hours and 473 cases later (an all time record) Henry tells the officers about an unusual radio call Radar took from the Chinese. The Chinese have 9 shot-up GIs they are willing to free...but only if unarmed doctors, a corpsman and a driver travel 9 miles into Chinese territory in one vehicle to retrieve the GIs. All must be totally without weaponry. Margaret and Frank do..."
}, {
  "imdbId" : "0068098",
  "season" : "3",
  "episodeNumber" : "3",
  "title" : "Officer of the Day",
  "description" : "Assigned by Frank Burns as Officer of the Day in Henry's absence, Hawkeye must deal with the daily 4077th chaos and try to thwart sneaky Col. Flagg's plans for his Korean prisoner."
}, {
  "imdbId" : "0068098",
  "season" : "3",
  "episodeNumber" : "4",
  "title" : "Iron Guts Kelly",
  "description" : "General Robert \"Iron Guts\" Kelly arrives for an inspection and dies in Margaret's tent, prompting his aide Colonel Wortman to do damage control and make it look as if Kelly died in combat."
}, {
  "imdbId" : "0068098",
  "season" : "3",
  "episodeNumber" : "5",
  "title" : "O.R.",
  "description" : "Drama, pathos and humor combine when heavy casualties result in a long session in the O.R."
}, {
  "imdbId" : "0068098",
  "season" : "3",
  "episodeNumber" : "6",
  "title" : "Springtime",
  "description" : "It is a beautiful Spring day that makes one yearn for a group lobotomy. Trapper grabs a nurse; Radar wants to grab pretty Lt. Simmons (Mary Kay Place) and Henry grabs some golf. In the field, nostrils flare as Hotlips and Frank grab each other. A hairy English rose reads Rupert Brooke... and a telegram. She said yes! Hawkeye almost gets grabbed by a disturbed feline fondler, but his new buddy, Gargantuan Marine, Lyle Wesson (Alex Karras) saves him. And he keeps on saving him! Henry arranges a wireless wedding between Korea and Toledo with Father Mulcahy presiding. The..."
}, {
  "imdbId" : "0068098",
  "season" : "3",
  "episodeNumber" : "7",
  "title" : "Check-Up",
  "description" : "Trapper John's ulcer flares up and could provide grounds for a medical discharge from the Army."
}, {
  "imdbId" : "0068098",
  "season" : "3",
  "episodeNumber" : "8",
  "title" : "Life with Father",
  "description" : "Henry suspects his wife is having an affair, Hawkeye searches for presidents' faces to try to win a pony and Father Mulcahy officiates at a Jewish Bris with the help of a rabbi on a faraway aircraft carrier."
}, {
  "imdbId" : "0068098",
  "season" : "3",
  "episodeNumber" : "9",
  "title" : "Alcoholics Unanimous",
  "description" : "When Henry goes to Tokyo for a conference Frank outlaws alcoholic beverages and dismantles the still but discovers that it's not so easy to dry out the 4077th."
}, {
  "imdbId" : "0068098",
  "season" : "3",
  "episodeNumber" : "10",
  "title" : "There Is Nothing Like a Nurse",
  "description" : "After a run-in with Major Houlihan, Henry is not altogether unhappy when the nurses are evacuated due to a possible enemy attack but soon finds out with rest of the camp just how much the nurses mean to the unit."
}, {
  "imdbId" : "0068098",
  "season" : "3",
  "episodeNumber" : "11",
  "title" : "Adam's Ribs",
  "description" : "After literally being fed up with mess hall food, Hawkeye goes on a desperate quest to order barbecue spare ribs from his favorite restaurant, Adam's Ribs, at Dearborn Station in Chicago."
}, {
  "imdbId" : "0068098",
  "season" : "3",
  "episodeNumber" : "12",
  "title" : "A Full Rich Day",
  "description" : "Hawkeye records a letter to his Dad, detailing the exploits of a mad Turkish soldier, the loss of a Luxembourg Lieutenant's corpse, and a lieutenant's strong-arm tactics to obtain medical care for a comrade."
}, {
  "imdbId" : "0068098",
  "season" : "3",
  "episodeNumber" : "13",
  "title" : "Mad Dogs and Servicemen",
  "description" : "Against Frank's objections, Hawkeye and Trapper treat a young, shell-shocked GI with hysterical paralysis while Henry searches for a possibly rabid dog that bit Radar."
}, {
  "imdbId" : "0068098",
  "season" : "3",
  "episodeNumber" : "14",
  "title" : "Private Charles Lamb",
  "description" : "When the 4077th is invited to share an Easter meal with a Greek unit, tender-hearted Radar comes up with a creative way to save the main course...a lamb!"
}, {
  "imdbId" : "0068098",
  "season" : "3",
  "episodeNumber" : "15",
  "title" : "Bombed",
  "description" : "While Radar tries to stop the camp from being shelled by their own artillery, Frank finds a wounded enemy soldier wired to explode, Margaret and Trapper get stuck in a supply shed and Henry and Father Mulcahy get blown up in the latrine."
}, {
  "imdbId" : "0068098",
  "season" : "3",
  "episodeNumber" : "16",
  "title" : "Bulletin Board",
  "description" : "Trapper writes a letter to his daughter, Shirley Temple dances, and the 4077th tries to take a mental break from GIs suffering from hypothermia and post-op bleeding by throwing a benefit picnic for the orphanage."
}, {
  "imdbId" : "0068098",
  "season" : "3",
  "episodeNumber" : "17",
  "title" : "The Consultant",
  "description" : "Hawkeye learns more than just a new surgical technique when a casual conversation in a Tokyo bar with a medical consultant convinces the man to come to the 4077th."
}, {
  "imdbId" : "0068098",
  "season" : "3",
  "episodeNumber" : "18",
  "title" : "House Arrest",
  "description" : "After Hawkeye makes an insulting remark about Margaret, Frank snaps him with a towel and Hawkeye responds with a nicely placed right cross to Frank's eye. Hawkeye is then placed under house arrest and instead of being treated like a criminal, he is treated like a conquering hero for what he did even to the point of getting some very tasty water buffalo steak and having movies shown in the Swamp. In the meantime, Colonel Reese, the woman in charge of all the nurses in Korea, arrives to observe Margaret and her staff and, for some strange reason, becomes attracted to ..."
}, {
  "imdbId" : "0068098",
  "season" : "3",
  "episodeNumber" : "19",
  "title" : "Aid Station",
  "description" : "Hawkeye, Margaret, and Klinger travel to an aid station at the front, where they end up working closely together under heavy fire and unsanitary medical conditions."
}, {
  "imdbId" : "0068098",
  "season" : "3",
  "episodeNumber" : "20",
  "title" : "Love and Marriage",
  "description" : "Hawkeye and Trapper try to unite a Korean medic with his family in spite of Frank's interference and find out that a young GI isn't telling the whole truth about his upcoming marriage to a Korean woman."
}, {
  "imdbId" : "0068098",
  "season" : "3",
  "episodeNumber" : "21",
  "title" : "Big Mac",
  "description" : "The camp prepares for a visit from General Douglas MacArthur, but Klinger interrupts the proceedings with his attempts to earn a Section 8 discharge."
}, {
  "imdbId" : "0068098",
  "season" : "3",
  "episodeNumber" : "22",
  "title" : "Payday",
  "description" : "A clerical error results in an unexpected payday windfall for Hawkeye and the ire of a zealous payroll clerk."
}, {
  "imdbId" : "0068098",
  "season" : "3",
  "episodeNumber" : "23",
  "title" : "White Gold",
  "description" : "The attempted theft of penicillin from the 4077th by a group of suspected black marketeers brings Col. Flagg to investigate."
}, {
  "imdbId" : "0068098",
  "season" : "3",
  "episodeNumber" : "24",
  "title" : "Abyssinia, Henry",
  "description" : "Henry finds out he's been discharged from the army, and everyone at the 4077th prepares to say goodbye to him as he heads for home."
}, {
  "imdbId" : "0068098",
  "season" : "4",
  "episodeNumber" : "1",
  "title" : "Welcome to Korea",
  "description" : "Hawkeye returns from R&R to find out Trapper has been discharged. He rushes to the airport to say goodbye but misses him. But it gives him an opportunity to welcome Trapper's replacement, B.J., to Korea."
}, {
  "imdbId" : "0068098",
  "season" : "4",
  "episodeNumber" : "2",
  "title" : "Change of Command",
  "description" : "Col. Sherman T. Potter assumes command of the 4077th."
}, {
  "imdbId" : "0068098",
  "season" : "4",
  "episodeNumber" : "3",
  "title" : "It Happened One Night",
  "description" : "It's a bitterly cold night, and Hawkeye and B.J. are stuck with the overnight shift and a roomful of unruly patients. In the meantime, Margaret tells Frank that she keeps all his love letters--so he ransacks her tent to get them back."
}, {
  "imdbId" : "0068098",
  "season" : "4",
  "episodeNumber" : "4",
  "title" : "The Late Captain Pierce",
  "description" : "Hawkeye finds out that due to clerical error, he has been declared dead."
}, {
  "imdbId" : "0068098",
  "season" : "4",
  "episodeNumber" : "5",
  "title" : "Hey, Doc",
  "description" : "Hawkeye and B.J. agree to help a colleague trying to start a Korean restaurant when he gets home. But Frank refuses to cooperate--until he is involved in an ridiculous tank accident."
}, {
  "imdbId" : "0068098",
  "season" : "4",
  "episodeNumber" : "6",
  "title" : "The Bus",
  "description" : "After their bus breaks down in the middle of nowhere on the way back from a medical convention, Hawkeye, B.J., Colonel Potter, Frank and Radar find themselves stranded."
}, {
  "imdbId" : "0068098",
  "season" : "4",
  "episodeNumber" : "7",
  "title" : "Dear Mildred",
  "description" : "Colonel Potter writes his anniversary letter to his wife. Meanwhile, Frank and Margaret try to find the perfect anniversary gift, only to be outdone by Radar."
}, {
  "imdbId" : "0068098",
  "season" : "4",
  "episodeNumber" : "8",
  "title" : "The Kids",
  "description" : "The 4077th takes in Nurse Cratty's Korean orphans during a shelling attack, including a pregnant girl with a bullet wound. But Frank accuses one of the orphans of stealing his newly (and dubiously) awarded Purple Heart."
}, {
  "imdbId" : "0068098",
  "season" : "4",
  "episodeNumber" : "9",
  "title" : "Quo Vadis, Captain Chandler",
  "description" : "The latest group of casualties includes a bomber pilot who claims he's Jesus Christ. Frank and Margaret think he's faking battle fatigue in order to get a discharge, and they bring in Colonel Flagg to help expose him."
}, {
  "imdbId" : "0068098",
  "season" : "4",
  "episodeNumber" : "10",
  "title" : "Dear Peggy",
  "description" : "B.J. writes a letter home to his wife, and Father Mulcahy gets a visit from one of his rigid superiors."
}, {
  "imdbId" : "0068098",
  "season" : "4",
  "episodeNumber" : "11",
  "title" : "Of Moose and Men",
  "description" : "Hawkeye saves the life of a colonel who wants him reprimanded for disrespect. B.J. tries to save the marriage of a friend who found out his wife is cheating on him, and Frank is paranoid that all Koreans are hiding or burying bombs."
}, {
  "imdbId" : "0068098",
  "season" : "4",
  "episodeNumber" : "12",
  "title" : "Soldier of the Month",
  "description" : "The 4077th introduces a \"soldier of the month\" award, which includes a week of R&R in Tokyo, and Klinger and Radar go all out to win the honor. Frank is supposed to choose the winner, but he contracts a rare fever."
}, {
  "imdbId" : "0068098",
  "season" : "4",
  "episodeNumber" : "13",
  "title" : "The Gun",
  "description" : "A vintage revolver is stolen from the camp's gun locker and Radar is accused as the thief."
}, {
  "imdbId" : "0068098",
  "season" : "4",
  "episodeNumber" : "14",
  "title" : "Mail Call, Again",
  "description" : "Colonel Potter finds out that he's about to become a grandfather, and Major Burns learns that his wife knows about his affair with Margaret--and wants a divorce."
}, {
  "imdbId" : "0068098",
  "season" : "4",
  "episodeNumber" : "15",
  "title" : "The Price of Tomato Juice",
  "description" : "What seems to be a simple request to get tomato juice for Colonel Potter becomes a ridiculous, complicated ordeal when Major Burns asks for something in return."
}, {
  "imdbId" : "0068098",
  "season" : "4",
  "episodeNumber" : "16",
  "title" : "Dear Ma",
  "description" : "Radar's letter home recounts the latest round of foot inspections, and how Colonel Potter's wife's premonition of bad luck comes to fruition."
}, {
  "imdbId" : "0068098",
  "season" : "4",
  "episodeNumber" : "17",
  "title" : "Der Tag",
  "description" : "Hawkeye and B.J. place a toe tag on a passed-out Frank as part of a drunken practical joke. But the joke backfires on them when he is accidentally shipped out to the front lines."
}, {
  "imdbId" : "0068098",
  "season" : "4",
  "episodeNumber" : "18",
  "title" : "Hawkeye",
  "description" : "Hawkeye Pierce, going solo, has an accident with a Jeep, and is rescued by a South Korean family. To prevent himself from succumbing to a concussion, Hawkeye begins talking endlessly to the family, who can't understand a word he's saying."
}, {
  "imdbId" : "0068098",
  "season" : "4",
  "episodeNumber" : "19",
  "title" : "Some 38th Parallels",
  "description" : "Hawkeye has impotency problems, Frank auctions off the 4077th's garbage, and Radar becomes distraught after a patient he has taken special interest in dies."
}, {
  "imdbId" : "0068098",
  "season" : "4",
  "episodeNumber" : "20",
  "title" : "The Novocaine Mutiny",
  "description" : "Hawkeye is court martialed for mutiny under Frank Burns' command."
}, {
  "imdbId" : "0068098",
  "season" : "4",
  "episodeNumber" : "21",
  "title" : "Smilin' Jack",
  "description" : "A chopper pilot with diabetes dead set on bringing in the most wounded from the front to be the 'Chopper Pilot of the Year' continues flying against the docs' orders."
}, {
  "imdbId" : "0068098",
  "season" : "4",
  "episodeNumber" : "22",
  "title" : "The More I See You",
  "description" : "A nurse that Hawkeye used to live with and never got over arrives at the 4077th. And Hawkeye's heartbreak is only intensified when he learns that she is now married."
}, {
  "imdbId" : "0068098",
  "season" : "4",
  "episodeNumber" : "23",
  "title" : "Deluge",
  "description" : "The Chinese Army joins the war, killing any hopes the 4077th has about a speedy resolution and homecoming."
}, {
  "imdbId" : "0068098",
  "season" : "4",
  "episodeNumber" : "24",
  "title" : "The Interview",
  "description" : "War Correspondent Clete Roberts interviews the members of the 4077."
}, {
  "imdbId" : "0068098",
  "season" : "5",
  "episodeNumber" : "1",
  "title" : "Bug Out",
  "description" : "When a rumor for a camp relocation turns out to be real, Hawkeye, Margaret and Radar volunteer to stay behind for a patient who cannot be moved."
}, {
  "imdbId" : "0068098",
  "season" : "5",
  "episodeNumber" : "2",
  "title" : "Margaret's Engagement",
  "description" : "Margaret's sudden engagement comes as a surprise to everyone, but Frank predictably takes it the hardest."
}, {
  "imdbId" : "0068098",
  "season" : "5",
  "episodeNumber" : "3",
  "title" : "Out of Sight, Out of Mind",
  "description" : "Hawkeye is temporarily blinded while trying to fix the nurses' furnace, and Frank finds a sure-fire way to win bets on baseball games."
}, {
  "imdbId" : "0068098",
  "season" : "5",
  "episodeNumber" : "4",
  "title" : "Lt. Radar O'Reilly",
  "description" : "To settle a poker debt, an officer forges promotion papers for Radar to become a Lieutenant"
}, {
  "imdbId" : "0068098",
  "season" : "5",
  "episodeNumber" : "5",
  "title" : "The Nurses",
  "description" : "The nurses go behind Margaret's back so that a fellow nurse confined to her tent can spend the night with her soldier husband who is paying her a surprise visit."
}, {
  "imdbId" : "0068098",
  "season" : "5",
  "episodeNumber" : "6",
  "title" : "The Abduction of Margaret Houlihan",
  "description" : "Margaret takes off in the middle of the night to help deliver a Korean baby. Nobody knows of her whereabouts, and Colonel Flagg is brought in to help investigate her disappearance."
}, {
  "imdbId" : "0068098",
  "season" : "5",
  "episodeNumber" : "7",
  "title" : "Dear Sigmund",
  "description" : "Psychiatrist Sidney Freedman composes a letter to Sigmund Freud during a visit to the 4077, while the rest of the camp endures the hijinks of a mystery prankster."
}, {
  "imdbId" : "0068098",
  "season" : "5",
  "episodeNumber" : "8",
  "title" : "Mulcahy's War",
  "description" : "Father Mulcahy, troubled by his lack of experience at the front, insists on accompanying Radar for an errand there."
}, {
  "imdbId" : "0068098",
  "season" : "5",
  "episodeNumber" : "9",
  "title" : "The Korean Surgeon",
  "description" : "Instead of turning him in as a prisoner of war, Hawkeye and B.J. pull some strings to get a wounded North Korean surgeon a spot on the staff."
}, {
  "imdbId" : "0068098",
  "season" : "5",
  "episodeNumber" : "10",
  "title" : "Hawkeye Get Your Gun",
  "description" : "Hawkeye and Potter provide assistance at a Korean clinic, and run into an enemy attack on the way home. Meanwhile, Klinger begins posing as a Gypsy to help get his discharge papers."
}, {
  "imdbId" : "0068098",
  "season" : "5",
  "episodeNumber" : "11",
  "title" : "The Colonel's Horse",
  "description" : "Everybody pitches in to save Colonel Potter's horse, who becomes sick while Potter is away in Tokyo. And Margaret asks Hawkeye, not Frank, to operate on her appendix."
}, {
  "imdbId" : "0068098",
  "season" : "5",
  "episodeNumber" : "12",
  "title" : "Exorcism",
  "description" : "To save the life of an elderly local who rejects an operation because he believes bad spirits surround the 4077th, Colonel Potter permits a Korean exorcism."
}, {
  "imdbId" : "0068098",
  "season" : "5",
  "episodeNumber" : "13",
  "title" : "Hawk's Nightmare",
  "description" : "Hawkeye starts sleepwalking and having horrific nightmares. He begins to think that he may be starting to lose his \"war against the war.\""
}, {
  "imdbId" : "0068098",
  "season" : "5",
  "episodeNumber" : "14",
  "title" : "The Most Unforgettable Characters",
  "description" : "Radar becomes an aspiring writer after ordering a flier from a comic book, and Hawkeye and B.J. give Frank a surprise birthday present that only he will appreciate."
}, {
  "imdbId" : "0068098",
  "season" : "5",
  "episodeNumber" : "15",
  "title" : "38 Across",
  "description" : "A fouled radio call for help on a crossword puzzle leads to a senior officer coming to the 4077th to help with a supposed serious medical problem."
}, {
  "imdbId" : "0068098",
  "season" : "5",
  "episodeNumber" : "16",
  "title" : "Ping Pong",
  "description" : "The 4077th hosts a traditional Korean wedding, much to Frank's objections. And Colonel Potter runs into an old friend who has put his troops in jeopardy so that he could receive a promotion."
}, {
  "imdbId" : "0068098",
  "season" : "5",
  "episodeNumber" : "17",
  "title" : "End Run",
  "description" : "A former star college football player suffers a severe leg injury in combat and must deal with the consequences, and Major Burns goes behind Colonel Potter's back to set up a boxing match between Klinger and Zale."
}, {
  "imdbId" : "0068098",
  "season" : "5",
  "episodeNumber" : "18",
  "title" : "Hanky Panky",
  "description" : "B.J. falls off the fidelity wagon while trying to provide consolation to a nurse whose marriage has just ended. But will he confess his infidelity to his wife?"
}, {
  "imdbId" : "0068098",
  "season" : "5",
  "episodeNumber" : "19",
  "title" : "Hepatitis",
  "description" : "The 4077th has an outbreak of hepatitis and Hawkeye needs to inoculate the reluctant staff while dealing with back pain."
}, {
  "imdbId" : "0068098",
  "season" : "5",
  "episodeNumber" : "20",
  "title" : "The General's Practitioner",
  "description" : "General Korshak wants Hawkeye to be his personal practitioner, despite his constant snottiness. And Radar helps take care of a soldier's half-Korean baby after he is shipped back home."
}, {
  "imdbId" : "0068098",
  "season" : "5",
  "episodeNumber" : "21",
  "title" : "Movie Tonight",
  "description" : "Colonel Potter hopes a Western will be the cure for the 4077th's morale problem. But during the show, the staff of the camp is forced to make its own entertainment during the frequent film breakages."
}, {
  "imdbId" : "0068098",
  "season" : "5",
  "episodeNumber" : "22",
  "title" : "Souvenirs",
  "description" : "Hawkeye and BJ try to stop a chopper pilot from selling souvenirs derived from war materials derived from locals facing danger getting them, and Klinger becomes a pole-sitter in his latest attempt to get a Section Eight."
}, {
  "imdbId" : "0068098",
  "season" : "5",
  "episodeNumber" : "23",
  "title" : "Post Op",
  "description" : "The 4077th is deluged with patients and their individual medical histories. Then they run out of blood and everyone is donating at 48-hour intervals."
}, {
  "imdbId" : "0068098",
  "season" : "5",
  "episodeNumber" : "24",
  "title" : "Margaret's Marriage",
  "description" : "Pressured by Frank, Margaret decides to marry Colonel Donald Penobscott at the 4077th. When Donald arrives in camp, he is treated to a bachelor party and a practical joke while the nurses give Margaret a bridal shower."
}, {
  "imdbId" : "0068098",
  "season" : "6",
  "episodeNumber" : "1",
  "title" : "Fade Out, Fade In",
  "description" : "Frank Burns cracks up over Margaret's marriage while on R&R in Tokyo, and Major Charles Emerson Winchester III is sent to the 4077th as a replacement by a vindictive superior officer."
}, {
  "imdbId" : "0068098",
  "season" : "6",
  "episodeNumber" : "2",
  "title" : "Fallen Idol",
  "description" : "Radar has always looked up to Hawkeye and admired him as his hero. But after suffering a Jeep accident en route to R&R at Hawkeye's behest. Radar questions his own hero worship. Particularly when he and his hero have a falling out."
}, {
  "imdbId" : "0068098",
  "season" : "6",
  "episodeNumber" : "3",
  "title" : "Last Laugh",
  "description" : "A practical joking friend gets BJ into serious trouble when he is arrested for a run-in he supposedly had with a general in Seoul."
}, {
  "imdbId" : "0068098",
  "season" : "6",
  "episodeNumber" : "4",
  "title" : "War of Nerves",
  "description" : "Sidney Freedman feels depressed over Tom, a young soldier, who blames Sidney for his injuries because Sidney sent him back into combat. The 4077th members light a bonfire to release their stress."
}, {
  "imdbId" : "0068098",
  "season" : "6",
  "episodeNumber" : "5",
  "title" : "The Winchester Tapes",
  "description" : "Hawkeye tries to travel to Seoul in order to visit Nurse Gilmore for the weekend. Charles tapes an angry message to his influential parents back home in Boston, asking for their help in getting him reassigned stateside."
}, {
  "imdbId" : "0068098",
  "season" : "6",
  "episodeNumber" : "6",
  "title" : "The Light That Failed",
  "description" : "A delivery error keeps the 4077th from receiving a vital shipment of supplies, Winchester has a selfish reaction to an error that nearly kills a patient, and everyone is forced to guess at the murderer's identity in a mystery novel."
}, {
  "imdbId" : "0068098",
  "season" : "6",
  "episodeNumber" : "7",
  "title" : "In Love and War",
  "description" : "Despite Colonel Potter's warning, Hawkeye falls in love with a Korean villager. Meanwhile, Margaret learns that her husband Donald may have made a pass at a new nurse assigned to the 4077th."
}, {
  "imdbId" : "0068098",
  "season" : "6",
  "episodeNumber" : "8",
  "title" : "Change Day",
  "description" : "Winchester plots to cheat the natives when the Army changes the military scrip while Klinger tries to attempt to apply to West Point in order to drop out later."
}, {
  "imdbId" : "0068098",
  "season" : "6",
  "episodeNumber" : "9",
  "title" : "Images",
  "description" : "Radar wants to get a tattoo, which Hawkeye and B.J. try to discourage. Major Houlihan wants to transfer one of her nurses out because she is too emotional for the job."
}, {
  "imdbId" : "0068098",
  "season" : "6",
  "episodeNumber" : "10",
  "title" : "The M*A*S*H Olympics",
  "description" : "When Col. Potter decides the 4077th personnel are out of shape, he orders them to exercise. To motivate them, he comes up with the idea for a series of competitions like the Olympics, with the prize being a 3-day pass."
}, {
  "imdbId" : "0068098",
  "season" : "6",
  "episodeNumber" : "11",
  "title" : "The Grim Reaper",
  "description" : "Colonel Bloodworth threatens to press court-martial charges against Hawkeye, who shoved him in the bar. But then he becomes a patient and witnesses Hawkeye's skills. Klinger bonds with a patient from his hometown."
}, {
  "imdbId" : "0068098",
  "season" : "6",
  "episodeNumber" : "12",
  "title" : "Comrades in Arms: Part 1",
  "description" : "Hawkeye and Margaret become romantically involved while they are trapped behind enemy lines."
}, {
  "imdbId" : "0068098",
  "season" : "6",
  "episodeNumber" : "13",
  "title" : "Comrades in Arms: Part 2",
  "description" : "B.J. disobeys orders and goes out to find Hawkeye and Margret, who are still missing in action. Meanwhile, their romantic relationship quickly goes up in flames, and they become even more hostile toward each other."
}, {
  "imdbId" : "0068098",
  "season" : "6",
  "episodeNumber" : "14",
  "title" : "The Merchant of Korea",
  "description" : "B.J. and Hawkeye are fed up with doing favors for Winchester because they owe him money. So they challenge him to a poker game to win it back."
}, {
  "imdbId" : "0068098",
  "season" : "6",
  "episodeNumber" : "15",
  "title" : "The Smell of Music",
  "description" : "Hawkeye and B.J. refuse to shower until Charles stops playing his French horn, and Colonel Potter deals with a patient who wants to kill himself because he is now disfigured."
}, {
  "imdbId" : "0068098",
  "season" : "6",
  "episodeNumber" : "16",
  "title" : "Patent 4077",
  "description" : "Hawkeye is fed up with having to work with inadequate surgical equipment, so he tries to find somebody to create a makeshift clamp for him. And Klinger tries to find Margaret's wedding ring after it was accidentally thrown out with the trash."
}, {
  "imdbId" : "0068098",
  "season" : "6",
  "episodeNumber" : "17",
  "title" : "Tea and Empathy",
  "description" : "Father Mulcahy and Klinger retrieve some stolen penicillin after a soldier's confession, B.J. deals with a patient's morphine addiction, and British Major Ross demands that Hawkeye release his still-injured soldiers."
}, {
  "imdbId" : "0068098",
  "season" : "6",
  "episodeNumber" : "18",
  "title" : "Your Hit Parade",
  "description" : "As the unit becomes overrun with casualties and tempers begin to flare, Radar tries to raise everyone's spirits by playing some new records over the intercom."
}, {
  "imdbId" : "0068098",
  "season" : "6",
  "episodeNumber" : "19",
  "title" : "What's Up, Doc?",
  "description" : "Hawkeye conducts a rabbit test on Radar's bunny to find out if Margaret is pregnant, and a patient desperate to get home holds Winchester hostage."
}, {
  "imdbId" : "0068098",
  "season" : "6",
  "episodeNumber" : "20",
  "title" : "Mail Call Three",
  "description" : "Klinger's wife wants a divorce, Radar's upset because his mom is seeing a new man, B.J. finds out that another man made a pass at his wife, and Hawkeye receives another love letter for another soldier named Benjamin Pierce."
}, {
  "imdbId" : "0068098",
  "season" : "6",
  "episodeNumber" : "21",
  "title" : "Temporary Duty",
  "description" : "The 4077th and the 8063rd exchange Hawkeye and a nurse for a crude bumpkin surgeon and a personal friend of Margaret."
}, {
  "imdbId" : "0068098",
  "season" : "6",
  "episodeNumber" : "22",
  "title" : "Potter's Retirement",
  "description" : "When Col. Potter learns of an informant feeding negative reports on his command bad enough to prompt an outside inspection, he decides to retire."
}, {
  "imdbId" : "0068098",
  "season" : "6",
  "episodeNumber" : "23",
  "title" : "Dr. Winchester and Mr. Hyde",
  "description" : "While dealing with a long stretch of surgery duty, Winchester gets addicted to amphetamines. And Radar sets up a mouse race competition between the 4077th and a group of cocky Marine patients."
}, {
  "imdbId" : "0068098",
  "season" : "6",
  "episodeNumber" : "24",
  "title" : "Major Topper",
  "description" : "Between the Swamp-mates trying to top each other, the camp deals with a bad batch of morphine and a corporal who shoots down invisible enemy gliders."
}, {
  "imdbId" : "0068098",
  "season" : "7",
  "episodeNumber" : "1",
  "title" : "Commander Pierce",
  "description" : "When Pierce is temporarily put in charge of the 4077th, the weight of the responsibility takes its toll. He changes, becoming up-tight and authoritarian."
}, {
  "imdbId" : "0068098",
  "season" : "7",
  "episodeNumber" : "2",
  "title" : "Peace on Us",
  "description" : "When the Army increases the number of points needed for a discharge, Hawkeye gets angry and interrupts official peace talks. Meanwhile, Margaret decides to divorce Donald after he permanently transfers himself stateside."
}, {
  "imdbId" : "0068098",
  "season" : "7",
  "episodeNumber" : "3",
  "title" : "Lil",
  "description" : "Radar gets bent out of shape when he thinks Colonel Potter is spending too much time with a visiting female colonel, and Hawkeye tries to figure out what BJ's initials stand for."
}, {
  "imdbId" : "0068098",
  "season" : "7",
  "episodeNumber" : "4",
  "title" : "Our Finest Hour",
  "description" : "An hour-long series retrospective. A reporter, Clete Roberts, interviews the staff. Mixed in are scenes from past shows."
}, {
  "imdbId" : "0068098",
  "season" : "7",
  "episodeNumber" : "5",
  "title" : "The Billfold Syndrome",
  "description" : "Major Winchester decides to quit talking to everyone at the camp, which Hawkeye and B.J. take as a challenge. Meanwhile, a medic gets amnesia."
}, {
  "imdbId" : "0068098",
  "season" : "7",
  "episodeNumber" : "6",
  "title" : "None Like It Hot",
  "description" : "A bath tub Hawkeye and B.J. purchase during a heat wave instantly becomes the ultimate hot spot, while Radar prepares for a tonsillectomy."
}, {
  "imdbId" : "0068098",
  "season" : "7",
  "episodeNumber" : "7",
  "title" : "They Call the Wind Korea",
  "description" : "During a wind storm, and while lost on the way to Seoul, Winchester and Klinger come across an overturned Greek transport with several injured men."
}, {
  "imdbId" : "0068098",
  "season" : "7",
  "episodeNumber" : "8",
  "title" : "Major Ego",
  "description" : "Major Winchester lets his surgical prowess go to his head when a \"Stars and Stripes\" journalist comes to interview him. But the journalist is more interested in making moves on Margaret than getting the story."
}, {
  "imdbId" : "0068098",
  "season" : "7",
  "episodeNumber" : "9",
  "title" : "Baby, It's Cold Outside",
  "description" : "The 4077th is forced to use extreme measures to save a group of soldiers suffering from hypothermia, while Klinger suffers temporary deafness after a mine explosion on his watch."
}, {
  "imdbId" : "0068098",
  "season" : "7",
  "episodeNumber" : "10",
  "title" : "Point of View",
  "description" : "You see a wounded soldier being treated at the 4077th through his eyes."
}, {
  "imdbId" : "0068098",
  "season" : "7",
  "episodeNumber" : "11",
  "title" : "Dear Comrade",
  "description" : "A North Korean Spy infiltrates the 4077 and poses as Charles' houseboy, to observe and report on 4077th's efficiency and success to his superiors. The staff is baffled by a skin-rash epidemic."
}, {
  "imdbId" : "0068098",
  "season" : "7",
  "episodeNumber" : "12",
  "title" : "Out of Gas",
  "description" : "When the camp copes with a critical shortage of sodium pentathol, a vital anesthetic, Father Mulcahy must use his black market contacts to get some."
}, {
  "imdbId" : "0068098",
  "season" : "7",
  "episodeNumber" : "13",
  "title" : "An Eye for a Tooth",
  "description" : "Winchester encourages Hawkeye, B.J. and Margaret to raise the stakes in their practical joke battle, and Father Mulcahy is desperate to receive a promotion."
}, {
  "imdbId" : "0068098",
  "season" : "7",
  "episodeNumber" : "14",
  "title" : "Dear Sis",
  "description" : "It's Christmas time in Korea, and everybody's depressed--especially Father Mulcahy, who is concerned that he isn't making a difference to anyone."
}, {
  "imdbId" : "0068098",
  "season" : "7",
  "episodeNumber" : "15",
  "title" : "B. J. Papa San",
  "description" : "B.J. helps out a local Korean family. Meanwhile, a general has a series of mishaps in camp."
}, {
  "imdbId" : "0068098",
  "season" : "7",
  "episodeNumber" : "16",
  "title" : "Inga",
  "description" : "Hawkeye falls for a visiting Swedish doctor, but is disconcerted by her take-charge ways. As a result, he is forced to confront his chauvinistic views toward powerful women."
}, {
  "imdbId" : "0068098",
  "season" : "7",
  "episodeNumber" : "17",
  "title" : "The Price",
  "description" : "Klinger tries to bribe Colonel Potter, but Potter is more concerned with the disappearance of his horse, Sophie. Meanwhile, Hawkeye and B.J. try to hide a man who is about to be drafted into the Korean army."
}, {
  "imdbId" : "0068098",
  "season" : "7",
  "episodeNumber" : "18",
  "title" : "The Young and the Restless",
  "description" : "The arrival of fresh-faced lecturer Capt. Simmons and his subsequent performance in ER turns Winchester into a drunk, Potter into an invalid, and BJ into a bookworm. Meanwhile, Klinger begins acting like he's back home in Toledo."
}, {
  "imdbId" : "0068098",
  "season" : "7",
  "episodeNumber" : "19",
  "title" : "Hot Lips Is Back in Town",
  "description" : "Margaret celebrates her newly obtained divorce by creating a new way to handle triage and invites a general to observe. Radar is enamored of a new nurse and tries everything he knows to get her attention."
}, {
  "imdbId" : "0068098",
  "season" : "7",
  "episodeNumber" : "20",
  "title" : "C*A*V*E",
  "description" : "A hurried relocation to a cave is complicated by Hawkeye revealing he has claustrophobia."
}, {
  "imdbId" : "0068098",
  "season" : "7",
  "episodeNumber" : "21",
  "title" : "Rally 'Round the Flagg, Boys",
  "description" : "A patient accuses Hawkeye of being a Communist sympathizer when he operates on a Korean soldier ahead of an American. As a result, Colonel Flagg attempts to recruit Winchester to spy on Hawkeye."
}, {
  "imdbId" : "0068098",
  "season" : "7",
  "episodeNumber" : "22",
  "title" : "Preventative Medicine",
  "description" : "Hawkeye performs a shocking and sinister stunt to keep a war-obsessed colonel from sending more young victims to a possible early grave, while Klinger tries to use voodoo on Potter to get a discharge."
}, {
  "imdbId" : "0068098",
  "season" : "7",
  "episodeNumber" : "23",
  "title" : "A Night at Rosie's",
  "description" : "In an act of protest, Hawkeye goes to Rosie's Bar and decrees he is not leaving. One by one he is joined by fellow surgeons and staff, including an annoyed Colonel Potter."
}, {
  "imdbId" : "0068098",
  "season" : "7",
  "episodeNumber" : "24",
  "title" : "Ain't Love Grand",
  "description" : "While B.J. and Hawkeye snipe at each other, Klinger romances a nurse and Winchester romances a Korean working girl."
}, {
  "imdbId" : "0068098",
  "season" : "7",
  "episodeNumber" : "25",
  "title" : "The Party",
  "description" : "Even while the camp is bugging out (and back), B.J. promotes the idea of a stateside \"reunion\" for the families of those at the 4077th."
}, {
  "imdbId" : "0068098",
  "season" : "8",
  "episodeNumber" : "1",
  "title" : "Too Many Cooks",
  "description" : "The 4077 receives a patient who is a bumbler at the front but regular gourmet in the mess tent. The surgical staff try and convince Potter to keep him but he flatly refuses. He has enough trouble as it is, his marriage is in danger."
}, {
  "imdbId" : "0068098",
  "season" : "8",
  "episodeNumber" : "2",
  "title" : "Are You Now, Margaret?",
  "description" : "A visiting Congressional aide accuses Margaret of being a Communist sympathizer and it could ruin her career. This dovetails with Klinger entering the Stars & Stripes photo contest."
}, {
  "imdbId" : "0068098",
  "season" : "8",
  "episodeNumber" : "3",
  "title" : "Guerilla My Dreams",
  "description" : "Hawkeye refuses to accept a South Korean officer's warning that a wounded civilian he brought in is a dangerous enemy guerrilla soldier. Charles finds a new chess opponent."
}, {
  "imdbId" : "0068098",
  "season" : "8",
  "episodeNumber" : "4",
  "title" : "Good-Bye Radar: Part 1",
  "description" : "As Radar returns from leave, the camp struggles with a total loss of electricity due to a malfunctioning generator and a stolen backup."
}, {
  "imdbId" : "0068098",
  "season" : "8",
  "episodeNumber" : "5",
  "title" : "Good-Bye Radar: Part 2",
  "description" : "Although Radar is granted a hardship discharge, the camp's difficulties make him seriously consider staying. Klinger begins taking over the company clerk job."
}, {
  "imdbId" : "0068098",
  "season" : "8",
  "episodeNumber" : "6",
  "title" : "Period of Adjustment",
  "description" : "B.J. and Klinger get drunk in despair at being envious to the now departed Radar."
}, {
  "imdbId" : "0068098",
  "season" : "8",
  "episodeNumber" : "7",
  "title" : "Nurse Doctor",
  "description" : "The senior staff's attempt to help a nurse enter medical school to become a doctor is complicated by her unwanted romantic advances towards Father Mulcahy. Only Charles is unaffected by a drought and water shortage."
}, {
  "imdbId" : "0068098",
  "season" : "8",
  "episodeNumber" : "8",
  "title" : "Private Finance",
  "description" : "Pierce deals with a dead soldier's ill-gotten gains, while a Korean mama attacks Klinger for dishonoring her daughter."
}, {
  "imdbId" : "0068098",
  "season" : "8",
  "episodeNumber" : "9",
  "title" : "Mr. and Mrs. Who?",
  "description" : "After a drunken trip to Tokyo, Winchester is visited by his new wife. Meanwhile, the camp is hit with an outbreak of hemorrhagic fever that they don't know how to deal with."
}, {
  "imdbId" : "0068098",
  "season" : "8",
  "episodeNumber" : "10",
  "title" : "The Yalu Brick Road",
  "description" : "Hawkeye and BJ get lost in enemy territory while Klinger's Thanksgiving turkey sickens most of the camp with salmonella."
}, {
  "imdbId" : "0068098",
  "season" : "8",
  "episodeNumber" : "11",
  "title" : "Life Time",
  "description" : "When soldier needs a valve replacement or else he could be paralyzed. And when another soldier is brain dead but still alive, they have to decide if they should remove his valve to save the other and they only have 20 minutes to decide."
}, {
  "imdbId" : "0068098",
  "season" : "8",
  "episodeNumber" : "12",
  "title" : "Dear Uncle Abdul",
  "description" : "Resigned to staying for his term of service, Klinger writes home about his job, which includes appeasing the officers' eccentricities. A home-bound patient says goodbye to the slow-witted buddy who saved his life in battle."
}, {
  "imdbId" : "0068098",
  "season" : "8",
  "episodeNumber" : "13",
  "title" : "Captains Outrageous",
  "description" : "While the 4077th staff substitute for Rosie after she's injured in a brawl at her bar, Father Mulcahy is at the end of his patience when he is passed over for promotion yet again."
}, {
  "imdbId" : "0068098",
  "season" : "8",
  "episodeNumber" : "14",
  "title" : "Stars and Stripes",
  "description" : "During a lull in casualties, friction occurs when Charles and B.J. try to write an article for a prestigious journal on a procedure they'd performed. Margaret discovers more about herself through a visit from Scully."
}, {
  "imdbId" : "0068098",
  "season" : "8",
  "episodeNumber" : "15",
  "title" : "Yessir, That's Our Baby",
  "description" : "When the 4077th staff find an abandoned Amerasian baby, their efforts to help her prove a frustrating struggle."
}, {
  "imdbId" : "0068098",
  "season" : "8",
  "episodeNumber" : "16",
  "title" : "Bottle Fatigue",
  "description" : "Hawkeye goes on the wagon and drives everyone crazy. When Winchester hears that his sister is going to marry an Italian, he goes nuts, doing everything in his power to stop the marriage."
}, {
  "imdbId" : "0068098",
  "season" : "8",
  "episodeNumber" : "17",
  "title" : "Heal Thyself",
  "description" : "When Potter and Charles are quarantined with mumps and get on each others' nerves, a replacement surgeon from Tokyo is brought in."
}, {
  "imdbId" : "0068098",
  "season" : "8",
  "episodeNumber" : "18",
  "title" : "Old Soldiers",
  "description" : "When Potter visits a sick friend in Tokyo, Hawkeye is in charge and the 4077th treats a group of refugee orphans."
}, {
  "imdbId" : "0068098",
  "season" : "8",
  "episodeNumber" : "19",
  "title" : "Morale Victory",
  "description" : "While Hawkeye and BJ struggle as morale officers of the disgruntled camp, Winchester tries to help a patient whose pianist career seems ruined due to a crippled hand."
}, {
  "imdbId" : "0068098",
  "season" : "8",
  "episodeNumber" : "20",
  "title" : "Lend a Hand",
  "description" : "Everyone at the 4077 is so cranky, cold and bored, BJ decides the only way to uplift spirits is to \"borrow\" Hawkeye's birthday. Hawkeye is not amused. Captain Anthony Borelli (Robert Alda) visits the 4077 to lecture about peripheral nerve grafting to replace entire segments of skin. Borelli has always really annoyed Hawkeye. When the surgeon is injured at the Battalion Aid Station, Hawkeye rushes to volunteer for duty, just to avoid Borelli. But Borelli insists on accompanying him--so Hawkeye \"borrows\" BJ's wedding anniversary to substitute for his birthday. After ..."
}, {
  "imdbId" : "0068098",
  "season" : "8",
  "episodeNumber" : "21",
  "title" : "Goodbye, Cruel World",
  "description" : "When Klinger's attempt to redecorate his office is rejected, he decides to desert while Hawkeye has a homebound war hero patient who attempts suicide."
}, {
  "imdbId" : "0068098",
  "season" : "8",
  "episodeNumber" : "22",
  "title" : "Dreams",
  "description" : "During a hectic non-stop rush of wounded that is overcrowding the camp, the staff's brief naps have disturbing dreams in which the war is an never-ending intrusion."
}, {
  "imdbId" : "0068098",
  "season" : "8",
  "episodeNumber" : "23",
  "title" : "War Co-Respondent",
  "description" : "B.J. feels torn when he and visiting war correspondent Aggie O'Shea fall for each other."
}, {
  "imdbId" : "0068098",
  "season" : "8",
  "episodeNumber" : "24",
  "title" : "Back Pay",
  "description" : "Pierce is upset by the fact that civilian doctors are making a lot of money off the war, and decides to bill the army for all his work. Meanwhile, Winchester is reluctantly showing 3 Korean doctors American medical techniques, putting them down all the while, until he is on the receiving end of their expertise."
}, {
  "imdbId" : "0068098",
  "season" : "8",
  "episodeNumber" : "25",
  "title" : "April Fools",
  "description" : "Spit and polish Colonel Tucker visits the camp at the worst time during April Fool's Day. Klinger, egged on by Sergeant Rizzo, uses reverse psychology to try to get out of the Army."
}, {
  "imdbId" : "0068098",
  "season" : "9",
  "episodeNumber" : "1",
  "title" : "The Best of Enemies",
  "description" : "En route to R&R, Hawkeye is flagged down by a North Korean soldier who holds him at gun point, forcing him to treat his wounded comrade. Back in camp, the officers change partners in a bridge tournament."
}, {
  "imdbId" : "0068098",
  "season" : "9",
  "episodeNumber" : "2",
  "title" : "Letters",
  "description" : "The staff of the 4077th answer letters from school children from Hawkeye's home town of Crabapple Cove."
}, {
  "imdbId" : "0068098",
  "season" : "9",
  "episodeNumber" : "3",
  "title" : "Cementing Relationships",
  "description" : "To fight an ongoing infection in the O.R., the staff decides to remove the old wood floor and make a concrete one. The surgeons do the menial labor while Klinger acts as foreman (he knows cement and it's not that hard); while an Italian soldier falls head-over-heels for Margaret."
}, {
  "imdbId" : "0068098",
  "season" : "9",
  "episodeNumber" : "4",
  "title" : "Father's Day",
  "description" : "Margaret's cold-hearted father visits while the gang tries to hide a stolen side of beef that was given to them by an appreciative patient."
}, {
  "imdbId" : "0068098",
  "season" : "9",
  "episodeNumber" : "5",
  "title" : "Death Takes a Holiday",
  "description" : "While local orphans attend a Christmas party in the mess tent, Hawkeye, B.J., and Margaret try to save the life of a critically injured solider so that his family won't think of Christmas as the day that their father died."
}, {
  "imdbId" : "0068098",
  "season" : "9",
  "episodeNumber" : "6",
  "title" : "A War for All Seasons",
  "description" : "As the year 1950 comes to a close, the 4077th staff and surgeons hope 1951 is \"a damn sight better\" and hopefully they'll be going home. The year 1951 is not uneventful: Klinger makes a bet on a baseball team Charles is sure will lose, Hawkeye and B.J. build a kidney machine, Margaret knits a scarf which soon becomes a bed sheet, and Father Mulcahy plants a garden. By the time New Year's Eve rolls around again, they all hope 1952 will be \"a damn sight better\" and that they will be returning home."
}, {
  "imdbId" : "0068098",
  "season" : "9",
  "episodeNumber" : "7",
  "title" : "Your Retention Please",
  "description" : "When an pushy retention officer comes to the camp to persuade staff to extend their terms of service, Klinger, distraught at his domestic situation, is persuaded to do so."
}, {
  "imdbId" : "0068098",
  "season" : "9",
  "episodeNumber" : "8",
  "title" : "Tell It to the Marines",
  "description" : "B.J. and Hawkeye try to get a hardship discharge for an immigrant Marine whose Mom is being deported before he can get home. Winchester becomes C.O. for a few days, using his new position to get himself silk sheets and other \"basic necessities of life\"."
}, {
  "imdbId" : "0068098",
  "season" : "9",
  "episodeNumber" : "9",
  "title" : "Taking the Fifth",
  "description" : "Klinger happens upon a bottle of vintage French wine and Hawkeye uses it to lure a nurse into his clutches. Winchester deals with Klinger to get more bottles of the wine. Col. Potter trades with the Canadians for a special anesthetic forbidden by the U.S. Army."
}, {
  "imdbId" : "0068098",
  "season" : "9",
  "episodeNumber" : "10",
  "title" : "Operation Friendship",
  "description" : "When the steam generator explodes in O.R., Klinger pushes Charles out of the line of fire just in time, but B.J. catches part of the blast and has a serious arm injury. For saving his life, Charles declares he is fully indebted to Maxwell Klinger and becomes his personal assistant. But after several days of bowing to Klinger's ever command, Charles begins to wish he HAD been killed. Meanwhile, Hawkeye doesn't like the doctor called in to help treat B.J., who refuses to admit there is anything wrong with him."
}, {
  "imdbId" : "0068098",
  "season" : "9",
  "episodeNumber" : "11",
  "title" : "No Sweat",
  "description" : "We're having a heat wave! The 4077th deals with a sudden heat wave in their own personal ways: Klinger disassembles the P.A. system, Charles goes through all of his tax returns and bonds, B.J. stresses over a letter from Peg, Margaret develops a severe case of prickly heat, and Colonel Potter can't get a good night's sleep."
}, {
  "imdbId" : "0068098",
  "season" : "9",
  "episodeNumber" : "12",
  "title" : "Depressing News",
  "description" : "When a supply snafu brings too many tongue depressors to camp, Hawkeye uses the extras to erect a monument to the wounded who have passed through camp. Klinger starts his own camp newspaper."
}, {
  "imdbId" : "0068098",
  "season" : "9",
  "episodeNumber" : "13",
  "title" : "No Laughing Matter",
  "description" : "Hawkeye's challenge to go through a day without telling a joke is complicated by Winchester's amusingly desperate attempt to curry the favor of a hated visiting officer."
}, {
  "imdbId" : "0068098",
  "season" : "9",
  "episodeNumber" : "14",
  "title" : "Oh, How We Danced",
  "description" : "When Winchester goes to inspect the sanitary conditions at another camp, the failing mark he gives the commander is met with physical violence. Meanwhile, the gang comes up with a surprise for B.J. on his anniversary."
}, {
  "imdbId" : "0068098",
  "season" : "9",
  "episodeNumber" : "15",
  "title" : "Bottoms Up",
  "description" : "Margaret's good friend Captain Helen Whitfield visits the 4077th and it seems like old times again, but what the Major doesn't know is that Whitfield is still a raging closet-alcoholic; Meanwhile, Hawkeye pulls one prank that goes too far when he drops Charles' pants in O.R."
}, {
  "imdbId" : "0068098",
  "season" : "9",
  "episodeNumber" : "16",
  "title" : "The Red/White Blues",
  "description" : "Col. Potter's blood pressure is too high and he has two weeks to get it back down, causing everyone to mollycoddle him, much to his dismay. Meanwhile, the malaria medicine they are sent makes Klinger sick."
}, {
  "imdbId" : "0068098",
  "season" : "9",
  "episodeNumber" : "17",
  "title" : "Bless You Hawkeye",
  "description" : "Hawkeye starts inexplicably sneezing uncontrollably until Col. Potter suspects it's psychological in nature and calls in Dr. Freedman."
}, {
  "imdbId" : "0068098",
  "season" : "9",
  "episodeNumber" : "18",
  "title" : "Blood Brothers",
  "description" : "Father Mulcahy is not acting like himself at all. An upcoming visit by his superior, Cardinal Reardon, has the good padre behaving like a petty, competitive child. On the eve of the biggest oration of his career, Hawkeye calls Father Mulcahy away from his sermon writing to the bedside of Pvt. Gary Sturgis (Patrick Swayze). Sturgis wants to remain at the 4077th, to watch over his unconscious buddy; and if compatible, he wants to be a donor for his friend. On Sunday morning, feeling unprepared to deliver his sermon, Father Mulcahy stands up in his bathrobe and quietly, ..."
}, {
  "imdbId" : "0068098",
  "season" : "9",
  "episodeNumber" : "19",
  "title" : "The Foresight Saga",
  "description" : "Klinger accidentally breaks Potter's eyeglasses, requiring a visit from traveling optometrist Dr. Bud Herzog. The 4077th receives fresh vegetables from a grateful Korean. Potter questions the authenticity of an upbeat letter from Radar."
}, {
  "imdbId" : "0068098",
  "season" : "9",
  "episodeNumber" : "20",
  "title" : "The Life You Save",
  "description" : "Winchester goes on a spiritual journey after a near-death experience. Hawkeye experiences the problems of being the officer in charge of food services when Potter rotates the duty roster."
}, {
  "imdbId" : "0068098",
  "season" : "10",
  "episodeNumber" : "1",
  "title" : "That's Show Biz",
  "description" : "A touring USO show brings an unexpected touch of vaudeville to the 4077th when the star showgirl requires an emergency operation."
}, {
  "imdbId" : "0068098",
  "season" : "10",
  "episodeNumber" : "2",
  "title" : "Identity Crisis",
  "description" : "Father Mulcahy counsels a guilt-ridden GI who swapped tags with a dead colleague. B.J. and Charles consider ways of keeping a soldier-salesman quiet, while Hawkeye and Margaret help another GI get even with the woman who jilted him."
}, {
  "imdbId" : "0068098",
  "season" : "10",
  "episodeNumber" : "3",
  "title" : "Rumor at the Top",
  "description" : "The Army is starting a new MASH unit, and the surgeons and staff of the 4077th fear they will be split up and reassigned. So they act completely unprofessional, uncouth, and incompetent in front of an army rep hoping he will reconsider."
}, {
  "imdbId" : "0068098",
  "season" : "10",
  "episodeNumber" : "4",
  "title" : "Give 'Em Hell, Hawkeye",
  "description" : "Hawkeye writes to President Truman complaining about the war and the senseless tasks they have to do, like camp beautification to obtain a needed water heater."
}, {
  "imdbId" : "0068098",
  "season" : "10",
  "episodeNumber" : "5",
  "title" : "Wheelers and Dealers",
  "description" : "After being cited for reckless Jeep driving, Colonel Potter voluntarily takes driving lessons from Rizzo and B.J. decides he will make all the money he can to pay the second Mortgage, by gambling."
}, {
  "imdbId" : "0068098",
  "season" : "10",
  "episodeNumber" : "6",
  "title" : "Communication Breakdown",
  "description" : "During a newspaper shortage, Charles gets newspapers from home, refuses to share them, and incurs the wrath of the whole camp. A patient and a soldier are Asian brothers on opposite sides of the war."
}, {
  "imdbId" : "0068098",
  "season" : "10",
  "episodeNumber" : "7",
  "title" : "Snap Judgment",
  "description" : "When Hawkeye's snappy new Polaroid camera is stolen, Klinger searches the black market and finds it. Unfortunately en route back to camp, Klinger is stopped by MPs who assume he is the camera thief."
}, {
  "imdbId" : "0068098",
  "season" : "10",
  "episodeNumber" : "8",
  "title" : "Snappier Judgment",
  "description" : "It's the day of Klinger's hearing before a trial of angry officers. Will Klinger be sent up the river? With Charles as his attorney, it's almost certain. Meanwhile, Hawkeye and B.J. set out to catch the real thief."
}, {
  "imdbId" : "0068098",
  "season" : "10",
  "episodeNumber" : "9",
  "title" : "'Twas the Day After Christmas",
  "description" : "On the day after Christmas, the 4077th decides to try out an English tradition, Boxing Day, where the officers and enlisted personnel change places for a day."
}, {
  "imdbId" : "0068098",
  "season" : "10",
  "episodeNumber" : "10",
  "title" : "Follies of the Living - Concerns of the Dead",
  "description" : "While Klinger is delirious with fever, he communicates with the ghost of deceased Private Jimmy Weston."
}, {
  "imdbId" : "0068098",
  "season" : "10",
  "episodeNumber" : "11",
  "title" : "The Birthday Girls",
  "description" : "Margaret tries desperately to get to Tokyo for her birthday, and the camp helps an injured cow give birth with Klinger starting a betting pool on the exact day and time."
}, {
  "imdbId" : "0068098",
  "season" : "10",
  "episodeNumber" : "12",
  "title" : "Blood and Guts",
  "description" : "When a visiting U.N. war correspondent sensationalizes the war instead of reporting it, Hawkeye is outraged. B.J. tries to repair a motorcycle donated to him by a wounded private."
}, {
  "imdbId" : "0068098",
  "season" : "10",
  "episodeNumber" : "13",
  "title" : "A Holy Mess",
  "description" : "A special egg breakfast is complicated by a distraught AWOL soldier talking Father Mulcahy into granting him sanctuary in the mess tent during a preceding church service."
}, {
  "imdbId" : "0068098",
  "season" : "10",
  "episodeNumber" : "14",
  "title" : "The Tooth Shall Set You Free",
  "description" : "While Winchester fearfully avoids getting his agonizing toothache treated, the other surgeons discover a racist commander is sending his African-American soldiers disproportionally into dangerous duty."
}, {
  "imdbId" : "0068098",
  "season" : "10",
  "episodeNumber" : "15",
  "title" : "Pressure Points",
  "description" : "After Hawkeye corrects a mistake that Colonel Potter made on a patient, Potter fears he's losing his touch badly enough to summon Dr. Sidney Freeman."
}, {
  "imdbId" : "0068098",
  "season" : "10",
  "episodeNumber" : "16",
  "title" : "Where There's a Will, There's a War",
  "description" : "Fearing for his life at an aid station, Hawkeye writes his will with special bequests for his friends."
}, {
  "imdbId" : "0068098",
  "season" : "10",
  "episodeNumber" : "17",
  "title" : "Promotion Commotion",
  "description" : "When Charles, Hawkeye, and B.J. determine promotion recommendations, they are wooed by the enlisted staff while a bully physically threatens Charles. Potter helps a GI who is being razzed by colleagues for being faithful to his girl."
}, {
  "imdbId" : "0068098",
  "season" : "10",
  "episodeNumber" : "18",
  "title" : "Heroes",
  "description" : "A famous prizefighter, \"Gentleman Joe\" Cavanaugh, comes to visit the 4077th and while there, has a stroke. Everyone is irritated as Pierce, serving as his doctor, becomes spokesman to the press. Father Mulcahy is upset, since Gentleman Joe was his childhood hero."
}, {
  "imdbId" : "0068098",
  "season" : "10",
  "episodeNumber" : "19",
  "title" : "Sons and Bowlers",
  "description" : "Ignoring Margaret's offers to help, Potter and B.J. head a bowling team in a championship match against the Marines. Hawkeye's father is having an operation back home, so Hawkeye feels helpless enough to confide in Charles."
}, {
  "imdbId" : "0068098",
  "season" : "10",
  "episodeNumber" : "20",
  "title" : "Picture This",
  "description" : "After becoming fed up with his bunkmates' living habits, Hawkeye moves out of The Swamp and into a quaint shack behind Rosie's. Meanwhile, Charles and B.J. continue to annoy one another: Charles with his loud, classical music playing at all hours, and B.J. constantly sharing news of Erin's potty training; Colonel Potter wants to paint a portrait of the entire camp as a present for Mildred, but it proves difficult with the men fighting with one another. Klinger, Margaret and Father Mulcahy take it upon themselves to try and get the Swampmen back together. Will they ..."
}, {
  "imdbId" : "0068098",
  "season" : "10",
  "episodeNumber" : "21",
  "title" : "That Darn Kid",
  "description" : "A peddler wheels his cart into camp. Klinger buys from him a goat to get rich selling milk. B.J. shows interest in a blue vase, but Charles outbids him greatly. Meanwhile, much to his chagrin, Hawkeye is paymaster again. But just as he gets the pay rolling, wounded arrive. Hawkeye tells Klinger to keep an eye on the money while he's in surgery. Unfortunately, Klinger left the money in his office alone with the goat...Hawk and Klinger return to find the money gone. It had been eaten. No way would I-CORPS believe that. Worse yet, he still had a ton of angry, unpaid ..."
}, {
  "imdbId" : "0068098",
  "season" : "11",
  "episodeNumber" : "1",
  "title" : "Hey, Look Me Over",
  "description" : "The nurses return from evacuation to find that the doctors have left the camp a mess. Potter announces an inspection in two days, so Margaret and the nurses try to get everything reorganized. Nurse Kelly is mad at Hawkeye for ignoring her."
}, {
  "imdbId" : "0068098",
  "season" : "11",
  "episodeNumber" : "2",
  "title" : "Trick or Treatment",
  "description" : "It's time for the annual 4077th Halloween party. Hawkeye is dressed as Superman, B.J. is a clown, Margaret is a geisha girl, Colonel Potter is a cowboy and Klinger is Al Capone. But it's not much of a party for the surgeons when unexpected wounded guests show up; Charles tries to help a slovenly marine who has a billiard ball stuck in his mouth; Father Mulcahy inadvertently saves a man's life when he is presumed dead."
}, {
  "imdbId" : "0068098",
  "season" : "11",
  "episodeNumber" : "3",
  "title" : "Foreign Affairs",
  "description" : "Charles falls in love with a French Red Cross woman but realizes that their lifestyles are not compatible. Hawkeye and BJ are helping with an army PR stunt in their own way."
}, {
  "imdbId" : "0068098",
  "season" : "11",
  "episodeNumber" : "4",
  "title" : "The Joker Is Wild",
  "description" : "It's another M*A*S*H prankathon. This time, Hawkeye appears to be the marked man after menial practical jokes happen to everyone in camp, but him. Will they get him too? Or is Hawkeye already the victim of an even larger practical joke?"
}, {
  "imdbId" : "0068098",
  "season" : "11",
  "episodeNumber" : "5",
  "title" : "Who Knew?",
  "description" : "When a nurse that Hawkeye is dating dies, he offers to deliver her eulogy and discovers that he didn't know her. Klinger tries to interest Charles in a business venture."
}, {
  "imdbId" : "0068098",
  "season" : "11",
  "episodeNumber" : "6",
  "title" : "Bombshells",
  "description" : "The whole 4077 are looking forward to a visit from Marilyn Monroe after a rumor starts; while B.J.'s fishing trip doesn't go as planned."
}, {
  "imdbId" : "0068098",
  "season" : "11",
  "episodeNumber" : "7",
  "title" : "Settling Debts",
  "description" : "Hawkeye receives a letter from Colonel Potters wife where she informs that she has paid the last mortgage on their home and asks Hawkeye and friends to throw a small surprise party for Potter to celebrate."
}, {
  "imdbId" : "0068098",
  "season" : "11",
  "episodeNumber" : "8",
  "title" : "The Moon Is Not Blue",
  "description" : "Bored at the terrible film selection, Hawkeye and BJ try to get a copy of the notorious film, \"The Moon is Blue.\" Wounded General Rothaker declares prohibition in camp."
}, {
  "imdbId" : "0068098",
  "season" : "11",
  "episodeNumber" : "9",
  "title" : "Run for the Money",
  "description" : "Father Mulcahy must save the camp's honor in a high-stakes footrace against the 8063rd. Hawkeye, BJ, and Hot Lips each bet on it. Meanwhile, Charles tries to help Private Walter Palmer, a patient who suffers frequent verbal abuse from his fellow soldiers due to a speech impediment."
}, {
  "imdbId" : "0068098",
  "season" : "11",
  "episodeNumber" : "10",
  "title" : "U.N., the Night and the Music",
  "description" : "Three U.N. delegates come to the 4077th and make a lasting impression on members of the camp, while B.J. treats a patient whose leg injury may require an amputation."
}, {
  "imdbId" : "0068098",
  "season" : "11",
  "episodeNumber" : "11",
  "title" : "Strange Bedfellows",
  "description" : "Col. Potter discovers that his son-in-law has had an affair. Meanwhile, Charles' snoring is keeping his tent-mates from getting a good night's sleep."
}, {
  "imdbId" : "0068098",
  "season" : "11",
  "episodeNumber" : "12",
  "title" : "Say No More",
  "description" : "General Addison Collins refuses to accept responsibility for the war games that have mortally wounded his son Curtis, a lieutenant. Charles tries to help Margaret, who develops laryngitis as she is about to meet her hero, Dr. Steven Chesler."
}, {
  "imdbId" : "0068098",
  "season" : "11",
  "episodeNumber" : "13",
  "title" : "Friends and Enemies",
  "description" : "Colonel Potter must decide whether to blow the whistle on an old army chum, Woody Cooke, whose military mistakes are costing human lives. BJ suffers from both an ingrown toenail and from Charles' insistence on playing his Mahler records."
}, {
  "imdbId" : "0068098",
  "season" : "11",
  "episodeNumber" : "14",
  "title" : "Give and Take",
  "description" : "Wounded Private Kurland learns a painful lesson from the enemy soldier he's critically wounded, while the thankless job of charity collection officer passes from one staff member to another."
}, {
  "imdbId" : "0068098",
  "season" : "11",
  "episodeNumber" : "15",
  "title" : "As Time Goes By",
  "description" : "Margaret seeks contributions for a time capsule."
}, {
  "imdbId" : "0068098",
  "season" : "11",
  "episodeNumber" : "16",
  "title" : "Goodbye, Farewell, and Amen",
  "description" : "In the closing days of the Korean War, the staff of the 4077 M*A*S*H Unit find themselves facing irrevocable changes in their lives."
}]