[{
  "imdbId" : "1103987",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "The Nigerian Job",
  "description" : "When Nathan Ford, a former insurance company investigator, is approached by a man asking him to help retrieve some stolen property, he is dubious. When he finds out that the job requires him to supervise and maintain control of three known thieves that he himself caught in the course of his insurance investigations, he's more than dubious. However, the job offers him the opportunity to get some of his own back from the insurance company that allowed his son to die, so he takes it despite his misgivings. When his doubts prove to be well-founded, he persuades his ..."
}, {
  "imdbId" : "1103987",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "The Homecoming Job",
  "description" : "Corporal Robert Perry, an Army reservist who fought in Iraq, was severely injured in an apparent error by Castleman Security, government contractors working in Iraq. The Army investigation clears Castleman of involvement, thus freeing them of any monetary obligation, and Perry lives too far from veteran's resources to allow him to receive government funded treatment that would allow him to work. He contacts Nathan Ford for help. What Nathan Ford and the rest of the Leverage team find is far more than a simple error."
}, {
  "imdbId" : "1103987",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "The Two-Horse Job",
  "description" : "After a Wall Street broker sets fire to his stable-killing his underachieving racehorses in the process-the team visits Kentucky to help the heartsick trainer, Eliot's high school love."
}, {
  "imdbId" : "1103987",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "The Miracle Job",
  "description" : "The team helps an old friend of Nate's, now a priest, save his church from the hands of a shady developer."
}, {
  "imdbId" : "1103987",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "The Bank Shot Job",
  "description" : "While Nate and Sophie try to con a corrupt Judge, they are taken hostage during a botched bank robbery."
}, {
  "imdbId" : "1103987",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "The Stork Job",
  "description" : "A job where the team tries to recover a war orphan for a grieved couple hits close to home for Parker."
}, {
  "imdbId" : "1103987",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "The Wedding Job",
  "description" : "A job for the wife of a wrongly-jailed restaurateur lands the team between the FBI and rival mob families."
}, {
  "imdbId" : "1103987",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "The Mile High Job",
  "description" : "The team traces incriminating evidence about a corporation's misdeeds to two witnesses on a plane to the Cayman Islands, not knowing what the corporation has planned for the flight."
}, {
  "imdbId" : "1103987",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "The Snow Job",
  "description" : "Nate complicates a simple con regarding a sleazy contractor and the recovery of a family's house."
}, {
  "imdbId" : "1103987",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "The 12-Step Job",
  "description" : "When the team cons an addicted embezzler into entering rehab, Nate confronts some of his own issues regarding alcoholism."
}, {
  "imdbId" : "1103987",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "The Juror #6 Job",
  "description" : "When one of Parker's aliases receives jury duty, Nate forces her to go, resulting in a showdown between the team and a corporation tampering with the jury."
}, {
  "imdbId" : "1103987",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "The First David Job",
  "description" : "The team goes after the CEO of Nate's former insurance company, responsible for denying his late son's medical care, but the situation causes conflict among the crew."
}, {
  "imdbId" : "1103987",
  "season" : "1",
  "episodeNumber" : "13",
  "title" : "The Second David Job",
  "description" : "In order to take down his former boss, Nate must reunite the splintered team to help him."
}, {
  "imdbId" : "1103987",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "The Beantown Bailout Job",
  "description" : "Now sober, Nathan Ford reunites Sophie, Hardison, Parker, and Eliot to help him con members of an Irish mob."
}, {
  "imdbId" : "1103987",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "The Tap-Out Job",
  "description" : "When a scheme against a crooked fight promoter goes awry, Eliot is forced to step into the ring."
}, {
  "imdbId" : "1103987",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "The Order 23 Job",
  "description" : "To swindle a felon, the team must use a hospital and stage a virus outbreak."
}, {
  "imdbId" : "1103987",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "The Fairy Godparents Job",
  "description" : "To recover funds from an incarcerated investment banker, the team tries to help his introverted stepson."
}, {
  "imdbId" : "1103987",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "The Three Days of the Hunter Job",
  "description" : "The team cons a sleazy tabloid newscaster with the story of a government cover-up."
}, {
  "imdbId" : "1103987",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "The Top Hat Job",
  "description" : "The team employs very unusual methods to infiltrate a corporation that has been selling tainted food to the public."
}, {
  "imdbId" : "1103987",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "The Two Live Crew Job",
  "description" : "The team must recover priceless artwork from a band of thieves."
}, {
  "imdbId" : "1103987",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "The Ice Man Job",
  "description" : "With Sophie gone, Parker and Hardison must assume new roles to recover a cache of stolen diamonds and help an innocent man accused of the crime."
}, {
  "imdbId" : "1103987",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "The Lost Heir Job",
  "description" : "Nathan leads a con against a corrupt lawyer trying to swindle a client's estate."
}, {
  "imdbId" : "1103987",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "The Runway Job",
  "description" : "To bring down an oppressive sweatshop owner, Nate and the team crash a fashion show."
}, {
  "imdbId" : "1103987",
  "season" : "2",
  "episodeNumber" : "11",
  "title" : "The Bottle Job",
  "description" : "To save the bar in Nathan's building from being lost to an avaricious loan shark, the team tries an old-school con."
}, {
  "imdbId" : "1103987",
  "season" : "2",
  "episodeNumber" : "12",
  "title" : "The Zanzibar Marketplace Job",
  "description" : "When Nate's ex-wife, Maggie, is thrown into a Ukranian jail for a crime she didn't commit, Nate and the team are forced to partner with an old nemesis to get her out."
}, {
  "imdbId" : "1103987",
  "season" : "2",
  "episodeNumber" : "13",
  "title" : "The Future Job",
  "description" : "The team must shut down the scams of a phony psychic."
}, {
  "imdbId" : "1103987",
  "season" : "2",
  "episodeNumber" : "14",
  "title" : "The Three Strikes Job",
  "description" : "The team uses a crooked politician's love of baseball to take him down but end up with more than they expect."
}, {
  "imdbId" : "1103987",
  "season" : "2",
  "episodeNumber" : "15",
  "title" : "The Maltese Falcon Job",
  "description" : "The team is trying to take down a corrupt local mayor, even with the stakes rising to dangerous levels."
}, {
  "imdbId" : "1103987",
  "season" : "3",
  "episodeNumber" : "1",
  "title" : "The Jailhouse Job",
  "description" : "As the team works to free Nate from jail, he must take on a corrupt warden and free an innocent man."
}, {
  "imdbId" : "1103987",
  "season" : "3",
  "episodeNumber" : "2",
  "title" : "The Reunion Job",
  "description" : "To uncover a password, the team infiltrates the high school reunion of an amoral software magnate who's the IT department for the Axis of Evil."
}, {
  "imdbId" : "1103987",
  "season" : "3",
  "episodeNumber" : "3",
  "title" : "The Inside Job",
  "description" : "When Parker is trapped in an unknown location while working a theft for her mentor, the LEVERAGE team must race the clock to find her and free her."
}, {
  "imdbId" : "1103987",
  "season" : "3",
  "episodeNumber" : "4",
  "title" : "The Scheherazade Job",
  "description" : "To rob an African kleptocrat's Boston vault, the LEVERAGE team has to time their heist to a symphony concert nearby, where amateur violinist Hardison must play a solo for a sell-out crowd."
}, {
  "imdbId" : "1103987",
  "season" : "3",
  "episodeNumber" : "5",
  "title" : "The Double Blind Job",
  "description" : "Nate and the team runs a con against a corrupt CEO of a pharmaceuticals company who is marketing a product which could kill thousands."
}, {
  "imdbId" : "1103987",
  "season" : "3",
  "episodeNumber" : "6",
  "title" : "The Studio Job",
  "description" : "When Eliot poses as a country music singer to help run a con against a corrupt recording studio executive, things get complicated when he becomes a bona fide star."
}, {
  "imdbId" : "1103987",
  "season" : "3",
  "episodeNumber" : "7",
  "title" : "The Gone Fishin' Job",
  "description" : "The team takes on a debt collector scamming innocent taxpayers, not knowing he is backed by a private militia."
}, {
  "imdbId" : "1103987",
  "season" : "3",
  "episodeNumber" : "8",
  "title" : "The Boost Job",
  "description" : "Nate and the team infiltrate a crew of top-flight car thieves to bring down a greedy car dealer."
}, {
  "imdbId" : "1103987",
  "season" : "3",
  "episodeNumber" : "9",
  "title" : "The Three-Card Monte Job",
  "description" : "An old enemy complicates matters for Nate and his crew as they try to help several small-time business people who were conned into committing crimes."
}, {
  "imdbId" : "1103987",
  "season" : "3",
  "episodeNumber" : "10",
  "title" : "The Underground Job",
  "description" : "Nate and the team investigate a fatal explosion in a coal mine and uncover far more than the negligent practices they suspected."
}, {
  "imdbId" : "1103987",
  "season" : "3",
  "episodeNumber" : "11",
  "title" : "The Rashomon Job",
  "description" : "Each member of the team recalls the story of an artifact all of them tried to steal on the same night five years ago."
}, {
  "imdbId" : "1103987",
  "season" : "3",
  "episodeNumber" : "12",
  "title" : "The King George Job",
  "description" : "Pieces of Sophie's past complicate a job in London where the team tries to expose an unscrupulous antiques trafficker who is using children as slave labor."
}, {
  "imdbId" : "1103987",
  "season" : "3",
  "episodeNumber" : "13",
  "title" : "The Morning After Job",
  "description" : "A con against a dirty financier could be the key to the team finding Damien Moreau."
}, {
  "imdbId" : "1103987",
  "season" : "3",
  "episodeNumber" : "14",
  "title" : "The Ho Ho Ho Job",
  "description" : "The team runs into trouble while recovering Christmas gifts for a charity when an old enemy returns."
}, {
  "imdbId" : "1103987",
  "season" : "3",
  "episodeNumber" : "15",
  "title" : "The Big Bang Job",
  "description" : "The team infiltrates a Department of Defense research lab in order to stop Damien Moreau, the villain they have been working to catch all season, from murdering a brilliant engineer and auctioning her work off to international terrorists."
}, {
  "imdbId" : "1103987",
  "season" : "3",
  "episodeNumber" : "16",
  "title" : "The San Lorenzo Job",
  "description" : "The team follows Moreau to San Lorenzo only to find that Moreau is the chief advisor to the current President. In order to take Moreau down, the team must first take over the country."
}, {
  "imdbId" : "1103987",
  "season" : "4",
  "episodeNumber" : "1",
  "title" : "The Long Way Down Job",
  "description" : "The team must battle a treacherous mountain, dangerous conditions, and hired mercenaries to retrieve evidence to bring down a corrupt financial executive."
}, {
  "imdbId" : "1103987",
  "season" : "4",
  "episodeNumber" : "2",
  "title" : "The 10 Li'l Grifters Job",
  "description" : "When a mark is killed in the middle of a con and Nate is accused of the crime, the crew must find the real killer to prove Nate's innocence."
}, {
  "imdbId" : "1103987",
  "season" : "4",
  "episodeNumber" : "3",
  "title" : "The 15 Minutes Job",
  "description" : "The team uses a PR executive's own notoriety against him to bring him down."
}, {
  "imdbId" : "1103987",
  "season" : "4",
  "episodeNumber" : "4",
  "title" : "The Van Gogh Job",
  "description" : "Nate and the crew discover the history behind a Van Gogh painting from World War II they are attempting to recover."
}, {
  "imdbId" : "1103987",
  "season" : "4",
  "episodeNumber" : "5",
  "title" : "The Hot Potato Job",
  "description" : "The Leverage team tries to recover a rare agricultural object worth millions of dollars."
}, {
  "imdbId" : "1103987",
  "season" : "4",
  "episodeNumber" : "6",
  "title" : "The Carnival Job",
  "description" : "An innovative computer chip the team steals from an executive's home becomes the ransom when the executive's daughter is kidnapped."
}, {
  "imdbId" : "1103987",
  "season" : "4",
  "episodeNumber" : "7",
  "title" : "The Grave Danger Job",
  "description" : "The team goes after a funeral home director who is scamming bereaved families out of their money but quickly discover the scam involves a Mexican drug cartel."
}, {
  "imdbId" : "1103987",
  "season" : "4",
  "episodeNumber" : "8",
  "title" : "The Boiler Room Job",
  "description" : "Nate and the team take on one of their toughest assignments: a con man from a family with a long history of pulling off successful scams."
}, {
  "imdbId" : "1103987",
  "season" : "4",
  "episodeNumber" : "9",
  "title" : "The Cross My Heart Job",
  "description" : "While stuck at an airport, the team must retrieve a heart donated to a fifteen-year-old patient when it is intercepted by a sick defense contractor."
}, {
  "imdbId" : "1103987",
  "season" : "4",
  "episodeNumber" : "10",
  "title" : "The Queen's Gambit Job",
  "description" : "Sterling asks Nate to steal a nuclear reactor component which someone intends to use to produce uranium which will then be sold to terrorists. Nate thinks Sterling is holding something back but he decides to do it. They figure out that the man selling it will hand it off while his step-daughter is competing in a chess tournament in Dubai. They try to proceed as planned but Sterling shows complicating things."
}, {
  "imdbId" : "1103987",
  "season" : "4",
  "episodeNumber" : "11",
  "title" : "The Experimental Job",
  "description" : "When the team investigates the disappearance of homeless vets around Boston, they stumble across a sinister plot."
}, {
  "imdbId" : "1103987",
  "season" : "4",
  "episodeNumber" : "12",
  "title" : "The Office Job",
  "description" : "While Nate and the team try to uncover an embezzler by infiltrating an office, they get roped into participating in a documentary of the company."
}, {
  "imdbId" : "1103987",
  "season" : "4",
  "episodeNumber" : "13",
  "title" : "The Girls' Night Out Job",
  "description" : "A con to take down a cunning thief who is part of a larger conspiracy is told from the point-of-view of Sophie, Parker, and Tara Cole."
}, {
  "imdbId" : "1103987",
  "season" : "4",
  "episodeNumber" : "14",
  "title" : "The Boys' Night Out Job",
  "description" : "A con to take down a cunning thief who is part of a larger conspiracy is told from the point-of-view of Nate, Eliot, and Hardison."
}, {
  "imdbId" : "1103987",
  "season" : "4",
  "episodeNumber" : "15",
  "title" : "The Lonely Hearts Job",
  "description" : "While searching for a philanthropist's missing wife, the team comes up against a grifter ring running a web of sophisticated \"Sweetheart Scams\". Now, Nate must learn how to steal hearts... or risk losing Sophie's for good."
}, {
  "imdbId" : "1103987",
  "season" : "4",
  "episodeNumber" : "16",
  "title" : "The Gold Job",
  "description" : "The Leverage team hits the recession-driven Cash-for-Gold industry by targeting a corrupt brother-sister team and steering them through an elaborate treasure hunt."
}, {
  "imdbId" : "1103987",
  "season" : "4",
  "episodeNumber" : "17",
  "title" : "The Radio Job",
  "description" : "When Latimer hires Nate's father to pull off a heist in an ultra-secure government office, the Leverage team must stage a fake hostage stand-off when they're trapped inside and the feds lay siege to the building."
}, {
  "imdbId" : "1103987",
  "season" : "4",
  "episodeNumber" : "18",
  "title" : "The Last Dam Job",
  "description" : "The Leverage team must recruit old friends and rivals in order to take down Latimer and a foe from their past."
}, {
  "imdbId" : "1103987",
  "season" : "5",
  "episodeNumber" : "1",
  "title" : "The (Very) Big Bird Job",
  "description" : "Nate and the team go after the CEO of a shipping company whose cost-cutting measures were the cause of a tragic plane crash."
}, {
  "imdbId" : "1103987",
  "season" : "5",
  "episodeNumber" : "2",
  "title" : "The Blue Line Job",
  "description" : "The Leverage crew helps a veteran hockey player who thinks team management is trying to get him injured on purpose but discover their real intentions are far more ominous."
}, {
  "imdbId" : "1103987",
  "season" : "5",
  "episodeNumber" : "3",
  "title" : "The First Contact Job",
  "description" : "To take down a wealthy scientist who stole a colleague's work, Nate and the crew convinces him he's made contact with aliens."
}, {
  "imdbId" : "1103987",
  "season" : "5",
  "episodeNumber" : "4",
  "title" : "The French Connection Job",
  "description" : "Eliot goes undercover at a culinary arts school to take down an avaricious restaurateur."
}, {
  "imdbId" : "1103987",
  "season" : "5",
  "episodeNumber" : "5",
  "title" : "The Gimme a K Street Job",
  "description" : "To help students whose cheerleading school is putting them in danger, the team takes on its most corrupt adversary: Congress."
}, {
  "imdbId" : "1103987",
  "season" : "5",
  "episodeNumber" : "6",
  "title" : "The D.B. Cooper Job",
  "description" : "A flashback to the 1970s of an FBI agent's final regret, his failure to capture hijacker D.B. Cooper, becomes a mystery Nate must solve."
}, {
  "imdbId" : "1103987",
  "season" : "5",
  "episodeNumber" : "7",
  "title" : "The Real Fake Car Job",
  "description" : "Nate and the crew concoct a story about a vintage car to get a corrupt Wall Street businessman to break his immunity agreement with the government."
}, {
  "imdbId" : "1103987",
  "season" : "5",
  "episodeNumber" : "8",
  "title" : "The Broken Wing Job",
  "description" : "When a torn ACL leaves Parker behind on the crew's latest job, she spies on the Brew Pub's customers for fun and discovers a group of thieves planning a heist."
}, {
  "imdbId" : "1103987",
  "season" : "5",
  "episodeNumber" : "9",
  "title" : "The Rundown Job",
  "description" : "Eliot and the team assist his old partner, counter-terrorism specialist Colonel Michael Vance, in stopping a biological weapon from being released in Washington, D.C."
}, {
  "imdbId" : "1103987",
  "season" : "5",
  "episodeNumber" : "10",
  "title" : "The Frame-Up Job",
  "description" : "Nate must clear Sophie's name when she is framed for the theft of a priceless work of art."
}, {
  "imdbId" : "1103987",
  "season" : "5",
  "episodeNumber" : "11",
  "title" : "The Low Low Price Job",
  "description" : "The crew takes on a big-box retail chain who is bribing the city to run local mom-and-pop stores out of business."
}, {
  "imdbId" : "1103987",
  "season" : "5",
  "episodeNumber" : "12",
  "title" : "The White Rabbit Job",
  "description" : "The team attempts one of the most difficult cons ever devised to stop a businessman from bankrupting his business and the town that depends on it."
}, {
  "imdbId" : "1103987",
  "season" : "5",
  "episodeNumber" : "13",
  "title" : "The Corkscrew Job",
  "description" : "Nate and the crew take on the greedy owner of a winery."
}, {
  "imdbId" : "1103987",
  "season" : "5",
  "episodeNumber" : "14",
  "title" : "The Toy Job",
  "description" : "The team goes after a CEO who is selling dangerous toys to the public."
}, {
  "imdbId" : "1103987",
  "season" : "5",
  "episodeNumber" : "15",
  "title" : "The Long Good-bye Job",
  "description" : "Nate takes the team on one of its most dangerous missions, a con related to the death of his son."
}]