[{
  "imdbId" : "5057054",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Pilot",
  "description" : "In the series premiere, CIA analyst Jack Ryan uncovers a series of suspicious transactions that take him and his boss James Greer out from behind their desks into the field to hunt down a powerful new threat to the world. Hanin begins to question her husband's affairs after he brings a mysterious outsider into their home."
}, {
  "imdbId" : "5057054",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "French Connection",
  "description" : "Jack and Greer decode a fresh piece of intel that takes them to Paris and one step closer to the elusive Suleiman. Hanin's husband returns home with a renewed fervor for his secretive mission, leaving her unsure of their family's future."
}, {
  "imdbId" : "5057054",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Black 22",
  "description" : "Drone pilot Victor struggles with the immense responsibility attached to his job. Jack and Greer join French Intelligence officers on a mission to track down Suleiman's brother. Hanin is forced to make a dangerous decision for the sake of their children."
}, {
  "imdbId" : "5057054",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "The Wolf",
  "description" : "As Jack and Cathy grow closer, Jack's double-life is put to the test. A show of force from Suleiman adds to his ranks and brings him one step closer to his next attack."
}, {
  "imdbId" : "5057054",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "End of Honor",
  "description" : "After the horrific Paris church attack, Jack and Greer discover a deeper strategy behind Suleiman's actions, forcing Jack to suggest an unusual trap for him. Hanin faces new challenges in her quest for freedom."
}, {
  "imdbId" : "5057054",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Sources and Methods",
  "description" : "Jack's moral code is tested when he and Greer use a Turkish criminal to help them track down a high-value target who may be able to lead them to Suleiman. Hanin tries to evade her pursuers and keep her daughters safe. Cathy investigates an outbreak of a virulent form of Ebola that may point to something more ominous."
}, {
  "imdbId" : "5057054",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "The Boy",
  "description" : "Jack and Greer try to convince their superiors to lead a covert ground assault to capture Suleiman. Jack's double life costs him an important relationship."
}, {
  "imdbId" : "5057054",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Inshallah",
  "description" : "Jack and Greer fear Suleiman's next attack could be on U.S. soil. They must figure out how to stop him or risk enormous costs."
}, {
  "imdbId" : "5057054",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "Cargo",
  "description" : "Jack Ryan searches for the truth behind Venezuela's transactions with various World Powers. James Greer, about to get sidelined from his new post in Russia, joins Jack in Venezuela and the two find themselves in the midst of a Venezuelan leader's re-election effort."
}, {
  "imdbId" : "5057054",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "Tertia Optio",
  "description" : "Jack is granted permission from Senator Chapin to stay in Venezuela. President Reyes denies involvement in the events that are keeping Jack in country. Meanwhile, Jack and Harry team up to follow a lead that could create dissension within the ranks."
}, {
  "imdbId" : "5057054",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "Orinoco",
  "description" : "The U.S. Special Activities team lands in Venezuela where Jack's intel leads them to a militia guarded compound. Deep in the jungle, Jack's search for answers puts the whole team in danger. President Reyes' opponent, Gloria Bonalde, proves to be a real contender in the upcoming election."
}, {
  "imdbId" : "5057054",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "Dressed to Kill",
  "description" : "Relieved of duty in Venezuela, Jack follows a new trail to London and seeks the help of MI5, only to discover the man he's after is also after him. Back in Venezuela, Reyes makes Gloria an offer."
}, {
  "imdbId" : "5057054",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "Blue Gold",
  "description" : "Using Max's daughter as bait, Jack and Harry convince Max to meet face to face. Stranded in the jungle, Marcus stumbles across a prisoner camp. Greer visits Gloria hoping to draw a connection between Reyes and her missing husband."
}, {
  "imdbId" : "5057054",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "Persona Non Grata",
  "description" : "Reyes accuses the U.S. of tampering with the election. The U.S. Embassy is evacuated. Jack, Greer and Mike November must decide whether to follow orders or go off the grid. Reyes' men pursue Matice and the American soldiers in the jungle."
}, {
  "imdbId" : "5057054",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "Dios y Federación",
  "description" : "The election in Venezuela is moved up. Stranded in a hostile country, Jack and Mike fight for their lives, while Greer is interrogated. The Ubarri family must decide to flee or face Reyes."
}, {
  "imdbId" : "5057054",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "Strongman",
  "description" : "Jack heads to the Presidential Palace to retrieve Greer. When the polls are shutdown, violent protests erupt outside the palace, and Jack must make a decision that could determine his future."
}]