[{
  "imdbId" : "3556944",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Brave New World",
  "description" : "After a terrorist attack in Odessa, Texas, left the city decimated and lives in shambles, those with extraordinary abilities are in hiding after being blamed for the catastrophic event. A new world order has them being hunted by those with nefarious motives, such as Luke (Zachary Levi) and Joanne Collins (Judi Shekoni), who are out to avenge a tragic loss of their son. Meanwhile, Noah Bennet (Jack Coleman) has taken measures to put his old life behind him and start over, until he comes face to face with Quentin Frady (Henry Zebrowski), a conspiracy theorist out to ..."
}, {
  "imdbId" : "3556944",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Odessa",
  "description" : "After a terrorist attack in Odessa, Texas, left the city decimated and lives in shambles, those with extraordinary abilities are in hiding after being blamed for the catastrophic event. Elsewhere, some are discovering their newfound skills. For better or for worse, some are fated to cross paths with assorted heroes of the past and together their ultimate destiny is nothing less than saving the world and mankind."
}, {
  "imdbId" : "3556944",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Under the Mask",
  "description" : "Erica reveals how far she will go to protect the world from Evos; Tommy shares his ability with Emily; Noah and Quentin continue their quest for the truth; and invisible guides Malina."
}, {
  "imdbId" : "3556944",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "The Needs of the Many",
  "description" : "Tommy's mom needs a blood transfusion following the crash and it may be up to Tommy to retrieve it for her. Luke begins to question he and Joanne's quest. Noah and Quentin capture Erica's daughter for answers. Molly makes a heavy decision."
}, {
  "imdbId" : "3556944",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "The Lion's Den",
  "description" : "Noah Bennet (Jack Coleman) and Quentin (Henry Zebrowski) take on Renautas while Miko's plan to retrieve her sword may land her in trouble. Malina's (Danika Yarosh) journey bring her closer to the truth. Elsewhere, Luke (Zachary Levi) returns home to confront his past and the authorities close in on Tommy (Robbie Kay). Meanwhile, Carlos (Ryan Guzman) may have found an unexpected ally and Erica (Rya Khilstedt) solidifies her plans."
}, {
  "imdbId" : "3556944",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Game Over",
  "description" : "Noah Bennet (Jack Coleman) takes matters into his own hands to get much-needed answers. After Tommy (Robbie Kay) makes a startling discovery, he and Emily (Gatlin Green) go on an unexpected journey. Elsewhere, Luke (Zachary Levi) continues to come to grips with the fact that he has become what he has been hunting. Malina (Danika Yarosh) finds a surprising ally. Miko (Kiki Sukezane) stays on the course to save her father, but Erica (Rya Khilstedt) takes measures to interfere. Meanwhile, Carlos (Ryan Guzman) learns more about what is really going on with EVOS from an ..."
}, {
  "imdbId" : "3556944",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "June 13th - Part One",
  "description" : "Noah and Hiro join forces to return to the events of June 13, 2014, that set everything in motion; Mohinder receives a message from Angela Petrelli about Erica's motives; Hachiro moves against Hiro."
}, {
  "imdbId" : "3556944",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "June 13th - Part Two",
  "description" : "Erica puts her plan into motion; Hiro and Angela take on an important mission; Noah has an unexpected reunion with Matt Parkman."
}, {
  "imdbId" : "3556944",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "Sundae, Bloody Sundae",
  "description" : "Noah is on the hunt for Tommy to reveal his past to him and guide him on his destiny to stop a catastrophic event. Taylor's discoveries about her mother, Erica Kravid, leads to her capture by an underground group."
}, {
  "imdbId" : "3556944",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "11:53 to Odessa",
  "description" : "Noah and Luke's destinies intersect as Malina tries to save those around her by unleashing her power; Tommy may be forced to work with his enemy; Carlos confronts his past while under Matt Parkman's watch; Ren looks for Miko."
}, {
  "imdbId" : "3556944",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "Send in the Clones",
  "description" : "Luke and Malina unite to rescue Tommy and save mankind in the wake of Noah's vanishing. Tommy and Miko team up against Erica. At the Sundtone Manor a battle rages to free prisoners under Matt Parkman's control."
}, {
  "imdbId" : "3556944",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "Company Woman",
  "description" : "Erica faces her past when Taylor threatens her life. Tommy and Quentin switch sides once again. Ren and Emily end up in the same place. Malina tries to get in touch with Tommy."
}, {
  "imdbId" : "3556944",
  "season" : "1",
  "episodeNumber" : "13",
  "title" : "Project Reborn",
  "description" : "The real Miko is brought to life. Ren enters the game to save Tommy. Quentin is put in a difficult situation. Malina attempts to stop the solar flare."
}]