[{
  "imdbId" : "0063962",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Identified",
  "description" : "SHADO - an acronym for Supreme Headquarters Alien Defence Organization - is located beneath a supposed film studio in the English countryside and run by Commander Straker, who poses as a film producer. When an Unidentified Flying Object attacks a plane in which Straker's deputy Colonel Freeman is travelling it is shot down and investigated. The body of an alien is found and discovered to have transplanted human body parts, seemingly from a trio who disappeared in nearby woods a decade earlier. It is part of the alien plan to take over the Earth to study and imitate ..."
}, {
  "imdbId" : "0063962",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Exposed",
  "description" : "Colonel Paul Foster is a test pilot whose aircraft is accidentally caught up in a battle between an Unidentified Flying Object and a SHADO rocket. Foster's plane is shot down and his co-pilot is killed. When he comes round in hospital nobody will believe his fanciful story of what he saw. Until he is made an offer that he cannot refuse, namely an invitation to join SHADO and donate his skills or, quite simply, death."
}, {
  "imdbId" : "0063962",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "The Cat with Ten Lives",
  "description" : "SHADO pilot Jim Reagan is on leave and is driving down a country road at night when he sees a Siamese cat blocking his way. When he gets out of his car to tend to the cat, he is rushed by aliens who abduct him and operate upon him. As a consequence, when he is returned to Earth he is totally under the influence of the cat and its commands - and the cat is at SHADO headquarters."
}, {
  "imdbId" : "0063962",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Conflict",
  "description" : "Lunar Module 32 is destroyed when a limpet craft operated bu the aliens attaches itself to its side and blows it up. The wreckage is widespread. Straker then orders a clean-up operation to rid the countryside of all craft detritus. However, this is not enough for General James Henderson, the chief of the International Astro-Physical Commission, who believes that SHADO should be disbanded."
}, {
  "imdbId" : "0063962",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "A Question of Priorities",
  "description" : "Straker's son John lives with Straker's ex-wife Mary, who has re-married. Straker is having a day out with the boy, John, but it ends in an argument with Mary and John is run over and seriously hurt. Drugs can be obtained to save him in America and a SHADO craft is sent to fetch them. However, Straker gets an alert call to say that an alien defector which could do untold damage to Earth is in the range of the SHADO craft. SHADO can destroy the alien but it means diverting the means to save John."
}, {
  "imdbId" : "0063962",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "E.S.P.",
  "description" : "John Croxley is a man with Extra Sensory Perception, which enables him to read the minds of other people, although he regards it as a curse and has sought medical aid. One day, following a dog-fight with a UFO craft, Foster crashes into and destroys Croxley's house, at the same time causing the death of Croxley's wife. Holding Foster responsible for his bereavement, Croxley uses his powers to read Foster's mind and find out all about SHADO, which he intends to destroy."
}, {
  "imdbId" : "0063962",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Kill Straker!",
  "description" : "Paul Foster and his co-pilot Frank Craig are attacked by a UFO which infiltrates their minds and hypnotises them into wanting to kill Straker. Straker actually saves their lives when their craft is about to be destroyed, but, on their return to SHADO, Craig makes an attempt on Straker's life whilst Foster seeks to discredit him."
}, {
  "imdbId" : "0063962",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Sub-Smash",
  "description" : "After an underwater UFO has attacked and sunk a freight ship in the ocean, Straker, Foster and SHADO lieutenant Nina Barry join a submarine crew to find out what they can. However, they too are attacked by the UFO's vessel and, as a result, their submarine is grounded on a ledge. Straker has to overcome his claustrophobia in order to work out an escape plan."
}, {
  "imdbId" : "0063962",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "Destruction",
  "description" : "Aliens attempt to destroy a naval ship dumping toxic waste into the ocean but their craft is shot down. Straker is surprised to read the news of the incident as it was not a SHADO operation, and goes to see Admiral Sheringham at the Admiralty. Sheringham is not co-operative and Straker suspects a cover-up. He sends Foster to see if he can get more information from Sarah, the Admiral's secretary."
}, {
  "imdbId" : "0063962",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "The Square Triangle",
  "description" : "Liz Newton and her lover Cass are planning the murder of Liz's husband Jack. A UFO craft lands near to her remote woodland cottage and an alien gets out to explore the surroundings. Believing the alien to be Jack, Liz and Cass shoot and kill it. Straker arrives in search of the alien and takes the couple away for questioning."
}, {
  "imdbId" : "0063962",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "Close Up",
  "description" : "Straker and the SHADO team are invited to sit in on the test for an immensely powerful new telescope as it takes the first known photographs of alien homeland. The photos are indeed taken but what will they reveal and will they have been worth it?"
}, {
  "imdbId" : "0063962",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "The Psychobombs",
  "description" : "A trio of innocent civilians, Linda Simmonds, Clem Mason and Daniel Clark are captured by aliens using a hypnotic signal and imbued with superhuman powers. Straker encounters Mason, who overpowers him and leaves him unconscious. When he comes round, Straker is given an ultimatum by the aliens. Unless SHADO ceases its operations, the trio will be sent in as suicide bombers to destroy it."
}, {
  "imdbId" : "0063962",
  "season" : "1",
  "episodeNumber" : "13",
  "title" : "Survival",
  "description" : "Foster is stranded on the Moon and another astronaut is killed following an attack by aliens under cover of a meteor shower. Foster has lost contact with the Moonbase and is assumed to be dead so there is no search party. Then he meets an alien, also stranded, and the two have to work in a bizarre alliance in order to survive."
}, {
  "imdbId" : "0063962",
  "season" : "1",
  "episodeNumber" : "14",
  "title" : "Mindbender",
  "description" : "Lieutenant Andy Conroy is investigating a crash involving an alien craft on the Moon when he suddenly gets caught up in a Wild west type shoot-out with Mexican brigands. Back at the SHADO's earthly base another officer, Beaver James, gets involved in another shoot-out, this time with aliens. Then a voice shouts \"Cut!\" and the whole is seen to be a film being made at the studios telling the story of Straker's life. So what's real and what's imagined?"
}, {
  "imdbId" : "0063962",
  "season" : "1",
  "episodeNumber" : "15",
  "title" : "Flight Path",
  "description" : "Paul Roper is a SHADO technician with a pretty, younger wife and aliens have threatened to kill her unless he passes on to them cryptic computer co-ordinates, the possession of which will allow them to make an undetected attack on the Moonbase. Colonel Freeman discovers what Roper has been doing and Roper asks for the opportunity to make amends by undertaking a dangerous mission to the Moon to stop the attack."
}, {
  "imdbId" : "0063962",
  "season" : "1",
  "episodeNumber" : "16",
  "title" : "The Man Who Came Back",
  "description" : "Craig Collins returns after his craft crash-landed in a jungle . Two whole months of his travels are unaccounted for, but he has become much rougher, stronger and sharper, though only Colonel John Grey seems to find any cause for concern and nobody else takes his views seriously. However, when Collins is in Space with Straker it becomes clear that aliens have taken over his mind and Straker has to try and literally talk sense into him."
}, {
  "imdbId" : "0063962",
  "season" : "1",
  "episodeNumber" : "17",
  "title" : "The Dalotek Affair",
  "description" : "A meteorite lands on the Moon following an abortive UFO attack and the Moonbase's video and radio links with SHADO fail. Foster suspects that Dalopek, a private mining company with a nearby base whose operations are opposed by Straker, may have accidentally been using the SHADO frequency, but, even after a further black-out in which a module crashes fatally, Dalopek is ultimately exonerated. Foster has hit it off with Jane Carson, Dalopek's glamorous communications officer, but Dalopek staff are subjected to amnesia treatment to make them forget the incident so that, ..."
}, {
  "imdbId" : "0063962",
  "season" : "1",
  "episodeNumber" : "18",
  "title" : "Timelash",
  "description" : "Cmdr Ed Straker and Col Virginia Lake disappear and are discovered unconscious next to a dead body of a Shado operative (Turner). Col Foster and co then try to understand what has happened from here on the story is largely told in flashback. Straker and Lake observe a UFO which they follow but then seems to 'buzz' them. They radio for help but are unable to contact SHADO HQ. After racing back they discover the base and surrounding area are frozen in time and space. They move through the base and see everyone frozen including all the equipment. On entering the film set..."
}, {
  "imdbId" : "0063962",
  "season" : "1",
  "episodeNumber" : "19",
  "title" : "Ordeal",
  "description" : "Following a wild night out with a girl called Sylvia, Foster is receiving a refreshing sauna bath at the SHADO health farm. Drifting into semi-consciousness, he comes to to find he has been abducted by an alien and is on a UFO, which is shot down onto the Moon's surface. He survives but has to be extremely careful how he removes the helmet he is wearing. Clumsy removal would kill him because of the breathing liquid it contains. However, as he drifts in and out of consciousness, it appears that he never left the sauna."
}, {
  "imdbId" : "0063962",
  "season" : "1",
  "episodeNumber" : "20",
  "title" : "Court Martial",
  "description" : "When Straker complains to Henderson that his phone has been tapped he is told that it is to trap a spy within SHADO, who has recently leaked information to the press. When a second leak occurs, evidence points to Foster, who is court-martialled and sentenced to death. Unconvinced of Foster's guilt, Straker discovers that somebody had bugged Foster's flat to frame him and sets out to discover who it is. At the same time Foster escapes and Henderson gives orders for him to be shot on sight."
}, {
  "imdbId" : "0063962",
  "season" : "1",
  "episodeNumber" : "21",
  "title" : "Computer Affair",
  "description" : "Three Interceptors are sent to frustrate a UFO attack but one collides with the UFO, killing the pilot, Ken Matthews. Lieutenant Gay Ellis was giving the pilots their instructions and Straker suspects she sacrificed Matthews to give spare another pilot,Mark Bradley, her apparent lover. Psychological tests on Gay and Mark, as processed by a computer, confirm that they are in love but both deny it. When an alien lands on Earth, Gay sends Mark to capture it, to prove that she is impartial and prepared to risk his life. He comes through and goes on a date with her. ..."
}, {
  "imdbId" : "0063962",
  "season" : "1",
  "episodeNumber" : "22",
  "title" : "Confetti Check A-OK",
  "description" : "When the wife of a SHADO officer, Lieutenant Grey, gives birth Straker is put in mind of events of ten years earlier when he was still with his wife Mary . He had recently established SHADO but the responsibility and degree of commitment put a heavy strain on his marriage. Mary saw him visiting another woman but it was professional and not sexual, but he felt unable to tell her the truth without jeopardising the organization."
}, {
  "imdbId" : "0063962",
  "season" : "1",
  "episodeNumber" : "23",
  "title" : "The Sound of Silence",
  "description" : "An alien craft lands in woodland near the home of horseman Russell Stone. When Stone goes missing suspicion initially falls on Ben Culley, a tramp with whom Stone had recently argued over trespassing on his property. However, Culley is found dead and it seems likely that the green alien who killed him has captured Stone.The trail leads to a nearby lake where it seems likely that the alien is hiding. . ."
}, {
  "imdbId" : "0063962",
  "season" : "1",
  "episodeNumber" : "24",
  "title" : "Reflections in the Water",
  "description" : "Following the sinking of a freighter ship and the death of an underwater cameraman, Straker and Foster take the submarine 'Skydiver' to examine the ocean bed. They come across a vast domed building and, from a distance, think they see SHADO Lieutenant Anderson in the dome. Back at headquarters Straker interviews Anderson, who claims to know nothing of the dome. It is part of an alien plot to create doubles of the SHADO staff - including Straker - to by-pass SHADO security systems. The dome has to be destroyed with its occupants."
}, {
  "imdbId" : "0063962",
  "season" : "1",
  "episodeNumber" : "25",
  "title" : "The Responsibility Seat",
  "description" : "Freelance journalist Jo Fraser comes to Straker's office, looking for a story but she plants a bug and absconds with the tape she has made of his conversations, having creamed him with a vase. He pursues and catches up with her ,taking her on a date and leaving Freeman in 'the responsibility chair' to make all the decisions. When a Russian mining company's vehicle runs amok on the moon and threatens the SHADO Moonbase it is down to Foster to save the day for Freeman."
}, {
  "imdbId" : "0063962",
  "season" : "1",
  "episodeNumber" : "26",
  "title" : "The Long Sleep",
  "description" : "Ten years earlier Straker accidentally knocked Catherine Frazer down in his car as she was running away from something which frightened her and she has been unconscious ever since.Now Catherine awakes from her coma and explains that she and a boy named Tim whom she had not long met went to a derelict farm-house to take recreational drugs. There they saw two aliens planting a bomb. The couple ran off - Catherine into the path of Straker's car, Tim, she understood to have fallen off a roof and died. However, he was taken by the aliens who took him over and is now back, ..."
}]