[{
  "imdbId" : "0433309",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Unaired Pilot",
  "description" : "Know what this is about?"
}, {
  "imdbId" : "0433309",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Pilot",
  "description" : "When a rapist proves a little too difficult to find for the FBI, Agent Eppes and Agent Lake utilize Agent Eppes' genius mathematician brother, Charlie, to discover the rapist's point of origin."
}, {
  "imdbId" : "0433309",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Uncertainty Principle",
  "description" : "A pair of bank robbers are quietly taking LA by storm but Charlie delivers an equation that may predict their next location. But these bank robbers aren't as respectful as the bank videos reveal."
}, {
  "imdbId" : "0433309",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Vector",
  "description" : "A deadly virus is spreading through LA and only Charlie's equations can determine how far and where the disease is spreading."
}, {
  "imdbId" : "0433309",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Structural Corruption",
  "description" : "The mysterious suicide of a brilliant but unfocused CalSci engineering major leads Eppes and Charlie to the site of an iconic building."
}, {
  "imdbId" : "0433309",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Prime Suspect",
  "description" : "A genius' (Harris) daughter is captured by two men looking to use his possible solution to a 150 year old math equation for heists."
}, {
  "imdbId" : "0433309",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Sabotage",
  "description" : "An unknown terrorist is mimicking horrible train accidents and leaving a number code at the scene."
}, {
  "imdbId" : "0433309",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Counterfeit Reality",
  "description" : "When FBI agent Don Eppes finds several murders are linked to counterfeiting, his mathematically genial brother Charlie uses his skills to do what other investigating methods -as used by Agent Kim Hall, Don's colleague and ex in his Albuquerque days, a blank chapter in his past for Charlie- failed to, locate the forging and identify who did the graphical artwork required for his old-fashioned, relatively hard to detect fakes with real printing presses and watermark, not computer printing: it's a missing artist, who must be kidnapped and will probably by murdered as a ..."
}, {
  "imdbId" : "0433309",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "Identity Crisis",
  "description" : "When Riley, who practiced an ingenious pyramid method of skinning numerous bank accounts for over half a million dollars, is strangled, exactly the same way -not revealed to the press- as Lisa Bayle, for whose murder Don Eppes' investigation once put Cliff Howard in jail after a plea bargain-confession, Don now fears the wrong man was arrested. Charlie helps him quantify the unlikeliness of a coincidence and seriously doubt the forensic evidence. Electrician Jose Salazar, whom Don suspects, still turns out to be innocent of Lisa's murder, but Charlie realizes that's ..."
}, {
  "imdbId" : "0433309",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "Sniper Zero",
  "description" : "Sniper attacks are occurring across LA but are all the attacks the result of one inexperienced marksmen or is a fad of sniper killings infecting LA?"
}, {
  "imdbId" : "0433309",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "Dirty Bomb",
  "description" : "A truck of nuclear materials is stolen by terrorists who intend to use the materials to make a bomb which would then be used on the city of LA. Only Charlie and Charlie's father Alan can save the city from a small nuclear blast."
}, {
  "imdbId" : "0433309",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "Sacrifice",
  "description" : "Dr. Larry Fleinhardt's former college days friend Jonas Hoke, the Senior computer-science researcher, who develops for Robert Oliver's firm Lorman group with gifted college drop-out Scott Reynolds a classified program to evaluate government projects, is murdered in his Hollywood Hills home; data were stolen from his computer, which only contains a coded program for analysis of baseball statistics. Hoke's financial divorce complications seem irrelevant, although his wife had a relationship with their security system installer Lucas Grant. However Charlie finds that ..."
}, {
  "imdbId" : "0433309",
  "season" : "1",
  "episodeNumber" : "13",
  "title" : "Noisy Edge",
  "description" : "A UFO is briefly seen flying through Los Angeles with no clear indication on what it is, but Agent Eppes discovers it was heading for the Staples Center and starts an investigation into the possibility of mass terrorism."
}, {
  "imdbId" : "0433309",
  "season" : "1",
  "episodeNumber" : "14",
  "title" : "Man Hunt",
  "description" : "A prison transport bus crashes after maneuvers by two other vehicles, several inmates escape, including the dangerous McDowd. Charlie gets on well with CHP Officer Morris on the scene and works out mathematically it was no accident, both other drivers probably were in the game. Dad is worried Don might be returning to the period he regularly worked in fugitive retrieval, especially now a former colleague, burly federal marshal Cooper, is on the same case. After finding a lesser fugitive, Charlie's mathematical probabilities approach helps reconstructing the remarkable..."
}, {
  "imdbId" : "0433309",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "Judgment Call",
  "description" : "When the wife of a judge is killed the team investigates. And they discover that it might not be for the reason they think."
}, {
  "imdbId" : "0433309",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "Bettor or Worse",
  "description" : "The team investigates a jewelry store theft where the robbers kidnapped the owner's wife and daughter."
}, {
  "imdbId" : "0433309",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "Obsession",
  "description" : "Singer Skyler Wyatt reports a knife-wielding intruder in her home. The break-in seems to be connected to the hate mail she has been receiving for the last three months. Don begins to investigate and the body of a paparazzo is discovered overlooking Skyler's home. Don brings in his brother Charlie to analyze the hand-written hate mail and to try to determine where the strange photographs found on the dead body were taken. As the investigation proceeds the brothers are drawn further into the murky world of the paparazzi and celebrity stalking!"
}, {
  "imdbId" : "0433309",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "Calculated Risk",
  "description" : "Don takes under his wing the son of a murdered executive as the team and Charlie try to narrow down who's responsible out of a pool of six thousand or more."
}, {
  "imdbId" : "0433309",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "Assassin",
  "description" : "The raid on a small time forgers home reveals a secret code book. Don takes the code book to his brother Charlie who tells him that the book hides secrets of a skilled and highly trained assassin somewhere in the country. Interrogation of he forger reveals the name of the intended target, Gabriel Ruiz, the last remaining member of a powerful political family in Colombia. So the hunt begins to catch the assassin before he completes his mission!"
}, {
  "imdbId" : "0433309",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "Soft Target",
  "description" : "When a death results from an anti-terrorism exercise Don and his team are called in, but they end up butting heads with the leader of the unit who refuses to halt further training exercises. Back at home, Alan has volunteered the house for the wedding of a girl both Charlie and Don had a crush on in high school."
}, {
  "imdbId" : "0433309",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "Convergence",
  "description" : "A series of home invasions become increasingly violent. Charlie's most famous work, The Eppes Convergence, is scrutinized by a former rival."
}, {
  "imdbId" : "0433309",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "In Plain Sight",
  "description" : "Data from a meth lab explosion reveals a photograph that triggers memories for Charlie and put him at loggerheads with Don who's focused on tracking down the drug dealer who set off the explosion that killed one of his agents."
}, {
  "imdbId" : "0433309",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "Toxin",
  "description" : "A few apparently random cases of product tampering lead to a mountain man with a grudge, a pharmaceutical company and a conspiracy."
}, {
  "imdbId" : "0433309",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "Bones of Contention",
  "description" : "The murder of a young museum researcher sends the team on a search for a killer and a missing Native American skull."
}, {
  "imdbId" : "0433309",
  "season" : "2",
  "episodeNumber" : "11",
  "title" : "Scorched",
  "description" : "Charlie seeks out an engineering professor to help him recreate a fire scenario to solve an arson case."
}, {
  "imdbId" : "0433309",
  "season" : "2",
  "episodeNumber" : "12",
  "title" : "The OG",
  "description" : "Charlie uses math to determine the killer of an undercover FBI agent."
}, {
  "imdbId" : "0433309",
  "season" : "2",
  "episodeNumber" : "13",
  "title" : "Double Down",
  "description" : "Charlie and the team investigate a murder at a casino."
}, {
  "imdbId" : "0433309",
  "season" : "2",
  "episodeNumber" : "14",
  "title" : "Harvest",
  "description" : "A crime scene drenched in blood leads the team to a form of human trafficking, and Amita to her past."
}, {
  "imdbId" : "0433309",
  "season" : "2",
  "episodeNumber" : "15",
  "title" : "The Running Man",
  "description" : "When a DNA synthesizer with terrorist possibilities is stolen from a university lab, Charlie and the team must find it before it leaves the country."
}, {
  "imdbId" : "0433309",
  "season" : "2",
  "episodeNumber" : "16",
  "title" : "Protest",
  "description" : "The bombing of a recruitment office puts Don and his father at odds, and brings an agent out of retirement."
}, {
  "imdbId" : "0433309",
  "season" : "2",
  "episodeNumber" : "17",
  "title" : "Mind Games",
  "description" : "A psychic helps to find a burial site of numerous illegal immigrants just across the California-Mexico border. Charlie and he battle to see who will come up with the location of another female migrant before she joins the other victims in the morgue."
}, {
  "imdbId" : "0433309",
  "season" : "2",
  "episodeNumber" : "18",
  "title" : "All's Fair",
  "description" : "After an Iraqi woman - in the US to film an interview on atrocities against women back home - is murdered, clues lead to an American military suspect and the team must determine their truth before another killing occurs."
}, {
  "imdbId" : "0433309",
  "season" : "2",
  "episodeNumber" : "19",
  "title" : "Dark Matter",
  "description" : "Charlie helps the team solve how many shooters there were in a school massacre."
}, {
  "imdbId" : "0433309",
  "season" : "2",
  "episodeNumber" : "20",
  "title" : "Guns and Roses",
  "description" : "An ATF agent is found in her home, an apparent victim of suicide. Don, having been involved with her, asks Charlie to run algorithms to determine if she was likely suicidal, or she was murdered."
}, {
  "imdbId" : "0433309",
  "season" : "2",
  "episodeNumber" : "21",
  "title" : "Rampage",
  "description" : "After an assailant opens fire in the FBI offices, Charlie does not want to return."
}, {
  "imdbId" : "0433309",
  "season" : "2",
  "episodeNumber" : "22",
  "title" : "Backscatter",
  "description" : "The Russian mob threatens Don and his family, however Charlie refuses to give up working the case."
}, {
  "imdbId" : "0433309",
  "season" : "2",
  "episodeNumber" : "23",
  "title" : "Undercurrents",
  "description" : "The bodies of young Asian girls wash up on the beach, including one with bird flu. Amita gets a job offer."
}, {
  "imdbId" : "0433309",
  "season" : "2",
  "episodeNumber" : "24",
  "title" : "Hot Shot",
  "description" : "Don's team investigates a rapist who's converted to a serial killer, as Charlie struggles with memories of his mother."
}, {
  "imdbId" : "0433309",
  "season" : "3",
  "episodeNumber" : "1",
  "title" : "Spree",
  "description" : "Charlie and the team track a couple who are spree killers, but their actions seem to defy profiling."
}, {
  "imdbId" : "0433309",
  "season" : "3",
  "episodeNumber" : "2",
  "title" : "Two Daughters",
  "description" : "The team is in a race against time to rescue fellow agent Megan from the clutches of Crystal Hoyle."
}, {
  "imdbId" : "0433309",
  "season" : "3",
  "episodeNumber" : "3",
  "title" : "Provenance",
  "description" : "The robbery of a painting that unexpectedly turned to murder, has the team exploring a disputed provenance and possible insurance fraud."
}, {
  "imdbId" : "0433309",
  "season" : "3",
  "episodeNumber" : "4",
  "title" : "The Mole",
  "description" : "The hit-and-run death of an interpreter may compromise a team member, and Charlie must deal with not being consulted for a paper."
}, {
  "imdbId" : "0433309",
  "season" : "3",
  "episodeNumber" : "5",
  "title" : "Traffic",
  "description" : "Charlie and the team grapple with the concept of 'randomness' while trying to find a killer targeting drivers on the freeway."
}, {
  "imdbId" : "0433309",
  "season" : "3",
  "episodeNumber" : "6",
  "title" : "Longshot",
  "description" : "Don and the team investigate a suspicious death at a horse track. When Charlie starts looking into the crime, he uncovers something that will send the investigation into an entirely different direction."
}, {
  "imdbId" : "0433309",
  "season" : "3",
  "episodeNumber" : "7",
  "title" : "Blackout",
  "description" : "Blackouts all over Los Angeles leave the city in the dark. Don works with his team to figure out if the power outages are an accident or the work of terrorists."
}, {
  "imdbId" : "0433309",
  "season" : "3",
  "episodeNumber" : "8",
  "title" : "Hardball",
  "description" : "The death of a minor league player leads to a math prodigy and stirs old feelings for Don."
}, {
  "imdbId" : "0433309",
  "season" : "3",
  "episodeNumber" : "9",
  "title" : "Waste Not",
  "description" : "Charlie's investigation of a company's toxic paving material is impeded by a new school administrator who wants him to focus primarily on his pure academic work instead."
}, {
  "imdbId" : "0433309",
  "season" : "3",
  "episodeNumber" : "10",
  "title" : "Brutus",
  "description" : "The assassination of a California senator leads the team to questionable experimentation on prisoners, the CIA, and a man bent on revenge. Elsewhere, Larry makes an announcement that shakes Charlie."
}, {
  "imdbId" : "0433309",
  "season" : "3",
  "episodeNumber" : "11",
  "title" : "Killer Chat",
  "description" : "The team tries to track the person murdering men in homes that are for sale, and Larry's dream of space may be in jeopardy."
}, {
  "imdbId" : "0433309",
  "season" : "3",
  "episodeNumber" : "12",
  "title" : "Nine Wives",
  "description" : "The search for a pedophile polygamist takes an interesting genealogical turn when a quilt is found."
}, {
  "imdbId" : "0433309",
  "season" : "3",
  "episodeNumber" : "13",
  "title" : "Finders Keepers",
  "description" : "The search for a yacht ends up splitting Charlie's loyalties when two agencies ask for his help."
}, {
  "imdbId" : "0433309",
  "season" : "3",
  "episodeNumber" : "14",
  "title" : "Take Out",
  "description" : "Multiple robberies at upscale restaurants bring Don's team in once it escalates to murder. Elsewhere, both Charlie and Don must do some soul searching as one tackles a psychiatric review and another questions the ethics of a pharmaceutical company that wants to use his name."
}, {
  "imdbId" : "0433309",
  "season" : "3",
  "episodeNumber" : "15",
  "title" : "End of Watch",
  "description" : "The discovery of a presumed dead police officer's badge brings the LAPD and Don's team together to solve the mystery of what happened 17 years ago. Elsewhere, Alan is served in a lawsuit, and he has to determine if his calculations were wrong when he consulted for a golf course."
}, {
  "imdbId" : "0433309",
  "season" : "3",
  "episodeNumber" : "16",
  "title" : "Contenders",
  "description" : "One of David's childhood friends is accused of murder while sparring in preparation for an All-Out Fighting bout, and Charlie has a contest of his own trying to defend Larry's chair in a Texas Hold 'em qualifier."
}, {
  "imdbId" : "0433309",
  "season" : "3",
  "episodeNumber" : "17",
  "title" : "One Hour",
  "description" : "The son of a multi-millionaire Latino hip-hop-Song producer is kidnapped. The kidnapper demands $3.2 million for the boy's release, but Granger and his crew only have one hour."
}, {
  "imdbId" : "0433309",
  "season" : "3",
  "episodeNumber" : "18",
  "title" : "Democracy",
  "description" : "An old colleague of Charlie's asks for help because of the untimely deaths of some coworkers, but when she also turns up dead Don and Charlie are started on a trail that may threaten the very democracy they've vowed to protect."
}, {
  "imdbId" : "0433309",
  "season" : "3",
  "episodeNumber" : "19",
  "title" : "Pandora's Box",
  "description" : "Charlie splits his genius between solving a plane crash and the burglary at his home."
}, {
  "imdbId" : "0433309",
  "season" : "3",
  "episodeNumber" : "20",
  "title" : "Burn Rate",
  "description" : "As letter bombs begin targeting people surrounding a previous serial bomber investigation, Don and Charlie must sift through a number of false leads to find the real killer."
}, {
  "imdbId" : "0433309",
  "season" : "3",
  "episodeNumber" : "21",
  "title" : "The Art of Reckoning",
  "description" : "Don finds himself negotiating with a hit man to find an assemblyman's son, and Larry has difficulty adjusting to terra firma."
}, {
  "imdbId" : "0433309",
  "season" : "3",
  "episodeNumber" : "22",
  "title" : "Under Pressure",
  "description" : "The threat of a terrorist attack in L.A. puts everyone on high-alert as Don leads a special task force, and butts heads with Charlie and Alan."
}, {
  "imdbId" : "0433309",
  "season" : "3",
  "episodeNumber" : "23",
  "title" : "Money for Nothing",
  "description" : "A shipment of medicine and cash bound for Zambia is hijacked, and Don and his team find themselves working against a banker focused on retrieving his money at the cost of the people being held for the code to access the safe."
}, {
  "imdbId" : "0433309",
  "season" : "3",
  "episodeNumber" : "24",
  "title" : "The Janus List",
  "description" : "When Charlie and Don are specifically asked for by a bomber who's rigged a bridge, it puts them on a trail of espionage in- and outside the states, and a devastating betrayal."
}, {
  "imdbId" : "0433309",
  "season" : "4",
  "episodeNumber" : "1",
  "title" : "Trust Metric",
  "description" : "Peter MacNicol returns as a regular cast member. Colby is being interrogated by a man named Agent Kirkland, who passes him a handcuff key and gives him escape instructions. Don and his team get information about and from Colby and must figure out if that information is reliable then realizes that everything about Colby being a double agent may not be what it seems."
}, {
  "imdbId" : "0433309",
  "season" : "4",
  "episodeNumber" : "2",
  "title" : "Hollywood Homicide",
  "description" : "The death of a Hollywood wannabe leads to a famous actor, his friends, and a possible double. At the office, David has difficulty dealing with Colby's return."
}, {
  "imdbId" : "0433309",
  "season" : "4",
  "episodeNumber" : "3",
  "title" : "Velocity",
  "description" : "A car crash into a building has ties to street racing and possibly a cold case."
}, {
  "imdbId" : "0433309",
  "season" : "4",
  "episodeNumber" : "4",
  "title" : "Thirteen",
  "description" : "Charlie is uncomfortable when the team has to use a numerologist to solve the current case, that has religious overtones."
}, {
  "imdbId" : "0433309",
  "season" : "4",
  "episodeNumber" : "5",
  "title" : "Robin Hood",
  "description" : "The perfect bank heist almost stumps the team when the profits are donated or returned to their rightful owners, and Don struggles with management issues."
}, {
  "imdbId" : "0433309",
  "season" : "4",
  "episodeNumber" : "6",
  "title" : "In Security",
  "description" : "Don is devastated when he thinks he led a killer to a secured witness, and Charlie sets out to prove he wasn't responsible."
}, {
  "imdbId" : "0433309",
  "season" : "4",
  "episodeNumber" : "7",
  "title" : "Primacy",
  "description" : "Amita's life is put in danger when she consults on a case involving an on-line role-playing game."
}, {
  "imdbId" : "0433309",
  "season" : "4",
  "episodeNumber" : "8",
  "title" : "Tabu",
  "description" : "A wealthy man's daughter is kidnapped, and Megan is astounded by his behavior while the team tries to rescue her."
}, {
  "imdbId" : "0433309",
  "season" : "4",
  "episodeNumber" : "9",
  "title" : "Graphic",
  "description" : "In this episode, it is discovered that someone has stolen, recreated and sold several copies of an extremely rare comic book. Christopher Lloyd plays the original creator of the comic book, who no longer benefits from his past creations. Having thought that his comics wouldn't be worth much in the future, he either lost or sold his entire collection and regrets it now that he and his wife live on very little. His young friend and fellow comics artist, played by Ben Feldman, publicly humiliates the rich man who owned the original before it was stolen."
}, {
  "imdbId" : "0433309",
  "season" : "4",
  "episodeNumber" : "10",
  "title" : "Chinese Box",
  "description" : "David is held hostage in an elevator at the F.B.I. building, and Don keeps brushing aside Charlie's suggestion to save David as an all-out assault is planned."
}, {
  "imdbId" : "0433309",
  "season" : "4",
  "episodeNumber" : "11",
  "title" : "Breaking Point",
  "description" : "Charlie's life is put in danger after he gives an interview about the case he and Don are working on together, attracting the attention of the kidnappers of an investigative reporter."
}, {
  "imdbId" : "0433309",
  "season" : "4",
  "episodeNumber" : "12",
  "title" : "Power",
  "description" : "Don's team tracks a serial rapist who uses his position as a cop to entrap his victims."
}, {
  "imdbId" : "0433309",
  "season" : "4",
  "episodeNumber" : "13",
  "title" : "Black Swan",
  "description" : "A meth lab bust yields a surprise arrest that stymies the team when they can't figure out why he was in the area, and Megan disagrees with what Don chooses to do to get his answers."
}, {
  "imdbId" : "0433309",
  "season" : "4",
  "episodeNumber" : "14",
  "title" : "Checkmate",
  "description" : "A.U.S.A. Robin Brooks is back in town, and her involvement in Don's case brings back memories as they try to keep witnesses alive. Meanwhile, David attempts to bond with a young man who's in the chief suspect's thrall."
}, {
  "imdbId" : "0433309",
  "season" : "4",
  "episodeNumber" : "15",
  "title" : "End Game",
  "description" : "Clay Porter returns to the U.S. when his father and sister are taken hostage, and Don embarks on a deadly cat-and-mouse game to try to catch Porter and rescue his family."
}, {
  "imdbId" : "0433309",
  "season" : "4",
  "episodeNumber" : "16",
  "title" : "Atomic No. 33",
  "description" : "Larry finds himself fighting his own bigotry when he assists Don and Charlie's investigation into the poisoning of cult members."
}, {
  "imdbId" : "0433309",
  "season" : "4",
  "episodeNumber" : "17",
  "title" : "Pay to Play",
  "description" : "The murder of a rapper puts Charlie to work analyzing the mathematics of the music business in the same week that Amita's parents come to town, and Megan has asked for a week off without discussing it with Don."
}, {
  "imdbId" : "0433309",
  "season" : "4",
  "episodeNumber" : "18",
  "title" : "When Worlds Collide",
  "description" : "When one of Charlie's friends, a scientist at the university, is arrested for terrorist activities, it puts him at philosophical odds with Don. And as he works to prove the man's innocence, his beliefs may jeopardize his career."
}, {
  "imdbId" : "0433309",
  "season" : "5",
  "episodeNumber" : "1",
  "title" : "High Exposure",
  "description" : "Charlie's loss of clearance may endanger Don's life when he and Ian Edgerton begin tracking suspects in the murders of two rock climbers."
}, {
  "imdbId" : "0433309",
  "season" : "5",
  "episodeNumber" : "2",
  "title" : "The Decoy Effect",
  "description" : "The team races to find a group of kidnappers who have their victims drain their bank accounts using ATMs, and Charlie's attempt to reinstate his clearance is slowed by an agent with an agenda that may include Don."
}, {
  "imdbId" : "0433309",
  "season" : "5",
  "episodeNumber" : "3",
  "title" : "Blowback",
  "description" : "Agent McGowan makes his move against Don, and Colby gets a little too involved with one of the suspects in a cop killing."
}, {
  "imdbId" : "0433309",
  "season" : "5",
  "episodeNumber" : "4",
  "title" : "Jack of All Trades",
  "description" : "Charlie and Don's fates hang in the balance as the team tracks a white-collar criminal through Los Angeles. Meanwhile, Alan finds out that one of his old planning projects may disappear with a new development by the city."
}, {
  "imdbId" : "0433309",
  "season" : "5",
  "episodeNumber" : "5",
  "title" : "Scan Man",
  "description" : "The death of an agent kicks everyone into high gear, but that slows down when their prime suspect turns out to have Autism Spectrum Disorder, Charlie steps on toes re-establishing himself as the resident expert, and Don looks for deeper meaning."
}, {
  "imdbId" : "0433309",
  "season" : "5",
  "episodeNumber" : "6",
  "title" : "Magic Show",
  "description" : "Charlie's skepticism of magic is revealed when a stunt goes wrong and a magician disappears, leaving David to pick up the pieces of his love life."
}, {
  "imdbId" : "0433309",
  "season" : "5",
  "episodeNumber" : "7",
  "title" : "Charlie Don't Surf",
  "description" : "The father of a childhood friend of Don and Charlie asks for Don's help when his son, a former pro surfer, is found dead."
}, {
  "imdbId" : "0433309",
  "season" : "5",
  "episodeNumber" : "8",
  "title" : "Thirty-Six Hours",
  "description" : "Two trains collide, a passenger train and a freight train carrying toxic chemicals. Don, Charlie and the team are brought to the scene, investigating a potential crime."
}, {
  "imdbId" : "0433309",
  "season" : "5",
  "episodeNumber" : "9",
  "title" : "Conspiracy Theory",
  "description" : "The team descends into a bit of madness as working with a conspiracy theorist to solve bombing case exposes each of their own peculiar beliefs. Meanwhile, a mysterious stranger saves an agent's life."
}, {
  "imdbId" : "0433309",
  "season" : "5",
  "episodeNumber" : "10",
  "title" : "Frienemies",
  "description" : "Charlie and Marshall Penfield work on their collaboration issues when Charlie must consult with him on a case involving robbery, murder and revenge."
}, {
  "imdbId" : "0433309",
  "season" : "5",
  "episodeNumber" : "11",
  "title" : "Arrow of Time",
  "description" : "Buck Winters, who murdered and stole with his older lover in the season three premiere, escapes from prison and comes after Don. Don uses his newfound faith to guide him through."
}, {
  "imdbId" : "0433309",
  "season" : "5",
  "episodeNumber" : "12",
  "title" : "Jacked",
  "description" : "Charlie's hacking skills are put to the test when the team tries to rescue hostages on a bus. Meanwhile, Alan chafes at his first experience with the think tank model."
}, {
  "imdbId" : "0433309",
  "season" : "5",
  "episodeNumber" : "13",
  "title" : "Trouble in Chinatown",
  "description" : "The abduction of an undercover agent brings ex-CIA psychic Simon Kraft back into the Eppes' lives, and while Charlie pursues a scientific solution and Don a procedural one, Kraft's visions lead them toward an ancient ceremony and the loss of another life."
}, {
  "imdbId" : "0433309",
  "season" : "5",
  "episodeNumber" : "14",
  "title" : "Sneakerhead",
  "description" : "The team chases after a pair of rare sneakers that just keep disappearing, leaving death and injuries in their wake. Liz weighs her promotion against losing the team in the L.A. office."
}, {
  "imdbId" : "0433309",
  "season" : "5",
  "episodeNumber" : "15",
  "title" : "Guilt Trip",
  "description" : "When Robin Brooks loses a case involving the murder of an informant, the team takes it very personally. Launching an investigation to get around double jeopardy, and bring justice down on an international arms dealer."
}, {
  "imdbId" : "0433309",
  "season" : "5",
  "episodeNumber" : "16",
  "title" : "Cover Me",
  "description" : "An old friend who's a DEA agent agrees to assist Liz in an undercover operation when Charlie uses math to affect the city's drug traffic, but a miscalculation and an addiction endangers both her life and the operation."
}, {
  "imdbId" : "0433309",
  "season" : "5",
  "episodeNumber" : "17",
  "title" : "First Law",
  "description" : "When an AI kills the scientist who created her it opens a career door for Charlie, but first he and Amita must determine what happened, putting Amita's life in jeopardy."
}, {
  "imdbId" : "0433309",
  "season" : "5",
  "episodeNumber" : "18",
  "title" : "12:01 AM",
  "description" : "Charlie is distracted from applying math to his first basketball-coaching job when a doctor claims to have evidence that clears a death-row inmate, leaving him and the team very little time to be sure real justice occurs."
}, {
  "imdbId" : "0433309",
  "season" : "5",
  "episodeNumber" : "19",
  "title" : "Animal Rites",
  "description" : "Charlie takes a very personal interest when one of CalSci's professors is murdered during a raid by animal rights advocates, and once the murderer is found Nikki's actions put the operation and civilians at risk."
}, {
  "imdbId" : "0433309",
  "season" : "5",
  "episodeNumber" : "20",
  "title" : "The Fifth Man",
  "description" : "Charlie once again questions his involvement with the FBI when a miscalculation leaves Don in the hospital and his team searching for the reason behind atypical home invasion robberies."
}, {
  "imdbId" : "0433309",
  "season" : "5",
  "episodeNumber" : "21",
  "title" : "Disturbed",
  "description" : "Charlie, still feeling guilty about Don's injury, focuses on finding a frighteningly intelligent serial killer who is meticulous about eliminating all witnesses to his crimes."
}, {
  "imdbId" : "0433309",
  "season" : "5",
  "episodeNumber" : "22",
  "title" : "Greatest Hits",
  "description" : "Disgraced agent Roger Bloom appears to be involved in a string of bank robberies, Charlie resists becoming part of his new office's legacy, and an abduction will forever change the Eppes's lives."
}, {
  "imdbId" : "0433309",
  "season" : "5",
  "episodeNumber" : "23",
  "title" : "Angels and Devils",
  "description" : "Wracked by fear and self-doubt after Amita's abduction, Charlie must somehow focus when she reaches out to him in order to save her before it's too late."
}, {
  "imdbId" : "0433309",
  "season" : "6",
  "episodeNumber" : "1",
  "title" : "Hangman",
  "description" : "The team tries to protect an activist from a sniper, while Charlie and Amita try to keep his proposal and her answer a secret."
}, {
  "imdbId" : "0433309",
  "season" : "6",
  "episodeNumber" : "2",
  "title" : "Friendly Fire",
  "description" : "Charlie and the team investigate a shootout involving a bank robber, but when the science doesn't match the stories suspicion falls on one of Don's mentors."
}, {
  "imdbId" : "0433309",
  "season" : "6",
  "episodeNumber" : "3",
  "title" : "7 Men Out",
  "description" : "A rash of apparent suicides takes a sinister turn when a gambling connection is uncovered. Elsewhere, Charlie worries when Alan's retirement disappears, and Larry flounders trying to find his new path."
}, {
  "imdbId" : "0433309",
  "season" : "6",
  "episodeNumber" : "4",
  "title" : "Where Credit's Due",
  "description" : "The team gets a close-up look at the movie business when a producer's desiccated body is found in the desert. Elsewhere, Larry knows that he's leaving but not his destination, and Alan struggles with technology."
}, {
  "imdbId" : "0433309",
  "season" : "6",
  "episodeNumber" : "5",
  "title" : "Hydra",
  "description" : "What starts as a kidnapping becomes more complicated when the team learns the child may be a clone and her guardians may not have her best interests in mind."
}, {
  "imdbId" : "0433309",
  "season" : "6",
  "episodeNumber" : "6",
  "title" : "Dreamland",
  "description" : "The team explores an odd death by some kind of electricity at a decommissioned airbase, finding themselves teamed with an odd character from the Pentagon's Department 44. Elsewhere, David ponders his future and Alan celebrates a birthday."
}, {
  "imdbId" : "0433309",
  "season" : "6",
  "episodeNumber" : "7",
  "title" : "Shadow Markets",
  "description" : "The team finds themselves protecting a hacker who has exposed their sting site when he's targeted by assassins."
}, {
  "imdbId" : "0433309",
  "season" : "6",
  "episodeNumber" : "8",
  "title" : "Ultimatum",
  "description" : "The team gets into a turf war with a prison warden, and the casualty may be Ian Edgerton and the member of Don's team that he's taken hostage in a desperate attempt to prove himself innocent of murder charges."
}, {
  "imdbId" : "0433309",
  "season" : "6",
  "episodeNumber" : "9",
  "title" : "Con Job",
  "description" : "When robbers hit a diamond exchange and take hostages, Don and the team find an unlikely ally in convict John Buckley, who may help the team's investigation when they believe the men are copying Buckley's criminal strategies."
}, {
  "imdbId" : "0433309",
  "season" : "6",
  "episodeNumber" : "10",
  "title" : "Old Soldiers",
  "description" : "When the team foils a robbery of an armored car full of Federal Reserve money and recover bills that trace back to the infamous D.B. Cooper heist, they call on Agent Roger Bloom, who worked on the Cooper case, for help with the investigation."
}, {
  "imdbId" : "0433309",
  "season" : "6",
  "episodeNumber" : "11",
  "title" : "Scratch",
  "description" : "Don and the team try their luck at investigating the theft of scratch-off lottery tickets, but the stakes are raised when one of the culprits killed at a botched robbery turns out to be a former lottery winner."
}, {
  "imdbId" : "0433309",
  "season" : "6",
  "episodeNumber" : "12",
  "title" : "Arm in Arms",
  "description" : "The team searches for a lost shipment of high-caliber firearms when one of the weapons is responsible for random killings throughout the city. Also, Charlie and Amita disagree on a wedding date while Don re-evaluates his relationship with Robin."
}, {
  "imdbId" : "0433309",
  "season" : "6",
  "episodeNumber" : "13",
  "title" : "Devil Girl",
  "description" : "The team searches for a serial killer who is targeting men who solicit prostitutes. Also, Colby and Nikki deal with the aftermath of a car crash when they have an accident during the investigation."
}, {
  "imdbId" : "0433309",
  "season" : "6",
  "episodeNumber" : "14",
  "title" : "And the Winner Is...",
  "description" : "Larry turns up again after having wandered the desert for quite some time, while the FBI works to solve jewelry heist at an awards show, while dealing with celebrities...and their egos."
}, {
  "imdbId" : "0433309",
  "season" : "6",
  "episodeNumber" : "15",
  "title" : "Growin' Up",
  "description" : "The team investigates the deaths of two men who were part of a group of friends that had been sexually assaulted by a teacher when they were young boys. Also, Charlie and Amita get a fantastic job opportunity that could put a wrinkle in their wedding plans."
}, {
  "imdbId" : "0433309",
  "season" : "6",
  "episodeNumber" : "16",
  "title" : "Cause and Effect",
  "description" : "Charlie and Amita are getting married at last. While making an arrest, Don's gun is stolen from him and is subsequently used in a series of crimes. Lou Diamond Phillips' character, Agent Ian Edgerton, appears in the series finale."
}]