[{
  "imdbId" : "2167393",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "A New War Begins",
  "description" : "Out of the turmoil of the Civil War, America enters an age of enlightenment that will change the landscape of the country forever. The growth is driven by five insightful men who will change the world forever."
}, {
  "imdbId" : "2167393",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Bloody Battles",
  "description" : "As it recovers from the Civil War, America undertakes the largest building phase of the country s history. While much of the growth is driven by railroads and oil, it's built using steel."
}, {
  "imdbId" : "2167393",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Changing the Game",
  "description" : "The steel and oil have forever changed the face of America, but they are just the beginning. JP Morgan arrives on the scene and expedites growth through finance."
}, {
  "imdbId" : "2167393",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "When One Ends, Another Begins",
  "description" : "Railroads, oil, steel and electricity have all been harnessed in less than 50 years, but the face of America is changing and will never be the same."
}, {
  "imdbId" : "2167393",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "A New Rival Emerges",
  "description" : "While Carnegie and Rockefeller continue to battle, JP Morgan arrives on the scene and establishes a bank in New York City that has one goal: to further the technological advancements of America. Morgan s first investment is in Thomas Edison s new development--Edison has developed electric light."
}, {
  "imdbId" : "2167393",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Owning It All",
  "description" : "With an investment from Morgan, the Edison Electric Company is created and begins wiring homes in New York. A rival, Nikola Tesla, soon emerges with a different technology for electric light. Edison is convinced his is better and goes to war with Tesla. As things escalate, Morgan begins to lose faith. Eventually, Tesla s technology prevails and his theory of Alternating Current (AC) becomes the standard. Morgan fires Edison and renames Edison Electric Company as General Electric (GE). GE is still one of the biggest companies in the world today. Edison vows never to ..."
}, {
  "imdbId" : "2167393",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Taking the White House",
  "description" : "Vanderbilt, Rockefeller, Carnegie, and Morgan have gone unmonitored for decades, but American politicians are about to change that. They want these men to fall into line under government control. The men, some lifelong enemies, come together with a plan to buy the White House by donating the modern day equivalent of $30 million dollars to Ohio Governor, William McKinley. McKinley intends to repay his backers; he repeals regulation after regulation to allow them the freedom to do unimaginable things without consequence or impediment. Morgan and Carnegie create US Steel..."
}, {
  "imdbId" : "2167393",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "The New Machine",
  "description" : "A young engineer named Henry Ford devises the plan for a gas-powered car. McKinley is assassinated and his VP Theodore Roosevelt takes office and quickly passes a series of regulations increasing oversight of American business. Ford receives his financial backing and comes up with the concept of the assembly line. He targets the middle class with his new product and changes the landscape of America. Rockefeller is put on trial for anti-trust violations. He loses in court and his company, Standard Oil, is one of the first monopolies broken up by the US government. JP ..."
}]