[{
  "imdbId" : "5164196",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Pilot",
  "description" : "A slightly unhinged former Navy SEAL lands a job as a police officer in Los Angeles where he's partnered with a veteran detective trying to maintain a low stress level in his life."
}, {
  "imdbId" : "5164196",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Surf N Turf",
  "description" : "Riggs and Murtaugh respond to a noise complaint at a party at heavyweight boxer Ronald Dawson's Hollywood hills home. When gunshots go off, they are drawn into a major case involving illegal gun runners with advanced military technology. Riggs becomes personally invested in the case when he discovers one of their targets is a pregnant woman who reminds him of his deceased wife. Meanwhile, Trish worries about Murtaugh's health, as partnering with Riggs tests his limits."
}, {
  "imdbId" : "5164196",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Best Buds",
  "description" : "Riggs and Murtaugh follow a violent case involving a drug cartel, theft, two killings and, unfortunately, Murtaugh's old T.O., Ned Brower. As the case unfolds, it turns out that Ned is more involved than just driving the cash, which leaves Murtaugh with an inevitably dangerous decision to make. Looking for back-up, the duo turns to Cruz for help. In the midst of all the chaos, Riggs continues to depend on outside vices, rather than face the reality of Miranda's death, while Murtaugh and Trish struggle to find alone time."
}, {
  "imdbId" : "5164196",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "There Goes the Neighborhood",
  "description" : "A string of burglaries hits close to home for Murtaugh when one occurs in his own neighborhood, and it gets just as personal for Riggs when another break-in ends in a casualty. Meanwhile, Roger Junior connects with an old friend who might be twisted up in some criminal action of his own."
}, {
  "imdbId" : "5164196",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Spilt Milk",
  "description" : "Murtaugh and Riggs target a former Navy SEAL. Murtaugh sees a parallel between the suspect and Riggs. Murtaugh sees Riggs connection to the suspect threatens to interfere with the case."
}, {
  "imdbId" : "5164196",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Ties That Bind",
  "description" : "When Riggs and Murtaugh investigate a high-profile case surrounding the murder of a young model, they uncover a vicious secret behind the locked mansion gates of one of LA's wealthiest families. Riggs gets a jolt from his past when he discovers that an old friend of his wife has ties to the case. Back at home, Murtaugh is shocked to hear that his daughter is sending promiscuous photos to her new boyfriend."
}, {
  "imdbId" : "5164196",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Fashion Police",
  "description" : "As Riggs and Murtaugh examine the murder of one of L.A.'s fashion expeditors, they follow a trail of evidence that leads them to an ongoing and exceptionally dangerous underground investigation led by the Drug Enforcement Administration. In the meantime, Trish and the kids are off visiting colleges, leaving Murtaugh to a \"bender\" of his own, while Riggs has trouble sleeping through the night due to his all-too-real dreams of Miranda."
}, {
  "imdbId" : "5164196",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Can I Get a Witness?",
  "description" : "When a million dollar casino heist takes a deadly turn, Riggs befriends the only credible witness, an eight-year-old boy, and takes him into his care. On the flip side, Murtaugh pulls some dangerous stunts in an attempt to prove to everyone that he can be a motorcycle guy. Meanwhile, Riggs contemplates what to do with the money he received from selling his home in Texas."
}, {
  "imdbId" : "5164196",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "Jingle Bell Glock",
  "description" : "Holiday celebrations are cut short when the precinct is called to examine a homicide linked to the deranged nephew of the drug lord who has ties to Riggs; and Murtaugh has a problem with his neighbor's excessive holiday decorations."
}, {
  "imdbId" : "5164196",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "Homebodies",
  "description" : "Riggs and Murtaugh end up in the middle of a turf war as they investigate the murder of a millennial \"designer drug\" dealer."
}, {
  "imdbId" : "5164196",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "Lawmen",
  "description" : "Murtaugh and Riggs suspect misuse of power in the LA Sheriff's department when they investigate the killing of a Texas Ranger."
}, {
  "imdbId" : "5164196",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "Brotherly Love",
  "description" : "Roger and Trish find themselves pitted against each other when a stolen car full of cocaine is traced to a ring of car thieves."
}, {
  "imdbId" : "5164196",
  "season" : "1",
  "episodeNumber" : "13",
  "title" : "The Seal Is Broken",
  "description" : "Riggs and Murtaugh investigate a series of violent crimes with one thing in common - the victims are all members of the same church. While investigating the case, Riggs faces a moral dilemma of his own when the one-year anniversary of Miranda's death sends him to a new low. Also, Trish and Roger disagree with RJ about his future."
}, {
  "imdbId" : "5164196",
  "season" : "1",
  "episodeNumber" : "14",
  "title" : "The Murtaugh File",
  "description" : "Murtaugh and Riggs discover that Cahill is being targeted by a murderous stalker after a violent car accident; Riggs begins to obsess over Murtaugh's past after finding his file in Cahill's office; Roger and Trish find their daughter's fake ID"
}, {
  "imdbId" : "5164196",
  "season" : "1",
  "episodeNumber" : "15",
  "title" : "As Good as It Getz",
  "description" : "Riggs and Murtaugh are forced to work with DEA agent Karen Palmer again, to protect Leo Getz, an ambulance-chasing attorney who was linked to the Cartel. As the three delve further into the case, they begin to realize that Leo may not be the only one with a target on his back. In the meantime, Riggs begins to view Agent Palmer in a new light while Murtaugh is left worried after Trish makes a spontaneous decision."
}, {
  "imdbId" : "5164196",
  "season" : "1",
  "episodeNumber" : "16",
  "title" : "Unnecessary Roughness",
  "description" : "A murder involving a high school football phenomenon draws Riggs and Murtaugh into the lucrative - and corrupt - world of college recruiting. Meanwhile, Murtaugh considers a big change in his professional life, and Riggs contemplates an even bigger shift in his personal life, as he spends more time with DEA Agent Karen Palmer."
}, {
  "imdbId" : "5164196",
  "season" : "1",
  "episodeNumber" : "17",
  "title" : "A Problem Like Maria",
  "description" : "Riggs and Murtaugh team up again with DEA Agent Karen Palmer, and together they gain inside knowledge of dangerous new cartel operations. As Riggs' attachment to Palmer deepens, so do his impulsive actions, further worrying Captain Avery and Delgado. In the meantime, Trish explores the potential of an amazing new career opportunity."
}, {
  "imdbId" : "5164196",
  "season" : "1",
  "episodeNumber" : "18",
  "title" : "Commencement",
  "description" : "Riggs makes a shocking discovery about Miranda's death that leads him back to the cartel in a frantic search for answers. His wild desperation leaves Murtaugh torn between his commitment to his partner and his commitment to his family."
}, {
  "imdbId" : "5164196",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "El Gringo Loco",
  "description" : "Riggs plans to finish off Tito Flores in Mexico where Murtaugh follows him."
}, {
  "imdbId" : "5164196",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "Dancing in September",
  "description" : "Riggs and Murtaugh uncover a drug ring at a wellness clinic while investigating a plastic surgeon's death."
}, {
  "imdbId" : "5164196",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "Born to Run",
  "description" : "Riggs and Murtaugh investigate the death of a famous singer's bodyguard."
}, {
  "imdbId" : "5164196",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "Flight Risk",
  "description" : "Murtaugh and Riggs search for an unreliable father who committed a robbery 20,000 feet in the air with his daughter as the main witness."
}, {
  "imdbId" : "5164196",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "Let It Ride",
  "description" : "Murtaugh and Riggs investigate a death that occurs moments before the victim's bet wins a horse race. Leo Getz insists it's a homicide and aids in the investigation. Meanwhile, Murtaugh updates his will, while Riggs struggles to come to terms with his past."
}, {
  "imdbId" : "5164196",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "Gold Rush",
  "description" : "Riggs is reunited with childhood friends and comes to realize they might be mixed up in the robbery-homicide case he and Murtaugh are investigating. Meanwhile, Murtaugh finds a joint stashed in his kitchen that he brings to Scorsese for testing in effort to bust one of his kids."
}, {
  "imdbId" : "5164196",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "Birdwatching",
  "description" : "Riggs and Murtaugh investigate a surfer's death."
}, {
  "imdbId" : "5164196",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "Fork-Getta-Bout-It",
  "description" : "Riggs and Murtaugh investigate a murder in a hospital that leads them to the underworld."
}, {
  "imdbId" : "5164196",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "Fools Rush In",
  "description" : "Riggs and Murtaugh are drawn into a fatal world of conspiracy theories. Meanwhile, Riggs' relationship with Molly evolves and Murtaugh and Trish attempt to get Harper into a fancy pre-school."
}, {
  "imdbId" : "5164196",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "Wreck the Halls",
  "description" : "Murtaugh's Christmas vacation in Hawaii is put on hold when he and Riggs are called to a homicide and the victim is an old friend."
}, {
  "imdbId" : "5164196",
  "season" : "2",
  "episodeNumber" : "11",
  "title" : "Funny Money",
  "description" : "Riggs and Murtaugh are thrown into the world of counterfeit money. When a group of teenagers inadvertently gets involved, it strikes a chord with Murtaugh, who is dealing with his own issues regarding his son, RJ. Meanwhile, Riggs decides to pay a visit to someone from his past."
}, {
  "imdbId" : "5164196",
  "season" : "2",
  "episodeNumber" : "12",
  "title" : "Diggin' Up Dirt",
  "description" : "A secret about Riggs' deceased wife is revealed when he visits his father-in-law in prison."
}, {
  "imdbId" : "5164196",
  "season" : "2",
  "episodeNumber" : "13",
  "title" : "Better Living Through Chemistry",
  "description" : "Murtaugh and Riggs respond to the murder of an escaped patient of Dr. Cahill's who mysteriously goes off the rails. The investigation brings to light a hidden scheme far bigger than they imagined. Meanwhile, Riggs' anger gets the better of him once again, causing Avery to consider whether or not he is fit to serve. Also, family tension runs high between Murtaugh and Trish, who have to make big decisions about R.J."
}, {
  "imdbId" : "5164196",
  "season" : "2",
  "episodeNumber" : "14",
  "title" : "Double Shot of Baileys",
  "description" : "When Detective Bailey's sister, Jess, runs into trouble with the law, Bailey must decide how far she's willing to go to protect her family. Meanwhile, with Trish away on a company retreat, Murtaugh is left to help Riana navigate boy problems, and Riggs deals with the fallout of a night of heavy drinking."
}, {
  "imdbId" : "5164196",
  "season" : "2",
  "episodeNumber" : "15",
  "title" : "An Inconvenient Ruth",
  "description" : "Murtaugh and Riggs search for the culprit of a local jewelry heist; Murtaugh gets called \"grandpa\" by another parent while at the playground with Harper sending him into a tizzy; Riggs deals with withdrawal from drinking."
}, {
  "imdbId" : "5164196",
  "season" : "2",
  "episodeNumber" : "16",
  "title" : "Ruthless",
  "description" : "After the city's gun buy-back program is robbed, the team is on a hunt for those responsible. Meanwhile, Murtaugh walks on thin ice with Trish, Riggs finds an unlikely friend in Ruthie, and Captain Avery is reunited with a college \"frenemy\" who has key information about the case."
}, {
  "imdbId" : "5164196",
  "season" : "2",
  "episodeNumber" : "17",
  "title" : "The Odd Couple",
  "description" : "After the fatal end to an argument on a construction site, the squad works to untangle facts about the incident. Meanwhile, Riggs struggles to rekindle his relationship with Molly, Trish's job is on the line as she tries to close a big deal at work, and Murtaugh gets one last chance to make it right at home."
}, {
  "imdbId" : "5164196",
  "season" : "2",
  "episodeNumber" : "18",
  "title" : "Frankie Comes to Hollywood",
  "description" : "Riggs and Murtaugh are on the case of a hitman who Murtaugh has been following for almost 17 years."
}, {
  "imdbId" : "5164196",
  "season" : "2",
  "episodeNumber" : "19",
  "title" : "Leo Getz Hitched",
  "description" : "When Leo decides to 'Getz' married, 'surprisingly' nothing goes smoothly."
}, {
  "imdbId" : "5164196",
  "season" : "2",
  "episodeNumber" : "20",
  "title" : "Jesse's Girl",
  "description" : "After a mansion break-in turns into a homicide, Murtaugh and Riggs set out to find the culprit. Murtaugh and Trish question their trust in Riana as she gets into some trouble with new friends. Meanwhile, Riggs recalls his troubling childhood and finds a true family with Molly and Ben."
}, {
  "imdbId" : "5164196",
  "season" : "2",
  "episodeNumber" : "21",
  "title" : "Family Ties",
  "description" : "On Murtaugh's first day on the job as interim captain, the wife of a popular businessman is abducted and the squad finds a connection in the case to Riggs' father (guest star Rex Linn). Meanwhile, Riggs is left to grapple with his family and work."
}, {
  "imdbId" : "5164196",
  "season" : "2",
  "episodeNumber" : "22",
  "title" : "One Day More",
  "description" : "The squad is on high alert after an apparent threat is made on Riggs' life. With Murtaugh taking on more responsibility at work, he and Riggs have to deal with their changing relationship. Meanwhile, Trish gets caught up in some trouble and Molly asks Riggs to make a big decision about their future. Riggs works on family issues."
}, {
  "imdbId" : "5164196",
  "season" : "3",
  "episodeNumber" : "1",
  "title" : "In the Same Boat",
  "description" : "Former international CIA operative Wesley Cole returns home and becomes Murtaugh's partner on the force; Avery continues his campaign for city council."
}, {
  "imdbId" : "5164196",
  "season" : "3",
  "episodeNumber" : "2",
  "title" : "Need to Know",
  "description" : "Murtaugh and Cole try to find their stride as they work to solve the murder of a finance executive; Cole navigates his role with his ex, Natalie, and his daughter, Maya; Avery grapples with the outcome of his campaign for city council."
}, {
  "imdbId" : "5164196",
  "season" : "3",
  "episodeNumber" : "3",
  "title" : "A Whole Lotto Trouble",
  "description" : "Cole and Murtaugh try to balance their family lives with their efforts to bust a gang running a lottery scam."
}, {
  "imdbId" : "5164196",
  "season" : "3",
  "episodeNumber" : "4",
  "title" : "Leo Getz Justice",
  "description" : "Cole and Murtaugh look back on past mistakes as Leo Getz returns as the attorney on their latest case."
}, {
  "imdbId" : "5164196",
  "season" : "3",
  "episodeNumber" : "5",
  "title" : "Get the Picture",
  "description" : "Murtaugh and Cole investigate after a robbery of a truck filled with fine art. Cole deals with lingering feelings for Natalie after a development in her life. Meanwhile, Riana blackmails Murtaugh into letting her go to a concert after she catches him in a lie he told Trish."
}, {
  "imdbId" : "5164196",
  "season" : "3",
  "episodeNumber" : "6",
  "title" : "Panama",
  "description" : "Cole confronts his past when his former mentor, Tom Barnes, delivers alarming news, as he and Murtaugh investigate a robbery of safe deposit boxes. Meanwhile, Murtaugh clashes with Trish's new client, Louie Gutierrez aka \"The Gute\" and enlists Bailey's help to investigate."
}, {
  "imdbId" : "5164196",
  "season" : "3",
  "episodeNumber" : "7",
  "title" : "Bali",
  "description" : "Murtaugh turns to Cole's former mentor, Tom Barnes, for help on a high-stakes cartel case. Meanwhile, Murtaugh and Trish meet Natalie and Maya for the first time, and tensions mount between Bailey and \"The Gute\", as the new partners begin to work together."
}, {
  "imdbId" : "5164196",
  "season" : "3",
  "episodeNumber" : "8",
  "title" : "What the Puck",
  "description" : "Cole needs to talk to Natalie about their relationship. Murtaugh makes an unlikely friend."
}, {
  "imdbId" : "5164196",
  "season" : "3",
  "episodeNumber" : "9",
  "title" : "Bad Santas",
  "description" : "While Cole gets into the holiday spirit for his first Christmas with Maya, Murtaugh hopes he can convince RJ to come back home from Costa Rica for the holidays. At the precinct, Cole and Murtaugh are saddled with a complicated burglary and home invasion case. Meanwhile, Avery's holidays are a bit blue, and Bailey is still trying to figure out her new partner."
}, {
  "imdbId" : "5164196",
  "season" : "3",
  "episodeNumber" : "10",
  "title" : "There Will Be Bud",
  "description" : "Cole finds himself on the rebound after Natalie's engagement; Murtaugh worries about the connection between the murder he's investigating and an opportunity for Trish to serve as co-counsel on a high profile lawsuit with Leo Getz."
}, {
  "imdbId" : "5164196",
  "season" : "3",
  "episodeNumber" : "11",
  "title" : "Dial M for Murtaugh",
  "description" : "Murtaugh's witnessing of an alleged abduction and Cole's investigation of a murder begin to collide; Erica's mother comes to town and stirs things up between her, Cole and the case at hand."
}, {
  "imdbId" : "5164196",
  "season" : "3",
  "episodeNumber" : "12",
  "title" : "The Roger and Me",
  "description" : "Murtaugh realizes his fighting movies aren't as sharp as they used to be when he and Cole investigate the murder of an underground MMA fighter; Trish considers running for public office; Cole and Erica try to keep things casual."
}, {
  "imdbId" : "5164196",
  "season" : "3",
  "episodeNumber" : "13",
  "title" : "Coyote Ugly",
  "description" : "When Cole and Murtaugh investigate a case involving a father and daughter (illegally) crossing the Mexican border, they end up uncovering a major issue with California Boarder Patrol. Meanwhile, Trish prepares her campaign for D.A. and must face parts of her past, before they find their way into the media spotlight. Cole also confronts his past when he experiences flashbacks as a result of an injury."
}, {
  "imdbId" : "5164196",
  "season" : "3",
  "episodeNumber" : "14",
  "title" : "A Game of Chicken",
  "description" : "Against Murtaugh's advice, Cole reaches out to Tom Barnes to help with a case that hits close to home, putting Murtaugh and Cole's partnership to the test. Meanwhile, Trish prepares to announce her campaign for District Attorney."
}, {
  "imdbId" : "5164196",
  "season" : "3",
  "episodeNumber" : "15",
  "title" : "The Spy Who Loved Me",
  "description" : "Cole is investigated by the FBI, forcing Murtaugh to question his loyalty to his own partner; Cole works a case that puts Natalie's fiance into the cross-hairs right before their wedding day."
}]