[{
  "imdbId" : "2406376",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Pilot",
  "description" : "When a body is found on the bridge connecting El Paso and Juarez, two detectives, one from the United States and one from Mexico, must work together to hunt down a serial killer operating on both sides of the border."
}, {
  "imdbId" : "2406376",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Calaca",
  "description" : "Marco and Sonya investigate the body from the bridge. Frye learns that the Killer isn't done with him. Charlotte makes an unwelcome discovery on her property."
}, {
  "imdbId" : "2406376",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Rio",
  "description" : "Sonya and Marco race to track down a prime suspect who could lead them to the lone desert survivor. Charlotte confronts an unexpected visitor determined to keep business as usual."
}, {
  "imdbId" : "2406376",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Maria of the Desert",
  "description" : "The clock ticks as Maria's broadcast continues. Sonya searches for the girl's location. Against protocol, Marco works a unique ransom angle. A powerful Juarez force crosses the border."
}, {
  "imdbId" : "2406376",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "The Beast",
  "description" : "Sonya and Marco suspect a cover-up. Charlotte goes to Marco for advice. A troubled girl seeks adventure in Juarez. A visitor stops by Linder's apartment."
}, {
  "imdbId" : "2406376",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "ID",
  "description" : "Sonya bonds with a key witness from the case. Marco uncovers Sonya and Hank's past. Charlotte calls on an old friend for help."
}, {
  "imdbId" : "2406376",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Destino",
  "description" : "The EPPD corners their prime suspect. Charlotte questions Ray's true intentions. Linder crosses the border and takes on his most difficult case yet."
}, {
  "imdbId" : "2406376",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Vendetta",
  "description" : "Sonya pursues a cold lead despite Marco's insistence that it's a dead end. Charlotte finds out that Ray has jeopardized her ranch."
}, {
  "imdbId" : "2406376",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "The Beetle",
  "description" : "Marco reconnects with a friend from his past and races to save his family. Charlotte responds to her biggest threat. Linder reveals his true feelings."
}, {
  "imdbId" : "2406376",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "Old Friends",
  "description" : "Showdown on the bridge as the Killer reveals his endgame."
}, {
  "imdbId" : "2406376",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "Take the Ride, Pay the Toll",
  "description" : "Showdown on the bridge as the Killer reveals his endgame."
}, {
  "imdbId" : "2406376",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "All About Eva",
  "description" : "Sonya uses Linder's latest problem to repair her relationship with Marco. Charlotte forms an unlikely alliance."
}, {
  "imdbId" : "2406376",
  "season" : "1",
  "episodeNumber" : "13",
  "title" : "The Crazy Place",
  "description" : "Sonya and Marco search for a missing girl. Charlotte meets someone who knows too much about her new business venture. Marco makes a decision that could change everything."
}, {
  "imdbId" : "2406376",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "Yankee",
  "description" : "Sonya meets a man connected to her past as Marco discovers he is no longer safe in his own department. Frye and Adriana investigate the origins of the \"money house.\" A mysterious woman crosses The Bridge into El Paso."
}, {
  "imdbId" : "2406376",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "Ghost of a Flea",
  "description" : "A bizarre killing attracts attention on both sides of the border. Frye & Adriana find more than they bargained for with their first lead. Eleanor enlists the help of a young boy."
}, {
  "imdbId" : "2406376",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "Sorrowsworn",
  "description" : "Sonya and Marco start working together in the hunt for Eleanor Nacht. Linder pays a visit to Eva. Charlotte and Ray begin fearing for their lives after losing one of Fausto Galvan's shipments."
}, {
  "imdbId" : "2406376",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "The Acorn",
  "description" : "Marco gains a new ally while discovering the true extent of Fausto's reach. A disruption at a local bank provides new intel to our Detectives and Reporters. Charlotte & Ray discuss their future."
}, {
  "imdbId" : "2406376",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "Eye of the Deep",
  "description" : "Eva gives her deposition. Jim Dobbs' body is cremated. Marco gets the chance to have his revenge against David Tate."
}, {
  "imdbId" : "2406376",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "Harvest of Souls",
  "description" : "Eva's case hits a wall, putting Marco and Sonya in the cross-hairs. Jack Dobbs digs up his past. Frye makes a career move. Eva takes matters into her own hands."
}, {
  "imdbId" : "2406376",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "Lamia",
  "description" : "Sonya uncovers the truth behind Lisa's death. Meanwhile Frye and Adriana find a mystery."
}, {
  "imdbId" : "2406376",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "Goliath",
  "description" : "Sonya visits a stranger from her past while Marco's tainted history is unearthed. Frye takes a step too far. Eleanor's loyalties are tested. A move is made to apprehend Fausto."
}, {
  "imdbId" : "2406376",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "Rakshasa",
  "description" : "Marco tries to find Sonya and her kidnapper. Fausto makes his move against Eleanor."
}, {
  "imdbId" : "2406376",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "Eidolon",
  "description" : "With Charlotte dead and his children's safety on the line, Cesar begins to follow Eleanor's orders. Meanwhile, Hank fights for his life after being wounded in the Red Ridge's stand-off."
}, {
  "imdbId" : "2406376",
  "season" : "2",
  "episodeNumber" : "11",
  "title" : "Beholder",
  "description" : "Marco and the marines go after Fausto. Sonya interrogates Eleanor. Frye and Adriana discover new secrets about the CIA and the DEA activities on the border."
}, {
  "imdbId" : "2406376",
  "season" : "2",
  "episodeNumber" : "12",
  "title" : "Quetzalcoatl",
  "description" : "Marco becomes Fausto's ticket to freedom. Sonya attempts to interpret Eleanor's ledger. Frye & Adriana aid the EPPD investigation."
}, {
  "imdbId" : "2406376",
  "season" : "2",
  "episodeNumber" : "13",
  "title" : "Jubilex",
  "description" : "Marco, Fausto, Obregan and an ailing Romina try to make it through the woods. Sonya and Hank get closer to their targets. Eleanor gets her reward."
}]