[{
  "imdbId" : "1717371",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Stronger",
  "description" : "David Pogue hosts this examination of what makes material strong. He looks at the underlying material science behind steel, Kevlar, glass, chalk, carbon nanotubes, and spiderwebs."
}, {
  "imdbId" : "1717371",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Smaller",
  "description" : "David Pogue hosts this examination of miniaturization. He looks at what it takes to make things smaller focusing nanotechnology and micro-robots that one day may be used to save lives."
}, {
  "imdbId" : "1717371",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Cleaner",
  "description" : "This program looks at cleaner ways to generate power principally in our cars and electrical power plants. It reviews alternatives for all the steps in the fuel generation, storage and distribution processes with a particular emphasis on how unwanted waste products can play a significant role."
}, {
  "imdbId" : "1717371",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Smarter",
  "description" : "Making stuff smarter isn't about artificial intelligence. It's more about engineering materials at the microscopic level to behave in specific ways. Today is it possible to create materials with clever designs or micro structures that permit control of a material's ability to self-heal, stick and release, self-clean, prevent disease, alter their shape and other properties. This program explains where several of these materials came from, how they work and how they are put to practical use."
}, {
  "imdbId" : "1717371",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Faster",
  "description" : "Are there physical limits to how fast humans can go? David Pogue wants to find out how much we can tweak physiology and engineering to move humans and machines even faster. He investigates everything from lightning-fast electric muscle cars to ultra-sleek sailboats to ultra-fast cameras and quantum teleportation. But faster is also about efficiency and the science of optimization: getting things done in less time. From the floor of the New York Stock Exchange to UPS headquarters and inside a packed 737, Pogue's quest for ultimate speed limits takes him to unexpected places where he comes face-to-face with the final frontiers of speed. NOVA also explores important questions: Is it possible to go too fast? Have we hit a point where innovation outpaces our ability to keep up?"
}, {
  "imdbId" : "1717371",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Wilder",
  "description" : "What happens when engineers open up nature's toolbox? David Pogue explores bold innovations inspired by the Earth's greatest inventor, life itself. From underwater wi-fi based on dolphin communication, to robotic 'mules' and 'cheetahs' for the military, to swarms of robotic bees, Pogue travels the world seeing the 'wildest' ideas put into action in new inventions and technologies. It is a journey that sees today's bacteria turned into tomorrow's metallurgists, viruses building batteries, and even DNA, the Code of Life, put to work in 'living' computers. Will the stuff of the future take on a life of its own?"
}, {
  "imdbId" : "1717371",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Colder",
  "description" : "Cold. For centuries we've fought it, shunned it and huddled against it. Cold has always been the enemy of life, but now it may hold the key to a new generation of science and technology that will improve our lives. David Pogue explores the frontiers of cold science, from saving the lives of severe trauma patients and cooling a warming planet to ultracold physics, where bizarre new properties of matter are the norm and the basis of new technologies like levitating trains and quantum computers. In this brave new world, cold isn't to be avoided. Cold is the new hot."
}, {
  "imdbId" : "1717371",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Safer",
  "description" : "Is it possible to engineer an absolutely safe world for ourselves? Host David Pogue explores the extent to which science and technology can protect us from monumental forces of nature such as earthquakes and epidemics. He challenges researchers to save us from dangers of our own making, such as traffic accidents and contact sports. Our increasing reliance on the internet makes us vulnerable to new risks: Pogue delves into cyber security, where computer experts work to shield us from attacks from hackers and terrorists. Risk is all around us -- but we can be smart about it."
}]
