[{
  "imdbId" : "0060036",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Rendezvous with Yesterday",
  "description" : "Congress has poured seven billion dollars into a large and deep hole in the ground - the home of Project TicToc and its revolutionary new technology, the Time Tunnel. A mechanism intended to access past and future, the tunnel is not quite ready despite a decade of work and all the billions. Senator Clark declares his intention to cut funding and abandon the project. Desparate scientist Tony Newman uses the apparatus to send himself through time to prove the concept. But the TicToc team cannot retrieve him, and so his mentor Doug Phillips goes back to help Tony out of ..."
}, {
  "imdbId" : "0060036",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "One Way to the Moon",
  "description" : "Doug and Tony escape death aboard the Titanic only to be hurled ten years into their future aboard a rocket bound for the moon. Problems arise which the astronauts blame on their unwilling stowaways, but the real cause is a saboteur aboard the flight - and the same man, ten years earlier, is in the TicToc complex with a confederate! Doug and Tony must discover the identity of the traitor and stop his plans or else die in space."
}, {
  "imdbId" : "0060036",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "End of the World",
  "description" : "Doug and Tony escape the moon only to materialize in an old mine shaft in 1910, the year that Halley's Comet passed very close to earth. Many in town, including prominent scientist Professor Ainsley, believe the comet will smash into the Earth and end all life! Doug and Tony know this isn't true so their goal is to rescue miners trapped below the earth and all but abandoned in the town's panic."
}, {
  "imdbId" : "0060036",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "The Day the Sky Fell In",
  "description" : "December 6, 1941: Dr. Tony Newman confronts his own past at Pearl Harbor and he wants to know what happened to his father."
}, {
  "imdbId" : "0060036",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "The Last Patrol",
  "description" : "In 1815 one of the final battles of the War of 1812 was fought near New Orleans, Lousiana. Doug and Tony materialize behind British lines and soon find themselves in the custody of Colonel Southall, a man history records as \"The Butcher\" because of a disastrous mistake attacking the strongest side of Andrew \"Old Hickory\" Jackson's fortifications. Southall believes the chrononauts can supply tactical information and he'll stop at nothing to get it. Meanwhile, Southall's descendant, a general in the modern British Army, visits the TicToc complex to explain what his ..."
}, {
  "imdbId" : "0060036",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Crack of Doom",
  "description" : "Tony and Doug are transported to Krakatoa, a volcanic island between Java and Sumatra in great activity and the blowup seems to be imminent. The travelers in time are attacked by superstitious natives that believe that a sacrifice would appease the fire, but they are rescued by the British Dr. Everett Holland, who is research the volcano with his daughter Eve. They ask the date to Everett and Holland and Eve tells that it is 26 August 1883, the eve of the explosive eruption that destroyed the island and caused a tsunami that killed more than 36,000 people. Tony and ..."
}, {
  "imdbId" : "0060036",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Revenge of the Gods",
  "description" : "Doug and Tony are transported to 1200 BC in the middle of the war between Greeks and Trojans. They are captured by Ulysses' men and their knowledge of history makes Ulysses believe that they are gods from the Olympus. When Doug is captured by the traitor Sardis and brought to Troy, he meets Helen of Troy and proves to Paris that he might be a god. Meanwhile Tony witnesses the construction of the Trojan Horse and joins the team that will break in Troy inside the horse to rescue Helen and Doug."
}, {
  "imdbId" : "0060036",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Massacre",
  "description" : "Doug and Tony are transported to the summer of 1876 and witness soldiers slaughtered by Indians in the middle of the desert. They are hunted and captured by three Indians; however Doug is rescued by the Trumpeter Tim that survived the massacre and is bringing a dispatch from General Crook to General George Armstrong Custer. Doug escapes but the leader of the Indians, Crazy Horse, brings Tony to the Indian camp to get information about the \"Yellow Hair\". Meanwhile, the Time Tunnel personnel summon the specialist in the Indian Wars period and Sioux descendent Dr. ..."
}, {
  "imdbId" : "0060036",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "Devil's Island",
  "description" : "Doug and Tony are transported to 1895 to the French penal colony of the Devil's Island, a prison where political and criminal prisoners where sent and never leave, and are mistakenly taken as two runaway prisoners. They try to explain the mistake to the cruel commanders that do not accept their explanations. When the prisoners decide to help the charismatic Captain Alfred Dreyfus to escape, Doug and Tony try to tell them that this is a doomed plan since Dreyfus has never escaped from the hellish island."
}, {
  "imdbId" : "0060036",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "Reign of Terror",
  "description" : "Doug and Tony find themselves during the French Revolution and become involved in a plot to rescue the doomed French Queen, Marie Antoinette."
}, {
  "imdbId" : "0060036",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "Secret Weapon",
  "description" : "Doug and Tony are transported to Russia on 16 June 1956, and sooner they receive an F-5 probe from the Time Tunnel personnel with the message \"Meet Alexis\". They meet the double agent Alexis that gives papers and free access to them to the facilities of the Russian Project A-13. They discover that Professor Anton Biraki has built a Time Tunnel very similar to theirs, and they have been assigned to pilot a doomed capsule in the first time travel. Meanwhile in the present days, Professor Biraki is in the United States offering his knowledge to the government."
}, {
  "imdbId" : "0060036",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "The Death Trap",
  "description" : "Doug and Tony are transported to February 1861 to a barn where a group of conspirators leaded by Jeremiah plots a plan to kill Abraham Lincoln, but they are surprised by a raid of governmental agents. Tony flees with Jeremiah and his brother Matthew while Doug is arrested by Pinkerton's men. The fanatic Jeremiah has prepared a time-bomb to blow up Lincoln's train but Tony knows that the plan is doomed to fail since history tells that Lincoln will die only four years later. When Jeremiah discovers that Lincoln is at the depot with Doug, he decides to blow up the spot; ..."
}, {
  "imdbId" : "0060036",
  "season" : "1",
  "episodeNumber" : "13",
  "title" : "The Alamo",
  "description" : "Doug and Tony materialize, and immediately come under attack from Mexican soldiers. They race for the nearest shelter and barely make inside... the Alamo, days before the Mexican Army will overrun it! Worse, Alamo commander Colonel Travis decides they must be spies and orders them imprisoned."
}, {
  "imdbId" : "0060036",
  "season" : "1",
  "episodeNumber" : "14",
  "title" : "Night of the Long Knives",
  "description" : "Doug and Tony land in nineteenth century Asia, meet Rudyard Kipling and become involved in the conflict between the British and local tribesman for control of the Khyber Pass."
}, {
  "imdbId" : "0060036",
  "season" : "1",
  "episodeNumber" : "15",
  "title" : "Invasion",
  "description" : "Landing in 1944 occupied France two days before D-Day, Doug is captured by the Germans and psychologically reprogrammed to hunt down and kill Tony who must keep their knowledge concerning the impending invasion from the Nazis."
}, {
  "imdbId" : "0060036",
  "season" : "1",
  "episodeNumber" : "16",
  "title" : "The Revenge of Robin Hood",
  "description" : "In thirteenth century England, Doug and Tony become involved with the Earl of Huntington otherwise known as the legendary Robin Hood and their efforts to get King John to sign the Magna Carta."
}, {
  "imdbId" : "0060036",
  "season" : "1",
  "episodeNumber" : "17",
  "title" : "Kill Two by Two",
  "description" : "Stuck on a Pacific island that is about to be bombarded by the American Navy in February 1945, Doug and Tony are captured by a downed Japanese pilot and a Japanese Army sergeant. To help the Time Tunnel staff locate this island and their two time travelers, they bring in an officer who served on that island who will not help them unless they save his son, the pilot who died during World War II."
}, {
  "imdbId" : "0060036",
  "season" : "1",
  "episodeNumber" : "18",
  "title" : "Visitors from Beyond the Stars",
  "description" : "Doug and Tony are transported to a spacecraft with two weird aliens that intend to invade Earth to steal proteins for their dying planet. They land on Mullins, Arizona, in 1885, and the aliens use a device called \"Projector\" to subdue the earthlings. The time travelers decide to resist the invasion to save Earth from the eminent destruction, but the powerful aliens seem to be unbeatable."
}, {
  "imdbId" : "0060036",
  "season" : "1",
  "episodeNumber" : "19",
  "title" : "The Ghost of Nero",
  "description" : "During an encounter between the Germans and the Italians in World War I, Doug and Tony land in a villa that is haunted by the ghost of the Roman Emperor Nero."
}, {
  "imdbId" : "0060036",
  "season" : "1",
  "episodeNumber" : "20",
  "title" : "The Walls of Jericho",
  "description" : "Appearing out the tent of Joshua, commander of the Israelites, Doug and Tony are sent into the city as his spies."
}, {
  "imdbId" : "0060036",
  "season" : "1",
  "episodeNumber" : "21",
  "title" : "Idol of Death",
  "description" : "Doug and Tony land in Mexico where Cortez is looking for the Golden Mask. Their archeology expert back at the Time Tunnel insists that they retrieve the Golden Mask that he has been searching for for twenty years or he will not help them."
}, {
  "imdbId" : "0060036",
  "season" : "1",
  "episodeNumber" : "22",
  "title" : "Billy the Kid",
  "description" : "Landing in 1881 New Mexico in the middle of a jailbreak of Billy the Kid, to defend Tony Doug shoots at Billy who escapes swearing to hunt down Doug. According to their research back at the Time Tunel, two unknown strangers were killed by him on that date."
}, {
  "imdbId" : "0060036",
  "season" : "1",
  "episodeNumber" : "23",
  "title" : "Pirates of Deadman's Island",
  "description" : "Doug and Tony have a run-in with pirates off the Barbary Coast in 1805 and help in the rescue of the nephew of the King of Spain assisted by American Naval officer Stephane Decatur."
}, {
  "imdbId" : "0060036",
  "season" : "1",
  "episodeNumber" : "24",
  "title" : "Chase Through Time",
  "description" : "Doug and Tony are transported to the Grand Canyon, Arizona, in 1547. Meanwhile, the saboteur Raul Nimon kills Dr. Alfred Stiles and plants a nuclear bomb with a timing device in the phase synchronizer console; however, the security seals all the exit and Nimon escapes through the time tunnel that is fixed in Doug and Tony. General Kirk orders the scientists to capture Nimon and discover where the bomb is hidden. However the tunnel is out of control and sends the trio to one million years in the future in a society organized like a beehive. However Nimon had arrived ..."
}, {
  "imdbId" : "0060036",
  "season" : "1",
  "episodeNumber" : "25",
  "title" : "The Death Merchant",
  "description" : "Ending up on different sides just prior to the Battle of Gettysburg, Doug and Tony must stop an attempt by Machiavelli (who had traveled in time from the Renaissance due to the Time Tunnel Project) from trying to affect the outcome of the battle and send him back into time."
}, {
  "imdbId" : "0060036",
  "season" : "1",
  "episodeNumber" : "26",
  "title" : "Attack of the Barbarians",
  "description" : "Doug and Tony must help Marco Polo stop an attack by Mongols in thirteenth century China. Tony meets and falls in love with the daughter of Kubla Kahn."
}, {
  "imdbId" : "0060036",
  "season" : "1",
  "episodeNumber" : "27",
  "title" : "Merlin the Magician",
  "description" : "Merlin the Magician pulls Tony and Doug from their journey through time and send them to help a young King Arthur fight an invasion of Vikings."
}, {
  "imdbId" : "0060036",
  "season" : "1",
  "episodeNumber" : "28",
  "title" : "The Kidnappers",
  "description" : "After Time Tunnel member Doctor Ann MacGregor is kidnapped by a time traveler from another planet, Tony and Doug are sent there to rescue her."
}, {
  "imdbId" : "0060036",
  "season" : "1",
  "episodeNumber" : "29",
  "title" : "Raiders from Outer Space",
  "description" : "In 1883 Khartuom in battle between British and Arab forces, Tony and Doug stumble upon aliens who plan to conquer the earth using missiles. They also send a bomb through the Time Tunnel to prevent any interference with their plans."
}, {
  "imdbId" : "0060036",
  "season" : "1",
  "episodeNumber" : "30",
  "title" : "Town of Terror",
  "description" : "In 1978, Doug and Tony have to stop aliens from stealing all the oxygen from the planet Earth."
}]