[{
  "imdbId" : "0096531",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Alien Nation",
  "description" : "A bigoted human policeman in the L.A. of the future and his alien partner learn to live with each other's differences while attempting to solve a drug conspiracy hidden in the subculture of Los Angeles' newest immigrant population: extraterrestrials."
}, {
  "imdbId" : "0096531",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Fountain of Youth",
  "description" : "Sikes' issues with aging are intensified when he learns that the Newcomer life-span is almost twice that of humans. The death of a police officer during surgery raises questions about the hospital."
}, {
  "imdbId" : "0096531",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Little Lost Lamb",
  "description" : "Sikes tries to help a 16 year-old Newcomer prostitute. George deals with the intrusion of Uncle Moodri and his traditional Tenctonese values."
}, {
  "imdbId" : "0096531",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Fifteen with Wanda",
  "description" : "Sikes and Francisco must each try to deal with their own problem children all while keeping a witness safe from a mob hit man."
}, {
  "imdbId" : "0096531",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "The Takeover",
  "description" : "While the city suffers a riot, Francisco and Sikes alone must defend their precinct house from a gang of thieves."
}, {
  "imdbId" : "0096531",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "The First Cigar",
  "description" : "Francisco comes under the scrutiny of the IRS and wrestles with the ethics of asking for a loan from an influential Newcomer that he has helped."
}, {
  "imdbId" : "0096531",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "The Night of the Screams",
  "description" : "As Halloween approaches, a series of Newcomer murders seems to follow the pattern of a Tenctonese myth."
}, {
  "imdbId" : "0096531",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Contact",
  "description" : "The murder of an astronomer leads Sykes and Francisco to the discovery of an extra-terrestrial probe passing through the solar system. But is it friend or foe? Sikes's relations with his Newcomer neighbor, Kathy, develops. George and Susan discus having another baby."
}, {
  "imdbId" : "0096531",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "Three to Tango",
  "description" : "A series of murders of Binnaum, a rare kind of Tenctonese needed for catalyzing reproduction, raises fears that Purists are trying to stop the Tenctonese from breeding. Francisco asks Albert to be the Binnaum for his and Susan's next child."
}, {
  "imdbId" : "0096531",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "The Game",
  "description" : "The Day of Descent, anniversary of the Tenctonese freedom from slavery, finds Francisco depressed. A lethal form of gambling from The Ship may be continuing on Earth."
}, {
  "imdbId" : "0096531",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "Chains of Love",
  "description" : "Sikes and Francisco seek an elusive Newcomer woman - all of whose dates wind up dead. George worries about Susan's fidelity."
}, {
  "imdbId" : "0096531",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "The Red Room",
  "description" : "A break in at a behavioral lab and a series of execution-style murders dredges up buried memories for Francisco."
}, {
  "imdbId" : "0096531",
  "season" : "1",
  "episodeNumber" : "13",
  "title" : "Spirit of '95",
  "description" : "As Susan and Buck campaign for Tenctonese suffrage, bombings and kidnappings are linked to the anti-Newcomer \"Purist\" organization."
}, {
  "imdbId" : "0096531",
  "season" : "1",
  "episodeNumber" : "14",
  "title" : "Generation to Generation",
  "description" : "Several parties claim ownership of a mysterious Tenctonese box that leaves a trail of death in its wake, including Francisco's eccentric Uncle Moodri."
}, {
  "imdbId" : "0096531",
  "season" : "1",
  "episodeNumber" : "15",
  "title" : "Eyewitness News",
  "description" : "The line between reality and fantasy blurs when a crossed video phone line lets a boardroom of executives see a sex actress attacked. George becomes swept up in celebrity when a news crew does a week-long special on him."
}, {
  "imdbId" : "0096531",
  "season" : "1",
  "episodeNumber" : "16",
  "title" : "Partners",
  "description" : "George is suspended from the force when several kilos of drugs goes missing on his watch. An old mentor of Sikes' returns. The Francisco family prepares for the Ejection, when the baby will transferred from Susan to George."
}, {
  "imdbId" : "0096531",
  "season" : "1",
  "episodeNumber" : "17",
  "title" : "Real Men",
  "description" : "Sikes and Francisco investigate possible steroid dealings at a gym. George must reconcile his and humanity's conceptions of manhood while he is pregnant."
}, {
  "imdbId" : "0096531",
  "season" : "1",
  "episodeNumber" : "18",
  "title" : "Crossing the Line",
  "description" : "Francisco worries that Sykes is hiding something when he cancels his vacation plans to help track down a killer."
}, {
  "imdbId" : "0096531",
  "season" : "1",
  "episodeNumber" : "19",
  "title" : "Rebirth",
  "description" : "When Sikes comes back after being pronounced dead, he becomes obsessed with finding the Newcomer he believes healed him."
}, {
  "imdbId" : "0096531",
  "season" : "1",
  "episodeNumber" : "20",
  "title" : "Gimme, Gimme",
  "description" : "George investigates the murder of the chief scientist behind a company he is heavily invested in. Buck, inspired by one of his teachers, protests that the workers at the company are being exploited. Matt sells one of his lottery tickets to Albert, only to see him win."
}, {
  "imdbId" : "0096531",
  "season" : "1",
  "episodeNumber" : "21",
  "title" : "The Touch",
  "description" : "Cathy finds a boy she knew from the ship, but suspects he has been abused."
}, {
  "imdbId" : "0096531",
  "season" : "1",
  "episodeNumber" : "22",
  "title" : "Green Eyes",
  "description" : "Tensions between partners erupt when Francisco passes the Detective 2 exam and is promoted over Sikes. Matt becomes uncomfortable with his attraction to Cathy. The mysterious death of a Newcomer judge points to a lethal bacterium being used as a weapon."
}]