[{
  "imdbId" : "1219024",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Flowers for Your Grave",
  "description" : "Murder mystery author Richard 'Rick' Castle publishes the book in which he kills off his bestseller series' hero, Derek Storm. On that very day, NYPD detective Kate Beckett questions him about two murders in the exact style of his novels, on a lawyer Fisk viz. social worker Alyson Tisdale. He's professionally flattered to have a copycat. Her boss, captain Roy Montgomery, accepts his help as case consultant and teams them up, the mayor being a fan puts him de facto in charge. More copy killing follows. The police simplistically arrest his fan Kyle Cabot, the first ..."
}, {
  "imdbId" : "1219024",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Nanny McDead",
  "description" : "Now Castle has solved the pseudo copycat-case, the mayor orders him accepted as permanent police consultant. First case, Howard Peterson and Sara Peterson's nanny Sara Manning, from Georgia, was found dead in their building's clothes dryer. Once more, Castle comes up with the non-evident questions and ideas to establish the infidelity-related motive and several suspects."
}, {
  "imdbId" : "1219024",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Hedge Fund Homeboys",
  "description" : "A clique of rich kids plays Russian Roulette with a bullet-less gun. But one night a bullet in the chamber kills one of them. When another one is supposedly commits suicide it's up to the team to discover what is what and if the suicide was over guilt."
}, {
  "imdbId" : "1219024",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Hell Hath No Fury",
  "description" : "Two guys thought the rug was the find at a neighborhood dumpster. They were astounded to find a councilman's body inside the rolled up rug. Was this a botched robbery or does this murder have ties to local politics?"
}, {
  "imdbId" : "1219024",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "A Chill Goes Through Her Veins",
  "description" : "A frozen female corpse discovered at a new construction site transforms a cold five-year-old missing persons case into a current homicide investigation."
}, {
  "imdbId" : "1219024",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Always Buy Retail",
  "description" : "Richard Castle thinks a murder is a voodoo ritualistic murder when a silver coin is found in the mouth of an adult male murdered victim. When other deaths pop up including a young girl with a silver coin in her mouth, it's up to the team to find the connection."
}, {
  "imdbId" : "1219024",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Home Is Where the Heart Stops",
  "description" : "Castle is anxiously awaiting the public response to the release of his newest work of fiction. A baffling rash of jewel robberies from the society set prompts Castle to ask Beckett to be his undercover date at a ball to see if the thief might be amongst the affluent set and casing out his victims at charity events, balls, and parties."
}, {
  "imdbId" : "1219024",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Ghosts",
  "description" : "A woman found drowned in a bathtub full of motor oil is initially identified as a missing suburban housewife, until it's discovered that her identity had been stolen from a deceased child, and that she had been a fugitive from a terrorism charge for two decades."
}, {
  "imdbId" : "1219024",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "Little Girl Lost",
  "description" : "Angela (2) is kidnapped from adoptive parents Alfred (painter) and Theresa Candela's home for $750,000 ransom, every cent they own. Castle follows the money in the parents' family and business. There's something fishing about the ransom demand."
}, {
  "imdbId" : "1219024",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "A Death in the Family",
  "description" : "Plastic surgeon Dr. Joshua Leeds (37) was asphyxiated by plastic bag in has long overdue parked car, but first tortured. He was reported missing weeks ago by fiancée Courtney Morantz. Castle has a forensic expert look into the murder on Becket's mother 15 years ago. And checks on Owen (15), his daughter's 'suspiciously' inconspicuous prom date. Leeds has threatening dissatisfied patient; and a secret patient, which Becket's FBI friends and Castle's mob contact contact, with surprising results."
}]