[{
  "imdbId" : "1365047",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Sarah Jessica Parker",
  "description" : "In this riveting series premiere, Sarah Jessica Parker embarks on an exciting adventure into the unknown to learn about her family tree. With the help of Ancestry.com, Sarah Jessica's story takes her on not one, but two awe-inspiring journeys first to Northern California and then to Salem, Massachusetts."
}, {
  "imdbId" : "1365047",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Emmitt Smith",
  "description" : "Football legend Emmitt Smith is intrigued by a family rumor that his paternal grandmother, Erma Lee Watson, had white ancestry. As he travels deep into rural Alabama to colonial Virginia and beyond on the trail of Erma's great grandmother Mariah, Smith uncovers a story more dramatic than he ever could have imagined."
}, {
  "imdbId" : "1365047",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Lisa Kudrow",
  "description" : "Since childhood, Lisa Kudrow has known that her grandmother Gertrude had it tough. Gertrude's mother, Meri, perished in the Holocaust. Lisa's father recalls hearing about her death from a young Polish sailor, a cousin named Yuri who was last seen in New York in the late 1940s. Lisa's father never forgot Yuri for warning him and his family to leave their village for safety before the Nazi army invasion. From Los Angeles to Belarus, to the actual village where Meri once lived, Lisa's journey reveals clues leading her to something neither she nor her father ever thought ..."
}, {
  "imdbId" : "1365047",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Matthew Broderick",
  "description" : "Tony Award-winner Matthew Broderick delves into his family history."
}, {
  "imdbId" : "1365047",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Brooke Shields",
  "description" : "Actress Brooke Shields embarks on a journey to discover which side of her divided and very different family she identifies with."
}, {
  "imdbId" : "1365047",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Susan Sarandon",
  "description" : "Oscar-Winner Susan Sarandon unlocks her mysterious family tree."
}, {
  "imdbId" : "1365047",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Spike Lee",
  "description" : "Director Spike Lee learns about his ancestors in the season finale."
}, {
  "imdbId" : "1365047",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "Vanessa Williams",
  "description" : "Season Premiere -- Multi-faceted performer Vanessa Williams explores the roots of her trailblazing ancestors."
}, {
  "imdbId" : "1365047",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "Tim McGraw",
  "description" : "Country music superstar Tim McGraw embarks on a journey to uncover his father's ancestral past."
}, {
  "imdbId" : "1365047",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "Rosie O'Donnell",
  "description" : "Rosie O'Donnell embarks on an emotional journey as she traces her late mother's roots."
}, {
  "imdbId" : "1365047",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "Kim Cattrall",
  "description" : "Kim Cattrall sets out to solve a 70 year-old mystery."
}, {
  "imdbId" : "1365047",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "Lionel Richie",
  "description" : "R&B superstar Lionel Richie unravels the mystery of his past."
}, {
  "imdbId" : "1365047",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "Steve Buscemi",
  "description" : "Golden Globe winner Steve Buscemi embarks on a journey to find the rogues and villains in his ancestral past."
}, {
  "imdbId" : "1365047",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "Gwyneth Paltrow",
  "description" : "Academy Award winner Gwyneth Paltrow delves into her ancestral past."
}, {
  "imdbId" : "1365047",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "Ashley Judd",
  "description" : "Actress and humanitarian Ashley Judd seeks the truth behind larger than life family tales."
}]