[{
  "imdbId" : "2575988",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Minimum Viable Product",
  "description" : "Richard is a computer programmer. He has to choose between a $10 million deal with Gavin Belson and a $200,000 deal with Peter Gregory, in exchange for his cooperation to make the idea of a super compressing algorithm change the world."
}, {
  "imdbId" : "2575988",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "The Cap Table",
  "description" : "Richard hires Jared to design a business plan. Big Head is asked to work for Gavin Belson, where he discovers that Hooli has stolen the Pied Piper algorithm and calls it Nucleus. Meanwhile Richard struggles to get his money from Gregory."
}, {
  "imdbId" : "2575988",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Articles of Incorporation",
  "description" : "The guys find themselves in trouble with their company name when they find out it's already taken. So whilst Richard tries to find a solution, Erlich searches for a new name in another dimension of his consciousness."
}, {
  "imdbId" : "2575988",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Fiduciary Duties",
  "description" : "Richard drunkenly promises to make Erlich a board member, which he regrets the next morning. Big Head finds others at Hooli, who like him, have made careers out of doing nothing. Richard struggles to put Pied Piper's vision into words."
}, {
  "imdbId" : "2575988",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Signaling Risk",
  "description" : "Now that Pied Piper is the official company name, Erlich wants a logotype to go with it so he hires a very unexpected artist in for the job. Meanwhile Richard gets a tighter deadline for the project after a simple mistake."
}, {
  "imdbId" : "2575988",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Third Party Insourcing",
  "description" : "Richard comes across a problem in the code writing and hires Kevin, a young kid, to write the code for him."
}, {
  "imdbId" : "2575988",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Proof of Concept",
  "description" : "Richard has trouble getting Pied Piper ready in time for the TechCrunch Disrupt, while Erlich realizes he slept with the wife of one of the judges of the contest."
}, {
  "imdbId" : "2575988",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Optimal Tip-To-Tip Efficiency",
  "description" : "Pied Piper makes it to the next stage of Disrupt but runs into trouble with Hooli's presentation. The guys break out into a ridiculous argument and Richard tries to pull Pied Piper together before the big presentation."
}, {
  "imdbId" : "2575988",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "Sand Hill Shuffle",
  "description" : "Monica deals with her new boss; Richard makes a decision about the company's future."
}, {
  "imdbId" : "2575988",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "Runaway Devaluation",
  "description" : "Richard and the guys struggle to find a backer as they face legal and financial woes. Meanwhile, an old enemy pays Richard a visit."
}, {
  "imdbId" : "2575988",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "Bad Money",
  "description" : "While considering Gavin's proposal, Richard is approached by a billionaire."
}, {
  "imdbId" : "2575988",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "The Lady",
  "description" : "Richard butts heads with Erlich over a prospective hire; Dinesh and Gilfoyle grow suspicious."
}, {
  "imdbId" : "2575988",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "Server Space",
  "description" : "Gavin's interference causes Pied Piper to struggle with securing their expansion."
}, {
  "imdbId" : "2575988",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "Homicide",
  "description" : "Monica encourages the guys to pounce on an opportunity; Erlich reconnects with a former mentee."
}, {
  "imdbId" : "2575988",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "Adult Content",
  "description" : "With the Pied Piper team fielding job offers, Richard faces the prospect of folding."
}, {
  "imdbId" : "2575988",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "White Hat/Black Hat",
  "description" : "Richard accidentally sparks a feud that leads him to become paranoid about security."
}, {
  "imdbId" : "2575988",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "Binding Arbitration",
  "description" : "Erlich demands to be put on stand as Pied Piper and Hooli enter Arbitration. Richard faces a moral dilemma now that he realizes that Hooli's claim may have successful potential. Meanwhile back at Pied Piper headquarters, Jared, Dinesh and Gilfoyle question a profound theory and its affiliation to their live stream."
}, {
  "imdbId" : "2575988",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "Two Days of the Condor",
  "description" : "The verdict on Pied Piper's fate coincides with a startling real-life drama that makes their livestream immensely popular, and emotions run high as the gang tries to keep the company together."
}, {
  "imdbId" : "2575988",
  "season" : "3",
  "episodeNumber" : "1",
  "title" : "Founder Friendly",
  "description" : "After being unceremoniously fired, an angry Richard faces a tough decision: accept the diminished role of CTO, or leave Pied Piper for good. Erlich takes a shine to Jack Barker, Laurie's new choice of CEO, while Dinesh and Gilfoyle weigh their options in Richard's absence. At Hooli, Gavin tries to improve his image by admitting failure, and Big Head gets wind of major changes."
}, {
  "imdbId" : "2575988",
  "season" : "3",
  "episodeNumber" : "2",
  "title" : "Two in the Box",
  "description" : "The new and improved Pied Piper impresses Dinesh and Gilfoyle, but worries Richard; Jared and Erlich face housing issues; Gavin suggests a controversial move."
}, {
  "imdbId" : "2575988",
  "season" : "3",
  "episodeNumber" : "3",
  "title" : "Meinertzhagen's Haversack",
  "description" : "Richard searches for a way around Jack; Gilfoyle opens himself up to recruiters; Dinesh draws unwanted attention from a recent purchase."
}, {
  "imdbId" : "2575988",
  "season" : "3",
  "episodeNumber" : "4",
  "title" : "Maleant Data Systems Solutions",
  "description" : "The Pied Piper guys struggle to phone it in; Erlich faces competition; Monica takes a stand; Gavin makes a decision about Nucleus."
}, {
  "imdbId" : "2575988",
  "season" : "3",
  "episodeNumber" : "5",
  "title" : "The Empty Chair",
  "description" : "Richard lets his ego get in the way at an interview; Dinesh, Gilfoyle and Jared misplace hardware; Erlich pitches his plans to Big Head."
}, {
  "imdbId" : "2575988",
  "season" : "3",
  "episodeNumber" : "6",
  "title" : "Bachmanity Insanity",
  "description" : "Richard's new relationship is threatened by neuroses; Big Head and Erlich's launch party has snags; Dinesh falls for a foreign coworker."
}, {
  "imdbId" : "2575988",
  "season" : "3",
  "episodeNumber" : "7",
  "title" : "To Build a Better Beta",
  "description" : "Richard decides to test the Pied Pipper beta. Erlich finds himself in trouble."
}, {
  "imdbId" : "2575988",
  "season" : "3",
  "episodeNumber" : "8",
  "title" : "Bachman's Earnings Over-Ride",
  "description" : "Erlich tries to be honest with Richard, who has mixed emotions about their friendship and the future of Pied Piper. Meanwhile, Jared's new company apparel turns heads but fuels yet another clash between Dinesh and Gilfoyle."
}, {
  "imdbId" : "2575988",
  "season" : "3",
  "episodeNumber" : "9",
  "title" : "Daily Active Users",
  "description" : "Shocking stats are revealed and prompt Richard to bridge the gap between Pied Piper and its users, but Jared must go to extremes to keep everything intact. Meanwhile, Gavin tries to recapture his former glory by bringing in new talent after discovering secrets about the competition."
}, {
  "imdbId" : "2575988",
  "season" : "3",
  "episodeNumber" : "10",
  "title" : "The Uptick",
  "description" : "Pied Piper's future is hazy, but Erlich's industry profile begins to rise, creating a moral dilemma for Richard as Dinesh's new app starts to catch on. Meanwhile, Laurie makes plans for her exit; and Gavin's pompous personality haunts his comeback at Hooli."
}, {
  "imdbId" : "2575988",
  "season" : "4",
  "episodeNumber" : "1",
  "title" : "Success Failure",
  "description" : "The guys struggle to find funding for Pied Piper's video chat app to keep up with their rapidly growing user base. Erlich faces resistance from Big Head's father. Jack steps on Gavin's toes at Hooli. Richard gets sage advice."
}, {
  "imdbId" : "2575988",
  "season" : "4",
  "episodeNumber" : "2",
  "title" : "Terms of Service",
  "description" : "Richard butts heads with Dinesh; Erlich makes a play to be involved in Jian-Yang's new app; Jared sets ground rules in his friendship with Richard; Gavin's paranoia over Jack's enthusiasm causes him to make a rash decision."
}, {
  "imdbId" : "2575988",
  "season" : "4",
  "episodeNumber" : "3",
  "title" : "Intellectual Property",
  "description" : "Dinesh gets back to the ground while Richard continues to explore his new project. Gavin tries to come out of the new problem he has gotten himself into and interestingly the chemistry between Richard and Monica takes a new turn."
}, {
  "imdbId" : "2575988",
  "season" : "4",
  "episodeNumber" : "4",
  "title" : "Teambuilding Exercise",
  "description" : "Sea food demo is being prepared. Big head professorship is proving beneficial to his students. And finally we get a glimpse of the insides of Gavin Belson mansion."
}, {
  "imdbId" : "2575988",
  "season" : "4",
  "episodeNumber" : "5",
  "title" : "The Blood Boy",
  "description" : "Cracks in Richard's latest partnership become more apparent when he has to deal with an unexpected interloper; Dinesh scrambles to find a way out of his new relationship; Monica learns of surprising developments at Raviga."
}, {
  "imdbId" : "2575988",
  "season" : "4",
  "episodeNumber" : "6",
  "title" : "Customer Service",
  "description" : "The guys struggle for funding to launch the latest iteration of Pied Piper. Erlich seeks to join the new VC firm formed by Laurie and Monica. Dinesh and Gilfoyle clash over the alpha build."
}, {
  "imdbId" : "2575988",
  "season" : "4",
  "episodeNumber" : "7",
  "title" : "The Patent Troll",
  "description" : "Richard takes on a patent troll; Gilfoyle battles a smart fridge; Jared embraces multiple identities; Erlich tries to spend time with a new crowd."
}, {
  "imdbId" : "2575988",
  "season" : "4",
  "episodeNumber" : "8",
  "title" : "The Keenan Vortex",
  "description" : "Richard ponders a deal with the tech world's latest \"it\" boy; Jack faces setbacks."
}, {
  "imdbId" : "2575988",
  "season" : "4",
  "episodeNumber" : "9",
  "title" : "Hooli-Con",
  "description" : "The Pied Piper guys try to pull off a stealth plan at Hooli-Con."
}, {
  "imdbId" : "2575988",
  "season" : "4",
  "episodeNumber" : "10",
  "title" : "Server Error",
  "description" : "Richard finds himself in a web of lies; Jared plans his exit; Jack bets big; Gavin plots a comeback."
}, {
  "imdbId" : "2575988",
  "season" : "5",
  "episodeNumber" : "1",
  "title" : "Grow Fast or Die Slow",
  "description" : "The pressure to get things right stymies Richard and forces him to grow the company in a way he hadn't planned; Dinesh and Gilfoyle question their ability to make good choices; Gavin returns to Hooli and worries about becoming antiquated."
}, {
  "imdbId" : "2575988",
  "season" : "5",
  "episodeNumber" : "2",
  "title" : "Reorientation",
  "description" : "Richard manages a number of conflicts in his efforts to unite his new employees; Dinesh celebrates a new purchase that Gilfoyle looks to spoil; Jian-Yang goes to court; Gavin meets pushback over his signature and what it says about him."
}, {
  "imdbId" : "2575988",
  "season" : "5",
  "episodeNumber" : "3",
  "title" : "Chief Operating Officer",
  "description" : "The COO of a world class company asks to move to Pied Piper. At the same time, Richard deals with a lawsuit from the smart fridge company that Gilfoyle hacked."
}, {
  "imdbId" : "2575988",
  "season" : "5",
  "episodeNumber" : "4",
  "title" : "Tech Evangelist",
  "description" : "Attempting to woo a gaming company to PiperNet, Richard inadvertently angers a prized ally; Dinesh deals with a betrayal; Gavin leaves his underlings with a cryptic message; Jared gets inside information from Big Head."
}, {
  "imdbId" : "2575988",
  "season" : "5",
  "episodeNumber" : "5",
  "title" : "Facial Recognition",
  "description" : "Overshadowed by Jared in an on-camera interview, Richard's confidence wavers further when Laurie and Monica force him to work with Eklow, a new artificial-intelligence company; Gavin questions his future beyond Hooli."
}, {
  "imdbId" : "2575988",
  "season" : "5",
  "episodeNumber" : "6",
  "title" : "Artificial Emotional Intelligence",
  "description" : "Richard decides to help when Laurie gets in a jam, but his lack of emotional discipline threatens to backfire on Pied Piper; Gavin tries to make a deal with a stubborn partner; Dinesh relishes a win; Jared bonds with a surprising figure."
}, {
  "imdbId" : "2575988",
  "season" : "5",
  "episodeNumber" : "7",
  "title" : "Initial Coin Offering",
  "description" : "As Pied Piper prepares to close on their Series B funding, Richard receives some unsettling news; Gilfoyle suggests a proposition; Monica is blunt with Richard; Dinesh competes with a co-worker; Gavin tries to charm small-town America."
}, {
  "imdbId" : "2575988",
  "season" : "5",
  "episodeNumber" : "8",
  "title" : "Fifty-One Percent",
  "description" : "PiperNet launches, but an early success makes Monica suspicious; Richard makes a surprising move; the team races against the clock as its future is threatened."
}]