[{
  "imdbId" : "0105946",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Midnight on the Firing Line",
  "description" : "The Narn attack a Centauri colony, while Raiders attack transport ships. And Talia Winters arrives at the station."
}, {
  "imdbId" : "0105946",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Soul Hunter",
  "description" : "A mysterious alien who steals the souls of the living arrives on the station putting Delenn's life in danger."
}, {
  "imdbId" : "0105946",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Born to the Purple",
  "description" : "Londo falls for a beautiful slave, whose owner wants to steal sensitive information. Garibaldi discovers that someone is using a restricted communications channel."
}, {
  "imdbId" : "0105946",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Infection",
  "description" : "A living weapon wreaks havoc on the station."
}, {
  "imdbId" : "0105946",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "The Parliament of Dreams",
  "description" : "A week long cultural festival is takes place on board the station. Catherine Sakai, Sinclair's old girlfriend, arrives on the station and G'Kar receives a death threat."
}, {
  "imdbId" : "0105946",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Mind War",
  "description" : "The Psi-Cops arrive at the station to capture Talia's old Psi Corps instructor. Catherine is warned not to survey a sector of space by G'Kar."
}, {
  "imdbId" : "0105946",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "The War Prayer",
  "description" : "A pro-Earth group attacks a Minbari poet and two Centauri lovers seek Londo's help."
}, {
  "imdbId" : "0105946",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "And the Sky Full of Stars",
  "description" : "Sinclair is kidnapped by people who want to know what happened when he disappeared in the last battle of the Earth/Minbari war, knowledge that even Sinclair does not know."
}, {
  "imdbId" : "0105946",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "Deathwalker",
  "description" : "A war criminal scientist who is the last of the notorious Dilgars is discovered on B5 bearing an extraordinary medication that all the powers want."
}, {
  "imdbId" : "0105946",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "Believers",
  "description" : "An alien family refuses surgery to save their dying child."
}, {
  "imdbId" : "0105946",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "Survivors",
  "description" : "Garibaldi is blamed for an accident aboard B5, leading to his return to the bottle."
}, {
  "imdbId" : "0105946",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "By Any Means Necessary",
  "description" : "While the station's dock workers stage an illegal strike, G'Kar tries to hold a Narn religious ceremony, but Londo holds the plant he needs and won't relinquish it."
}, {
  "imdbId" : "0105946",
  "season" : "1",
  "episodeNumber" : "13",
  "title" : "Signs and Portents",
  "description" : "Londo obtains a priceless Centauri artifact and a stranger visits each alien ambassador asking only one question."
}, {
  "imdbId" : "0105946",
  "season" : "1",
  "episodeNumber" : "14",
  "title" : "TKO",
  "description" : "A disgraced boxer comes to Babylon 5 to compete in the Mutai, an alien fighting match. Meanwhile, an old friend visits Ivanova so that she can mourn the loss of her father."
}, {
  "imdbId" : "0105946",
  "season" : "1",
  "episodeNumber" : "15",
  "title" : "Grail",
  "description" : "A man searching for the Holy Grail arrives. Ambassador Kosh may be behind a string of attacks on the station."
}, {
  "imdbId" : "0105946",
  "season" : "1",
  "episodeNumber" : "16",
  "title" : "Eyes",
  "description" : "A Colonel investigates Sinclair and his command staff for recent station actions."
}, {
  "imdbId" : "0105946",
  "season" : "1",
  "episodeNumber" : "17",
  "title" : "Legacies",
  "description" : "A Minbari military leader's dead body disappears on the station."
}, {
  "imdbId" : "0105946",
  "season" : "1",
  "episodeNumber" : "18",
  "title" : "A Voice in the Wilderness: Part 1",
  "description" : "One of Delenn's old friends arrives on the station when an extinct civilization is found on the planet that Babylon 5 orbits."
}, {
  "imdbId" : "0105946",
  "season" : "1",
  "episodeNumber" : "19",
  "title" : "A Voice in the Wilderness: Part 2",
  "description" : "An Earthforce captain and an alien race both lay claim to the planet below."
}, {
  "imdbId" : "0105946",
  "season" : "1",
  "episodeNumber" : "20",
  "title" : "Babylon Squared",
  "description" : "B5's immediate predecessor, Babylon 4, suddenly reappears after mysteriously vanishing years ago."
}, {
  "imdbId" : "0105946",
  "season" : "1",
  "episodeNumber" : "21",
  "title" : "The Quality of Mercy",
  "description" : "Talia must enter the mind of a convicted murderer while Dr. Franklin goes to Downbelow to investigate a doctor who apparently is 'magically' healing people."
}, {
  "imdbId" : "0105946",
  "season" : "1",
  "episodeNumber" : "22",
  "title" : "Chrysalis",
  "description" : "Garibaldi investigates a death on the station which leads him to a terrible discovery."
}, {
  "imdbId" : "0105946",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "Points of Departure",
  "description" : "As Captain John Sheridan assumes command of B5, he learns the reason why the Minbari inexplicably surrendered to Earth in the Earth-Minbari war while a renegade Minbari ship seeks to restart it."
}, {
  "imdbId" : "0105946",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "Revelations",
  "description" : "G'Kar brings news of an old enemy's return. Dr. Franklin tries to bring Garibaldi out from his coma. Delenn returns, quite changed."
}, {
  "imdbId" : "0105946",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "The Geometry of Shadows",
  "description" : "Ivanova deals with a Drazi custom, which only occurs once every 5 years. Techno-mages arrive on the station."
}, {
  "imdbId" : "0105946",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "A Distant Star",
  "description" : "Captain Sheridan's old commanding officer arrives at the station, and disaster ensues in Hyperspace."
}, {
  "imdbId" : "0105946",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "The Long Dark",
  "description" : "A sleeper ship is found adrift near the station, where a deadly force awaits."
}, {
  "imdbId" : "0105946",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "Spider in the Web",
  "description" : "Talia witnesses a murder at the hands of a Free Mars member."
}, {
  "imdbId" : "0105946",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "Soul Mates",
  "description" : "Visitors to the station include Londo's three wives and Talia's ex-husband. Delenn has a bad hair day."
}, {
  "imdbId" : "0105946",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "A Race Through Dark Places",
  "description" : "Bester has Talia investigate an \"underground railroad\" of telepaths escaping the Psi-corp."
}, {
  "imdbId" : "0105946",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "The Coming of Shadows",
  "description" : "The Centauri emperor visits the station, leading G'Kar to attempt to assassinate him. Lord Refa and Londo conspire to expand their power on Centauri Prime."
}, {
  "imdbId" : "0105946",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "GROPOS",
  "description" : "A task force of ground troops led by Dr. Franklin's father is assembled at B5, leading to some friction."
}, {
  "imdbId" : "0105946",
  "season" : "2",
  "episodeNumber" : "11",
  "title" : "All Alone in the Night",
  "description" : "Sheridan is kidnapped onto an alien ship and General Hague makes an unofficial visit to the station."
}, {
  "imdbId" : "0105946",
  "season" : "2",
  "episodeNumber" : "12",
  "title" : "Acts of Sacrifice",
  "description" : "G'Kar asks Sheridan for Earth Force help in the Narn/Centauri war."
}, {
  "imdbId" : "0105946",
  "season" : "2",
  "episodeNumber" : "13",
  "title" : "Hunter, Prey",
  "description" : "A fugitive with secret Earth Force data flees to Babylon 5."
}, {
  "imdbId" : "0105946",
  "season" : "2",
  "episodeNumber" : "14",
  "title" : "There All the Honor Lies",
  "description" : "Sheridan kills a Minbari warrior in self-defense, but a Minbari witness to the incident claims it was not justified."
}, {
  "imdbId" : "0105946",
  "season" : "2",
  "episodeNumber" : "15",
  "title" : "And Now for a Word",
  "description" : "ISN arrives on the station to film a documentary of the station and crew."
}, {
  "imdbId" : "0105946",
  "season" : "2",
  "episodeNumber" : "16",
  "title" : "In the Shadow of Z'ha'dum",
  "description" : "Sheridan discovers that Morden has a connection with his dead wife. Nightwatch, a new agency on Earth is trying to recruit new personnel."
}, {
  "imdbId" : "0105946",
  "season" : "2",
  "episodeNumber" : "17",
  "title" : "Knives",
  "description" : "An old friend asks for help from Londo. Sheridan is possessed by a strange creature."
}, {
  "imdbId" : "0105946",
  "season" : "2",
  "episodeNumber" : "18",
  "title" : "Confessions and Lamentations",
  "description" : "Dr. Franklin tries desperately to find a cure for a disease which is killing off all the Markab on the station."
}, {
  "imdbId" : "0105946",
  "season" : "2",
  "episodeNumber" : "19",
  "title" : "Divided Loyalties",
  "description" : "Lyta Alexander returns to the station with news that one of the officers on the station is an undercover operative."
}, {
  "imdbId" : "0105946",
  "season" : "2",
  "episodeNumber" : "20",
  "title" : "The Long, Twilight Struggle",
  "description" : "The Narn/Centauri War comes to a devastating turn of events."
}, {
  "imdbId" : "0105946",
  "season" : "2",
  "episodeNumber" : "21",
  "title" : "Comes the Inquisitor",
  "description" : "Kosh tests Delenn's allegiance while G'Kar attempts to bring his people together on Babylon 5."
}, {
  "imdbId" : "0105946",
  "season" : "2",
  "episodeNumber" : "22",
  "title" : "The Fall of Night",
  "description" : "While the Centauri/Narn war escalates the Earth government enters into a non-aggression treaty with the Centauri. While Keffer is in Hyperspace, he discovers a dangerous secret."
}, {
  "imdbId" : "0105946",
  "season" : "3",
  "episodeNumber" : "1",
  "title" : "Matters of Honor",
  "description" : "A small colony is attacked by the Shadows. It's the location of a Ranger training base, Marcus Cole goes to Babylon 5 to get help. Sheridan and Delenn embark on a mission to help the Rangers in the newly built White Star. Meanwhile Earth force sends a representative to find out more about the ship that destroyed Lt. Keffer."
}, {
  "imdbId" : "0105946",
  "season" : "3",
  "episodeNumber" : "2",
  "title" : "Convictions",
  "description" : "A mad bomber is loose on Babylon 5. When they find him, he threatens to detonate the station, if his demands are not met. Meanwhile G'Kar and Londo are trapped in an elevator. Londo wants to work together so they can escape, but G'Kar refuses to aide his nemesis."
}, {
  "imdbId" : "0105946",
  "season" : "3",
  "episodeNumber" : "3",
  "title" : "A Day in the Strife",
  "description" : "Sheridan and Ivanova deal with a dispute with the worker's guild. Then a probe arrives, and gives the station a test. If they pass, it promises to share advanced technology, if they fail the station will be destroyed in a few hours. Garibaldi talks to Franklin about his stim use-age."
}, {
  "imdbId" : "0105946",
  "season" : "3",
  "episodeNumber" : "4",
  "title" : "Passing Through Gethsemane",
  "description" : "Kosh's ship arrives at the station bearing a surprise visitor, Lyta Alexander returns after visiting the Vorlon home world. Brother Edward, a monk with Brother Theo visits with Delenn to discuss religion. Soon he begins to hear voices. They discover that Edward is experiencing repressed memories, someone is forcing him to relive past moments. Why would someone make a monk relive such horrors?"
}, {
  "imdbId" : "0105946",
  "season" : "3",
  "episodeNumber" : "5",
  "title" : "Voices of Authority",
  "description" : "Sheridan has an interesting time dealing with the new Political Officer stationed by EarthGov and Ivonova visits the planet below Babylon 5 in search of the \"first ones\"."
}, {
  "imdbId" : "0105946",
  "season" : "3",
  "episodeNumber" : "6",
  "title" : "Dust to Dust",
  "description" : "Bester returns to Babylon 5 to stop the flow of Dust, a powerful new drug which can temporarily unlock telepathic powers. But Captain Sheridan and the crew can't risk Bester reading their minds and uncovering their secret Shadow war preparations."
}, {
  "imdbId" : "0105946",
  "season" : "3",
  "episodeNumber" : "7",
  "title" : "Exogenesis",
  "description" : "Marcus and Franklin investigate a series of deaths caused by a mysterious parasite."
}, {
  "imdbId" : "0105946",
  "season" : "3",
  "episodeNumber" : "8",
  "title" : "Messages from Earth",
  "description" : "Sheridan discovers a terrifying new alliance between the Shadows and another race."
}, {
  "imdbId" : "0105946",
  "season" : "3",
  "episodeNumber" : "9",
  "title" : "Point of No Return",
  "description" : "Nightwatch takes control of Babylon 5 security. The widow of the former Centauri Emperor visits Londo, and gives Londo and Vir news of their future."
}, {
  "imdbId" : "0105946",
  "season" : "3",
  "episodeNumber" : "10",
  "title" : "Severed Dreams",
  "description" : "When President Clark escalates his brutal repression of the people of Earth Alliance, Captain Sheridan declares Babylon 5 independent."
}, {
  "imdbId" : "0105946",
  "season" : "3",
  "episodeNumber" : "11",
  "title" : "Ceremonies of Light and Dark",
  "description" : "After severing ties with Earth, the command staff must deal with some unexpected issues. Delenn suggests they go through a Minbari rebirth ceremony. Secrets are revealed, and hidden dangers are revealed as a group loyal to Clark takes Delenn hostage."
}, {
  "imdbId" : "0105946",
  "season" : "3",
  "episodeNumber" : "12",
  "title" : "Sic Transit Vir",
  "description" : "Vir returns to Babylon 5, and meets his fiancée'. As he and his bride to be get to know each other, a Narn attacks, and takes a blood oath to kill them. The command staff must figure out why someone would want to kill Vir."
}, {
  "imdbId" : "0105946",
  "season" : "3",
  "episodeNumber" : "13",
  "title" : "A Late Delivery from Avalon",
  "description" : "An impressive man in medieval armor arrives on the station, claiming to be King Arthur. Is he the genuine hero, sent by the Vorlons? If not, who is he and what are his secrets?"
}, {
  "imdbId" : "0105946",
  "season" : "3",
  "episodeNumber" : "14",
  "title" : "Ship of Tears",
  "description" : "Bester arrives in a starfury. He wants their help in tracking down weapons, which turns out to be telepaths captured by the Shadows. They discover why the Shadows wanted telepaths for their war."
}, {
  "imdbId" : "0105946",
  "season" : "3",
  "episodeNumber" : "15",
  "title" : "Interludes and Examinations",
  "description" : "Garibaldi tries to get Franklin to face up to his stim usage. Londo waits anxiously for Adira to return. Morden returns first, and manipulates the situation to his advantage. The alliance asks Sheridan to prove he has forces equal to the Shadows before they will commit. Sheridan calls on Kosh for assistance, but Kosh is resistant at first, Kosh finally agrees to help Sheridan, and later pays the price for his involvement."
}, {
  "imdbId" : "0105946",
  "season" : "3",
  "episodeNumber" : "16",
  "title" : "War Without End: Part One",
  "description" : "Sinclair returns to Babylon 5 with a mission, going back in time to take Babylon 4 where it is most needed. This is a continuation of First Season's Babylon Squared. Many things about the past are explained. And some surprises about the future are revealed"
}, {
  "imdbId" : "0105946",
  "season" : "3",
  "episodeNumber" : "17",
  "title" : "War Without End: Part Two",
  "description" : "The mission to send Babylon 4 where it's needed continues. Sinclair's destiny is revealed. Sheridan sees what will happen to Centauri Prime in the future. Zathras explains who the \"One\" is."
}, {
  "imdbId" : "0105946",
  "season" : "3",
  "episodeNumber" : "18",
  "title" : "Walkabout",
  "description" : "Kosh's replacement arrives and Dr. Franklin falls in love with a singer during his search."
}, {
  "imdbId" : "0105946",
  "season" : "3",
  "episodeNumber" : "19",
  "title" : "Grey 17 Is Missing",
  "description" : "With Sinclair gone, the Rangers need a new leader, and everyone looks to Delenn. But some in the warrior caste will not accept her in this new role, and seek a way to block her. Marcus must stop Neroon from interfering in the ceremony at any cost. Meanwhile Garibaldi investigates the death of a maintenance worker and a mysterious cult on a section that \"vanished\""
}, {
  "imdbId" : "0105946",
  "season" : "3",
  "episodeNumber" : "20",
  "title" : "And the Rock Cried Out, No Hiding Place",
  "description" : "Religious leaders gather on Babylon 5 bringing news of events on Earth. Sheridan and Delenn figure out where the Shadows will strike next. G'Kar is captured by Refa, this will lead to a final confrontation with Londo."
}, {
  "imdbId" : "0105946",
  "season" : "3",
  "episodeNumber" : "21",
  "title" : "Shadow Dancing",
  "description" : "Delenn asks the League for ships for a mission, she won't tell them where or when the mission will take place. The League hesitates, but they agree to support her. The fleet manages to prevent an attack by a Shadow Fleet. Franklin finally finds himself, and confronts his inner demons. An unexpected visitor from Sheridan's past arrives."
}, {
  "imdbId" : "0105946",
  "season" : "3",
  "episodeNumber" : "22",
  "title" : "Z'ha'dum",
  "description" : "Sheridan goes to Z'Ha'Dum, to try and prevent the fall of Centauri Prime, and end the Shadow War. Secrets are revealed, and Kosh's warning haunts Sheridan."
}, {
  "imdbId" : "0105946",
  "season" : "4",
  "episodeNumber" : "1",
  "title" : "The Hour of the Wolf",
  "description" : "After the destruction of Z'Ha'Dum, Sheridan: presumed dead, Garibaldi: missing and the fragile alliance against the Shadows is crumbling. Mollari faces the new Emperor, and B5 is in a holding pattern, waiting for the next shoe to drop."
}, {
  "imdbId" : "0105946",
  "season" : "4",
  "episodeNumber" : "2",
  "title" : "Whatever Happened to Mr. Garibaldi?",
  "description" : "G'Kar finds trouble while searching for Garibaldi. Sheridan hovers between life and death."
}, {
  "imdbId" : "0105946",
  "season" : "4",
  "episodeNumber" : "3",
  "title" : "The Summoning",
  "description" : "A mysterious spacecraft heads towards Babylon 5 as Ivanova and Marcus search for more First Ones to aid in the war."
}, {
  "imdbId" : "0105946",
  "season" : "4",
  "episodeNumber" : "4",
  "title" : "Falling Toward Apotheosis",
  "description" : "Refugees from worlds destroyed by the Vorlons descend on Babylon 5."
}, {
  "imdbId" : "0105946",
  "season" : "4",
  "episodeNumber" : "5",
  "title" : "The Long Night",
  "description" : "Sheridan schemes to lure the Shadows into open warfare with the Vorlons."
}, {
  "imdbId" : "0105946",
  "season" : "4",
  "episodeNumber" : "6",
  "title" : "Into the Fire",
  "description" : "Sheridan has managed to get the Vorlons and Shadows into one sector, where they are not attacking each other directly. He and Delenn lead a fleet into the sector where the source of the conflict is finally revealed, this is the end of the Shadow War."
}, {
  "imdbId" : "0105946",
  "season" : "4",
  "episodeNumber" : "7",
  "title" : "Epiphanies",
  "description" : "Earth prepares to shut down Babylon 5."
}, {
  "imdbId" : "0105946",
  "season" : "4",
  "episodeNumber" : "8",
  "title" : "The Illusion of Truth",
  "description" : "ISN reporters come to Babylon 5 to interview the Command staff, and film them for a documentary. The staff is reluctant at first, but they finally agree."
}, {
  "imdbId" : "0105946",
  "season" : "4",
  "episodeNumber" : "9",
  "title" : "Atonement",
  "description" : "While defending her love for Sheridan to the Minbaris, Delenn might be forced to expose an astounding secret."
}, {
  "imdbId" : "0105946",
  "season" : "4",
  "episodeNumber" : "10",
  "title" : "Racing Mars",
  "description" : "Sheridan clashes with Garibaldi. Franklin and Marcus encounter trouble near the Mars resistance camp."
}, {
  "imdbId" : "0105946",
  "season" : "4",
  "episodeNumber" : "11",
  "title" : "Lines of Communication",
  "description" : "Delenn meets the Drakhs for the first time."
}, {
  "imdbId" : "0105946",
  "season" : "4",
  "episodeNumber" : "12",
  "title" : "Conflicts of Interest",
  "description" : "Ivanova prepares for her first resistance broadcast."
}, {
  "imdbId" : "0105946",
  "season" : "4",
  "episodeNumber" : "13",
  "title" : "Rumors, Bargains and Lies",
  "description" : "Delenn meets with Neroon to discuss the war that's torn their planet apart. She proposes a plan but she'll need his support. Sheridan launches an eccentric plan involving misdirection, rumors, etc, to get the League to agree to a new role for the White Star Fleet."
}, {
  "imdbId" : "0105946",
  "season" : "4",
  "episodeNumber" : "14",
  "title" : "Moments of Transition",
  "description" : "The Minbari war between the warrior and the religious castes comes to an end, leading to the formation of a new Grey Council. Bester comes to Babylon 5 to make Lyta an offer. Clark's forces attack a transport convoy carrying thousands of civilians, prompting Sheridan to change strategies."
}, {
  "imdbId" : "0105946",
  "season" : "4",
  "episodeNumber" : "15",
  "title" : "No Surrender, No Retreat",
  "description" : "After Clark's order causes the death of civilians, Sheridan decides it's time to attack Clark's forces directly. First mission is a colony that's being oppressed by some Earth Cruisers. Some in Earth force also distrust Clark, Sheridan might find some allies, amongst those he might be fighting."
}, {
  "imdbId" : "0105946",
  "season" : "4",
  "episodeNumber" : "16",
  "title" : "Exercise of Vital Powers",
  "description" : "Garibaldi meets with his benefactor. He wants to join with Edgar Industries. But his employer wants proof of his commitment. He want Garibaldi's to bring in Sheridan. Meanwhile Franklin finally manages to temporarily revive a telepath that had been captured by the Shadows. He'll need Lyta's help to continue his research"
}, {
  "imdbId" : "0105946",
  "season" : "4",
  "episodeNumber" : "17",
  "title" : "The Face of the Enemy",
  "description" : "Garibaldi sets up Sheridan who is promptly taken into custody by Clark's men. Garibaldi's behavior and what happened to him when he disappeared in his Starfury is revealed."
}, {
  "imdbId" : "0105946",
  "season" : "4",
  "episodeNumber" : "18",
  "title" : "Intersections in Real Time",
  "description" : "Sheridan has been captured. Now he's being tortured for information. How long can he hold out?"
}, {
  "imdbId" : "0105946",
  "season" : "4",
  "episodeNumber" : "19",
  "title" : "Between the Darkness and the Light",
  "description" : "Garibaldi now freed of Bester's influence tries to find allies to free Sheridan. But no one trusts him, not even those who used to call him friend. Now Garbaldi, Franklin, and Lyta try to free Sheridan. Meanwhile Ivanova and Marcus find out Clark has new more powerful ships. They take a contingent of White stars to destroy the new ships, someone will pay a high price for the victory."
}, {
  "imdbId" : "0105946",
  "season" : "4",
  "episodeNumber" : "20",
  "title" : "Endgame",
  "description" : "The battle for Earth concludes as Sheridan leads his forces to Earth to confront Clark's forces in an all out battle. Meanwhile Marcus learns of the alien device Franklin used to heal Garibaldi when he was critically injured. But to save a person's life, someone else must die."
}, {
  "imdbId" : "0105946",
  "season" : "4",
  "episodeNumber" : "21",
  "title" : "Rising Star",
  "description" : "Earth is now free from Clark. Sheridan must now face the new President for his actions. He's forced to resign. Delenn, G'Kar, and Londo offer the Earth President a chance to join the newly formed Inter Stellar Alliance. Garibaldi searches for Lise. Ivanova revives and tries to deal with what her recovery cost someone else."
}, {
  "imdbId" : "0105946",
  "season" : "4",
  "episodeNumber" : "22",
  "title" : "The Deconstruction of Falling Stars",
  "description" : "In the distant future, a man exams key moments in history that have shaped the world. Starting with the formation of the Alliance that was formed on Babylon 5."
}, {
  "imdbId" : "0105946",
  "season" : "5",
  "episodeNumber" : "1",
  "title" : "No Compromises",
  "description" : "Captain Lochley arrives just as preparations are underway for Sheridan's swearing in ceremony as the President of the newly formed Interstellar Alliance. Telepaths arrive seeking a sanctuary while they search for a home world."
}, {
  "imdbId" : "0105946",
  "season" : "5",
  "episodeNumber" : "2",
  "title" : "The Very Long Night of Londo Mollari",
  "description" : "During a heart attack, Londo experiences an epiphany and apologizes to G'Kar."
}, {
  "imdbId" : "0105946",
  "season" : "5",
  "episodeNumber" : "3",
  "title" : "The Paragon of Animals",
  "description" : "Military crises threaten the ongoing formation of the InterStellar Alliance, but Sheridan asserts its power."
}, {
  "imdbId" : "0105946",
  "season" : "5",
  "episodeNumber" : "4",
  "title" : "A View from the Gallery",
  "description" : "A day in the life of 2 maintenance workers on Babylon 5. As crisis arises, they encounter the command staff, and the ambassadors each dealing with the crisis."
}, {
  "imdbId" : "0105946",
  "season" : "5",
  "episodeNumber" : "5",
  "title" : "Learning Curve",
  "description" : "Two Minbari Rangers-in-training come to the station and learn a difficult lesson. A new underworld boss tries to take control of Down-below."
}, {
  "imdbId" : "0105946",
  "season" : "5",
  "episodeNumber" : "6",
  "title" : "Strange Relations",
  "description" : "The secret of Sheridan and Lochley's past marriage is revealed."
}, {
  "imdbId" : "0105946",
  "season" : "5",
  "episodeNumber" : "7",
  "title" : "Secrets of the Soul",
  "description" : "A telepath is assaulted, and the others vow revenge."
}, {
  "imdbId" : "0105946",
  "season" : "5",
  "episodeNumber" : "8",
  "title" : "Day of the Dead",
  "description" : "It is the Brakiri Day of the Dead. They purchase a large section of the station for their holiday. That night everyone in that sector meets with people who have passed away. Most of the inhabitants of the sector are happy to see their loved ones, but Lennier's encounter leaves him with troubling news about his future."
}, {
  "imdbId" : "0105946",
  "season" : "5",
  "episodeNumber" : "9",
  "title" : "In the Kingdom of the Blind",
  "description" : "Byron and other telepaths seek a homeworld of their own."
}, {
  "imdbId" : "0105946",
  "season" : "5",
  "episodeNumber" : "10",
  "title" : "A Tragedy of Telepaths",
  "description" : "Lochley asks Bester for help in dealing with a group of telepaths who have locked themselves in an area of Downbelow."
}, {
  "imdbId" : "0105946",
  "season" : "5",
  "episodeNumber" : "11",
  "title" : "Phoenix Rising",
  "description" : ""
}, {
  "imdbId" : "0105946",
  "season" : "5",
  "episodeNumber" : "12",
  "title" : "The Ragged Edge",
  "description" : "Garibaldi is sent to retrieve a witness to the shipping line attacks from the Drazi homeworld."
}, {
  "imdbId" : "0105946",
  "season" : "5",
  "episodeNumber" : "13",
  "title" : "The Corps Is Mother, the Corps Is Father",
  "description" : "A day in the life of Alfred Bester, who starts his day in Psi Corps HQ, where he is well liked and respected. He gets an assignment to track down a rogue telepath, two recruits accompany him. They follow the telepath's trail to Babylon 5, where he isn't as popular."
}, {
  "imdbId" : "0105946",
  "season" : "5",
  "episodeNumber" : "14",
  "title" : "Meditations on the Abyss",
  "description" : "Vir learns he is the new Centauri ambassador to Babylon 5."
}, {
  "imdbId" : "0105946",
  "season" : "5",
  "episodeNumber" : "15",
  "title" : "Darkness Ascending",
  "description" : "Sheridan finally discovers why Delenn had Lennier assigned to the White Star Fleet, and orders his ship to return. But Lennier takes his fighter and continues his mission, where he finally gets the information the Alliance needs. Lyta contacts G'Kar and reminds him of the offer he made to her in \"The Gathering.\" She's willing to help the Narn in exchange for money to find a home world for telepaths."
}, {
  "imdbId" : "0105946",
  "season" : "5",
  "episodeNumber" : "16",
  "title" : "And All My Dreams, Torn Asunder",
  "description" : "The Alliance show the member worlds evidence of the Centauri actions, while Londo and Vir are in their room with copies of the evidence. Eventually they're let into the meeting, where they all see the evidence Lennier gathered. Sheridan comes up with a plan to peacefully enforce a blockade, but Garibaldi's issues jeopardize his plans."
}, {
  "imdbId" : "0105946",
  "season" : "5",
  "episodeNumber" : "17",
  "title" : "Movements of Fire and Shadow",
  "description" : "Londo and G'Kar return to Centauri Prime to figure out who in the government started the attacks, and are put in jail. G'Kar eventually figures a way for Londo to get out, and Londo tries to gather support. Garibaldi learns of two member worlds's plans to attack Centauri Prime. He informs Sheridan, who rushes off to try and stop the attack. Delenn and Lennier head back to Minbar to convince the council to build new ships, but are attacked in hyperspace. Lyta and Franklin find out what's been controlling the Centauri attack fleet."
}, {
  "imdbId" : "0105946",
  "season" : "5",
  "episodeNumber" : "18",
  "title" : "The Fall of Centauri Prime",
  "description" : "Centauri Prime has been attacked, thousands have died. Londo finds out the truth, who masterminded the war, and why they allowed the attack on Centauri Prime to happen. Londo becomes Emperor, and has to act hostile to those he once called \"friend.\""
}, {
  "imdbId" : "0105946",
  "season" : "5",
  "episodeNumber" : "19",
  "title" : "The Wheel of Fire",
  "description" : "G'Kar returns to the station to find he has become a religious icon. Sheridan confronts Garibaldi about his drinking problems. Lyta is taken into custody for planning attacks on Psi Corps. Delenn collapses, and they find out she's pregnant."
}, {
  "imdbId" : "0105946",
  "season" : "5",
  "episodeNumber" : "20",
  "title" : "Objects in Motion",
  "description" : "Garibaldi and Lise are going to get married, he'll run her late husband's company. An assassin is hired to kill Lise. Zack has a plan to smoke him out, but another person wants G'Kar dead as well. Both attacks are prevented. Garibaldi deals with the people who ordered the hit on Lise. G'Kar and Lyta leave the station."
}, {
  "imdbId" : "0105946",
  "season" : "5",
  "episodeNumber" : "21",
  "title" : "Objects at Rest",
  "description" : "Garibaldi forms a new Board of Directors for his company. Ta'Lon becomes the new Narn ambassador. Sheridan and Delenn leave for Mimbar. An accident on board their White Star ship creates doubt/hesitation for Lennier, who fails to act appropriately. He leaves the ship, and tells Delenn he'll come back one day to atone for what he's done. Sheridan and Delenn are greeted by Londo on Mimbar who has a gift for them."
}, {
  "imdbId" : "0105946",
  "season" : "5",
  "episodeNumber" : "22",
  "title" : "Sleeping in Light",
  "description" : "20 years after he visited Z'Ha'Dum, Sheridan knows his time is short and gathers his old comrades together. Afterwards he takes personalized White Star to Babylon 5 where it's going to be decommissioned shortly. The final leg of his journey takes him to Coriana 6 where they ended the Shadow War, and meets with one last person. The old command staff gather on Babylon 5 to watch its decommissioning."
}]