[{
  "imdbId" : "9708550",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "The Rub (Beginnings - 1933)",
  "description" : "After centuries of percolating in America's immigrant and racial mix, particularly in the American South, what was first called \"hillbilly music\" begins reaching more people through the new technologies of phonographs and radio."
}, {
  "imdbId" : "9708550",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Hard Times (1933 - 1945)",
  "description" : "During the Great Depression and World War II, country music thrives and reaches bigger audiences. Gene Autry sets off a craze for singing cowboys, Bob Wills adapts jazz's Big Band sound to create Texas Swing, and Roy Acuff becomes a star."
}, {
  "imdbId" : "9708550",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "The Hillbilly Shakespeare (1945 - 1953)",
  "description" : "Country music adapts to the cultural changes of post-war society. Bill Monroe and Earl Scruggs transform string band music into Bluegrass. Out of the bars comes a new sound and songs about drinking, cheating, and heartbreak: Honky Tonk."
}, {
  "imdbId" : "9708550",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "I Can't Stop Loving You (1953 - 1963)",
  "description" : "In Memphis, the confluence of blues and hillbilly music at Sun Studios gives birth to \"rockabilly,\" the precursor of rock and roll. Elvis Presley and Johnny Cash are at the forefront. Nashville has become Music City USA."
}, {
  "imdbId" : "9708550",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "The Sons and Daughters of America (1964 - 1968)",
  "description" : "Country music artists like Loretta Lynn, Merle Haggard and Charley Pride reflect a changing America as they appeal to wide audiences."
}, {
  "imdbId" : "9708550",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Will the Circle Be Unbroken? (1968 - 1972)",
  "description" : "Country music draws artists to Nashville, Tennessee as the war in Vietnam rages on; Kris Kristofferson sets a new lyrical standard; Bob Dylan, The Byrds and other rock and pop artists come to Nashville to record."
}, {
  "imdbId" : "9708550",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Are You Sure Hank Done It This Way? (1973 - 1983)",
  "description" : "The 1970s to early 80s are a vibrant time in country, with Dolly Parton finding mainstream success; Hank Williams Jr. and Rosanne Cash emerging from their fathers' shadows; and Willie Nelson and Waylon Jennings starting the \"Outlaw\" style."
}, {
  "imdbId" : "9708550",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Don't Get Above Your Raisin' (1984 - 1996)",
  "description" : "\"New Traditionalist\" country music artists such as George Strait, Randy Travis and the Judds keep country music true to its roots. Plus the rise of superstar Garth Brooks and the return of Johnny Cash to the industry he helped create."
}]