[{
  "imdbId" : "0092468",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Pilot",
  "description" : "After the platoon are hit in a nighttime raid, Sgt. Anderson recruits some fresh troops before going on a mission to find the enemy units that hit them."
}, {
  "imdbId" : "0092468",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Notes from the Underground",
  "description" : "A U.S. Platoon on reconnaissance patrol with Goldman's platoon is ambushed by the NVA, the enemy soldiers appearing to vanish before Goldman and his men can intersect them, the inexperienced Lieutenant mistakenly calling fire on the surviving members of the other platoon as they emerge from the heavy undergrowth. Dispersed to an adjacent village and amid further tension between Anderson and Goldman, the platoon find the village deserted. Marcus Taylor, a slick, fast talking black private disappears and the platoon discovers evidence of the enemy's vast underground ..."
}, {
  "imdbId" : "0092468",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Dislocations",
  "description" : "Bravo Company are tasked with moving the inhabitants of a village to a safer location. When all does not go according to plan they get some unexpected help."
}, {
  "imdbId" : "0092468",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "War Lover",
  "description" : "Bravo Company have to team up with a gung-ho special forces team in order to destroy a bridge. Bravo Company discovers that things are not always black and white in war."
}, {
  "imdbId" : "0092468",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Sitting Ducks",
  "description" : "After getting what they think is an easy mission, Bravo Company discover that the village that they are protecting is surrounded by the enemy. What's more, the enemy seem to know their every move."
}, {
  "imdbId" : "0092468",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Burn Baby, Burn",
  "description" : "After a series of incidents, racial divisions develop within Bravo Company. When one of the men is found dead, Johnson is suspected, making matters worse."
}, {
  "imdbId" : "0092468",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Brothers, Fathers, and Sons",
  "description" : "Anderson, Johnson and Baker's Huey is downed. They find an orphaned baby while fleeing a father with a vengeance."
}, {
  "imdbId" : "0092468",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "The Good, the Bad, and the Dead",
  "description" : "When a drunken Sgt is arrested for stealing a jeep, Anderson recognizes the soldier as his old sergeant. After recommending him to the Lt, he organizes to have him drafted to the platoon. Anderson's new addition soon creates problems for the whole group on their first patrol due to his willful disobedience and lax attention to regulations."
}, {
  "imdbId" : "0092468",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "Battling Baker Brothers",
  "description" : "When Baker's twin brother visits Bravo Company on their birthday a misunderstanding drives a wedge between them. Things get complicated when Baker's brothers helicopter is shot down and Baker believes that his brother is still alive."
}, {
  "imdbId" : "0092468",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "Nowhere to Run",
  "description" : "The troops are under attack by the VC. Percell accidentally kills an unarmed boy. Lt. Goldman reconnects with an old flame."
}, {
  "imdbId" : "0092468",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "Roadrunner",
  "description" : "Anderson receives a letter from his wife telling him that their three year old daughter is asking about him. He fights back tears and asks the chaplain if he could send his daughter a letter telling her he loves her and misses her. Lt. Goldman tells him they must go to the Don Ho Valley to recon any pilot that lands in their area. He's against it as his company were almost wiped out last time he was there. They go and teach a downed pilot surrounded by a company of VC."
}, {
  "imdbId" : "0092468",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "Pushin' Too Hard",
  "description" : "The platoon is visited by reporter Vickie Adams. She joins them on a patrol."
}, {
  "imdbId" : "0092468",
  "season" : "1",
  "episodeNumber" : "13",
  "title" : "USO Down",
  "description" : "After a group of performers' chopper crashes the team ventures out to bring them back to safety, which leads to some unexpected developments."
}, {
  "imdbId" : "0092468",
  "season" : "1",
  "episodeNumber" : "14",
  "title" : "Under Siege",
  "description" : "The platoon is assigned to defend Firebase Ladybird at the beginning of the 1968 Tet Offensive. At the same time they come under siege by NVA soldiers, they are assigned a new, ambitious commander who complicates an already dangerous situation."
}, {
  "imdbId" : "0092468",
  "season" : "1",
  "episodeNumber" : "15",
  "title" : "Soldiers",
  "description" : "When Purcell's father had a heart attack in Honolulu, Ruiz and Taylor change their R&R to Honolulu to give Purcell support. They are confronted by the anti-war attitudes and demonstrations back home. Purcell is shocked by the veterans' ward at the hospital, while he deals with his feelings towards his father, who has left his mother and has taken up with a younger woman."
}, {
  "imdbId" : "0092468",
  "season" : "1",
  "episodeNumber" : "16",
  "title" : "Gray-Brown Odyssey",
  "description" : "Lt. Caffrey temporarily loses his sight when his Jeep hits a mine. Horn leaves him with a female VC soldier and goes for help. Caffrey and the woman walk out when the woman asks a local woman who came across them. During their escape, Caffrey regains his sight after a dunking in a river, but the woman is shot by other VC chasing them."
}, {
  "imdbId" : "0092468",
  "season" : "1",
  "episodeNumber" : "17",
  "title" : "Blood Brothers",
  "description" : "General Goldman, Lt. Goldman's father, is on base on a fact-finding mission. He agrees that Myron has disobeyed orders by withdrawing rather than advancing against his better judgment toward what appeared to be a burned-out NVA facility. It turned out that the NVA were dug in a bit further on the trail. A pal of Ruiz tripped a wire and was killed. He was high on heroin. Sent to chill out with Sgt. Ecksley in supply, Ruiz discovered that Ecksley was selling Army goods in the black market and enabling soldiers to score heroin through the local drug lord. General Goldman..."
}, {
  "imdbId" : "0092468",
  "season" : "1",
  "episodeNumber" : "18",
  "title" : "The Short Timer",
  "description" : "Taylor is a short timer, anxious to go back to Detroit. However, as the time for him to leave nears, he is less sure that he wants to leave his friends in Nam."
}, {
  "imdbId" : "0092468",
  "season" : "1",
  "episodeNumber" : "19",
  "title" : "Paradise Lost",
  "description" : "Bravo Company was saved from a group of VC by some Montagnards, who then brought the guys back to their village, home of a former Special Forces agent. Brigade determined that Bravo Company should train the villagers on weapons. The Special Forces agent opposes giving the tribe the weapons, as it will cause them to become a target. Brigade wants the Montagnards to cut off the VC trail running near the village. Bravo Company runs afoul of a local martinet who takes out his anger on the village."
}, {
  "imdbId" : "0092468",
  "season" : "1",
  "episodeNumber" : "20",
  "title" : "Angel of Mercy",
  "description" : "Lt. Goldman is shot loading a captured, injured VC colonel onto a helicopter. At the base hospital, he learns that Nikki Raines, the nurse he is in love with, had an abortion and she wants to break up with him because he is a soldier, a bad risk. The ARVN aide to the intelligence officer who wants to question the VC colonel tries to kill the colonel so that he cannot reveal the plans for a big offensive at the Tet."
}, {
  "imdbId" : "0092468",
  "season" : "1",
  "episodeNumber" : "21",
  "title" : "The Hill",
  "description" : "Bravo Company takes Hill 1000 - again - and finds no trace of the enemy. All the men, especially Horn, question why they take a hill suffering casualties and then abandon it, only to be required to take it again. A day or so later, a helicopter spraying Agent Orange is shot down, and Bravo Company again goes up Hill 1000 through the dripping Agent Orange. Horn walked down the hill but decides that his friends are worth fighting for. Horn is wounded throwing explosives into the VC bunker. And then the men are ordered yet again to abandon the hill. Medals are handed out..."
}, {
  "imdbId" : "0092468",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "Saigon: Part 1",
  "description" : "Pilot Lt. McKay says rock 'n roll is here to stay and blasts it from his chopper. He flies back to where Bravo Company is pinned down by VC and joins the fight from the air, playing rock 'n roll the whole time. Alex Devlin, a reporter, is working a drug story but learns from Jake Bridger, the owner of a hotel in Saigon, that there has been a big increase in VC activity all around with the Tet coming. Taylor and Johnson want to invest in a hotel chain with Bridger, even though Anderson warns them that Bridger is a hustler. Anderson meets with his ex-wife in Saigon."
}, {
  "imdbId" : "0092468",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "Saigon: Part 2",
  "description" : "Carol Anderson informs Zeke that she is marrying a nice guy; he wants her to be happy. Stacy Bridger travels to Saigon to meet her father, Sgt. Jake Bridger. He was killed by VC a week before. Except Bridger is in hiding and getting information about the VC to pass on to Command. McKay sends Goldman on a wild goose chase down the Fu Loc Highway so that he could be alone with Alex; McKay didn't know VC were all over the area. He flew to the rescue. That night, the VC launch a coordinated attack in Saigon, on Tan Son Nhut (the American base), and in cities throughout ..."
}, {
  "imdbId" : "0092468",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "For What It's Worth",
  "description" : "Soldiers need someone to talk to regarding the horrors they experience. Tan Son Nhut has a priest who is there to listen. The Army also has a contract with a psychologist, Dr. Jennifer Seymour. A fragger kills the priest, making the base paranoid. Anderson listens to tapes of Dr. Seymour's notes about her patients and figures out who the fragger is, saving lives by doing so. Yet Dr. Seymour is angry that he violated her patients' privacy."
}, {
  "imdbId" : "0092468",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "True Grit",
  "description" : "Battle fatigue can be totally enervating. McKay verbally abuses a soldier in the field who could not let go of a tree and get into the helicopter; they manage to get him into the chopper and back to base where Dr. Seymour deals with him. The policy is to get men without casualties back in to the field as soon as possible, but Anderson requests that Dr. Seymour find a way not to send Martsen back to the field. The major in the psych ward orders Martsen back to active duty, and he is shot in the next skirmish. Ruiz finally goes to see Dr. Seymour about his view that he ..."
}, {
  "imdbId" : "0092468",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "Non-Essential Personnel",
  "description" : "Bravo Company gets a new lieutenant, as Lt. Goldman is the new press officer for Major Darling. Lt. Escobar is shot and brought back by Ruiz. Lt. Escobar comes from a family with connections, and his father arranges for an early out for Escobar - and Ruiz. Ruiz turns him down. McKay and Bravo Company pick up two additional injured soldiers who had items for Major Darling apparently looted from a temple. Major Darling grounds McKay for doing this. Devlin picks up the story about the artifacts and offers a deal to Darling: he is to quit looting and he is to put Goldman ..."
}, {
  "imdbId" : "0092468",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "Sleeping Dogs",
  "description" : "Sgt. Block is a sniper who has gone off the deep end. Anderson tries to help him by seeking a promotion for him that will take him out of the jungle. Sgt. Major Toliver stand in the way, and Block kills him. Anderson goes into the jungle for Block."
}, {
  "imdbId" : "0092468",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "I Wish It Would Rain",
  "description" : "The United States does not go into Cambodia."
}, {
  "imdbId" : "0092468",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "Popular Forces",
  "description" : "The U.S. Army is training South Vietnamese soldiers. They prove resourceful and reliable. Dr. Seymour shoots a VC and has trouble with her feelings. Alex chases a story about orphans and survives a VC attack on their compound."
}, {
  "imdbId" : "0092468",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "Terms of Enlistment",
  "description" : "Dr. Seymour is offered a direct commission as a major and a posting at Fort Sam Houston to teach her methodologies. PFC Thayer admits to Dr. Seymour that he is a homosexual. The Army doesn't allow homosexuals and it doesn't allow officers to fraternize with non-officers. To take the men's attention away from Thayer's attempted suicide, they set up a boxing match. Taylor promotes Woods to box. Woods, though, is hesitant because he will lose his amateur status, as the fight is not sanctioned. Taylor's conscience bothers him, but Woods proceeds with the match. When Woods..."
}, {
  "imdbId" : "0092468",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "Nightmare",
  "description" : "In a VC village, Purcell shoots a VC and Bravo Company rescues a Quaker woman who is providing care for children in the village. She takes a little girl back to Saigon to find her mother. There, Purcell interrupts two Vietnamese trying to rape the Quaker woman. In his struggle with one of the men, the Vietnamese man is killed with his own gun, but the Quaker woman will not testify that Purcell was acting in self defense. The little girl's mother witnessed the fight, however, and Anderson, with the help of the widow of his friend who was killed in action, persuades the..."
}, {
  "imdbId" : "0092468",
  "season" : "2",
  "episodeNumber" : "11",
  "title" : "Promised Land",
  "description" : "Anderson has to bring the body of a (black) soldier to the U.S. and meet with his family. And it all coincides with the recent assassination of Martin Luther King. At the same time several of the black soldiers are reeling from it and the Lieutenant in charge of these men who is black, tries to get them to go on. When they disobey his orders, he considers action but Goldman tries to talk him out of it."
}, {
  "imdbId" : "0092468",
  "season" : "2",
  "episodeNumber" : "12",
  "title" : "Lonesome Cowboy Blues",
  "description" : "The platoon must find a leak in a top secret operation. The only lead, Sgt Jackson, turns up dead. A Vietnamese boy is shot by VC while leading the team to Jackson and later accused of being the informant for the VC. Anderson and Goldman must find the true leak."
}, {
  "imdbId" : "0092468",
  "season" : "2",
  "episodeNumber" : "13",
  "title" : "Sins of the Fathers",
  "description" : "Zeke has to do some soul-searching after he kills a female sniper in self-defense. Someone is killing Saigon prostitutes and Alex is determined to get to the bottom of the story, contrary to Goldman's feelings."
}, {
  "imdbId" : "0092468",
  "season" : "2",
  "episodeNumber" : "14",
  "title" : "Sealed with a Kiss",
  "description" : "Zeke is being recruited for private mercenary work. Alex investigates Pentagon waste. She's desperate for Myron to take a desk job but he's scheduled to lead his men on a joint operation with the SEALs."
}, {
  "imdbId" : "0092468",
  "season" : "2",
  "episodeNumber" : "15",
  "title" : "Hard Stripe",
  "description" : "The platoon is on patrol when they encounter CIA operative Jim Doyle in the Free Fire Zone. He conscripts them to carry back a new Russian rifle. Lt. Goldman suspects that he's in business for himself after two men are killed by an ambush."
}, {
  "imdbId" : "0092468",
  "season" : "2",
  "episodeNumber" : "16",
  "title" : "The Volunteer",
  "description" : "Zeke struggles to get through the military bureaucracy. SPC Sweet volunteers to help him in exchange for a place in his platoon to go out into the field."
}, {
  "imdbId" : "0092468",
  "season" : "3",
  "episodeNumber" : "1",
  "title" : "The Luck",
  "description" : "Anderson and Goldman are listed MIA in the aftermath of an artillery strike. The platoon, McKay, and Alex Devlin deal with the loss in different ways. Johnson gets promoted to sergeant and has to fill in the shoes of Zeke. Alex Devlin wants to put Vietnam and Myron behind her and accepts a position as correspondent in Paris. Anderson and Goldman in fact have been taken POW. In a stopover village they figure out where they are and realize that they are ferried northwards. They need to escape because their chances to make it back to their own lines are dwindling."
}, {
  "imdbId" : "0092468",
  "season" : "3",
  "episodeNumber" : "2",
  "title" : "Doc Hock",
  "description" : "With Goldman recovering and transferring to Intelligence, Anderson meets the replacement Lieutenant Miller, who is keen on appearance by the book, which is something the new medic, Francis Hockenbury, takes lightly. Alex Devlin gets the rare opportunity to interview NVA General Thoc in the tunnels. After surviving a B-52 strike on the complex, she is happy to be back in Saigon and spend her last night with Myron."
}, {
  "imdbId" : "0092468",
  "season" : "3",
  "episodeNumber" : "3",
  "title" : "The Ties That Bind",
  "description" : "The platoon is transferred to Camp Barnett MACV-SOG from where they will conduct unconventional warfare and counter-insurgency operations. Zeke Anderson is not extending his tour and uses his saved up free time to return to the US earlier to go see his daughter Katie for the first time in 2 years. The squads' first assignment is to snatch a VC tax collector. Myron, mourning the loss of Alex, is distracted, and Johnson is trying to adjust to his role as the new \"sarge\"."
}, {
  "imdbId" : "0092468",
  "season" : "3",
  "episodeNumber" : "4",
  "title" : "Lonely at the Top",
  "description" : "The platoon is searching for a recon-squad that disappeared. During the various patrols Johnson's leadership abilities are severely put to the test and he has doubts whether he still got the edge. Zeke meets up with Jennifer Seymour and proposes to marry her. She says yes to share her life with Zeke, but she also senses that Anderson isn't ready yet to end the life he shared with his men in Vietnam."
}, {
  "imdbId" : "0092468",
  "season" : "3",
  "episodeNumber" : "5",
  "title" : "A Bodyguard of Lies",
  "description" : "Lt Beller -a friend of Goldman- and his platoon function as a blocking force, while Goldman's squad searches for weapons and the enemy in several villages. Beller is disillusioned and his platoon is war weary, due to time in combat, casualties, and not getting results. During a search Anderson and Goldman hear gunfire, then run into Beller, in the nearby village of Phu An. Percell is strung out from the war and the drugs he is taking affect his mood and fighting ability."
}, {
  "imdbId" : "0092468",
  "season" : "3",
  "episodeNumber" : "6",
  "title" : "A Necessary End",
  "description" : "The squad is deep in enemy territory kidnapping a high-ranking NVA officer. Percell is not with them, after spending the night in jail. He is fed up with the military and, despite Ruiz's efforts, deserts. McKay helps out an orphanage run by nuns. He is happy being useful in a different way for a change, until he witnesses a Buddhist commits suicide in the streets. The Army wants to keep the Phu An massacre quiet; Beller's platoon is dissolved and Beller and his men are transferred to other units."
}, {
  "imdbId" : "0092468",
  "season" : "3",
  "episodeNumber" : "7",
  "title" : "Cloud Nine",
  "description" : "The guys yank Percell out of Cholon. Although safe from being branded a deserter, he now has to face drug withdrawal symptoms for the next days. The platoon is tasked in finding out how the NVA is getting truckloads of supplies into an area without roads. Colonel Brewster learns that the Army isn't doing anything regarding the massacre at Phu An and has no other option then to go to the press."
}, {
  "imdbId" : "0092468",
  "season" : "3",
  "episodeNumber" : "8",
  "title" : "Thanks for the Memories",
  "description" : "With Thanksgiving as a backdrop; Colonel Brewster's decision to go to the press about the Phu An massacre lands him a lot of trouble with the higher echelon, especially when he goes on the record with journalist Sid Boyle. Percell -after his cold turkey- is physically fine, but psychologically still shaken. Goldman, Zeke and the squad are gathering evidence for Colonel Brewster's theory that the NVA must have fuel storage dumps at regular intervals along the Ho Chi Minh trail."
}, {
  "imdbId" : "0092468",
  "season" : "3",
  "episodeNumber" : "9",
  "title" : "I Am What I Am",
  "description" : "Goldman's father shows up and after telling him he doesn't have long to live, they start talking and get to know each other for the first time in years. Johnson becomes a short-timer, and his friends in the platoon want to know his plans. Ruiz gets acquainted with Susana, an OR-assistant. The squad tries to get an enemy helicopter in order to destroy it or possibly fly it back. Percell goes along but keeps a low profile, but proves he hasn't lost his edge after encouragement by \"Doc\" Hockenbury."
}, {
  "imdbId" : "0092468",
  "season" : "3",
  "episodeNumber" : "10",
  "title" : "World in Changes",
  "description" : "An elusive NVA sniper makes life hard for everybody, but particular for McKay as the sniper targets helicopters. The squad assists ruthless CIA-operative Duke Fontaine in removing an important VC official from the ranks. The mission becomes complicated when Taylor and Johnson are captured by the VC."
}, {
  "imdbId" : "0092468",
  "season" : "3",
  "episodeNumber" : "11",
  "title" : "Green Christmas",
  "description" : "As Bravo Company returns from a mission, they are interviewed by a television reporter. Sgt. Hannagan has received a pile of wrapped presents from groups back home. Bravo Company decides that the presents should go to the orphanage as Hannagan had told the television reporter. Hannagan tries to prevent that from actually happening, but Percell, Ruiz, and Taylor take the presents and load them onto a truck. Nurse Susanna Lozada is grieving a soldier they lost on the operating table. Ruiz comforts her and invites her to the Christmas party at the orphanage. She and ..."
}, {
  "imdbId" : "0092468",
  "season" : "3",
  "episodeNumber" : "12",
  "title" : "Odd Man Out",
  "description" : "Bravo Company is sent into the bush to rescue the wife of a local potentate who is denying the Army access to use their artillery until she is home. Bravo Company finds her and learns that she ran away to her home village and was kidnapped from there. The home villagers don't want her around because the VC punish them because she is there. She has nowhere to go. She is sick and they are being chased by VC. So Bravo Company takes her back to her village. The VC attack. The woman dies. Lt. Goldman and Taylor take her baby girl to her husband, who refuses to accept her."
}, {
  "imdbId" : "0092468",
  "season" : "3",
  "episodeNumber" : "13",
  "title" : "And Make Death Proud to Take Us",
  "description" : "Bravo Company gets 15 newbies and is sent into the bush to set sensors along a train and to reestablish a base. Anderson's group, reestablishing the base, is attacked by VC, and Goldman's group cannot get to them. Likewise, there is no air support to be had before the next morning. One of the newbies, Griner, is from South Carolina, and Taylor immediately decides he is racist. Griner proves himself an excellent shot, which Taylor recognizes and appreciates. Another newbie, Bell, from Texas, looks very young and is, in fact, only 15."
}, {
  "imdbId" : "0092468",
  "season" : "3",
  "episodeNumber" : "14",
  "title" : "Dead Man Tales",
  "description" : "In their quest to capture or kill the sniper that has been picking off Americans at Camp Bennett, several Americans die by friendly fire as McKay attempts to support Goldman's patrol who had come under fire. After the sniper shoots at McKay again, he takes off into the bush to track him down. McKay finds the sniper's tree and stakes it out. Doc Hockenbury meets a local girl, Tien Ly, and goes to her house for dinner."
}, {
  "imdbId" : "0092468",
  "season" : "3",
  "episodeNumber" : "15",
  "title" : "Road to Long Binh",
  "description" : "Camp Barnett is suffering from food poisoning, affecting everyone except Lt. Goldman and Sgt. Anderson. As a result, they have to go pick up a deserter, SSG Jonathan Digby, an outstanding soldier Anderson knew in Germany."
}, {
  "imdbId" : "0092468",
  "season" : "3",
  "episodeNumber" : "16",
  "title" : "Acceptable Losses",
  "description" : "Bravo Company has to leave four men behind - Taylor, Ruiz, Wozniak, and Lamb who was killed. McKay takes Goldman, Anderson, and Duke Fontaine back to pick them up. However, some VC get Lamb's radio and lure the chopper in. Taylor, Ruiz, and Wozniak see the VC doing this and release other smoke, and McKay has to leave them behind again. \"Pop\" Scarlett joins Bravo Company."
}, {
  "imdbId" : "0092468",
  "season" : "3",
  "episodeNumber" : "17",
  "title" : "Vietnam Rag",
  "description" : "Taylor and Ruiz have been MIA for three weeks. Bravo Company gets a slew of newbies and returns to its previous platoon status of going out on reconnaissance. A photojournalist is embedded with Bravo Company."
}, {
  "imdbId" : "0092468",
  "season" : "3",
  "episodeNumber" : "18",
  "title" : "War Is a Contact Sport",
  "description" : "Hockenbury refuses to shoot a VC, resulting in the death of an American soldier. As a result, Hockenbury is ostracized. Col. Brewster is back because he has managed to get an investigation of the village massacre. Ruiz and Taylor get back to the base. Goldman, McKay, and Anderson lead men into the bush to find a depot. They find what appears to be an empty village, not on any maps, no animals or dung, and find a tank and the men to operate it."
}, {
  "imdbId" : "0092468",
  "season" : "3",
  "episodeNumber" : "19",
  "title" : "Three Cheers for the Orange, White and Blue",
  "description" : "The board of inquiry convenes. Anderson leads the men, including Pop Scarlet and his son Spc. Robby Scarlet, into the bush where Agent Orange is being sprayed. They arrive at a village that had been sprayed previously; the people do not look very healthy. Later, back at base, Griner gets a very itchy rash. In the barracks, Hockenbury blames it on the Agent Orange, but none of the guys believe him."
}, {
  "imdbId" : "0092468",
  "season" : "3",
  "episodeNumber" : "20",
  "title" : "The Raid",
  "description" : "Hockenbury, who moved out of the barracks and into a room in the dispensary, joins Bravo Company at mess, but he is still ostracized. Col. Brewster has developed a very sensitive mission in which he expects perhaps heavy casualties. Even though Goldman, Percell, and Ruiz are short, all the men volunteer. Fontaine is the intelligence liaison. Also, Air Force Major Chapman, who escaped three months previously from a prison camp in Hanoi, is also part of the mission. The mission: to raid a POW camp and bring home 38 guys."
}, {
  "imdbId" : "0092468",
  "season" : "3",
  "episodeNumber" : "21",
  "title" : "Payback",
  "description" : "Two months or so after the raid on the POW camp, Percell, Ruiz, Griner, and McKay are home and out of the military. Adjustment is difficult. Back at Camp Barnett, Goldman, Anderson, and Taylor are dealing with new men."
}]