[{
  "imdbId" : "0112178",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Caretaker",
  "description" : "While pursuing the trail of Maquis rebels, a newly commissioned Starfleet ship gets pulled to the far side of the galaxy."
}, {
  "imdbId" : "0112178",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Parallax",
  "description" : "Voyager has set a course for home, repairs are underway, and it's time to pick personnel to fill vital crew positions. Tempers are turbulent as the Starfleet crew absorbs the undisciplined Maquis. Neelix finds his place as chef and Kes builds the airponics bay. Paris does double duty as Conn Officer and Field Medic. Chakotay recommends Torres for Chief Engineer, but Janeway isn't convinced she can exhibit the professionalism of a Starfleet officer. All must put opinions aside when Voyager mounts a rescue of a ship caught in a quantum singularity, only to find the ship..."
}, {
  "imdbId" : "0112178",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Time and Again",
  "description" : "The Voyager crew discovers a planet which recently suffered a horrific catastrophe. Upon investigation, Janeway and Paris are sent back in time before the disaster and are faced with the decision of whether to try to stop it."
}, {
  "imdbId" : "0112178",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Phage",
  "description" : "With dilithium reserves running low, Janeway follows Neelix's advice and proceeds to the nearest known supply. When they arrive in orbit, scans reveal a massive supply; however when the away team transports down to the planet there is none there. Completely confused, Commander Chackotay orders the away team back to Voyager but before they return to Voyager, Neelix is attacked by an alien who removes his lungs. The EMH then comes up with a solution - holographic lungs, but this means that Neelix has to stay in a restraint whilst he has the lungs and he is unable to ..."
}, {
  "imdbId" : "0112178",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "The Cloud",
  "description" : "With power reserves running low, the crew of Voyager alters course to enter a nebula in which there is a usable power source or \"coffee\" as Captain Janeway puts it. However, once they enter the nebula they encounter numerous problems; they are attacked by an unknown substance that cripples every defense system on the ship, forcing the crew to retreat out of the nebula, losing 11% of their power reserves. The crew later discovers that the nebula was not a real nebula, but was in fact, a life form. The crew returns to the nebula to help the creature recover after the ..."
}, {
  "imdbId" : "0112178",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Eye of the Needle",
  "description" : "The Voyager crew detects a wormhole in the Delta quadrant, and immediately changes course with hopes it will provide passage home. Upon reaching the opening, the find it to be too small for the ship, but large enough to establish contact with a ship in the Alpha quadrant."
}, {
  "imdbId" : "0112178",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Ex Post Facto",
  "description" : "The Baneans wrongfully convict Tom Paris of murder. Technology plus the Banean physiology can access someone's last experiences before death and the evidence shows Tom killing a jealous husband. His sentence is to re-live his crimes through his victim's eyes every 14 hours for life."
}, {
  "imdbId" : "0112178",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Emanations",
  "description" : "A Voyager sensor scan reveals what seems to be a previously undiscovered chemical element in a group of asteroids. Some of the asteroids support a class M environment so, an away team is dispatched to investigate. The away team discovers the asteroid to be a burial ground for an unknown culture. Chakotay, a Native American, advocates a respectful, unintrusive perusal of the bodies and their bizarre web-like enclosures. The unknown new chemical apparently is a bi-product of the bodies' decomposition process. The away team detects a peculiar phenomenon developing and ..."
}, {
  "imdbId" : "0112178",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "Prime Factors",
  "description" : "The crew encounters a hedonistic alien race with the ability to travel through the galaxy at will -- an ability that may be the key to Voyager's returning home."
}, {
  "imdbId" : "0112178",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "State of Flux",
  "description" : "Voyager answers a distress call from a Kazon-Nistrim ship, to find all but one of the crew dead in an explosion. Investigation uncovers the Kazon were experimenting with Federation technology acquired from a traitor on Voyager. The Doctor proves Ensign Seska is not really a Bajoran."
}, {
  "imdbId" : "0112178",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "Heroes and Demons",
  "description" : "After Harry Kim disappears during his 'Beowulf' holonovel program, Chakotay and Tuvok are sent to investigate and they disappear. Not wanting to lose any more crew-members, the Doctor is transfered to the holodek to investigate."
}, {
  "imdbId" : "0112178",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "Cathexis",
  "description" : "Energy beings from a nebula displace Chakotay's consciousness from his body. The Doctor pronounces him brain-dead and B'Elanna turns to Chakotay's cultural beliefs to try to bring him back. Meanwhile, Chakotay's spirit roams the ship and infiltrates crew members in an attempt to warn his shipmates of the dangers of the nebula, but they mistake his efforts as a malicious alien manipulation."
}, {
  "imdbId" : "0112178",
  "season" : "1",
  "episodeNumber" : "13",
  "title" : "Faces",
  "description" : "Lieutenants Paris, Torres, and Durst are imprisoned by the Vidiians. In an attempt to develop a cure for the phage, a Vidiian doctor splits the bi-racial Torres into two people (one Klingon and one Human) because he believes Klingons are immune to the Phage. The two Torreses escape the prison compound, but the Klingon Torres is fatally injured protecting the Human Torres while the Human Torres cracks the Vidiiam computer to escape. Before her death, the Klingon Torres tells her Human half that showing courage makes her death honorable. The Doctor tells the Human ..."
}, {
  "imdbId" : "0112178",
  "season" : "1",
  "episodeNumber" : "14",
  "title" : "Jetrel",
  "description" : "Neelix is diagnosed with a fatal illness by a Haakonian named Ma'Bor Jetrel. This man is the same one who developed a doomsday weapon that destroyed a Talaxian moon and killed Neelix's family."
}, {
  "imdbId" : "0112178",
  "season" : "1",
  "episodeNumber" : "15",
  "title" : "Learning Curve",
  "description" : "While Voyager's mixed Starfleet/Maquis crew seem to be working out, a few rogue Maquis are fighting the integration. Chakotay selects the most resistant of the group and Tuvok decides to put the rebels through boot-camp, Tuvok style. Meanwhile, Voyager's bio-neural circuitry is afflicted by a viral infection stemming from Neelix's cooking."
}, {
  "imdbId" : "0112178",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "The 37's",
  "description" : "Voyager answers an ancient SOS distress and finds 8 humans - including Amelia Earhart - in cryo-stasis on a nearby planet. There are thousands more Humans living in cities nearby, descendants of Humans abducted from Earth in 1937 by a race seeking to use them as slaves. Both sides are happy to find some answers and new friends. When Voyager's crew is invited to stay and live on the \"new\" Earth, Janeway is worried so many will accept she may find herself the only one who truly wants to get home."
}, {
  "imdbId" : "0112178",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "Initiations",
  "description" : "Chakotay is captured by a young Kazon who is undergoing a manhood ritual."
}, {
  "imdbId" : "0112178",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "Projections",
  "description" : "The program for the Emergency Medical Hologram is activated due to what the computer describes as a ship-wide emergency. When the Doctor asks the computer to scan for the crew, he learns that they were all forced to abandon ship. Later, he encounters Torres, who says that she and the Captain stayed behind to stop a warp core breach caused by a Kazon attack; the remaining crew escaped in lifepods. Informed that the injured captain needs his assistance, the Doctor is sent to the Bridge, courtesy of new holo-emitters installed throughout the ship. After reviving Janeway,..."
}, {
  "imdbId" : "0112178",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "Elogium",
  "description" : "Voyager encounters new life forms that have a very unusual attraction to the ship. Meanwhile Kes's reproductive cycle, called \"the elogium\", is mysteriously triggered. She is not prepared for it, as she is too young. But the elogium occurs only once in the Ocampans' short lifespans, and if she wants to have a child, it must be now."
}, {
  "imdbId" : "0112178",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "Non Sequitur",
  "description" : "Harry Kim wakes up in San Francisco having never been assigned to Voyager which Starfleet considers lost."
}, {
  "imdbId" : "0112178",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "Twisted",
  "description" : "Voyager encounters a non-corporeal, sentient, space-dwelling life-form which is interested in communicating with and learning more about the ship and its people. Too bad it couldn't just say that. As the being passes through the ship, it upsets computer control, communications, and more bizarrely, distorts the physical arrangement of its decks and sections. When the being passes, so does the crew's fear and confusion, and the curious creature deposits a massive chunk of information into Voyager's computer memory banks."
}, {
  "imdbId" : "0112178",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "Parturition",
  "description" : "After a disagreement over Kes, Neelix and Tom Paris are trapped together on an alien planet and must work together so that they and their alien baby ward can survive."
}, {
  "imdbId" : "0112178",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "Persistence of Vision",
  "description" : "The Voyager crew enters a new region of space and begins to see hallucinations. The Captain sees her holonovel characters come to life."
}, {
  "imdbId" : "0112178",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "Tattoo",
  "description" : "Finding a familiar cultural symbol on an away mission, Chakoaty connects with an experience he had as a child and tries to contact his spirit people."
}, {
  "imdbId" : "0112178",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "Cold Fire",
  "description" : "Ten months after The Caretaker stranded Voyager in the Delta Quadrant, the ship encounters the alien's mate and a station full of Ocampa with heightened psychic powers. Kes, swept up by the possibility of expanding her own abilities, learns just how turbulent and potent they can be. The female Caretaker seeks revenge on Voyager, blaming Janeway for the death of her mate."
}, {
  "imdbId" : "0112178",
  "season" : "2",
  "episodeNumber" : "11",
  "title" : "Maneuvers",
  "description" : "After the Kazon steal some Federation technology Chakotay goes after them on his own and is captured."
}, {
  "imdbId" : "0112178",
  "season" : "2",
  "episodeNumber" : "12",
  "title" : "Resistance",
  "description" : "Disguised while on an away mission Captain Janeway is rescued by a man who thinks that she is his daughter."
}, {
  "imdbId" : "0112178",
  "season" : "2",
  "episodeNumber" : "13",
  "title" : "Prototype",
  "description" : "Voyager finds an automated life-form adrift in space. When B'Elanna Torres reactivates it, the unit realizes she may be able to help build more of its kind. The robot kidnaps Torres and gives her an ultimatum: build a working prototype or Voyager will be destroyed."
}, {
  "imdbId" : "0112178",
  "season" : "2",
  "episodeNumber" : "14",
  "title" : "Alliances",
  "description" : "Janeway tries to make an alliance with a Kazon sect for their own protection and so they can continue their journey through the Delta Quadrant."
}, {
  "imdbId" : "0112178",
  "season" : "2",
  "episodeNumber" : "15",
  "title" : "Threshold",
  "description" : "After finding a type of dilithium that can survive at a higher temperatures, Tom Paris comes up with the ingenious idea of attempting to cross the transwarp threshold in an attempt to find a way to get home faster. After a bumpy start and the help of Torres and Kim, they succeed in a holodeck simulation. When it is presented to Captain Janeway, she is impressed and gives them the go ahead to try it, but traveling faster than warp 10 has never before been attempted. The first run goes very well. Tom Paris manages to cross the warp threshold which means that the shuttle..."
}, {
  "imdbId" : "0112178",
  "season" : "2",
  "episodeNumber" : "16",
  "title" : "Meld",
  "description" : "Tuvok investigates the murder of a Voyager engineer. Former Maquis and Betazoid Lon Suder (guest star Brad Dourif) confesses to the murder and offers no explanation or signs of remorse. Tuvok, curious to find a reason for Suder's madness, performs a mind-meld on the killer, only to find himself losing his usual Vulcan control and regressing into madness."
}, {
  "imdbId" : "0112178",
  "season" : "2",
  "episodeNumber" : "17",
  "title" : "Dreadnought",
  "description" : "Voyager comes across a ship that has been destroyed, upon investigation they discover that B'Elanna Torres is responsible! Dreadnought is a self guided missile created by the Cardassians to destroy the Maquis, however the bomb failed to go off allowing B'Elanna to get inside the missile and re-program it to do the Maquis' bidding."
}, {
  "imdbId" : "0112178",
  "season" : "2",
  "episodeNumber" : "18",
  "title" : "Death Wish",
  "description" : "While \"Voyager\" investigates what appears to be a typical comet, the crew accidentally releases a member of the Q Continuum who has been imprisoned in the ship's console for over 300 years to prevent him from committing suicide. He then claims asylum on the ship, which leaves Captain Janeway to decide whether he should go back in to confinement or whether to grant his request for asylum, which will give him endless opportunities to commit suicide."
}, {
  "imdbId" : "0112178",
  "season" : "2",
  "episodeNumber" : "19",
  "title" : "Lifesigns",
  "description" : "The Doctor saves a Vidiian dying from the Phage by placing her consciousness in a holographic body and then thinks that he is falling in love with her."
}, {
  "imdbId" : "0112178",
  "season" : "2",
  "episodeNumber" : "20",
  "title" : "Investigations",
  "description" : "Tom Paris leaves Voyager and joins a Talaxian space convoy."
}, {
  "imdbId" : "0112178",
  "season" : "2",
  "episodeNumber" : "21",
  "title" : "Deadlock",
  "description" : "A \"spatial scission\" causes Voyager to be duplicated. One of the Voyagers is under heavy attack from the Vidiians while the other remains impervious. Both Captain Janeways work together and agree to sacrifice one ship to save the other. Before self-sacrifice, the doomed Voyager sends it's version of Ensign Kim and newborn Naomi Wildman to the other ship to replace the Kim that was killed in the attack and the baby who died from complications shortly after birth."
}, {
  "imdbId" : "0112178",
  "season" : "2",
  "episodeNumber" : "22",
  "title" : "Innocence",
  "description" : "Tuvok crashes on a planet where he finds some children who know that they are all going to die."
}, {
  "imdbId" : "0112178",
  "season" : "2",
  "episodeNumber" : "23",
  "title" : "The Thaw",
  "description" : "Voyager finds a group of people connected in stasis chambers and something has gone terribly wrong."
}, {
  "imdbId" : "0112178",
  "season" : "2",
  "episodeNumber" : "24",
  "title" : "Tuvix",
  "description" : "Tuvok and Neelix are on an alien planet collecting examples of flora but when they attempt to beam back up to Voyager there is a malfunction with the transporter caused by the alien plant life they collected causing them to merge together as one life form, 'Tuvix'."
}, {
  "imdbId" : "0112178",
  "season" : "2",
  "episodeNumber" : "25",
  "title" : "Resolutions",
  "description" : "Captain Janeway and Chakotay contract an incurable virus and they can only survive if they stay behind together on a planet which negates the effects of the disease."
}, {
  "imdbId" : "0112178",
  "season" : "2",
  "episodeNumber" : "26",
  "title" : "Basics: Part 1",
  "description" : "The Kazon take over Voyager and strand the crew on a desolate primitive planet. Only Tom Paris, Lon Suder, and The Doctor are on board Voyager to retake the ship."
}, {
  "imdbId" : "0112178",
  "season" : "3",
  "episodeNumber" : "1",
  "title" : "Basics: Part 2",
  "description" : "The entire Voyager was marooned on a desolate planet by the Kazon. Tom Paris was sent out to try and find someone who can help them. And Lon Suder and the Doctor who are still on Voyager try to help."
}, {
  "imdbId" : "0112178",
  "season" : "3",
  "episodeNumber" : "2",
  "title" : "Flashback",
  "description" : "Captain Janeway participates in a mind-meld with Tuvok reliving his experiences on the SS Excelsior under the command of Captain Sulu at the time of the \"Star Trek: The Undiscovered Country\" movie."
}, {
  "imdbId" : "0112178",
  "season" : "3",
  "episodeNumber" : "3",
  "title" : "The Chute",
  "description" : "Tom Paris and Harry Kim are wrongly convicted of a terrorist bombing. Even though Janeway captures the true criminals, Tom and Harry are fitted with strange brain implants and imprisoned on a satellite. In the prison, the inmates have no supervision, no medical care, and all have implants which increase their aggressive tendencies. New prisoners and food-rations are delivered through a one-way chute. As days pass, the friends try to hold on to reality but find themselves turning on one another and taking drastic measures to survive and attempt escape."
}, {
  "imdbId" : "0112178",
  "season" : "3",
  "episodeNumber" : "4",
  "title" : "The Swarm",
  "description" : "Voyager is attacked by swarms of tiny spaceships that attach themselves to Voyager's hull. The Doctor is losing his memory and Torres activates the Jupiter Station diagnostic program run by a familiar hologram."
}, {
  "imdbId" : "0112178",
  "season" : "3",
  "episodeNumber" : "5",
  "title" : "False Profits",
  "description" : "Voyager comes across a pair of Alpha Quadrant Ferengis who have set themselves up as Gods on a primitive planet. Voyager wants to end their reign and use the nearby wormhole to return home."
}, {
  "imdbId" : "0112178",
  "season" : "3",
  "episodeNumber" : "6",
  "title" : "Remember",
  "description" : "Lieutenant Torres starts having vivid dreams about another life, another love and another planet."
}, {
  "imdbId" : "0112178",
  "season" : "3",
  "episodeNumber" : "7",
  "title" : "Sacred Ground",
  "description" : "After Kes is injured by an energy beam on a planet's sacred ground, Janeway must undergo a spiritual quest in order to save her life."
}, {
  "imdbId" : "0112178",
  "season" : "3",
  "episodeNumber" : "8",
  "title" : "Future's End: Part 1",
  "description" : "A timeship from the future who tries to stop Voyager gets thrown with Voyager into the twentieth century. His timeship is found in the 1960's and Voyager finds a company that has benefited from its technology exists in 1996."
}, {
  "imdbId" : "0112178",
  "season" : "3",
  "episodeNumber" : "9",
  "title" : "Future's End: Part 2",
  "description" : "Henry Starling, who made a fortune from his looting of 29th century technology from the crashed timeship, is planning a foray into the future to feed his greed. The Voyager crew must find a way to stop Starling before his attempted use of the timeship destroys Earth's Solar System. Meanwhile, while trying to rescue Paris and Tuvok, Torres and Chakotay are captured by an anti-government white supremacist militia who believe that they are feds."
}, {
  "imdbId" : "0112178",
  "season" : "3",
  "episodeNumber" : "10",
  "title" : "Warlord",
  "description" : "A dying warlord takes over Kes's body and is determined to retake his home planet."
}, {
  "imdbId" : "0112178",
  "season" : "3",
  "episodeNumber" : "11",
  "title" : "The Q and the Grey",
  "description" : "Due to the death of the Q in their last encounter with Voyager, a Civil War has broken out among the Q continuum. A new Q needs to be produced and the mischievous Q known to the USS Enterprise has chosen Janeway as his mate."
}, {
  "imdbId" : "0112178",
  "season" : "3",
  "episodeNumber" : "12",
  "title" : "Macrocosm",
  "description" : "After returning from a first contact mission, Janeway, Neelix and the Doctor must retake Voyager from an infestation of microorganisms that grow to an alarming size."
}, {
  "imdbId" : "0112178",
  "season" : "3",
  "episodeNumber" : "13",
  "title" : "Fair Trade",
  "description" : "Voyager heads into a section of space that Neelix has no knowledge of so he tries to obtain a map of it from a less than reputable friend."
}, {
  "imdbId" : "0112178",
  "season" : "3",
  "episodeNumber" : "14",
  "title" : "Alter Ego",
  "description" : "Harry Kim finds himself in love with Marayna, a character from Neelix's Polynesian resort holodeck program. Seeking to eliminate the emotion, Harry turns to Tuvok, who interacts with the woman and finds himself falling for her as well. While Harry is overwhelmed with feelings of jealousy and betrayal, Tuvok realizes the persona is too real and discovers she is actually a lonely alien who can interact with passing ships through their computers."
}, {
  "imdbId" : "0112178",
  "season" : "3",
  "episodeNumber" : "15",
  "title" : "Coda",
  "description" : "Chakotay and Janeway crash on a planet and are are stuck in a time loop where Janeway dies."
}, {
  "imdbId" : "0112178",
  "season" : "3",
  "episodeNumber" : "16",
  "title" : "Blood Fever",
  "description" : "Ensign Vorik undergoes the Vulcan mating drive known as Pon farr. The strong chemical imbalance affects B'Elanna Torres as well, leading her to irrational thoughts and behavior. Trapped in a cave, Tom Paris must try to reason with B'Elanna and get her medical attention while trying to respect his friend and deny her uncharacteristic sexual advances."
}, {
  "imdbId" : "0112178",
  "season" : "3",
  "episodeNumber" : "17",
  "title" : "Unity",
  "description" : "Chakotay finds a planet of unassimilated Borg drones from all over the galaxy."
}, {
  "imdbId" : "0112178",
  "season" : "3",
  "episodeNumber" : "18",
  "title" : "Darkling",
  "description" : "Kes falls in love on an away mission. The Doctor, seeking to expand his programming, incorporates the personalities of several historical figures. B'Elanna Torres chastises The Doctor, warning him that his program is complex and the results could be unfavorable. But it is too late. The Doctor has developed an alter ego; a violent unethical personality that attempts to murder Kes' new love."
}, {
  "imdbId" : "0112178",
  "season" : "3",
  "episodeNumber" : "19",
  "title" : "Rise",
  "description" : "While helping a planet being bombarded by asteroids, Neelix and Tuvok get trapped on the surface and Tuvok's negative attitude is getting on Neelix's nerves."
}, {
  "imdbId" : "0112178",
  "season" : "3",
  "episodeNumber" : "20",
  "title" : "Favorite Son",
  "description" : "While Ensign Kim begins experiencing bizarre DNA changes, he instinctively leads Voyager to a planet whose inhabitants claim Kim is really a member of their race and is ritualistically returning home. When his welcome seems too good to be true, Kim loses contact with Voyager and begins to uncover the alien's true intentions."
}, {
  "imdbId" : "0112178",
  "season" : "3",
  "episodeNumber" : "21",
  "title" : "Before and After",
  "description" : "Starting near her death with no memory, Kes experiences parts of her life moving backwards through time. The Doctor develops an experimental procedure to extend Kes' lifespan beyond the Ocampan standard nine years. We see a possible future Voyager where Janeway and Torres died years ago in a great war and the survivors of Voyager were exposed to temporal radiation. The Doctor's procedure re-activates the symptoms of the radiation, causing Kes to relive moments of her life, from being elderly to her conception. In this reality, Kes and Tom Paris married and had a ..."
}, {
  "imdbId" : "0112178",
  "season" : "3",
  "episodeNumber" : "22",
  "title" : "Real Life",
  "description" : "The Doctor creates a holographic family, but B'elanna Torres thinks the Doctor's simulation is too \"nice\" (in a \"Leave It To beaver\" sort of way). She introduces some alterations to the program to make the simulation more accurate to real life: a wife who often disagrees, a rebellious teenage son, and a daughter who is sure she knows better than her doting father. When his daughter is critically injured the Doctor must make a choice, run back to his Voyager life, or face the harsh \"reality\" of losing a loved one."
}, {
  "imdbId" : "0112178",
  "season" : "3",
  "episodeNumber" : "23",
  "title" : "Distant Origin",
  "description" : "A Voth scientist finds the remains of a Voyager crewman who died on the planet where the crew was exiled by the Kazon during the two-part episode \"Basics\". An analysis of the remains' DNA shows links to his own DNA. While tracking and studying the Voyager crew, the scientist and his aide are discovered; they eventually pool their knowledge and conclude that the saurian is an evolved dinosaur from a species that left Earth more than 65 million years earlier. The scientist is thrilled to be able to prove his Distant Origin theory (that his Voth race originated elsewhere..."
}, {
  "imdbId" : "0112178",
  "season" : "3",
  "episodeNumber" : "24",
  "title" : "Displaced",
  "description" : "Voyager's crew is being replaced by strangers one by one and the replacements don't know why they are there."
}, {
  "imdbId" : "0112178",
  "season" : "3",
  "episodeNumber" : "25",
  "title" : "Worst Case Scenario",
  "description" : "Members of the Voyager crew clandestinely participate in a hidden holodeck program where the ship's Maquis members stage an insurrection. Word gets out and Tuvok confesses to writing the program as a training guide for security officers but never finished it because the merged crew seemed to be working well together. When Tuvok and Paris get trapped in the program, they realize that former crew mate and Cardassian spy Seska had added her own twist to the story."
}, {
  "imdbId" : "0112178",
  "season" : "3",
  "episodeNumber" : "26",
  "title" : "Scorpion: Part 1",
  "description" : "About to enter Borg space, Voyager finds a threat so devastating that even the Borg can not deal with it."
}, {
  "imdbId" : "0112178",
  "season" : "4",
  "episodeNumber" : "1",
  "title" : "Scorpion: Part 2",
  "description" : "Voyager finds a solution to combat the invader of Borg space. All Captain Janeway asks is free passage through their territory and Voyager will share their knowledge."
}, {
  "imdbId" : "0112178",
  "season" : "4",
  "episodeNumber" : "2",
  "title" : "The Gift",
  "description" : "Seven of Nine, the Borg drone that Voyager severed from the collective, tries to resist as her natural human physiology tries to regenerate. It's up to Captain Janeway to convince her to embrace her humanity and join the Voyager crew. Meanwhile, Kes' telekinetic powers grow to such a point that she can no longer control them. In order to prevent Voyager from being destroyed, she decides she must leave the ship."
}, {
  "imdbId" : "0112178",
  "season" : "4",
  "episodeNumber" : "3",
  "title" : "Day of Honor",
  "description" : "The Klingon holiday known as Day Of Honor comes around again and this year B'Elanna Torres decides to embrace her Klingon heritage and participate in a series of ritual endurance tests. But blood pie and painstiks are the last thing on her mind when an emergency necessitates ejecting Voyagers warp core. Torres and Tom Paris are sent in a shuttlecraft to retrieve it but the Caatati decide they want the core and destroy the shuttle. Paris and Torres don EV suits and beam off in time, only to find themselves adrift in space with little oxygen. Accepting her impending ..."
}, {
  "imdbId" : "0112178",
  "season" : "4",
  "episodeNumber" : "4",
  "title" : "Nemesis",
  "description" : "Commander Chakotay's shuttle is hit by enemy cross-fire and crashes on a planet in the midst of a war. One side befriends him and attempts to help him relocate his shuttle and he finds himself quickly taking sides. When he is captured by the other side, he is reminded that every army has its own story."
}, {
  "imdbId" : "0112178",
  "season" : "4",
  "episodeNumber" : "5",
  "title" : "Revulsion",
  "description" : "Voyager receives a distress call from a lone survivor on a damaged ship. When learning the survivor is a hologram, The Doctor insists on joining B'Elanna Torres who lends aid in fixing the ship. Once on the ship, Dejaren (guest star Leland Orser) expresses his hatred of \"organics,\" and Torres discovers that the crew were not killed by a virus but instead brutally murdered, Dejaren turns on her and nearly kills her too."
}, {
  "imdbId" : "0112178",
  "season" : "4",
  "episodeNumber" : "6",
  "title" : "The Raven",
  "description" : "Janeway is trying to gain passage through a region of space owned by a cautious and xenophobic race of aliens. Negotiations are disrupted when Seven of Nine believes that she is being contacted by the Borg and forcefully leaves Voyager to rejoin the collective and heads into the alien territory."
}, {
  "imdbId" : "0112178",
  "season" : "4",
  "episodeNumber" : "7",
  "title" : "Scientific Method",
  "description" : "A string of bizarre illnesses afflicts the Voyager crew. The Doctor and Seven of Nine uncover a team of alien researchers existing out of phase performing medical experiments on the ship's crew."
}, {
  "imdbId" : "0112178",
  "season" : "4",
  "episodeNumber" : "8",
  "title" : "Year of Hell: Part 1",
  "description" : "Voyager comes across a Krenim timeship that is wiping whole species from existence by changing the existing timeline."
}, {
  "imdbId" : "0112178",
  "season" : "4",
  "episodeNumber" : "9",
  "title" : "Year of Hell: Part 2",
  "description" : "A year after Voyager encounters the Krenim time ship, a badly damaged Voyager with a skeleton crew leads an armada of interplanetary ships against them."
}, {
  "imdbId" : "0112178",
  "season" : "4",
  "episodeNumber" : "10",
  "title" : "Random Thoughts",
  "description" : "Voyager visits a planet with a telepathic races that outlaws negative thoughts. When B'Elanna is charged with releasing an angry thought into the society and condemned to a dangerous neurological procedure, Tuvok uncovers a black market dealing in violent thoughts."
}, {
  "imdbId" : "0112178",
  "season" : "4",
  "episodeNumber" : "11",
  "title" : "Concerning Flight",
  "description" : "While Janeway is visiting her da Vinci holodeck program, Voyager is mugged by transporter. They steal everything from the main computer core, to the emergency rations, even the dirty laundry! They track the property to a trade outpost. When they take a team to recover the gear, Janeway is shocked to find her holodeck character da Vinci (guest star John Rhys-Davies) - wearing The Doctor's mobile emitter living there. He believes it is America, and tells her he has been hired by the Prince as an inventor. With da Vinci's help, she gets the computer back, but the 'Prince..."
}, {
  "imdbId" : "0112178",
  "season" : "4",
  "episodeNumber" : "12",
  "title" : "Mortal Coil",
  "description" : "Neelix experiences a crisis of faith when, after being dead for nearly nineteen hours, Seven of Nine revives him using her Borg technology. On awakening, Neelix has no memory of experiencing the Talaxian afterlife and begins to doubt everything his culture believes about the post-thanatic experience and their spiritual place in the universe. His crisis is played out with the help of Chakotay's vision quest."
}, {
  "imdbId" : "0112178",
  "season" : "4",
  "episodeNumber" : "13",
  "title" : "Waking Moments",
  "description" : "The Voyager crew are assaulted in the form of nightmares. An alien species, functioning only in a dream world, disables the crew and traps them in a shared dream. Chakotay strives to stay awake and help The Doctor disable the aliens' hold on the crew, all while wondering if he is still dreaming."
}, {
  "imdbId" : "0112178",
  "season" : "4",
  "episodeNumber" : "14",
  "title" : "Message in a Bottle",
  "description" : "Using an alien communications net, Voyager sends their Doctor to the Federation ship USS Prometheus only to find that it has been taken over by Romulans."
}, {
  "imdbId" : "0112178",
  "season" : "4",
  "episodeNumber" : "15",
  "title" : "Hunters",
  "description" : "Voyager starts to receive news from home both good and bad. They also encounter the Hirogen race who only live to hunt and have their sights on Voyager."
}, {
  "imdbId" : "0112178",
  "season" : "4",
  "episodeNumber" : "16",
  "title" : "Prey",
  "description" : "Helping a wounded Hirogen, Janeway finds that their prey has boarded Voyager, a member of species 8472."
}, {
  "imdbId" : "0112178",
  "season" : "4",
  "episodeNumber" : "17",
  "title" : "Retrospect",
  "description" : "Seven of Nine claims to have been assaulted by the arms trader who just sold new technology to Voyager."
}, {
  "imdbId" : "0112178",
  "season" : "4",
  "episodeNumber" : "18",
  "title" : "The Killing Game: Part 1",
  "description" : "After Voyager is captured by the Hirogens, the ship is turned into a massive holodeck so that the Hirogens can hunt members of the crew who have been fitted with new identities in various scenarios based upon Federation history."
}, {
  "imdbId" : "0112178",
  "season" : "4",
  "episodeNumber" : "19",
  "title" : "The Killing Game: Part 2",
  "description" : "Janeway and the crew must retake Voyager from the Hirogens."
}, {
  "imdbId" : "0112178",
  "season" : "4",
  "episodeNumber" : "20",
  "title" : "Vis À Vis",
  "description" : "Bored with his daily routine, Tom Paris finds a refreshing friendship with a visiting alien willing to share a new method of propulsion with Voyager. Unwittingly, Tom finds trouble when his new friend swaps bodies and delivers him to authorities ready to charge Tom with the aliens' crimes. Meanwhile, the alien in Tom's body makes waves in Tom's personal and professional relationships on Voyager."
}, {
  "imdbId" : "0112178",
  "season" : "4",
  "episodeNumber" : "21",
  "title" : "The Omega Directive",
  "description" : "Voyager's sensor detect a rare particle theoretically capable of damaging subspace and nullifying warp travel. Under a classified directive known only to Starfleet Captains and above, Janeway leads Voyager on a mission to destroy all traces of the particle. Seven of Nine is hesitant to destroy the Omega particle, remembering the Borg revered it as the embodiment of perfection."
}, {
  "imdbId" : "0112178",
  "season" : "4",
  "episodeNumber" : "22",
  "title" : "Unforgettable",
  "description" : "An alien woman requests asylum aboard Voyager, stating she has been aboard recently and she and Chakotay fell in love. She claims her race wants to keep themselves concealed from other races and have ways to forget contact with her species. Once an agent charged with returning fugitives to her homeworld, she is now being hunted by her former colleagues for revealing her race's secrets."
}, {
  "imdbId" : "0112178",
  "season" : "4",
  "episodeNumber" : "23",
  "title" : "Living Witness",
  "description" : "When The Doctor's back-up module is found, his program is brought on-line for the first time in seven hundred years. In the future, Kyrian Museum of Heritage teaches a history that writes Voyager as playing a detrimental role in beginning their Great War with the Vaskans. The Doctor is the only living witness and sets the record straight, but the new \"facts\" give way to old tensions from the formerly warring races and the museum curator and The Doctor find themselves amidst violence and destruction instead of the peace and understanding they hoped for."
}, {
  "imdbId" : "0112178",
  "season" : "4",
  "episodeNumber" : "24",
  "title" : "Demon",
  "description" : "Desperate to replenish the ship's power resources, Voyager seeks out a deuterium signature on a class \"Y\" a.k.a. \"Demon Class\" planet. After nearly being lost, Paris and Kim are thought to be \"bioformed\" to the planet's atmosphere. Further investigation uncovers a strange life-form that, after making contact with the away team, has developed self-awareness and will do anything to keep it."
}, {
  "imdbId" : "0112178",
  "season" : "4",
  "episodeNumber" : "25",
  "title" : "One",
  "description" : "An unavoidable poisonous nebula forces the entire crew into stasis chambers - all except the unaffected Doctor and Seven of Nine, who must fight her nearly life long \"collective\" mentality to handle being alone for over a month while combating ship-wide failures, a strange alien intruder, and her own fears of individuality and loneliness."
}, {
  "imdbId" : "0112178",
  "season" : "4",
  "episodeNumber" : "26",
  "title" : "Hope and Fear",
  "description" : "An alien translator by the name of Arturis is able to finally decode the Starfleet message received by Voyager five months ago. It tells them to go to a new type of ship waiting for them with an engine system faster than warp drive, which is capable of bringing them home within three months."
}, {
  "imdbId" : "0112178",
  "season" : "5",
  "episodeNumber" : "1",
  "title" : "Night",
  "description" : "Crew morale hits an all-time low when Voyager must spend two years crossing an expanse devoid of any star systems or signs of life. As Captain Janeway is forced to reflect on the choice she made stranding her crew in the Delta Quadrant, little does she know, she will face a similar decision when Voyager ends up in the middle of a serious conflict."
}, {
  "imdbId" : "0112178",
  "season" : "5",
  "episodeNumber" : "2",
  "title" : "Drone",
  "description" : "Voyager is investigating the birth of a nebula. Unfortunately, after an away mission shuttle is caught in the blast, a transporter accident during the team evacuation causes the Doctor's mobile emitter to be infected with Seven's nanoprobes. The mobile emitter starts assimilating a science lab, and creates a new drone built upon the emitter's twenty-ninth century technology."
}, {
  "imdbId" : "0112178",
  "season" : "5",
  "episodeNumber" : "3",
  "title" : "Extreme Risk",
  "description" : "B'Elanna Torres secretly participates in several dangerous holodeck programs. The Voyager crew works around the clock to build the Delta Flyer, hoping to beat the Malon in retrieving a lost probe from the atmosphere of a gas giant."
}, {
  "imdbId" : "0112178",
  "season" : "5",
  "episodeNumber" : "4",
  "title" : "In the Flesh",
  "description" : "The crew of Voyager discover a simulation of Starfleet Headquarters being run by Species 8472, the enemy they helped the Borg defeat in the two-part episode \"Scorpion\". It is being used to practice infiltrating the Federation. With the aid of regular doses of drugs, Species 8472 are able to shape-shift into human form. It is up to Janeway to try to convince the aliens that Starfleet is not a threat to them."
}, {
  "imdbId" : "0112178",
  "season" : "5",
  "episodeNumber" : "5",
  "title" : "Once Upon a Time",
  "description" : "The Delta Flyer crash lands after encountering an ion storm. Voyager desperately tries to contact and rescue Tuvok, Paris, and a badly injured Ensign Samantha Wildman. Meanwhile aboard ship, Neelix attempts to distract young Naomi Wildman, who is eager to hear from her mother. Finding out the truth, Naomi escapes into a popular children's holo-novel."
}, {
  "imdbId" : "0112178",
  "season" : "5",
  "episodeNumber" : "6",
  "title" : "Timeless",
  "description" : "A miscalculation by Ensign Kim causes a fatal crash during Voyager's first test with slipstream travel. Fifteen years in the future, survivors Chakotay, Kim and The Doctor attempt to send a message back in time to prevent the tragedy. Guest stars LeVar Burton as Captain Geordi La Forge."
}, {
  "imdbId" : "0112178",
  "season" : "5",
  "episodeNumber" : "7",
  "title" : "Infinite Regress",
  "description" : "Voyager comes in contact with Borg technology that causes Seven of Nine to display multiple personalities."
}, {
  "imdbId" : "0112178",
  "season" : "5",
  "episodeNumber" : "8",
  "title" : "Nothing Human",
  "description" : "An injured cytoplasmic life-form attaches itself to Torres, tapping into her body like a parasite. Unsure of how to save his patient, The Doctor creates a holographic recreation of a non-humanoid exobiology specialist to consult the case. The consult is going well until Torres refuses treatment when it is made known that the Cardassian specialist was responsible for tortuous experiments resulting in the deaths of thousands of Bajorans."
}, {
  "imdbId" : "0112178",
  "season" : "5",
  "episodeNumber" : "9",
  "title" : "Thirty Days",
  "description" : "In a letter to his father, Tom Paris tells the story of the events leading up to his demotion to Ensign and sentence to thirty days in Voyager's brig."
}, {
  "imdbId" : "0112178",
  "season" : "5",
  "episodeNumber" : "10",
  "title" : "Counterpoint",
  "description" : "Voyager passes through a sector of space controlled by race which is deeply suspicious of telepathic lifeforms. Tuvok and others force the Voyager crew to develop a novel approach in order to pass through safely."
}, {
  "imdbId" : "0112178",
  "season" : "5",
  "episodeNumber" : "11",
  "title" : "Latent Image",
  "description" : "The Doctor (Robert Picardo) uncovers evidence his memory was erased 18 months ago. Nearly all traces of a crewman and a fateful away mission have been deleted by Captain Janeway. Confronted by The Doctor's need for answers and Seven of Nine's perspective on the rights of a hologram, Janeway restores the fatal truth about Ensign Jetal, The Doctor's choice that led to her death, and his resulting breakdown. A powerful episode with an outstanding performance by Picardo."
}, {
  "imdbId" : "0112178",
  "season" : "5",
  "episodeNumber" : "12",
  "title" : "Bride of Chaotica!",
  "description" : "While Tom Paris & Harry Kim are running an episode of their \"Captain Proton\" holodeck programs, Voyager gets caught in a layer of sub space. However this layer or 'sub space sand bar' as it is nicknamed is home to a race of photonic aliens. There is one big problem: they are not able to detect Voyager or any carbon based life forms (humans). Instead they transport down on to the holodeck and start a war with Dr Chaotica's army of Evil! When Voyager detects internal weapons fire on the holodeck, Tom Paris and Tuvok are dispatched to find out what the problem is. When ..."
}, {
  "imdbId" : "0112178",
  "season" : "5",
  "episodeNumber" : "13",
  "title" : "Gravity",
  "description" : "A Voyager shuttle manned by Lt. Cmdr. Tuvok, Ensign Paris and The Doctor is pulled into a subspace gravity well and crashes on a Class \"D\" planet existing within it. With the shuttle too damaged to fly, the away team befriends Noss (guest star Lori Petty,) alien woman who crashed on the planet several seasons before them. As weeks pass, the survivors grow close. Noss learns English and teaches Tuvok and Paris how to survive the other aliens and hunt for food. Noss finds herself in love with Tuvok, and frustrated that he will not allow his emotions to love her back. ..."
}, {
  "imdbId" : "0112178",
  "season" : "5",
  "episodeNumber" : "14",
  "title" : "Bliss",
  "description" : "The Voyager crew discovers what seems to be a wormhole leading to the Alpha Quadrant and home. Images of Earth and letters from home elates the crew of Voyager. Seven, and others, however, are skeptical of this seeming deliverance."
}, {
  "imdbId" : "0112178",
  "season" : "5",
  "episodeNumber" : "15",
  "title" : "Dark Frontier: Part 1",
  "description" : "Members of the Voyager crew train on the holodeck for a raid on a Borg ship. Should they be successful, they will steal the Borg trans-warp coil in hopes of integrating the technology into Voyager's systems. The Borg seem to be one step ahead when the Borg Queen communicates with Seven of Nine."
}, {
  "imdbId" : "0112178",
  "season" : "5",
  "episodeNumber" : "16",
  "title" : "Dark Frontier: Part 2",
  "description" : "Janeway is confused but won't give up on her crew mate and friend. Two years after being liberated from the collective, Seven of Nine rejoins the Borg, seemingly of her own will. When Janeway finds a history of transmissions from the Borg to Seven, she is convinced that Seven was lured back against her wishes. Meanwhile, aboard the Borg sphere, the Borg Queen attempts to seduce Seven into helping her assimilate Earth."
}, {
  "imdbId" : "0112178",
  "season" : "5",
  "episodeNumber" : "17",
  "title" : "The Disease",
  "description" : "Voyager encounters a group of xenophobic nomads, at space for 400 years, with serious ship wide malfunctions. This offer to help leads to serious consequences. Strait laced Ensign Kim gets entangled in a forbidden romance."
}, {
  "imdbId" : "0112178",
  "season" : "5",
  "episodeNumber" : "18",
  "title" : "Course: Oblivion",
  "description" : "A slight respite seems to be in order but some mysterious force is affecting the very fabric of Voyager itself. To solve the mystery this crew must retrace their steps to see what went wrong."
}, {
  "imdbId" : "0112178",
  "season" : "5",
  "episodeNumber" : "19",
  "title" : "The Fight",
  "description" : "Voyager gets trapped in \"chaotic space,\" a kind of Bermuda Triangle, where sensors are useless and a straight line sends them running in circles. In an attempt to relay to Voyager that they are not welcome, the inhabitants of chaotic space activate a genetic defect in Commander Chakotay, who interprets the warnings and instructions in the form of hallucinations including his Grandfather and his boxing training at Starfleet Academy."
}, {
  "imdbId" : "0112178",
  "season" : "5",
  "episodeNumber" : "20",
  "title" : "Think Tank",
  "description" : "Voyager is sought after by the Hazari, unyielding bounty hunters of the delta-quadrant. While debating methods of escape, a group of problem-solvers offers their services in out-witting the Hazari. The group spokesman Kurros (guest star Jason Alexander) proposes a payment method to Janeway: one of Neelix's famed recipes, an artifact owned by Chakotay, and Seven of Nine herself."
}, {
  "imdbId" : "0112178",
  "season" : "5",
  "episodeNumber" : "21",
  "title" : "Juggernaut",
  "description" : "Voyager responds to a distress call of a heavily-damaged Malon freighter. Torres, Neelix, Chakotay, and the only 2 surviving Malon have 6 hours to stop a theta-radiation fallout which will destroy everything within a 3 light-year radius. The away-team must clear radiation section-by-section to reach the control room, and along the way they deal with unstable airlocks and the Vihaar, a Malon boogeyman who is more malicious than mythical."
}, {
  "imdbId" : "0112178",
  "season" : "5",
  "episodeNumber" : "22",
  "title" : "Someone to Watch Over Me",
  "description" : "Voyager makes first contact with the Kadi, a ritualistic race with many social protocol. Seven takes the advice of the Captain and The Doctor gives her classes in dating. Neelix plays babysit-the-drunk when Tomin (guest star Scott Thompson,) the Kadi Ambassador turns from preacher to party animal. The Doctor finds himself falling for his student."
}, {
  "imdbId" : "0112178",
  "season" : "5",
  "episodeNumber" : "23",
  "title" : "11:59",
  "description" : "The crew of Voyager swap stories of family histories. Janeway is most proud of her ancestor Shannon O'Donnell, who has been celebrated by the Janeway clan for generations as an astronaut and pivotal member of The Millenium Gate and several Mars projects that followed. When research and history-buff Tom Paris prove the stories wrong, that O'Donnell wasn't the hero Janeway made her out to be, the crew points out that her inspiration made Janeway join Starfleet and that is an accomplishment in itself."
}, {
  "imdbId" : "0112178",
  "season" : "5",
  "episodeNumber" : "24",
  "title" : "Relativity",
  "description" : "When Voyager is destroyed, Captain Braxton of the 29th Century Timeship Relativity contacts Seven of Nine to travel back in time and discover who planted the 'temporal disruptor.' However, she must do this without being discovered by the past Janeway."
}, {
  "imdbId" : "0112178",
  "season" : "5",
  "episodeNumber" : "25",
  "title" : "Warhead",
  "description" : "An alien warhead or missile that possesses Artificial Intelligence links with the EMH program and begins to terrorize the crew."
}, {
  "imdbId" : "0112178",
  "season" : "5",
  "episodeNumber" : "26",
  "title" : "Equinox: Part 1",
  "description" : "Voyager encounters the Federation Starship Equinox, a Starfleet vessel trapped in the Delta Quadrant by the same alien who brought Voyager there. Equinox is heavily damaged and running with a skeleton crew. Happy to have found each other, Voyager assists Equinox in fighting off an non-humanoid alien race attacking them. But Equinox has earned the aliens hostility. Captain Ransom and his crew have been kidnapping and killing the aliens and using their unique physiology to enhance their warp drive. When Janeway imprisons the Equinox crew they stage a revolt. The Equinox..."
}, {
  "imdbId" : "0112178",
  "season" : "6",
  "episodeNumber" : "1",
  "title" : "Equinox: Part 2",
  "description" : "Temporarily shielded from the alien attack, Janeway orders that their first priority is to find the Equinox, stop Ransom and recover Seven of Nine. Chakotay disagrees but obeys. Voyager finds Equinox and captures a few of its crew members before they escape again. Chakotay stops Janeway within seconds of sacrificing the Equinox crewman and Janeway relieves him of duty. Meanwhile, the Equinox EMH, posing as Voyager's doctor, keeps in contact with Ransom. The Doctor, on-board the Equinox with his ethical subroutines disabled, performs surgery on Seven that will extract ..."
}, {
  "imdbId" : "0112178",
  "season" : "6",
  "episodeNumber" : "2",
  "title" : "Survival Instinct",
  "description" : "Stardate 53049.2 Voyager docks at a space outpost filled with a variety of Delta Quadrant aliens. Eager for some culture exchange and friendly first contact, Captain Janeway grants shore leave to her crew and rolls out the welcome mat for visitors. Tuvok worries about security, Kim and Paris get drunk and start a fight, Naomi Wildman makes a lunch date with Seven. Despite a crowded ship, a few thefts, security breaches, and the gift of a plant (that bites!) all seems to be going well. Seven of Nine is approached by an alien who holds relics from her Borg days, actual ..."
}, {
  "imdbId" : "0112178",
  "season" : "6",
  "episodeNumber" : "3",
  "title" : "Barge of the Dead",
  "description" : "When her shuttle crosses paths with an ion storm, B'Elanna Torres is severely injured and slips into a coma. She envisions Klingons killing her crew mates and her, and then finds herself on the Barge of the Dead traveling to Gre'thor, the Klingon version of hell. Just before the dream ends her Mother appears on board with the rest of the damned souls. When she regains consciousness in sickbay she experiences a crisis of faith. Despite the support of the friends B'Elanna is convinced that her Mother is dead and suffering dishonor because her daughter never embraced her..."
}, {
  "imdbId" : "0112178",
  "season" : "6",
  "episodeNumber" : "4",
  "title" : "Tinker Tenor Doctor Spy",
  "description" : "The Doctor's experiment with daydreaming gets out of control when his program is compromised by an alien race. The aliens bully passing ships for supplies; they never make a move without first consulting their command which they call The Hierarchy. One of the aliens mistakes the daydreams for reality and gets permission to attack. Once realizing his mistake, he offers to help Voyager, but only if they act out one of The Doctor's fantasies where he is in command of Voyager."
}, {
  "imdbId" : "0112178",
  "season" : "6",
  "episodeNumber" : "5",
  "title" : "Alice",
  "description" : "The crew discovers a space age junkyard near their course. Desperate for supplies Voyager finds an eager trader. After an exhaustive search of the ship and the junkyard a list of items developed for trade. Avid pilot Tom Paris notices a \"race car\" among the assemblage. Paris convinces Chakotay to acquire it to have an extra \"away\" ship. Paris begins cleaning and repairing and slowly becomes obsessed with this very unique space vessel."
}, {
  "imdbId" : "0112178",
  "season" : "6",
  "episodeNumber" : "6",
  "title" : "Riddles",
  "description" : "Returning from an away mission the Delta Flyer is boarded and Tuvok is assaulted by a cloaked alien from a xenophobic race called the Ba'Neth. Neurological damage leaves the once-disciplined, logical Vulcan with the mentality of a lost and scared child. With Neelix's help, Tuvok discovers new hobbies and embraces the concept of 'fun.' Naroq, a Kesat studying the Ba'Neth helps Voyager find the aliens in hopes of answers about their technology and the weapon used on Tuvok. When presented with an operation that will restore him to his old self, Tuvok hesitates, knowing ..."
}, {
  "imdbId" : "0112178",
  "season" : "6",
  "episodeNumber" : "7",
  "title" : "Dragon's Teeth",
  "description" : "Voyager is pulled into a sub-space corridor, traveling 200 light-years until pushed out by the Turei who claim ownership of the labyrinth. After refusing to let the Turei wipe Voyager's computer of data regarding the corridors, the ship lands on a nearby planet. 900 years ago the population sought shelter from nuclear winter in stasis pods, intent on waking 5 years later. As Voyager helps the Vaadwaur rebuild, Neelix and Seven of Nine uncover historical data that the Vaadwaur were once ruthless conquerers in the Delta Quadrant. Uncovering the Vaadwaur plot to steal ..."
}, {
  "imdbId" : "0112178",
  "season" : "6",
  "episodeNumber" : "8",
  "title" : "One Small Step",
  "description" : "Voyager encounters a graviton ellipse, a phenomenon that emerges from subspace on rare occasions. The anomaly engulfed a manned vessel during a Mars mission in 2032 and Chakotay is determined to retrieve the debris from inside the ellipse. Chakotay, Paris and Seven take the Delta Flyer in, but when an asteroid strikes, Chakotay, obsessed with retrieving the module, disobeys Janeway's order to leave. The collision renders the Flyer flightless as the ellipse prepares to return to subspace."
}, {
  "imdbId" : "0112178",
  "season" : "6",
  "episodeNumber" : "9",
  "title" : "The Voyager Conspiracy",
  "description" : "Seven of Nine upgrades her Borg alcove to assimilate mass amounts of data in short periods of time. The data leads Seven to theorize a several conspiracies aboard Voyager involving their presence in the Delta Quadrant as an intentional act. Voyager meets Tash, an alien far from home building a catapult capable of launching ships hundreds of light-years in an instant. As Seven assimilates inconclusive data, her paranoia and imagination fills in the gaps and plants the seed of doubt among the crew."
}, {
  "imdbId" : "0112178",
  "season" : "6",
  "episodeNumber" : "10",
  "title" : "Pathfinder",
  "description" : "Back on Earth, Barclay (Schultz) uses holograms to formulate a plan to open communications with Voyager."
}, {
  "imdbId" : "0112178",
  "season" : "6",
  "episodeNumber" : "11",
  "title" : "Fair Haven",
  "description" : "The crew of Voyager take part in Tom Paris' latest holodeck getaway: Fair Haven, an Irish coastal town of the early 20th century. The program is left open day and night as a morale booster while Voyager rides out a nucleogenic wavefront. Janeway gets close with Micheal Sullivan, a pub owner in Fair Haven. She adjusts his appearance, education, interests and personal life (\"delete the wife\") to make him her perfect guy. After several special days together, Janeway realizes even though her love is real, he is not, and real loves you accept as they are. When Voyager hits..."
}, {
  "imdbId" : "0112178",
  "season" : "6",
  "episodeNumber" : "12",
  "title" : "Blink of an Eye",
  "description" : "Voyager is trapped in orbit above a strange planet where time passes thousands of times faster than in the surrounding galaxy. As the population of the planet evolves Voyager becomes an integral part of their culture. Eventually they develop technology that allows them to send someone to the \"Sky Ship\"."
}, {
  "imdbId" : "0112178",
  "season" : "6",
  "episodeNumber" : "13",
  "title" : "Virtuoso",
  "description" : "The Doctor's singing talent is so appreciated by one species that he is considering resigning his Starfleet commission and staying on with his millions of adoring fans."
}, {
  "imdbId" : "0112178",
  "season" : "6",
  "episodeNumber" : "14",
  "title" : "Memorial",
  "description" : "Members of an away mission start dreaming about a species they have never seen before who are in a gruesome battle on an unknown planet."
}, {
  "imdbId" : "0112178",
  "season" : "6",
  "episodeNumber" : "15",
  "title" : "Tsunkatse",
  "description" : "Seven of Nine and Tuvok are kidnapped while on an away mission and Seven is forced to fight in their gladiator-like competition or Tuvok will not receive the medical attention that he requires."
}, {
  "imdbId" : "0112178",
  "season" : "6",
  "episodeNumber" : "16",
  "title" : "Collective",
  "description" : "Several Borg children abduct Chakotay, Kim, Neelix and Paris."
}, {
  "imdbId" : "0112178",
  "season" : "6",
  "episodeNumber" : "17",
  "title" : "Spirit Folk",
  "description" : "A revisit to the holographic town of Fair Haven proves dangerous for Paris and Kim as members of the program begin to see Voyager crew members change elements of the program before their eyes. The members of the program fear the voyager crew and think of them as bad spirits set to kill the town of Fair Haven."
}, {
  "imdbId" : "0112178",
  "season" : "6",
  "episodeNumber" : "18",
  "title" : "Ashes to Ashes",
  "description" : "Three years ago, when Ensign Lyndsey Ballard died on an away mission, Voyager gave her a traditional burial in space. Her remains were recovered by the Kobali, a race that procreates by reanimating the corpses of other races and altering their DNA. When Lyndsey flees the Kobali and returns to Voyager, Janeway is skeptical but medical scans prove she is the real deal. While The Doctor can't make her human again, he alters her appearance to look like her old self and she tries to reintegrate herself with the crew. Also in this episode, Seven of Nine is frustrated to ..."
}, {
  "imdbId" : "0112178",
  "season" : "6",
  "episodeNumber" : "19",
  "title" : "Child's Play",
  "description" : "While Seven of Nine should be overjoyed when Icheb's parents are located, she does not believe them when told of the circumstances of his original assimilation."
}, {
  "imdbId" : "0112178",
  "season" : "6",
  "episodeNumber" : "20",
  "title" : "Good Shepherd",
  "description" : "In Seven's assessment of ship-wide efficiency, she brings to the Captain's attention three 'black sheep' crewmen who have slipped through the cracks. Mortimer Harren (Jay Underwood) the overly-qualified underly-enthused engineer, Tal Celes has no confidence in herself and doesn't inspire it in others, and William Telfer the resident hypochondriac. Seeking to guide her strays back to the flock, Janeway orders them all to join her on an away mission to a class 'T' nebula in the Delta Flyer. Anxiety strikes when the know-it-all Harren gets sensor data very wrong, Tal is ..."
}, {
  "imdbId" : "0112178",
  "season" : "6",
  "episodeNumber" : "21",
  "title" : "Live Fast and Prosper",
  "description" : "The Voyager crew is the victim of identity theft. A clever trio of con artists claiming to be Janeway, Chakotay, and Tuvok are making trades all over the quadrant and giving Voyager a bad name. When they skip out on the bill, the collectors demand payment from the real Voyager. Once Janeway has her doppelganger in custody, Neelix 'accidently' lets her escape, allowing the real Captain run her own double-cross."
}, {
  "imdbId" : "0112178",
  "season" : "6",
  "episodeNumber" : "22",
  "title" : "Muse",
  "description" : "Harry Kim and B'Elanna Torres take the Delta Flyer in search of dilithium. They crash on a pre-warp planet and B'Elanna is found by a local, Kelis the Poet. He believes she is 'an eternal,' a superior being sent from Heaven. He writes plays, 'The Voyager Travels,' based off of her logs which he performs with his acting troupe. 8 days after the crash, B'Elanna awakens, bound and injured. Kelis informs her she is his muse, but he needs more stories to put on or his 'patron' will let them starve. B'Elanna makes an offer: Kelis the Poet will retrieve some 'winter's tears'..."
}, {
  "imdbId" : "0112178",
  "season" : "6",
  "episodeNumber" : "23",
  "title" : "Fury",
  "description" : "Kes returns to Voyager. Aged, angry, and more powerful than ever, she literally tears through the ship. Using her abilities in combination with Voyager's warp core, Kes travels back in time to Voyager's first year in the Delta Quadrant. Her agenda is to kidnap her younger self and return her to Ocampa, even if it means turning her former friends over to the Vidiians. The only one to suspect anything is Tuvok, who is experiencing intermittent visions and memories of the future."
}, {
  "imdbId" : "0112178",
  "season" : "6",
  "episodeNumber" : "24",
  "title" : "Life Line",
  "description" : "The Pathfinder Project makes use of a pulsar and the MIDAS Array allowing a data stream to reach Voyager - and Voyager to reply - every 32 days. Lieutenant Barclay (guest star Dwight Schultz) sends a letter to The Doctor asking for a second opinion for his dying friend. The eccentric genius Dr. Lewis Zimmerman (Robert Picardo) who created the template for The Doctor's program is terminally ill with no known cure in the Alpha Quadrant. After reviewing the medical record The Doctor believes he can cure Zimmerman, and convinces Captain Janeway to risk sending him through..."
}, {
  "imdbId" : "0112178",
  "season" : "6",
  "episodeNumber" : "25",
  "title" : "The Haunting of Deck Twelve",
  "description" : "Neelix becomes very agitated as Voyager begins a full shutdown prior to entering a peculiar astronomical nebula. Left in charge of calming the recently rescued Borg children, Neelix encourages the young ones around a 24th century \"campfire\" for stories. Neelix recounts a story from Voyager's recent past that is strangely reminiscent of the current situation."
}, {
  "imdbId" : "0112178",
  "season" : "6",
  "episodeNumber" : "26",
  "title" : "Unimatrix Zero: Part 1",
  "description" : "Unimatrix Zero is a virtual world where drones can exist free of the Borg collective and free of their biomechanical and cortical implants. Seven of Nine visits there and Janeway sees an opportunity to disrupt the Borg even if it means the destruction of Unimatix Zero."
}, {
  "imdbId" : "0112178",
  "season" : "7",
  "episodeNumber" : "1",
  "title" : "Unimatrix Zero: Part 2",
  "description" : "Unimatrix Zero is a virtual world where drones can exist free of the Borg collective and free of their biomechanical and cortical implants. Seven of Nine visits there and Janeway sees an opportunity to disrupt the Borg even if it means the destruction of Unimatix Zero."
}, {
  "imdbId" : "0112178",
  "season" : "7",
  "episodeNumber" : "2",
  "title" : "Imperfection",
  "description" : "Seven of Nine's life is threatened when her cortical implants begin to degrade. Icheb wants to help her, but his proposition is very risky."
}, {
  "imdbId" : "0112178",
  "season" : "7",
  "episodeNumber" : "3",
  "title" : "Drive",
  "description" : "With Janeway's approval, Paris enters the Delta Flyer in an inter-species, light-speed shuttle race. Four races, once at war, are holding the race as a celebration of their peace treaty. Wrapped up in competition, Paris forgets a promise to spend a weekend with B'Elanna Torres. Torres is hurt but, with advice from Seven of all people, she decides to partake in the race as Paris' co-pilot. When the race is underway, the couple realize their participation was intentional; the Delta Flyer has been rigged as a bomb by one of the racers seeking to end accord with a bang."
}, {
  "imdbId" : "0112178",
  "season" : "7",
  "episodeNumber" : "4",
  "title" : "Repression",
  "description" : "Security officer Tuvok is investigating a strange series of attacks on Voyager directed at the former Maquis members."
}, {
  "imdbId" : "0112178",
  "season" : "7",
  "episodeNumber" : "5",
  "title" : "Critical Care",
  "description" : "The Doctor is stolen from Voyager by an alien who sells him and his mobile emitter to a hospital on a densely-populated planet. He is activated in a cramped room filled with sick people and is made to treat them using only very basic equipment. When the administrators of the facility realise how skilled the Doctor is, they move him to another area of the hospital to treat more deserving patients. The Doctor is appalled to learn that the medical care that people are given is linked to their status in society and hatches a plan to make things a little less ..."
}, {
  "imdbId" : "0112178",
  "season" : "7",
  "episodeNumber" : "6",
  "title" : "Inside Man",
  "description" : "Direct from Starfleet a hologram of Barclay arrives with instructions to get Voyager home within three days. The Doctor suspects that a there is something wrong with the hologram."
}, {
  "imdbId" : "0112178",
  "season" : "7",
  "episodeNumber" : "7",
  "title" : "Body and Soul",
  "description" : "When attacked by a species that detests holographic beings, Seven download the Doctor's program into her implants. Kim and Seven are captured and Seven begins to exhibit some of the Doctor's personality traits. On Voyager, Tuvok finally starts to exhibit Pon Farr, the Vulcan mating time."
}, {
  "imdbId" : "0112178",
  "season" : "7",
  "episodeNumber" : "8",
  "title" : "Nightingale",
  "description" : "Going to the aid of a medical transport Harry Kim gets his first command."
}, {
  "imdbId" : "0112178",
  "season" : "7",
  "episodeNumber" : "9",
  "title" : "Flesh and Blood",
  "description" : "The Hirogen species sends Voyager a distress call when their holographic prey become too cunning and cannot be defeated. Free from their pursuers, the leader of the holograms decides to continue the crusade against the organics in order to liberate all holograms everywhere. The Doctor finally realizes what he had done and comes up with a plan to redeem himself."
}, {
  "imdbId" : "0112178",
  "season" : "7",
  "episodeNumber" : "10",
  "title" : "Shattered",
  "description" : "After an accident Chakotay is able to pass through the time spheres that are scattered about the ship after Voyager goes through a temporal rift. In various sections of the ship, its past and future exist side by side and Chakotay must have its crew past and present work together to save Voyager."
}, {
  "imdbId" : "0112178",
  "season" : "7",
  "episodeNumber" : "11",
  "title" : "Lineage",
  "description" : "Tom and B'Elanna are overjoyed about their coming child though B'Elanna starts having nightmare flashbacks of her own childhood."
}, {
  "imdbId" : "0112178",
  "season" : "7",
  "episodeNumber" : "12",
  "title" : "Repentance",
  "description" : "Voyager rescues a prison warden and a set of prisoners that are scheduled to be executed testing their own ethical beliefs."
}, {
  "imdbId" : "0112178",
  "season" : "7",
  "episodeNumber" : "13",
  "title" : "Prophecy",
  "description" : "Voyager finds a Klingon multi-generational ship that left the Alpha Quadrant 100 years before. When they hear of B'Elanna's child they claim that it is their savior."
}, {
  "imdbId" : "0112178",
  "season" : "7",
  "episodeNumber" : "14",
  "title" : "The Void",
  "description" : "Voyager slips into a pocket of subspace where many other ships are trapped and must steal from each other to survive. Only with the help of other star ships can they all escape the void."
}, {
  "imdbId" : "0112178",
  "season" : "7",
  "episodeNumber" : "15",
  "title" : "Workforce: Part 1",
  "description" : "Upon returning from a mission, Chakotay, Kim and Neelix find Voyager abandoned and the Doctor the only crew member aboard. The entire crew have been kidnapped, their memories erased and they are now working in an alien industrial complex. Chakotay and Neelix infiltrate the complex and have to make Captain Janeway remember."
}, {
  "imdbId" : "0112178",
  "season" : "7",
  "episodeNumber" : "16",
  "title" : "Workforce: Part 2",
  "description" : "Upon returning from a mission, Chakotay, Kim and Neelix find Voyage abandoned and the Doctor the only crew member aboard. The entire crew have been kidnapped, their memories erased and they are now working in an alien industrial complex. Chakotay and Neelix infiltrate the complex and have to make Cpatain Janeway remember."
}, {
  "imdbId" : "0112178",
  "season" : "7",
  "episodeNumber" : "17",
  "title" : "Human Error",
  "description" : "Using the holodeck, Seven of Nine is trying to perfect her social skills to the point of becoming an obsession."
}, {
  "imdbId" : "0112178",
  "season" : "7",
  "episodeNumber" : "18",
  "title" : "Q2",
  "description" : "When Q finds his son too much to handle he lets Captain Janeway have a crack at him."
}, {
  "imdbId" : "0112178",
  "season" : "7",
  "episodeNumber" : "19",
  "title" : "Author, Author",
  "description" : "During their now regular communications with Earth and Starfleet the Doctor sends to Earth a holo-novel based too closely on his adventures on Voyager causing hurt feelings among his crew and dissension among the holographic beings on Earth."
}, {
  "imdbId" : "0112178",
  "season" : "7",
  "episodeNumber" : "20",
  "title" : "Friendship One",
  "description" : "For the first time in six years Voyager gets a mission from Starfleet Command. Retreive the 21st century probe Friendship One from a nearby planet."
}, {
  "imdbId" : "0112178",
  "season" : "7",
  "episodeNumber" : "21",
  "title" : "Natural Law",
  "description" : "Chakotay and Seven of Nine's shuttle is crippled by an energy field and they crash on a planet inhabited by a primitive species."
}, {
  "imdbId" : "0112178",
  "season" : "7",
  "episodeNumber" : "22",
  "title" : "Homestead",
  "description" : "Voyager finds a colony of Talaxians far from their home planet. When Neelix begins to bond with them he makes a major decision."
}, {
  "imdbId" : "0112178",
  "season" : "7",
  "episodeNumber" : "23",
  "title" : "Renaissance Man",
  "description" : "The Doctor abducts and impersonates various members of the crew when the Captain is kidnapped."
}, {
  "imdbId" : "0112178",
  "season" : "7",
  "episodeNumber" : "24",
  "title" : "Endgame",
  "description" : "Ten years after Voyager's return from a 23 year journey across the galaxy, Admiral Janeway breaks all the temporal rules and journeys back in time to change a decision she made that prolonged their journey by 16 years. Bringing technology that will help fight the Borg, the Admiral wants her younger self to fight the Borg use their transwarp hub to go home."
}]
