[{
  "imdbId" : "2234222",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Natural Selection",
  "description" : "Sarah Manning witnesses the death of a woman who looks exactly like her. She decides to escape her dramatic life and take the woman's identity for her own. But converting to a new life is harder than she expected."
}, {
  "imdbId" : "2234222",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Instinct",
  "description" : "Sarah looks deeper into the secret life that Beth seems to have lead. Art refuses to return Beth's money until Sarah goes through with the hearing."
}, {
  "imdbId" : "2234222",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Variation Under Nature",
  "description" : "Sarah has reinstated Beth into the detective force just as law enforcement finds Katja Obinger's body."
}, {
  "imdbId" : "2234222",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Effects of External Conditions",
  "description" : "While Sarah tries to track down her mysterious blonde clone, Alison fills in for Sarah on a visit to see her daughter."
}, {
  "imdbId" : "2234222",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Conditions of Existence",
  "description" : "Both Sarah and Alison believe that their lovers are actually monitoring them. Vic finds out that Sarah's alive."
}, {
  "imdbId" : "2234222",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Variations Under Domestication",
  "description" : "Sarah's hunt for answers is interrupted by a trip to the suburbs. Alison's paranoia has boiled over, putting all the Orphans at risk. But when Sarah, Alison and Beth's worlds dangerously collide, Sarah must decide who to trust with her secret."
}, {
  "imdbId" : "2234222",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Parts Developed in an Unusual Manner",
  "description" : "With Paul missing, Sarah is forced to confront the conspiracy head on. But when Paul learns Sarah has kept essential information from him, the fragile trust between them threatens to shatter. Meanwhile, Cosima grows closer to Delphine and the dangerously fascinating Dr. Leekie."
}, {
  "imdbId" : "2234222",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Entangled Bank",
  "description" : "Art and Angela investigate Sarah's life. Alison has an affair with her best friend's husband. Paul ties up a loose end. Helena finds Sarah's weak spot."
}, {
  "imdbId" : "2234222",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "Unconscious Selection",
  "description" : "After Kira's life is threatened, Sarah is on the warpath, but Dr. Leekie makes her think twice about her plans for revenge. Meanwhile, Cosima faces the truth about Delphine, forcing her to choose sides. Now, it's up to Sarah to decide the killer's fate, but the truth about where Sarah came from changes everything."
}, {
  "imdbId" : "2234222",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "Endless Forms Most Beautiful",
  "description" : "Dr. Leekie offers deals to both Alison and Cosima. Sarah meets Rachel Duncan. Delphine tries to make amends. Alison tries to get her life back together. Helena escapes."
}, {
  "imdbId" : "2234222",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "Nature Under Constraint and Vexed",
  "description" : "Rachel has kidnapped Kira and Mrs. S. While trying to elude Rachel's thugs herself, Sarah has to decide whether to trust Paul as the person who has the best access to Rachel of those she knows in order to get Kira back. All Paul does tell Sarah is that there is a black tie event at Dyad at which Rachel will be in attendance. Sarah decides that she needs to attend the event - Cosima who already is an invitee - but has no plan beyond knowing that she will need to get in there with concealed gun in hand. With this scant outline of a plan, Sarah enlists the help of Felix ..."
}, {
  "imdbId" : "2234222",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "Governed by Sound Reason and True Religion",
  "description" : "On information from Art, Sarah learns that it is not Rachel who abducted Kira, but rather the Prolethians, the reasons she does not know behind the abduction. However, there is no news whatsoever about Mrs. S, who she believes must have also been abducted along with Kira, which is only of little concern to her based on what her birth mother told her before her death. Regardless, Sarah decides to trust Art so that he can help her locate Kira. What Sarah discovers in the matter is not quite what she expects, which results in her not knowing who to trust. Art also tries ..."
}, {
  "imdbId" : "2234222",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "Mingling Its Own Nature with It",
  "description" : "Sarah is able to escape with Kira from the bird watchers and Mrs. S, and now, along with Felix, are on the run with no money. They decide to take refuge at a secluded house where the owner seems to be away. But the choice of the house is no accident. This stop has an unintended effect on Felix. As Alison prepares for opening night, she slowly begins to unravel under all the pressure, which includes meeting someone who she believes is another monitor. Cosima learns from Delphine of yet another clone, Jennifer, who recently died from whatever ails Cosima herself. They ..."
}, {
  "imdbId" : "2234222",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "Governed as It Were by Chance",
  "description" : "Sarah survives the car crash, is quickly reunited with Kira and sets off with Cal in his camper. She decides to head back to the city to find out from Mrs. S just what is going on. She also pays a visit to Rachel which doesn't quite go as expected. At the Dyad Institute, Cosima takes on the task of finding out about Project Leda. Alison awakens from her drug and alcohol stupor to find her right arm in a sling - and that she's in a rehab clinic. Felix convinces her she should spend a week there and just rest. Henrik Johanssen makes it clear to his daughter Gracie that ..."
}, {
  "imdbId" : "2234222",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "Ipsa Scientia Potestas Est",
  "description" : "Rachel returns home to find Rosen dead, which she takes out on Sarah and Cosima. She also makes Paul an offer he can't refuse, even if he wanted to. In this new position, Paul decides to use Felix to help Rachel. Leekie, unlike Rachel, shows that his plans veer toward the truly scientific, he who provides Cosima and Delphine with some information about the clones' past. Feeling indebted to Helena for saving her from Rosen, Sarah decides to help Helena within the bounds of what Sarah believes is right. Helena may have thoughts of her own about what she wants to achieve..."
}, {
  "imdbId" : "2234222",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "To Hound Nature in Her Wanderings",
  "description" : "Sarah and Helena are traveling together to Cold River to find out more about their clone past and specifically the person who Helena refers to as the Swan Man. This trip marks the first time that Helena has felt a sense of freedom in a long time. This freedom, however, may ultimately cause problems for her. Sarah's quest for information takes her to some unlikely places, or more precisely to some unexpected people. She gets some help in this quest by Art and Felix, who have the information obtained from Maggie Chen's storage unit. Felix, however, is often in a state ..."
}, {
  "imdbId" : "2234222",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "Knowledge of Causes, and Secret Motion of Things",
  "description" : "When a rehab confidante betrays Alison and threatens to expose the truth about Aynsley's death, she goes into free fall on the eve of Family Day. With Donnie and the kids set to visit, it's all clones on deck to contain the fallout."
}, {
  "imdbId" : "2234222",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "Variable and Full of Perturbation",
  "description" : "A new player in the clone conspiracy turns up at Felix's door, sending him into crisis mode. With Cosima running out of options, Sarah struggles with the decision to surrender a crucial piece of leverage and make a deal with DYAD."
}, {
  "imdbId" : "2234222",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "Things Which Have Never Yet Been Done",
  "description" : "Cosima takes a turn for the worse, forcing Sarah to take desperate action - with tragic consequences for those she loves. The Proletheans set their ultimate plan in motion. Alison and Donnie tangle with the law."
}, {
  "imdbId" : "2234222",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "By Means Which Have Never Yet Been Tried",
  "description" : "After the successful abduction of Kira, Sarah prepares to surrender to Rachel and the Dyad Group; but the Clone Club has other ideas as they band together to pull off the ultimate rescue."
}, {
  "imdbId" : "2234222",
  "season" : "3",
  "episodeNumber" : "1",
  "title" : "The Weight of This Combination",
  "description" : "Sarah pursues the missing Helena who is held in a faraway compound. Sarah must use her wiles - and acting chops - to deter a Topside investigator who threatens the Leda sisters' lives. Meanwhile, Cosima appears to be rebounding from her illness, while Alison and Donnie face newfound financial woes. But when the menace of Castor rears its head once more, Sarah and her entire family must come together to survive."
}, {
  "imdbId" : "2234222",
  "season" : "3",
  "episodeNumber" : "2",
  "title" : "Transitory Sacrifices of Crisis",
  "description" : "Castor pursues the Leda clones for original tissue samples. Helena, who is pregnant and imprisoned, is examined by a mysterious new villain. The Castor boys are also out to play, sexually assaulting a frightened young woman, Patty, which ultimately sets Sarah - and Art - hot on the Castor trail. Sarah gleans they may have a mysterious defect that puts their lives in peril."
}, {
  "imdbId" : "2234222",
  "season" : "3",
  "episodeNumber" : "3",
  "title" : "Formalized, Complex, and Costly",
  "description" : "Leda and Castor are both on the hunt for original clone DNA. On-the-lam, Mark and Gracie pursue new leads to find the samples that might set them free, while Art and Sarah reunite to track them down. Meanwhile, Cosima and Scott try to learn more about Castor's biology and Alison's new money-making venture is going gangbusters. A shocking revelation about the Castor-Leda connection leaves the sisters reeling, just before Sarah witnesses a deadly Prolethean-Castor face-off."
}, {
  "imdbId" : "2234222",
  "season" : "3",
  "episodeNumber" : "4",
  "title" : "Newer Elements of Our Defense",
  "description" : "Sarah's fate hangs in the balance as she tries to save her sister."
}, {
  "imdbId" : "2234222",
  "season" : "3",
  "episodeNumber" : "5",
  "title" : "Scarred by Many Past Frustrations",
  "description" : "Sarah and Helena suffer a strained reunion; the Leda family worries about Sarah's absence."
}, {
  "imdbId" : "2234222",
  "season" : "3",
  "episodeNumber" : "6",
  "title" : "Certain Agony of the Battlefield",
  "description" : "Paul learns the truth about Coady's plans for Castor and has no choice but to make a dangerous play."
}, {
  "imdbId" : "2234222",
  "season" : "3",
  "episodeNumber" : "7",
  "title" : "Community of Dreadful Fear and Hate",
  "description" : "Sarah and Helena have managed to escape from the Castor compound, and arranging with Mrs. S are awaiting Benjamin's arrival in the Mexican desert to retrieve them. However, they are surprised to see that their retriever is Mrs. S herself. This meeting allows for a showdown between Helena and Mrs. S, the former who wants to kill the latter for selling her out. With Cosima's new relationship with Shay being strong, Cosima is having problems dealing with Delphine, whether it be on a professional or personal level. Cosima feels like betraying a request by Delphine without..."
}, {
  "imdbId" : "2234222",
  "season" : "3",
  "episodeNumber" : "8",
  "title" : "Ruthless in Purpose, and Insidious in Method",
  "description" : "Ruthless in Purpose, and Insidious in Method Rachel bargains for her freedom with decoding Duncan's Moreau book."
}, {
  "imdbId" : "2234222",
  "season" : "3",
  "episodeNumber" : "9",
  "title" : "Insolvent Phantom of Tomorrow",
  "description" : "Clone Club heads to London to track down the Castor Original, but their enemies follow closely."
}, {
  "imdbId" : "2234222",
  "season" : "3",
  "episodeNumber" : "10",
  "title" : "History Yet to Be Written",
  "description" : "Kendall may be the key to stop Castor; the sisters appear to be thwarting their most dangerous foe."
}, {
  "imdbId" : "2234222",
  "season" : "4",
  "episodeNumber" : "1",
  "title" : "The Collapse of Nature",
  "description" : "A flashback to Beth Childs' final investigation, days before her suicide."
}, {
  "imdbId" : "2234222",
  "season" : "4",
  "episodeNumber" : "2",
  "title" : "Transgressive Border Crossing",
  "description" : "After fleeing Iceland, Sarah begins searching for M.K. and uncovers new clues to Beth's breakdown. Scott learns Kendall Malone is hiding something."
}, {
  "imdbId" : "2234222",
  "season" : "4",
  "episodeNumber" : "3",
  "title" : "The Stigmata of Progress",
  "description" : "As Sarah scrambles to learn more about her implant, Alison and Donnie take a drastic step to help. Meanwhile, Kira has a disturbing vision."
}, {
  "imdbId" : "2234222",
  "season" : "4",
  "episodeNumber" : "4",
  "title" : "From Instinct to Rational Control",
  "description" : "While Cosima examines Leekie's body, Felix and Donnie pose as a couple to learn more about a fertility clinic. Sarah discovers M.K. has her own agenda."
}, {
  "imdbId" : "2234222",
  "season" : "4",
  "episodeNumber" : "5",
  "title" : "Human Raw Material",
  "description" : "A risky cover mission at Brightborn yields several big surprises. The rift between Sarah and Felix grows as she checks up on Adele."
}, {
  "imdbId" : "2234222",
  "season" : "4",
  "episodeNumber" : "6",
  "title" : "The Scandal of Altruism",
  "description" : "Seeing that it is the best overall solution yet not perfect by any means, Sarah and Cosima decide with Kendall's OK to set up an agreement with Susan Duncan, which they will not divulge to Mrs. S. until everything is arranged as they know she won't like what they've done. That agreement is an agent representing Susan will remove the bot from Sarah's cheek, with Cosima on site to ensure Sarah's safety. As Scott and Cosima have not yet come up with a \"cure\" for Cosima and the other affected Leda clones, they in turn will provide their research and Kendall to Susan, with..."
}, {
  "imdbId" : "2234222",
  "season" : "4",
  "episodeNumber" : "7",
  "title" : "The Antisocialism of Sex",
  "description" : "Sarah regresses to old habits while struggling to cope with the consequences of her decisions - reconnecting with Beth on a dark night of the soul. Back at the lab, Cosima, haunted by vicious memories and news of Delphine, attempts a dangerous Hail Mary to find a cure. At the Hendrixes, Alison is more determined than ever to create normalcy for her kids. As she forges ahead with a birthday party, Donnie is caught in the Neolution crosshairs."
}, {
  "imdbId" : "2234222",
  "season" : "4",
  "episodeNumber" : "8",
  "title" : "The Redesign of Natural Objects",
  "description" : "Siobhan wants vengeance for her mother. Cosima and Susan Duncan try to come together to try to finally find the cure. Neolution continues with their threats causing Alison to be terrified, and Mrs. To question her loyalty to her sestras."
}, {
  "imdbId" : "2234222",
  "season" : "4",
  "episodeNumber" : "9",
  "title" : "The Mitigation of Competition",
  "description" : "The formal alliance between the sisters on one side Susan/Rachel/Ira on the other side begins in earnest. Cosima has arrived on the island where she and Susan will begin the process of finding a cure for both Leda and Castor by developing original DNA in the absence of Kendall through fertilization of one of Sarah's eggs with Ira's sperm, while Sarah and Felix meet with Rachel and Ira to discuss the next step in bringing down Evie Cho and restoring Susan as the head of Neolution. As Evie ramps up her media campaign to bring BrightBorn's work to the masses, Sarah, ..."
}, {
  "imdbId" : "2234222",
  "season" : "4",
  "episodeNumber" : "10",
  "title" : "From Dancing Mice to Psychopaths",
  "description" : "When communication with Cosima is cut off and Neolution appears to be within striking distance, Sarah's alliance with Rachel goes out the window. Sarah lures a high-level Neolutionist into a trap, and sets out to bring down Neolution once and for all."
}, {
  "imdbId" : "2234222",
  "season" : "5",
  "episodeNumber" : "1",
  "title" : "The Few Who Dare",
  "description" : "Desperate to get off the island and reunite with her family, a wounded Sarah journeys into the island's interior, only to discover a mysterious village - the beating heart of the Neolution agenda."
}, {
  "imdbId" : "2234222",
  "season" : "5",
  "episodeNumber" : "2",
  "title" : "Clutch of Greed",
  "description" : "Dragged home from the Island by Neolution, Sarah refuses to follow Rachel's new regime. Sarah sets a plan in motion to get her and her daughter out of Neolution's reach for good."
}, {
  "imdbId" : "2234222",
  "season" : "5",
  "episodeNumber" : "3",
  "title" : "Beneath Her Heart",
  "description" : "As Clone Club reels from the loss of one of their own, Sarah gnaws at the shackles Rachel has firmly placed around her family. Alison struggles to find her place in the sisterhood."
}, {
  "imdbId" : "2234222",
  "season" : "5",
  "episodeNumber" : "4",
  "title" : "Let the Children and Childbearers Toil",
  "description" : "Sarah and Siobhan follow a lead on a Neolution defector, hoping for enough leverage to free Kira from Dyad's clutches. Also, Cosima investigates rumors about a creature in the woods."
}, {
  "imdbId" : "2234222",
  "season" : "5",
  "episodeNumber" : "5",
  "title" : "Ease for Idle Millionaires",
  "description" : "While Sarah and Kira spend time at home bonding, Cosima unlocks the island's biggest secret, discovering a link between the village's so-called creature and the science around Kira."
}, {
  "imdbId" : "2234222",
  "season" : "5",
  "episodeNumber" : "6",
  "title" : "Manacled Slim Wrists",
  "description" : "Cosima is forced into an alliance with Susan Duncan when an old enemy returns to the Island. Meanwhile, on the mainland, Krystal stumbles onto a vital clue to the Neolution endgame."
}, {
  "imdbId" : "2234222",
  "season" : "5",
  "episodeNumber" : "7",
  "title" : "Gag or Throttle",
  "description" : "As Westmoreland demands a more aggressive approach with Kira, and Sarah fights to save her daughter, Rachel discovers a dark secret that makes her question her place within Neolution."
}, {
  "imdbId" : "2234222",
  "season" : "5",
  "episodeNumber" : "8",
  "title" : "Guillotines Decide",
  "description" : "Now that Sarah and Mrs. S have Kira back, they need to get her into a safe place. The activity around their house is remarkably quiet which Sarah believes is not a good sign. However, Mrs. S would like them now to focus on other things in their lives, namely Felix's first art exhibit in two years, he and Adele who have come back from their sleuthing in Switzerland. This exhibit is important for Felix as major art dealers and critics will be in attendance. All the sisters who are around - Sarah, Alison and Cosima - know the role they are to play in Felix's big day. ..."
}, {
  "imdbId" : "2234222",
  "season" : "5",
  "episodeNumber" : "9",
  "title" : "One Fettered Slave",
  "description" : "Sarah, Felix and Kira mourning the death of S coincides with they and the other sisters learning from Sister Irina that Helena has been kidnapped. The sisters' first thought is that she has been taken to the island, but they figure that the one person who they now may seemingly be able to trust to some extent that would know for sure is Rachel. Rachel is only able to fill in some of the pieces. However, with news of Dyad's involvement in the genetics project hitting the media, Interpol has been called in to take over from the police the investigation of the deaths of ..."
}, {
  "imdbId" : "2234222",
  "season" : "5",
  "episodeNumber" : "10",
  "title" : "To Right the Wrongs of Many",
  "description" : "Now in labor, Helena is forced to hunker down in the basement of Old Dyad for the delivery. It's a cage match for survival as Sarah and Art struggle to protect her in a desperate last stand against Neolution."
}]