[{
  "imdbId" : "0289830",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Beyond the Sky",
  "description" : "During a bombing mission over Germany in December 1944, Capt. Russell Keys apparently survives his plane crashing after seeing bright lights in the sky. After the war, he is plagued by nightmares where he is mistreated by strange beings. As the nightmares continue, he learns that 8 of his 9 crew members are now dead. In Roswell, N.M. in 1947, U.S. Army Captain Owen Crawford goes up against Col. Thomas Campbell who is hiding the fact that a flying saucer has crashed in the area. Crawford is determined to take over the project and sets about to undermine the Colonel's ..."
}, {
  "imdbId" : "0289830",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Jacob and Jesse",
  "description" : "It's now 1958 and Russell Keys has long ago left his family. During one of his abductions however, he see his now teenage son Jesse has also been abducted. Keys has been trying to find a pattern to his abductions in the hope of avoiding being taken. So he returns to his home in Illinois and convinces his son to run away with him. His wife, who is re-married to a police officer, is frantic particularly when Russell returns but Jesse does not. Owen Crawford is now a Lieutenant Colonel and in charge of the program resulting from the Roswell crash. Very little has been ..."
}, {
  "imdbId" : "0289830",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "High Hopes",
  "description" : "Jesse Keys seeks out his father Russell and together they decide to report their abductions to the Air Force. Medical tests reveal that they each have an identical brain implant. Eventually they are directed to Colonel Crawford but the attempt to remove the implant from Russell's brain doesn't go as planned. At home, Crawford has to deal with his wife's increasingly erratic behavior. Crawford's men discover that Jacob Clarke is still alive in Montana and try to take him but they underestimate his powers."
}, {
  "imdbId" : "0289830",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Acid Tests",
  "description" : "It's now 1970 and Colonel Crawford is forced to retire after claiming to have found a potential landing strip for alien ships, which turn out to be human-made crop circles made by Tom Clarke specifically to discredit him. One of Crawford's sons, Sam, sees a newspaper report of an archaeological find in Alaska that bears the same hieroglyphs as is on the metal object he keeps locked away. He travels to Alaska to see what he can find out. Jesse Keys is now a young adult but keeps a low profile traveling from town to town. He's also a drug addict but while recovering in ..."
}, {
  "imdbId" : "0289830",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Maintenance",
  "description" : "It's 1980 and Eric Crawford is now the head of the UFO program. Soon after his father's death, he blackmailed government officials into giving him the post. Jesse Keys is married but is becoming increasingly paranoid over his abductions and agrees to seek professional help. He soon finds himself under the control of the military. Jacob is married and still has his special powers. He returns to Texas and reunites with his family at their mother's death bed. He tells his brother Tom about his origins and Tom goes from being the biggest pessimist to the strongest ..."
}, {
  "imdbId" : "0289830",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Charlie and Lisa",
  "description" : "Jacob Clarke dies at a relatively young age. His wife eventually re-marries but his daughter Lisa, five years after his death, is abducted by aliens. Eric Crawford is out of a job and back to civilian life after the aliens recover all of the artifacts from the Roswell crash. As the years go by the various characters go about their lives but in 1991, Crawford is called back to service when the payload aboard a spacecraft vanishes. Jesse Keys' son Charlie is a successful schoolteacher but has decided that he will resist any further attempts at abducting him. Lisa meets ..."
}, {
  "imdbId" : "0289830",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "God's Equation",
  "description" : "Mary Crawford has joined her father's project but is proving to be cut from the same cloth as her grandfather as she is quite vicious and will stop at nothing to succeed. The scientists believe they have found a way to block signals from the implant. Charlie and Lisa meet quite by accident in a group therapy session and after subsequently undergoing hypnotherapy, realize that Charlie is the father of Lisa's 9-year old daughter Allie. When an emotionally unstable member of the therapy group shoots Charlie and takes all of the others hostage, Allie demonstrates ..."
}, {
  "imdbId" : "0289830",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Dropping the Dishes",
  "description" : "With Allie Keys in government custody, the plan is to use her as bait to attract one of the alien vessels. Mary Crawford finds herself out of the project however when it's taken over by General Beers. Charlie and Lisa are desperate to find Allie and Lisa undergoes hypnosis to see if she can make a psychic connection. She determines that Allie is in North Dakota and they set off to find her. Mary Crawford, using her many contacts, gets the same information and they all converge on the US Army site. When the alien craft arrives, Mary takes drastic action."
}, {
  "imdbId" : "0289830",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "John",
  "description" : "With Mary Crawford now aboard the disabled alien vessel, the military start to move in. She sees her grandfather and has a conversation with him while an army Lieutenant gets to talk with his late mother. In order to save herself and those she cares about, Allie uses her powers in a very special way. On the road again, Lisa, Charlie and Allie have to keep a low profile as their photos are constantly on the news. Lisa meets a relative she has never met before and Allie has to use her powers to save him."
}, {
  "imdbId" : "0289830",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "Taken",
  "description" : "Still being pursued by the military and by Mary Crawford, Lisa makes contact with her Uncle Tom who suggest they go to his mother's house in Texas and eventually onto Mexico and South America. The fact that Allie can be tracked presents a major difficulty. Mary Crawford and Dr. Chet Wakeman have a serious difference of opinion on what to do about Allie, leading Mary to take some drastic action. As the military moves in, Allie has a fateful choice to make."
}]