[{
  "imdbId" : "7049682",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "It's Summer and We're Running Out of Ice",
  "description" : "Angela investigates the attempted murder of a fellow officer; The Lord of a Country Estate receives an anniversary gift from his loyal servants."
}, {
  "imdbId" : "7049682",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Martial Feats of Comanche Horsemanship",
  "description" : "As Angela relives haunting memories of an attack on her family, she detains a mysterious man who claims responsibility for Tulsa's most recent murder; An original play is performed for an audience of one."
}, {
  "imdbId" : "7049682",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "She Was Killed by Space Junk",
  "description" : "Following a late-night visit from the senator, FBI agent Laurie Blake heads to Tulsa to take over the recent murder investigation; The Lord of The Manor receives a harshly worded letter and responds accordingly."
}, {
  "imdbId" : "7049682",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "If You Don't Like My Story, Write Your Own",
  "description" : "Reclusive trillionaire Lady Trieu finally enters the stage with a mysterious offer; With Laurie getting closer to the truth of her coverup, Angela enlists Looking Glass for help; The Lord trains two new servants."
}, {
  "imdbId" : "7049682",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Little Fear of Lightning",
  "description" : "The origin story of Looking Glass is revealed, as is the truth behind the greatest hoax in American history; The Smartest Man In The World plots a daring escape."
}, {
  "imdbId" : "7049682",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "This Extraordinary Being",
  "description" : "Deep under the influence of Nostalgia, Angela gets a firsthand account of her grandfather's journey."
}, {
  "imdbId" : "7049682",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "An Almost Religious Awe",
  "description" : "Under Lady Trieu's care, Angela undergoes an unconventional treatment; Laurie chases down a lead; The Smartest Man in The World delivers a stunning defense of his past actions."
}, {
  "imdbId" : "7049682",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "A God Walks into Abar",
  "description" : "Angela's mysterious past in Vietnam is at last revealed."
}, {
  "imdbId" : "7049682",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "See How They Fly",
  "description" : "Everything ends. For real this time."
}]