[{
  "imdbId" : "4122068",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Episode #1.1",
  "description" : "Laura Hawkins begins to suspect there's something unusual about their family 'Synth' Anita."
}, {
  "imdbId" : "4122068",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Episode #1.2",
  "description" : "Niska stages a brutal escape from the brothel and Leo's secret is revealed. Meanwhile, George is horrified to be given a new Synth, Vera."
}, {
  "imdbId" : "4122068",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Episode #1.3",
  "description" : "Anita saves Toby's life; George tries to break free; and Pete is angry at the brothel-murder cover-up."
}, {
  "imdbId" : "4122068",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Episode #1.4",
  "description" : "Joe gets too close to Anita, and Karen is not what she seems. Meanwhile, Leo gets one step closer to finding Mia, and Niska gets revenge."
}, {
  "imdbId" : "4122068",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Episode #1.5",
  "description" : "With Karen on her tail, Leo sends Niska to George's house and an unlikely friendship begins. Also: Joe's secret threatens to destroy the Hawkins family."
}, {
  "imdbId" : "4122068",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Episode #1.6",
  "description" : "With the Hawkins family at their lowest ebb, Laura makes a confession that will have serious implications for Anita and leaves Mattie wondering if she can ever forgive her. Meanwhile, Karen discovers the whereabouts of Niska."
}, {
  "imdbId" : "4122068",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Episode #1.7",
  "description" : "When Karen goes in search of Niska, Pete tries to uncover the strange truth about his former partner. Laura provides a refuge for the hunted Synths, giving hope that they and humans can peacefully co-exist but Hobb is on their trail."
}, {
  "imdbId" : "4122068",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Episode #1.8",
  "description" : "As protesters march against the increased use of domestic Synths Hobb prepares to experiment on the brains of his captives in his efforts to crack the secret of artificial intelligence. Now fully sympathetic to Anita/Mia and the others as sentient creatures the Hawkins family, assisted by Pete Drummond, threaten to expose Hobb's experiment to the press unless he releases the Synths - which he does though with a tracking device inside Fred. On the run the family and the Synths mingle with the protesters before taking refuge in a church crypt. Here Leo takes a gamble on..."
}, {
  "imdbId" : "4122068",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "Episode #2.1",
  "description" : "The Hawkins family try to get their lives back on track. Niska is driven to a fateful decision while on the run in Berlin. Leo, Max and Mia are living in hiding near a coastal town when they are threatened by a mysterious organisation."
}, {
  "imdbId" : "4122068",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "Episode #2.2",
  "description" : "Karen and Pete learn of a special Synth which is being sold on the black market. Hestor uses dubious means to extract information from her prisoner and Mia risks exposing her secret to try and help Ed."
}, {
  "imdbId" : "4122068",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "Episode #2.3",
  "description" : "Athena arrives in the UK seeking a meeting with Hobb and Niska's consciousness assessments begin. Leo's group of Synths are forced to abandon their hiding place but Mia makes a decision that shocks her friends."
}, {
  "imdbId" : "4122068",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "Episode #2.4",
  "description" : "Mia and Ed get closer but their relationship is threatened when their secret is discovered. The outcome of the trial looks bleak for Niska until Laura calls a surprise witness."
}, {
  "imdbId" : "4122068",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "Episode #2.5",
  "description" : "Leo stakes out the silo and tracks down the sniper who shot Ten. Hester promises to use peaceful means to deal with the shooter, but can Leo trust her? Meanwhile, Mia risks falling into the hands of a mysterious organisation."
}, {
  "imdbId" : "4122068",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "Episode #2.6",
  "description" : "Athena challenges Milo over his ethics and is shocked to learn the extent of the tycoon's ambitions. Max starts a new community of synths and takes matters into his own hands when he learns how far Leo is prepared to go to achieve his aims."
}, {
  "imdbId" : "4122068",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "Episode #2.7",
  "description" : "Laura seeks Niska's help as Mia and Hester prepare to break into the silo - but their attack does not go to plan. Meanwhile, Karen goes in search of Athena and makes a life-changing decision."
}, {
  "imdbId" : "4122068",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "Episode #2.8",
  "description" : "In the aftermath of events at the silo, Hester seeks revenge on Leo. Karen decides she and Sam have no future. Niska plans to return to Berlin with Astrid, but cannot abandon her family. Joe makes a shocking confession to Laura."
}]