[{
  "imdbId" : "5313984",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Awakening",
  "description" : "Episode One: Awakening is crucial in setting up the context for the dramatic story of the events of Easter Week 1916. Here, the audience is introduced to the main characters and the main players of Easter Week on all sides and, through them, are made aware of the political and cultural currents playing out in Ireland, Europe, and the world-including the role of Empire, the outbreak of the first World War, the rise of socialist, feminist and nationalist thought and self determination.Episode 1 will bring viewers up to the cusp of Easter week itself."
}, {
  "imdbId" : "5313984",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Insurrection",
  "description" : "Episode Two: Insurrection examines the events of Easter Week 1916 on a day-to-day basis. Through the use of graphics and contributions from military historians, viewers are provided with both an insight into particular locations, such as the General Post Office, as well as a clear, overall view of the state of play in Dublin. They will also hear-via archival material that has been rarely seen or heard-from the voices of participants: rebels, British soldiers, and civilian witnesses. Viewers will experience as far as possible what it was like to be an eyewitness to ..."
}, {
  "imdbId" : "5313984",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "When Myth and History Rhyme",
  "description" : "The third and final episode, When Myth and History Rhyme, deals with the surrender and subsequent executions of the leaders of the Irish Rebellion and the fundamental changes arising from these events. The aim is to have viewers experience the same emotional response as did the men and women of the time-which is accomplished through first-person narratives, descriptions of the executions, and the last statements of the leaders. Doing so allows viewers to understand the sea change that occurred in Ireland in the aftermath of the Rising. Contributors to the series will ..."
}]