[{
  "imdbId" : "4118466",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Vertical Mobility",
  "description" : "In 2074, where corporations govern all, one man must risk exposing his true identity to find his lost love."
}, {
  "imdbId" : "4118466",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Downsizing",
  "description" : "Ben scrambles to deflect suspicion after the Spiga data breach; Laura offers to help when her mother's policies evict an innocent family; Theo is forced into an important cage fight."
}, {
  "imdbId" : "4118466",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Human Resources",
  "description" : "An executive from a rival company covertly offers to divulge valuable secrets, prompting Ben, Elizabeth, and Julian to plan a defection. Meanwhile, Laura responds to a domestic betrayal; and in the past, Aaron and Elena meet again."
}, {
  "imdbId" : "4118466",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Cost Containment",
  "description" : "The Larsons and Elizabeth don't see eye to eye when it comes to certain life choices; Theo defies an order to cripple a basketball prodigy; Roger enlists help uncovering Ben's secrets; and a daring heist is planned by Aaron and Theo."
}, {
  "imdbId" : "4118466",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Profit and Loss",
  "description" : "Ben improvises to keep Roger from discovering the truth about Elena; at the same time, he faces pressure from Elizabeth to complete a vital project. Meanwhile, Laura takes her therapy to the next level; and Julian offers assistance to a friend in need."
}, {
  "imdbId" : "4118466",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Sweating the Assets",
  "description" : "Laura, who's on a mission of mercy, relives the painful events of eight years ago that forever changed her life and her relationships with Elizabeth and Julian. Meanwhile, a sudden event causes Ben and Theo to rethink their next move."
}, {
  "imdbId" : "4118466",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Executables",
  "description" : "Ben races to finish the Everclear device and help Spiga question an enemy agent; Laura brokers to save a girl's sight; Theo's skills are tested against a well-conditioned opponent from uptown."
}, {
  "imdbId" : "4118466",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Operational Realignment",
  "description" : "After his strategy misfires, Ben's backup plan risks his life and Elena's rescue; Laura bypasses company policy to save a cardiac patient; Julian accepts Ben's help to investigate a murder."
}, {
  "imdbId" : "4118466",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "Burning Platform",
  "description" : "Ben's ongoing investigation leads to a shock; Laura's child patient reveals some sobering facts; and Elizabeth and Julian put their bold plan against Inazagi in motion. A thief is discovered; a killer is hunted down; Elizabeth and Laura deal with the fate of the clinic; and Theo makes his way inside the wall."
}, {
  "imdbId" : "4118466",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "Golden Parachute",
  "description" : "Ben's mission reaches a critical juncture; Laura finds the thief; Theo ventures inside the wall; Elizabeth and Laura reckon with the fate of the clinic; Julian tracks a killer."
}]