[{
  "imdbId" : "5361834",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Ancestors",
  "description" : "Historian Michael Wood looks back at the start of China's history from the creation legend to the first 3 recorded dynasties Xia, Shang and Zhou, to the unification of 7 states under Qin Shi Huang. The name China comes from this Qin Dynasty, although the Chinese people refer to themselves as The Han."
}, {
  "imdbId" : "5361834",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Silk Roads and China Ships",
  "description" : "Michael Wood tells the tale of China's first great international age under the Tang Dynasty (618-907). He travels along the Silk Road to the bazaars of central Asia and into India on the track of the Chinese monk who brought Buddhism back to China."
}, {
  "imdbId" : "5361834",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Golden Age",
  "description" : "The tale of what's broadly considered China's most creative dynasty - the Song (960-1279). Michael Wood heads to the city of Kaifeng, the greatest city in the world before the 19th century."
}, {
  "imdbId" : "5361834",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "The Ming",
  "description" : "The tale of one of China's most famous dynasties begins with the amazing story of Hongwu, a peasant rebel who founded one of greatest eras in Chinese history."
}, {
  "imdbId" : "5361834",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "The Last Empire",
  "description" : "China's last empire, the Qing, lasted from 1644 to 1912. It began in violence and war as the Manchus swept down from the north, but invaders became emperors, with three generations of one family ruling the country. Among them, Michael Wood argues, was China's greatest emperor - Kangxi."
}, {
  "imdbId" : "5361834",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "The Age of Revolution",
  "description" : "'Revolution', Michael Wood observes, 'has been a fact of life in Chinese history'. Between 1850 and 1950, three cataclysmic revolutions shook China to the core, but out of them, today's China emerged."
}]