[{
  "imdbId" : "0052520",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Where Is Everybody?",
  "description" : "Mike Ferris finds himself alone in the small Oakwood town and without recollection about his name, where he is or who he is. Mike wanders through the town trying to find a living soul. The tension increases and Mike has a breakdown."
}, {
  "imdbId" : "0052520",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "One for the Angels",
  "description" : "A pitchman (Ed Wynn) is visited by Death and is forced to get his priorities in order."
}, {
  "imdbId" : "0052520",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Mr. Denton on Doomsday",
  "description" : "The town drunk in the old-west faces his past when Fate lends a hand."
}, {
  "imdbId" : "0052520",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "The Sixteen-Millimeter Shrine",
  "description" : "Barbara Jean Trenton is a faded film star who lives in the past by constantly re-watching her old movies instead of moving on with her life, so her associates try to lure her out of her self-imposed isolation."
}, {
  "imdbId" : "0052520",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Walking Distance",
  "description" : "A man makes a time travel to his childhood, when he's just a few miles away from his native town."
}, {
  "imdbId" : "0052520",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Escape Clause",
  "description" : "A hypochondriac man sells his soul to the devil, exchanging it for one million years of immortality."
}, {
  "imdbId" : "0052520",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "The Lonely",
  "description" : "A convict, living alone in an asteroid, receives from the police a realistic woman-robot."
}, {
  "imdbId" : "0052520",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Time Enough at Last",
  "description" : "A henpecked book lover finds himself blissfully alone with his books after a nuclear war."
}, {
  "imdbId" : "0052520",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "Perchance to Dream",
  "description" : "A fatigued man fights to stay awake as he explains to a psychiatrist that if he falls asleep it will trigger a nightmare, which will cause his heart to fail."
}, {
  "imdbId" : "0052520",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "Judgment Night",
  "description" : "A man finds himself on a ship in the Atlantic in 1942 not knowing who he was or how he got there. He does know that the ship would be attacked by a German submarine."
}, {
  "imdbId" : "0052520",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "And When the Sky Was Opened",
  "description" : "Three U.S. astronauts blast off from Earth on an initial test flight in an experimental rocket-ship, but during the flight into space the ship disappears from radar, then reappears. On return, the rocket-ship is hangared and put under a tarp, pending an investigation. One crewman is hospitalized for a leg broken on landing, and is visited by the other two. Next the pair go for a drink, and then one crewman phones his parents from a bar phone-booth - but they say they have no son! The astronaut immediately disappears, and no one in the bar remembers him, except the ..."
}, {
  "imdbId" : "0052520",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "What You Need",
  "description" : "A small time crook plans to exploit an old street peddler who has the uncanny knack of selling people exactly what they will shortly need."
}, {
  "imdbId" : "0052520",
  "season" : "1",
  "episodeNumber" : "13",
  "title" : "The Four of Us Are Dying",
  "description" : "A man who can change his face to look like other people uses his ability to improve his life regardless of his affect on others."
}, {
  "imdbId" : "0052520",
  "season" : "1",
  "episodeNumber" : "14",
  "title" : "Third from the Sun",
  "description" : "Two families of Government employees plan to steal a spaceship and travel to another planet just prior to a nuclear war. They must also deal with a stooge who wants to stop them."
}, {
  "imdbId" : "0052520",
  "season" : "1",
  "episodeNumber" : "15",
  "title" : "I Shot an Arrow into the Air",
  "description" : "Order breaks down between three surviving crewmen whose rocket ship crashes on an unknown world with limited water and supplies."
}, {
  "imdbId" : "0052520",
  "season" : "1",
  "episodeNumber" : "16",
  "title" : "The Hitch-Hiker",
  "description" : "A young woman driving cross country becomes frantic when she keeps passing the same man on the side of the road. No matter how fast she drives the man is always up ahead, hitching her for a ride."
}, {
  "imdbId" : "0052520",
  "season" : "1",
  "episodeNumber" : "17",
  "title" : "The Fever",
  "description" : "An elderly man catches gambling fever from a slot machine that he believes is calling his name."
}, {
  "imdbId" : "0052520",
  "season" : "1",
  "episodeNumber" : "18",
  "title" : "The Last Flight",
  "description" : "A World War I British fighter pilot lands at an American air force base in France 42 years in the future."
}, {
  "imdbId" : "0052520",
  "season" : "1",
  "episodeNumber" : "19",
  "title" : "The Purple Testament",
  "description" : "A U.S. army lieutenant serving in the Philippines during WWII develops a harrowing ability to see in the faces of the men of his platoon, who will be the next ones to die."
}, {
  "imdbId" : "0052520",
  "season" : "1",
  "episodeNumber" : "20",
  "title" : "Elegy",
  "description" : "Three astronauts touch down on an asteroid, where they discover a world of people that appear to be frozen in time. Confused, they theorize as to why everyone is motionless, until a man springs to life and explains."
}, {
  "imdbId" : "0052520",
  "season" : "1",
  "episodeNumber" : "21",
  "title" : "Mirror Image",
  "description" : "While waiting in a bus station, Millicent Barnes has the strange feeling that her doppelganger is trying to take over her life."
}, {
  "imdbId" : "0052520",
  "season" : "1",
  "episodeNumber" : "22",
  "title" : "The Monsters Are Due on Maple Street",
  "description" : "On a peaceful suburban street, strange occurrences and mysterious people stoke the residents' paranoia to a disastrous intensity."
}, {
  "imdbId" : "0052520",
  "season" : "1",
  "episodeNumber" : "23",
  "title" : "A World of Difference",
  "description" : "A businessman sitting in his office inexplicably finds that he is on a production set and in a world where he is a movie star. Uninterested in the newfound fame, he fights to get back to his home and family."
}, {
  "imdbId" : "0052520",
  "season" : "1",
  "episodeNumber" : "24",
  "title" : "Long Live Walter Jameson",
  "description" : "A father forbids a history professor from marrying his daughter when he discovers that the captivating lecturer is actually an immortal who has lived for thousands of years."
}, {
  "imdbId" : "0052520",
  "season" : "1",
  "episodeNumber" : "25",
  "title" : "People Are Alike All Over",
  "description" : "Biologist Sam Conrad is scheduled to go on a mission to Mars and is genuinely concerned about what they will find there. The mission commander, Mark Marcusson, tells him there's nothing to worry about as he firmly believes that God made everyone in his image and no matter what they find, he is certain that people are alike all over. They crash-land on Mars and Marcusson dies from his injuries. Conrad is happy to find that the people of Mars are very human-like, friendly and intelligent. They provide him with a home and promise him much more. Too late however he ..."
}, {
  "imdbId" : "0052520",
  "season" : "1",
  "episodeNumber" : "26",
  "title" : "Execution",
  "description" : "When a 20th-century scientist tests out his time machine he accidentally retrieves a 19th-century murderer - saving him from the hangman's noose. Unaware of the man's history, the two attempt to acclimatize him to his new surroundings."
}, {
  "imdbId" : "0052520",
  "season" : "1",
  "episodeNumber" : "27",
  "title" : "The Big Tall Wish",
  "description" : "An aging boxer finds himself the winner of a match he thought he had lost, the result a six year old's frantic wish. But can a world-weary, embittered man still believe in miracles, or will he turn his back on it?"
}, {
  "imdbId" : "0052520",
  "season" : "1",
  "episodeNumber" : "28",
  "title" : "A Nice Place to Visit",
  "description" : "When bad guy Henry Francis Valentine dies in a shootout with police, he wakes up in the next world where his every wish is granted forever, and ever."
}, {
  "imdbId" : "0052520",
  "season" : "1",
  "episodeNumber" : "29",
  "title" : "Nightmare as a Child",
  "description" : "A schoolteacher keeps seeing a strange little girl in her apartment building."
}, {
  "imdbId" : "0052520",
  "season" : "1",
  "episodeNumber" : "30",
  "title" : "A Stop at Willoughby",
  "description" : "Tired of his miserable job and wife, a businessman starts dreaming on the train each night, about an old, idyllic town called Willoughby. Soon he has to know whether the town is real and fancies the thought of seeking refuge there."
}, {
  "imdbId" : "0052520",
  "season" : "1",
  "episodeNumber" : "31",
  "title" : "The Chaser",
  "description" : "A young man obsessed with winning over an uninterested beauty gets more than he bargained for when he buys a love potion to gain her affection."
}, {
  "imdbId" : "0052520",
  "season" : "1",
  "episodeNumber" : "32",
  "title" : "A Passage for Trumpet",
  "description" : "A suicidally despondent trumpet player finds himself in a bizarre world where he seems to be the only moving being, except for one helpful other musician."
}, {
  "imdbId" : "0052520",
  "season" : "1",
  "episodeNumber" : "33",
  "title" : "Mr. Bevis",
  "description" : "An eccentric loser gets a new life from his guardian angel, but there is a price to keeping it."
}, {
  "imdbId" : "0052520",
  "season" : "1",
  "episodeNumber" : "34",
  "title" : "The After Hours",
  "description" : "A woman is treated badly by some odd salespeople on an otherwise empty department store floor."
}, {
  "imdbId" : "0052520",
  "season" : "1",
  "episodeNumber" : "35",
  "title" : "The Mighty Casey",
  "description" : "A down-and-out baseball team's fortunes are lifted by a mysterious but seemingly unbeatable young player."
}, {
  "imdbId" : "0052520",
  "season" : "1",
  "episodeNumber" : "36",
  "title" : "A World of His Own",
  "description" : "A writer demonstrates he can control reality simply by dictating changes."
}, {
  "imdbId" : "0052520",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "King Nine Will Not Return",
  "description" : "A pilot of a downed WW II bomber comes to in the African desert and desperately tries to find out what happened to the rest of his crew."
}, {
  "imdbId" : "0052520",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "The Man in the Bottle",
  "description" : "A luckless couple stumbles upon fortune when a genie materializes from a bottle in their antique shop. The genie grants them four wishes but warns them, prophetically, to be careful what you wish for."
}, {
  "imdbId" : "0052520",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "Nervous Man in a Four Dollar Room",
  "description" : "Small time criminal Jackie Rhoades must face both his past and his conscience while waiting for his next assignment."
}, {
  "imdbId" : "0052520",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "A Thing About Machines",
  "description" : "Bartlett Finchley's paranoia about the machines around proves true."
}, {
  "imdbId" : "0052520",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "The Howling Man",
  "description" : "David Ellington recounts a story, one that began just after the end of World War I. He was hiking in Europe when he sought refuge in an abbey during a violent rain storm. The residence is isolated and its head, Brother Jerome, tells him he cannot stay. Ellington is ill however and during his short stay meets someone who is being kept prisoner and howls constantly through the night. Ellington believes the Howling Man is being kept there for no good reason but Brother Jerome tells him of the man's true nature. The decision Ellington makes will haunt him for the rest of ..."
}, {
  "imdbId" : "0052520",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "Eye of the Beholder",
  "description" : "A young woman lying in a hospital bed, her head wrapped in bandages, awaits the outcome of a surgical procedure performed by the State in a last-ditch attempt to make her look \"normal\"."
}, {
  "imdbId" : "0052520",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "Nick of Time",
  "description" : "A pair of newlyweds stopping in a small town are trapped by their own superstition when playing a fortune telling machine in a local diner."
}, {
  "imdbId" : "0052520",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "The Lateness of the Hour",
  "description" : "The daughter of an inventor objects to their \"perfect\" home where they are waited on by mechanical servants."
}, {
  "imdbId" : "0052520",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "The Trouble with Templeton",
  "description" : "A nostalgic actor revisits his late wife and friends at their old haunt, only to find that he is now out of place there."
}, {
  "imdbId" : "0052520",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "A Most Unusual Camera",
  "description" : "When three dum-dum crooks get ahold of a camera that takes pictures of the future, they set out to make a quick fortune with their new toy."
}, {
  "imdbId" : "0052520",
  "season" : "2",
  "episodeNumber" : "11",
  "title" : "The Night of the Meek",
  "description" : "After a derelict Santa Claus is fired on Christmas Eve, he finds a mysterious bag that gives out presents. With this bag he sets out to fulfill his one wish - to see the less fortunate inherit the bounties of Christmas."
}, {
  "imdbId" : "0052520",
  "season" : "2",
  "episodeNumber" : "12",
  "title" : "Dust",
  "description" : "Luis Gallegos is scheduled to be hanged in a dusty western town after he was found guilty of killing a child while drunk. Gallegos' father begs everyone for mercy but the Marshal, who doesn't think the prisoner is a bad sort, has little choice but to proceed with the sentence. Peter Gomez decides to take advantage of the situation by selling the father his 'magic dust' that will make the townsfolk take pity on his son. Events provide for an unexpected conclusion."
}, {
  "imdbId" : "0052520",
  "season" : "2",
  "episodeNumber" : "13",
  "title" : "Back There",
  "description" : "At a prominent club in Washington, D.C., a socialite argues about whether it would be possible to change history by traveling back in time. When he leaves the club he finds himself in 1865, on the night that President Lincoln will be shot."
}, {
  "imdbId" : "0052520",
  "season" : "2",
  "episodeNumber" : "14",
  "title" : "The Whole Truth",
  "description" : "A used car salesman buys a car that dooms him to tell only the truth!"
}, {
  "imdbId" : "0052520",
  "season" : "2",
  "episodeNumber" : "15",
  "title" : "The Invaders",
  "description" : "When a woman investigates a clamor on the roof of her rural house, she discovers a small UFO and little aliens emerging from it. Or so it seems."
}, {
  "imdbId" : "0052520",
  "season" : "2",
  "episodeNumber" : "16",
  "title" : "A Penny for Your Thoughts",
  "description" : "Gaining telepathic abilities when his coin lands on its edge bank clerk Hector B. Poole learns about the difference between other people's plans and fantasies."
}, {
  "imdbId" : "0052520",
  "season" : "2",
  "episodeNumber" : "17",
  "title" : "Twenty Two",
  "description" : "While in the hospital recovering from overwork, Liz Powell keeps dreaming about going down to the hospital morgue."
}, {
  "imdbId" : "0052520",
  "season" : "2",
  "episodeNumber" : "18",
  "title" : "The Odyssey of Flight 33",
  "description" : "Passing through the sound barrier a commercial airliner inadvertently travels back in time."
}, {
  "imdbId" : "0052520",
  "season" : "2",
  "episodeNumber" : "19",
  "title" : "Mr. Dingle, the Strong",
  "description" : "A timid vacuum-cleaner salesman is given the strength of 300 men by some experimenting aliens."
}, {
  "imdbId" : "0052520",
  "season" : "2",
  "episodeNumber" : "20",
  "title" : "Static",
  "description" : "An old radio is taking bitter bachelor Ed Lindsay back to a happier time before what he considers worthless tripe on television when he starts picking up radio programs from the 1930's and 1940's."
}, {
  "imdbId" : "0052520",
  "season" : "2",
  "episodeNumber" : "21",
  "title" : "The Prime Mover",
  "description" : "A compulsive gambler cajoles his friend to use his telekinesis to affect the results of the gambling tables in Las Vegas."
}, {
  "imdbId" : "0052520",
  "season" : "2",
  "episodeNumber" : "22",
  "title" : "Long Distance Call",
  "description" : "A toy telephone becomes the link between a young boy and his dead grandmother."
}, {
  "imdbId" : "0052520",
  "season" : "2",
  "episodeNumber" : "23",
  "title" : "A Hundred Yards Over the Rim",
  "description" : "A pioneer from a wagon train in 1847 sets off to find something for his ill son and stumbles into present day New Mexico."
}, {
  "imdbId" : "0052520",
  "season" : "2",
  "episodeNumber" : "24",
  "title" : "The Rip Van Winkle Caper",
  "description" : "After successfully stealing a gold shipment, a group of criminals and their scientist accomplice put themselves in suspended animation in a remote desert cave. When they awaken decades later, complications ensue when their truck is destroyed."
}, {
  "imdbId" : "0052520",
  "season" : "2",
  "episodeNumber" : "25",
  "title" : "The Silence",
  "description" : "Annoyed by a club member's constant chatter, a man bets him he cannot remain silent for a year, living in a glass enclosure in the club basement."
}, {
  "imdbId" : "0052520",
  "season" : "2",
  "episodeNumber" : "26",
  "title" : "Shadow Play",
  "description" : "When Adam Grant is found guilty of first degree murder and sentenced he lashes out telling everyone that he will not be murdered again. Grant claims to be having a recurring nightmare where he is found guilty and executed. The characters around him change and so he argues that all of them will vanish if he dies. It leads newspaperman Paul Carson to question what is real and what might just be a figment of someone else's imagination. DA Henry Ritchie visits Grant in jail and decides to try and do something about his claims, no matter how far-fetched his claims might be."
}, {
  "imdbId" : "0052520",
  "season" : "2",
  "episodeNumber" : "27",
  "title" : "The Mind and the Matter",
  "description" : "Using the power of mind over matter, Archibald Beechcroft remakes the world to his own specifications."
}, {
  "imdbId" : "0052520",
  "season" : "2",
  "episodeNumber" : "28",
  "title" : "Will the Real Martian Please Stand Up?",
  "description" : "Following a frantic phone call about a crashed spaceship, two policeman try and determine who among the passengers of a bus at a snowed-in roadside diner is from another world."
}, {
  "imdbId" : "0052520",
  "season" : "2",
  "episodeNumber" : "29",
  "title" : "The Obsolete Man",
  "description" : "In a future totalitarian society, a librarian is declared obsolete and sentenced to death."
}, {
  "imdbId" : "0052520",
  "season" : "3",
  "episodeNumber" : "1",
  "title" : "Two",
  "description" : "Two survivors of an apocalyptic battle, a man and a woman from each opposing sides, approach each other suspiciously."
}, {
  "imdbId" : "0052520",
  "season" : "3",
  "episodeNumber" : "2",
  "title" : "The Arrival",
  "description" : "Federal aviation investigator Grant Sheckly must deal with a mystery when a plane lands at an airport without pilots, passengers or luggage."
}, {
  "imdbId" : "0052520",
  "season" : "3",
  "episodeNumber" : "3",
  "title" : "The Shelter",
  "description" : "A suburban dinner party is interrupted by a bulletin warning of an impending nuclear attack. As the neighbors scramble to prepare themselves, they turn against the one family that installed a permanent bomb shelter."
}, {
  "imdbId" : "0052520",
  "season" : "3",
  "episodeNumber" : "4",
  "title" : "The Passersby",
  "description" : "A Confederate soldier and a widow meet during the end of the Civil War."
}, {
  "imdbId" : "0052520",
  "season" : "3",
  "episodeNumber" : "5",
  "title" : "A Game of Pool",
  "description" : "A frustrated pool champ has beaten everyone. Everyone except one man; the legend, Fats Brown. Brown is dead, and the champ can only curse his name. But guess who just walked in."
}, {
  "imdbId" : "0052520",
  "season" : "3",
  "episodeNumber" : "6",
  "title" : "The Mirror",
  "description" : "A Central American revolutionary comes into the possession of a mirror that shows him his potential assassins."
}, {
  "imdbId" : "0052520",
  "season" : "3",
  "episodeNumber" : "7",
  "title" : "The Grave",
  "description" : "Old West lawman Conny Miller visits the grave of a man who he failed to track down to prove he was never afraid of him but gets more than he bargained for."
}, {
  "imdbId" : "0052520",
  "season" : "3",
  "episodeNumber" : "8",
  "title" : "It's a Good Life",
  "description" : "On an isolated family farm, a young boy with vast mental powers, but lacking emotional development, holds his terrified family in thrall to his every juvenile wish."
}, {
  "imdbId" : "0052520",
  "season" : "3",
  "episodeNumber" : "9",
  "title" : "Deaths-Head Revisited",
  "description" : "A former German SS captain returns to Dachau concentration camp and begins reminiscing on the power he enjoyed there, until he finds himself on trial by those who died at his hands."
}, {
  "imdbId" : "0052520",
  "season" : "3",
  "episodeNumber" : "10",
  "title" : "The Midnight Sun",
  "description" : "When the Earth falls out of orbit, two women try to cope with increasingly oppressive heat in a nearly abandoned city."
}, {
  "imdbId" : "0052520",
  "season" : "3",
  "episodeNumber" : "11",
  "title" : "Still Valley",
  "description" : "In the last days of the Civil War, Confederate soldiers come across a witch who can help bring victory to the Southern cause."
}, {
  "imdbId" : "0052520",
  "season" : "3",
  "episodeNumber" : "12",
  "title" : "The Jungle",
  "description" : "A businessman who has recently returned from Africa is stalked by the superstitions and warnings of a witch doctor."
}, {
  "imdbId" : "0052520",
  "season" : "3",
  "episodeNumber" : "13",
  "title" : "Once Upon a Time",
  "description" : "Janitor Woodrow Mulligan gets a trip from 1890 to 1962 courtesy of his employer's time helmet."
}, {
  "imdbId" : "0052520",
  "season" : "3",
  "episodeNumber" : "14",
  "title" : "Five Characters in Search of an Exit",
  "description" : "An army major awakens in a small room with no idea of who he is or how he got there. He finds four other people in the same room, and they all begin to question how they each arrived there, and more importantly, how to escape."
}, {
  "imdbId" : "0052520",
  "season" : "3",
  "episodeNumber" : "15",
  "title" : "A Quality of Mercy",
  "description" : "Hot shot new Lieutanant Katell tries to make his mark on the last day of World War II in the Pacific and gets a unique perspective on his actions."
}, {
  "imdbId" : "0052520",
  "season" : "3",
  "episodeNumber" : "16",
  "title" : "Nothing in the Dark",
  "description" : "An old woman has fought with death a thousand times and has always won. But now she finds herself afraid to let a wounded policeman in her door for fear he is Mr. Death. Is he?"
}, {
  "imdbId" : "0052520",
  "season" : "3",
  "episodeNumber" : "17",
  "title" : "One More Pallbearer",
  "description" : "Wealthy Paul Radin tries to get three people from his past to apologize to him by offering them shelter from a staged and phony nuclear war scenario."
}, {
  "imdbId" : "0052520",
  "season" : "3",
  "episodeNumber" : "18",
  "title" : "Dead Man's Shoes",
  "description" : "A homeless man takes the shoes of a dead gangster and steps into his life."
}, {
  "imdbId" : "0052520",
  "season" : "3",
  "episodeNumber" : "19",
  "title" : "The Hunt",
  "description" : "Upon returning from a coon hunt, Hyder Simpson discovers that no one can see or hear him because he has passed on."
}, {
  "imdbId" : "0052520",
  "season" : "3",
  "episodeNumber" : "20",
  "title" : "Showdown with Rance McGrew",
  "description" : "The star of a Western TV series suddenly finds himself transported back in time to the real Wild West, and face-to-face with the real Jesse James."
}, {
  "imdbId" : "0052520",
  "season" : "3",
  "episodeNumber" : "21",
  "title" : "Kick the Can",
  "description" : "An old man living in a rest home thinks he's found the secret of youth in children's games."
}, {
  "imdbId" : "0052520",
  "season" : "3",
  "episodeNumber" : "22",
  "title" : "A Piano in the House",
  "description" : "Sadistic and hated theater critic Fitzgerald Fortune buys a player piano that has the power to reveal the souls of all who hear it."
}, {
  "imdbId" : "0052520",
  "season" : "3",
  "episodeNumber" : "23",
  "title" : "The Last Rites of Jeff Myrtlebank",
  "description" : "A young man wakes up at his own funeral and wants to know what the heck is going on. The townfolk are glad to see him back, but they begin to wonder if he's a man.. or something else?"
}, {
  "imdbId" : "0052520",
  "season" : "3",
  "episodeNumber" : "24",
  "title" : "To Serve Man",
  "description" : "An alien race comes to earth, promising peace and sharing technology. A linguist and his team set out to translate the alien's language, using a book whose title they deduce is \"To Serve Man\"."
}, {
  "imdbId" : "0052520",
  "season" : "3",
  "episodeNumber" : "25",
  "title" : "The Fugitive",
  "description" : "Old Ben is a kind old man who likes to play with the kids, whether it's baseball or hide and seek. Little Jenny, who has to wear braces on her legs, is particularly fond of him. He tells her he has to leave soon since the men who are after him will soon arrive. He assures her that he's not a criminal or anything like that. She wants him to take her with him but he says it can't be done. He does fix the problem with her legs however. Turns out Old Ben is important where he comes from and arranges it so that he and Jenny can get what they want."
}, {
  "imdbId" : "0052520",
  "season" : "3",
  "episodeNumber" : "26",
  "title" : "Little Girl Lost",
  "description" : "Awoken in the middle of the night by the cries of his daughter, a father enters the girl's room to find that she has vanished - even though he can still her crying out for help."
}, {
  "imdbId" : "0052520",
  "season" : "3",
  "episodeNumber" : "27",
  "title" : "Person or Persons Unknown",
  "description" : "David Gurney wakes up to another ordinary day. Except today, nobody knows who he is."
}, {
  "imdbId" : "0052520",
  "season" : "3",
  "episodeNumber" : "28",
  "title" : "The Little People",
  "description" : "On a desolate planet, two astronauts discover an entire society populated by beings only 1/100th their size. One of them decides to rule the society as god."
}, {
  "imdbId" : "0052520",
  "season" : "3",
  "episodeNumber" : "29",
  "title" : "Four O'Clock",
  "description" : "A very obsessed man wants to expose evil in the world, investigating people he sees as murderers, subversives, perverts and communists, then attempting to ruin their lives."
}, {
  "imdbId" : "0052520",
  "season" : "3",
  "episodeNumber" : "30",
  "title" : "Hocus-Pocus and Frisby",
  "description" : "A rural gas station attendant given to telling tall tales about himself is kidnapped by aliens who believe him to be one of Earth's leading intellects."
}, {
  "imdbId" : "0052520",
  "season" : "3",
  "episodeNumber" : "31",
  "title" : "The Trade-Ins",
  "description" : "An elderly couple shop for younger replacement bodies, then resort to desperate measures to cover the cost."
}, {
  "imdbId" : "0052520",
  "season" : "3",
  "episodeNumber" : "32",
  "title" : "The Gift",
  "description" : "A man from the stars comes with a gift to a small Mexican village whose residents do not welcome this stranger."
}, {
  "imdbId" : "0052520",
  "season" : "3",
  "episodeNumber" : "33",
  "title" : "The Dummy",
  "description" : "Ventriloquist Jerry Etherson is convinced that his dummy, Willie, is alive and evil. He locks Willie in a trunk and makes plans for a new act with a new dummy. Too bad he didn't clear those plans with Willie first."
}, {
  "imdbId" : "0052520",
  "season" : "3",
  "episodeNumber" : "34",
  "title" : "Young Man's Fancy",
  "description" : "Newlywed Alex Walker finds himself being pulled back to his childhood and back to his widowed mother in the house where he grew up."
}, {
  "imdbId" : "0052520",
  "season" : "3",
  "episodeNumber" : "35",
  "title" : "I Sing the Body Electric",
  "description" : "A recent widower, needing loving care for his three young children, orders a cybernetic \"grandmother\". While two of the children accept her, one of his daughters fiercely rejects her, with near tragic consequences."
}, {
  "imdbId" : "0052520",
  "season" : "3",
  "episodeNumber" : "36",
  "title" : "Cavender Is Coming",
  "description" : "Inept guardian angel Harmon Cavender is given a chance to earn his wings by helping an unconventional big city woman, the young, awkward Agnes Grep."
}, {
  "imdbId" : "0052520",
  "season" : "3",
  "episodeNumber" : "37",
  "title" : "The Changing of the Guard",
  "description" : "After being forced to retire, Professor Fowler contemplates suicide when he doesn't feel he has made a difference in the world. That night he has an experience that shows him that he is wrong."
}, {
  "imdbId" : "0052520",
  "season" : "4",
  "episodeNumber" : "1",
  "title" : "In His Image",
  "description" : "A young man grapples with an urge to kill and confusion about his origins."
}, {
  "imdbId" : "0052520",
  "season" : "4",
  "episodeNumber" : "2",
  "title" : "The Thirty-Fathom Grave",
  "description" : "In the early 1960's, as a U.S. Navy ship cruises near Guadalcanal in the South Pacific, its sonar detects muted hammering on metal undersea. The eerie sounds emanate from a submarine on the ocean floor, maybe there since World War II. A very nervous crew member (Mike Kellin) on the ship served aboard that sub - and he was its sole survivor."
}, {
  "imdbId" : "0052520",
  "season" : "4",
  "episodeNumber" : "3",
  "title" : "Valley of the Shadow",
  "description" : "A reporter stumbles into a peaceful town where miracles seem to occur due to technology and the townsfolk won't let him leave."
}, {
  "imdbId" : "0052520",
  "season" : "4",
  "episodeNumber" : "4",
  "title" : "He's Alive",
  "description" : "Around 1960, a tiny neo-Nazi organization struggles pathetically to succeed in a big city. A mysterious figure begins to ruthlessly guide a young, insecure U.S. Nazi leader, and the group begins to draw more attention."
}, {
  "imdbId" : "0052520",
  "season" : "4",
  "episodeNumber" : "5",
  "title" : "Mute",
  "description" : "The orphaned daughter of telepathic parents must learn to speak and deal with a world she cannot communicate in."
}, {
  "imdbId" : "0052520",
  "season" : "4",
  "episodeNumber" : "6",
  "title" : "Death Ship",
  "description" : "An interplanetary expedition from earth finds an exact duplicate of their ship and themselves crashed on the planet they were surveying. Should they stay or risk taking off and crashing?"
}, {
  "imdbId" : "0052520",
  "season" : "4",
  "episodeNumber" : "7",
  "title" : "Jess-Belle",
  "description" : "Appalachian beauty Jess-Belle can't bear to lose the object of her passion to the local rich girl, so she turns to the local witch for aid. The results bring unexpected and tragic consequences."
}, {
  "imdbId" : "0052520",
  "season" : "4",
  "episodeNumber" : "8",
  "title" : "Miniature",
  "description" : "Mousie misfit Charlie Parkes finds the world unfolding before him in a museum doll house to be more real than his boring job and overbearing mother."
}, {
  "imdbId" : "0052520",
  "season" : "4",
  "episodeNumber" : "9",
  "title" : "Printer's Devil",
  "description" : "A man sells his soul to the devil to save his failing newspaper and gets more than he bargained for."
}, {
  "imdbId" : "0052520",
  "season" : "4",
  "episodeNumber" : "10",
  "title" : "No Time Like the Past",
  "description" : "A scientist attempts to use a time machine to prevent tragedies, both in world history and in his own past."
}, {
  "imdbId" : "0052520",
  "season" : "4",
  "episodeNumber" : "11",
  "title" : "The Parallel",
  "description" : "Astronaut Robert Gaines returns from space to a world that is not exactly the one he left from."
}, {
  "imdbId" : "0052520",
  "season" : "4",
  "episodeNumber" : "12",
  "title" : "I Dream of Genie",
  "description" : "A wiseacre genie appears from a lamp to a meek man, George P. Hanley. Hanley is so used to bad luck, he imagines how each of three possible wishes could go very wrong - but the genie will grant him only one wish!"
}, {
  "imdbId" : "0052520",
  "season" : "4",
  "episodeNumber" : "13",
  "title" : "The New Exhibit",
  "description" : "A wax-museum employee fights to preserve five figures of famous murderers."
}, {
  "imdbId" : "0052520",
  "season" : "4",
  "episodeNumber" : "14",
  "title" : "Of Late I Think of Cliffordville",
  "description" : "Aging tycoon William Feathersmith is bored with life and makes arrangements through a devilish travel agency to return to the Cliffordville of his youth and start all over again."
}, {
  "imdbId" : "0052520",
  "season" : "4",
  "episodeNumber" : "15",
  "title" : "The Incredible World of Horace Ford",
  "description" : "Horace Ford longs for his childhood which was not as idyllic as he remembers it."
}, {
  "imdbId" : "0052520",
  "season" : "4",
  "episodeNumber" : "16",
  "title" : "On Thursday We Leave for Home",
  "description" : "Space colonists from Pilgrim I, Earth's first spaceship to colonize the outer regions, have spent 30 years in their new home. It's a lonely barren place and they are waiting for a ship from to arrive to transport them home. Some of the colonists are at their wits end and another one, the 9th in six months, commits suicide. They are led by William Benteen, who they call Captain, a tough no-nonsense type who does his best to keep the together. They rejoice when the ship arrives and are given three days to prepare for their departure. As the day approaches however, ..."
}, {
  "imdbId" : "0052520",
  "season" : "4",
  "episodeNumber" : "17",
  "title" : "Passage on the Lady Anne",
  "description" : "A young American couple, the Ransomes, who are trying to salvage their troubled marriage, insist on booking passage on an old trans-Atlantic cruise liner. But other passengers try to persuade them to disembark immediately."
}, {
  "imdbId" : "0052520",
  "season" : "4",
  "episodeNumber" : "18",
  "title" : "The Bard",
  "description" : "Julius Moomer, a talentless self-promoting hack who dreams of becoming a successful television writer, uses a book of magic to summon William Shakespeare to write dramatic teleplays that Moomer will pass off as his own. Shakespeare becomes irritated by Moomer's lack of appreciation and is even more appalled when he discovers the changes wrought on his plays by cynical television executives."
}, {
  "imdbId" : "0052520",
  "season" : "5",
  "episodeNumber" : "1",
  "title" : "In Praise of Pip",
  "description" : "In the early 1960's, small-time bookie Max Phillips (Jack Klugman) hates his life. His only pride is his son, Pip, then serving in the U.S. Armed Forces in Vietnam. When a young bettor uses company funds to bet with Max, then loses everything, Max returns his money, angering Max's bosses."
}, {
  "imdbId" : "0052520",
  "season" : "5",
  "episodeNumber" : "2",
  "title" : "Steel",
  "description" : "In the near future boxing has been outlawed and is performed by mechanical robots. To replace his broken client, the manager decides to enter the ring and replace him."
}, {
  "imdbId" : "0052520",
  "season" : "5",
  "episodeNumber" : "3",
  "title" : "Nightmare at 20,000 Feet",
  "description" : "A man, newly recovered from a nervous breakdown, becomes convinced that a monster only he sees is damaging the plane he's flying in."
}, {
  "imdbId" : "0052520",
  "season" : "5",
  "episodeNumber" : "4",
  "title" : "A Kind of a Stopwatch",
  "description" : "A man is given a stopwatch that halts time."
}, {
  "imdbId" : "0052520",
  "season" : "5",
  "episodeNumber" : "5",
  "title" : "The Last Night of a Jockey",
  "description" : "A washed-up jockey gets his wish while waiting for the results of his race fixing hearing."
}, {
  "imdbId" : "0052520",
  "season" : "5",
  "episodeNumber" : "6",
  "title" : "Living Doll",
  "description" : "A frustrated father does battle with his stepdaughter's talking doll, whose vocabulary includes such phrases as \"I hate you\" and \"I'm going to kill you\"."
}, {
  "imdbId" : "0052520",
  "season" : "5",
  "episodeNumber" : "7",
  "title" : "The Old Man in the Cave",
  "description" : "In a post-apocalyptic settlement, the inhabitants' survival is dependent on the advice of an unseen man living in a nearby cave. This dependence is tested when a band of soldiers descends on their town."
}, {
  "imdbId" : "0052520",
  "season" : "5",
  "episodeNumber" : "8",
  "title" : "Uncle Simon",
  "description" : "Caregiver Barbara Polk must take care of her uncle's robot after his untimely and accidental death."
}, {
  "imdbId" : "0052520",
  "season" : "5",
  "episodeNumber" : "9",
  "title" : "Probe 7, Over and Out",
  "description" : "Colonel Cook stranded on another planet with no hope for rescue meets a woman who is the sole survivor from another planet."
}, {
  "imdbId" : "0052520",
  "season" : "5",
  "episodeNumber" : "10",
  "title" : "The 7th Is Made Up of Phantoms",
  "description" : "Three 1960's Army National Guard soldiers on maneuvers near the Little Big Horn battle site find themselves unwittingly involved in Custer's last stand."
}, {
  "imdbId" : "0052520",
  "season" : "5",
  "episodeNumber" : "11",
  "title" : "A Short Drink from a Certain Fountain",
  "description" : "An aging married man convinces his brother to inject him with a youth serum."
}, {
  "imdbId" : "0052520",
  "season" : "5",
  "episodeNumber" : "12",
  "title" : "Ninety Years Without Slumbering",
  "description" : "An old man believes that his life will end the moment his grandfather clock stops ticking."
}, {
  "imdbId" : "0052520",
  "season" : "5",
  "episodeNumber" : "13",
  "title" : "Ring-A-Ding Girl",
  "description" : "Movie star Bunny Blake receives a ring from her hometown which is giving her warnings to come home while she flies cross country."
}, {
  "imdbId" : "0052520",
  "season" : "5",
  "episodeNumber" : "14",
  "title" : "You Drive",
  "description" : "After involved with a hit-and-run killing a child, Mr. Oliver Pope is haunted by his car."
}, {
  "imdbId" : "0052520",
  "season" : "5",
  "episodeNumber" : "15",
  "title" : "The Long Morrow",
  "description" : "Before leaving on a decades long mission, astronaut Douglas Stansfield meets a woman and falls in love."
}, {
  "imdbId" : "0052520",
  "season" : "5",
  "episodeNumber" : "16",
  "title" : "The Self-Improvement of Salvadore Ross",
  "description" : "Saladore Ross has a unique talent where he can trade physical characteristics with other people and will do anything to get the love of Leah Maitland."
}, {
  "imdbId" : "0052520",
  "season" : "5",
  "episodeNumber" : "17",
  "title" : "Number 12 Looks Just Like You",
  "description" : "In a future society everyone must undergo an operation at age 19 to become beautiful and conform to society. One young woman desperately wants to hold onto her own identity."
}, {
  "imdbId" : "0052520",
  "season" : "5",
  "episodeNumber" : "18",
  "title" : "Black Leather Jackets",
  "description" : "Three leather jacket wearing, motorcycle riding men invade a peaceful neighborhood."
}, {
  "imdbId" : "0052520",
  "season" : "5",
  "episodeNumber" : "19",
  "title" : "Night Call",
  "description" : "Telephone calls begin to haunt a disabled elderly woman."
}, {
  "imdbId" : "0052520",
  "season" : "5",
  "episodeNumber" : "20",
  "title" : "From Agnes - with Love",
  "description" : "A computer technician begins to take advice for his love life from Agnes, the computer he works with."
}, {
  "imdbId" : "0052520",
  "season" : "5",
  "episodeNumber" : "21",
  "title" : "Spur of the Moment",
  "description" : "An engaged heiress is terrorized by a middle-aged woman on a horse pleading with her not to go through with her impending marriage."
}, {
  "imdbId" : "0052520",
  "season" : "5",
  "episodeNumber" : "22",
  "title" : "An Occurrence at Owl Creek Bridge",
  "description" : "It is the end of the Civil War and Union troops have occupied the South. They are going to execute a Southern resistance fighter."
}, {
  "imdbId" : "0052520",
  "season" : "5",
  "episodeNumber" : "23",
  "title" : "Queen of the Nile",
  "description" : "A reporter interviews a Hollywood movie queen who has a secret to her eternal beauty."
}, {
  "imdbId" : "0052520",
  "season" : "5",
  "episodeNumber" : "24",
  "title" : "What's in the Box",
  "description" : "Philanderer Joe Britt sees his indiscretions shown on his own TV set after it was worked on by a very unique repairman."
}, {
  "imdbId" : "0052520",
  "season" : "5",
  "episodeNumber" : "25",
  "title" : "The Masks",
  "description" : "Wealthy Jason Foster is dying and he invites his greedy heirs to a Mardi Gras party where they must wear the masks he specially had made for them or else be cut off from their inheritance."
}, {
  "imdbId" : "0052520",
  "season" : "5",
  "episodeNumber" : "26",
  "title" : "I am the Night - Color Me Black",
  "description" : "The sun won't rise on a small town where an execution is scheduled to take place."
}, {
  "imdbId" : "0052520",
  "season" : "5",
  "episodeNumber" : "27",
  "title" : "Sounds and Silences",
  "description" : "Roswell Flemington enjoys loud noises, is an annoyance to others and is suitably punished."
}, {
  "imdbId" : "0052520",
  "season" : "5",
  "episodeNumber" : "28",
  "title" : "Caesar and Me",
  "description" : "When ventriloquist Jonathan West can not find any work his dummy Caesar suggests he turn to robbery."
}, {
  "imdbId" : "0052520",
  "season" : "5",
  "episodeNumber" : "29",
  "title" : "The Jeopardy Room",
  "description" : "A defector is trapped in a hotel room and given 3 hours to find a hidden bomb."
}, {
  "imdbId" : "0052520",
  "season" : "5",
  "episodeNumber" : "30",
  "title" : "Stopover in a Quiet Town",
  "description" : "After drinking too much at a party, Bob and Millie Frazer awaken in a strange bed, in a strange house in a strange town. They're still dressed in the clothes they wore to the party but their memories are fuzzy. Bob was too drunk to drive so Millie was behind the wheel and she vaguely remembers a shadow falling over them. They soon realize that everything in the town is fake. The telephone in the house isn't wired; the drawers and cupboards in the kitchen are only a facade; even the trees are fake. The town is deserted and Millie begins to wonder if they're dead. They ..."
}, {
  "imdbId" : "0052520",
  "season" : "5",
  "episodeNumber" : "31",
  "title" : "The Encounter",
  "description" : "Episode features a conversation between a WWII vet and a Japanese gardener in the vet's attic. Trapped together they face off and accusations fly as they have flashbacks and discuss the war. Both reveal how it affected them leading to a violent climax."
}, {
  "imdbId" : "0052520",
  "season" : "5",
  "episodeNumber" : "32",
  "title" : "Mr. Garrity and the Graves",
  "description" : "Mr. Garrity comes into town offering to resurrect the dead and reunite the townsfolk with their departed loved ones out of the goodness of his heart. Do the town-folks want these miracles to occur?"
}, {
  "imdbId" : "0052520",
  "season" : "5",
  "episodeNumber" : "33",
  "title" : "The Brain Center at Whipple's",
  "description" : "A heartless CEO completely automates his factory and lays off almost all of his workers over the objections of his employees."
}, {
  "imdbId" : "0052520",
  "season" : "5",
  "episodeNumber" : "34",
  "title" : "Come Wander with Me",
  "description" : "Singer Floyd Burney searches the backwoods for new songs and finds Mary Rachel and much more deep in the Twilight Zone."
}, {
  "imdbId" : "0052520",
  "season" : "5",
  "episodeNumber" : "35",
  "title" : "The Fear",
  "description" : "Charlotte Scott and policeman Robert Franklin seem to be stalked by giants."
}, {
  "imdbId" : "0052520",
  "season" : "5",
  "episodeNumber" : "36",
  "title" : "The Bewitchin' Pool",
  "description" : "Two children escape their bickering parents through a portal in the bottom of their swimming pool to a magical land watched over by a kindly old woman the children call Aunt T."
}]