[{
  "imdbId" : "0090528",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Pilot",
  "description" : "An Assistant DA hires Ray after her coworker shows up with the intellect of a 6 year old just before they are supposed to go to trial in big case. Ray tracks the events back to an organized crime leader and infiltrates the compound to gather more information. While there, he is asked to assist the wife of the doctor running the operation for the crime lord."
}, {
  "imdbId" : "0090528",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Ancient Eyes",
  "description" : "Ray infiltrates an illegal migrant worker camp in order to look for the missing son of the housekeeper of a former client. The camp is run more like a prison than a worker camp."
}, {
  "imdbId" : "0090528",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Ether",
  "description" : "Ray poses as a visiting surgeon to find out why a hospital has such a high mortality rate for it's OR patients."
}, {
  "imdbId" : "0090528",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Below the Line",
  "description" : "Ray is hired by an elementary school teacher to find her husband. He infiltrates a marine research facility where the man had been working as a diver."
}, {
  "imdbId" : "0090528",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Sometimes You Gotta Sing the Blues",
  "description" : "Ray is picked up by the police and brought to the Chief who tells him he knows about him and what he does. Instead of arresting him before, he chose to sit on it till he could use him and it appears the time is now. It seems the man's wife was killed and it appears they were not happily married so they're turning their attention towards him. He's hoping another cop who was with him when his wife was killed will back him up but the cop not only doesn't, he passes the lie detector test. So with a girl who's a friend of the Chief he tries to prove his innocence."
}, {
  "imdbId" : "0090528",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Abnormal Psych",
  "description" : "When a young woman tries to kill Ray, and then steps in front of a bus, his investigation leads him back to a University research program where several students have committed suicide. It turns out the program is being run by a man related to Ray's mysterious past."
}, {
  "imdbId" : "0090528",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Orange Blossom",
  "description" : "Ray is contacted by a doctor at a mental hospital about some strange occurrences. But, once he gets inside the hospital, he finds out the \"doctor\" is really a patient. However, there really are some nefarious activities that he uncovers."
}, {
  "imdbId" : "0090528",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Less Than the Eye Can See",
  "description" : "An employee of WHO shows up at Ray's door, and promptly dies after telling Ray he's infected with smallpox. Ray's investigation leads him to a secret government research facility."
}, {
  "imdbId" : "0090528",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "That Terrible Swift Sword",
  "description" : "Ray is hired by Sister Allison of a traveling religious show to find a serial killer murdering prostitutes in the cities that the show stops at. Ray goes undercover as a preacher to find the culprit, but when he does it seems to profoundly affect him."
}, {
  "imdbId" : "0090528",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "The Greeter",
  "description" : "A pharmaceutical chemist hires Ray to investigate some bogus drugs. When Ray arrives at the plant, not only is the chemist missing, no one in the company admits to having known him. With the help of a local Vietnam vet, Ray gets the information he needs about what's going on."
}, {
  "imdbId" : "0090528",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "Gemini",
  "description" : "Someone from out of Ray's past is setting him up for murder. And the people he's helped before are either not helping him, or acting against him."
}, {
  "imdbId" : "0090528",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "Playback",
  "description" : "A test of a new self-contained research station goes awry and all but one of the researchers ends up dead. Ray goes in with a new team, which includes the lone survivor, to try and determine what happened."
}, {
  "imdbId" : "0090528",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "Bring Me the Hand That Hit Me",
  "description" : "A girl asks Ray to help her mentally handicapped brother whom she thinks is in trouble. It seems that he and the guy he hangs with robbed a mobster. And they thought what they got wouldn't be missed but not only does the man want what they took from him. He also wants the hand of the man who struck him."
}, {
  "imdbId" : "0090528",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "Echoes",
  "description" : "A sculptor that Ray helped in the past is once again being stalked, apparently by the very same man who is supposed to be dead. Ray is hired by the agent this time to safeguard the sculptor."
}, {
  "imdbId" : "0090528",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "The First Time Is Forever",
  "description" : "Ray turns down a journalist who shortly thereafter ends up dead. Recognizing he may have made a mistake Ray decides to look into things. As he investigates he keeps having hallucinations or flashbacks of killing people."
}, {
  "imdbId" : "0090528",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "Autumn",
  "description" : "Ray gets hired by a beautiful blonde to look into the disappearance of her father. But things just aren't making sense. It appears as though a novelist is somehow setting situations up for him."
}, {
  "imdbId" : "0090528",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "The Neniwa",
  "description" : "Ray poses as a college anthropology instructor in order to investigate suspicious accidents occurring at a construction site on what may be an Indian burial ground. The site may be a sacred place to a local tribe, but the developer plans to go ahead with the project unless Ray can get the him to reconnect with his own heritage."
}, {
  "imdbId" : "0090528",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "The Second Finest Man Who Ever Lived",
  "description" : "Ray gets involved when a man he helped in the past dies under suspicious circumstances working at the docks. The man's developmentally challenged son agrees to take on his father's debt as Ray tries to work out what got the man killed."
}, {
  "imdbId" : "0090528",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "Night Maneuvers",
  "description" : "Ray shows up at a military academy as a Captain. He has enlisted mans Infantry brass on his lapels."
}, {
  "imdbId" : "0090528",
  "season" : "2",
  "episodeNumber" : "11",
  "title" : "Cry Wolf",
  "description" : "Ray is hired by an actor who's been having attempts on his life. The actor seems to have rather overly dramatic grasp of reality."
}, {
  "imdbId" : "0090528",
  "season" : "2",
  "episodeNumber" : "12",
  "title" : "Blood Money",
  "description" : "A Principal of an inner city school turns to Ray for help when a Fagin like criminal has his sights on three of his students who he thinks can do some good if they stay out of his clutches. So Ray goes as a teacher."
}, {
  "imdbId" : "0090528",
  "season" : "2",
  "episodeNumber" : "13",
  "title" : "Anytime, Anywhere",
  "description" : "Ray travels back to Vietnam to help retrieve a statue in return for a list of POWs still being held. During the transaction Ray is blinded and must learn to exist in a new world."
}, {
  "imdbId" : "0090528",
  "season" : "2",
  "episodeNumber" : "14",
  "title" : "Caper",
  "description" : "Ray is asked to reunite a Soviet scientist with her father who escaped years before. Now, he's being smuggled in a container on a cruise ship as one thing after another goes wrong for Ray."
}, {
  "imdbId" : "0090528",
  "season" : "2",
  "episodeNumber" : "15",
  "title" : "One Way Ticket to the End of the Line",
  "description" : "Know what this is about?"
}]