[{
  "imdbId" : "0481303",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Catastrophe",
  "description" : "\"Not a tree stands. Not a square foot of surface has escaped mutilation.There is nothing but the mud and the gaping shell holes; a chaotic wilderness of shell holes, rim overlapping rim, and, in the bottom of many, the bodies of the dead? CAPTAIN ROWLAND FIELDING WWI WAS ON A SCALE NEVER KNOWN OR IMAGINED BEFORE."
}, {
  "imdbId" : "0481303",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Slaughter in the Trenches",
  "description" : "\"If any man tells you he went over the top and wasn't scared, he's a damn liar. HARRY PATCH: DUKE OF CORNWALL'S LIGHT INFANTRY. BORN 1898 - THESE YEARS WOULD PRODUCE A NEW AND DEADLY EXPRESSION - \"GOING OVER THE TOP\""
}, {
  "imdbId" : "0481303",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Blood in the Air",
  "description" : "\"A glorious death! Fight on and fly on to the last drop of blood and the last drop of petrol? a death for a knight.- BARON MANFRED VON RICHTHOFEN MILITARY COMMANDERS BEGAN TO REALISE THAT FLIGHT MIGHT BE USEFUL FOR WAR."
}, {
  "imdbId" : "0481303",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Killers of the Sea",
  "description" : "\"The Lusitania is a godsend to the British. It's quite the most stupid thing the Germans could have done.\" - Professor Andrew Lambert, King's College, London. This sea war was about innovation and dazzling advances in technology."
}, {
  "imdbId" : "0481303",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Mayhem on the Eastern Front",
  "description" : "\"Between the trenches are any amount of dead and decomposing bodies of our own men and Turks lying on the heather. The smell is awful.- CAPTAIN GUY NIGHTINGALE THE WAR ON THE EASTERN FRONT WOULD RESHAPE THE MAP OF EUROPE FOREVER"
}, {
  "imdbId" : "0481303",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Victory and Despair",
  "description" : "\"The First World War was certainly tragic, but it wasn't futile. In the First World War the Allies achieved a great negative victory; they prevented the domination of Europe by militaristic Germany.- DR. GARY SHEFFIELD, KING'S COLLEGE. THIS IS THE STORY OF 1918 - THE YEAR THAT CHANGED EVERYTHING"
}]