[{
  "imdbId" : "0436992",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Rose",
  "description" : "When ordinary shop-worker Rose Tyler meets a mysterious stranger called the Doctor she is drawn into his strange and dangerous world; her life will never be the same again."
}, {
  "imdbId" : "0436992",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "The End of the World",
  "description" : "The Doctor takes Rose to the year 5 billion to witness the destruction of the Earth."
}, {
  "imdbId" : "0436992",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "The Unquiet Dead",
  "description" : "The Doctor has great expectations for his latest adventure when he and Rose join forces with Charles Dickens to investigate a mysterious plague of zombies."
}, {
  "imdbId" : "0436992",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Aliens of London",
  "description" : "The Doctor returns Rose to her own time - well, sort of - but her family reunion is ruined when a spaceship crashes in the middle of London. What is the origin of the spaceship, and where has the Prime Minister gone in this time of crisis?"
}, {
  "imdbId" : "0436992",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "World War Three",
  "description" : "The Slitheen have infiltrated Parliament and have the Doctor and his friends trapped as the Doctor works to prevent them from starting World War Three."
}, {
  "imdbId" : "0436992",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Dalek",
  "description" : "The TARDIS is drawn to an alien museum deep below the Utah desert, where a ruthless billionaire keeps prisoner the last of the Doctor's most fearsome enemies."
}, {
  "imdbId" : "0436992",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "The Long Game",
  "description" : "In the year 200,000 the Doctor discovers that a satellite with a dark secret is controlling humanity and slowing its development."
}, {
  "imdbId" : "0436992",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Father's Day",
  "description" : "Rose asks The Doctor to take her to 1987, on the day her father was killed."
}, {
  "imdbId" : "0436992",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "The Empty Child",
  "description" : "When a spaceship crashes in the middle of the London Blitz the Doctor, Rose and the enigmatic Captain Jack Harkness find themselves investigating a plague of physical injuries and a little boy in a gas mask."
}, {
  "imdbId" : "0436992",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "The Doctor Dances",
  "description" : "The gas mask zombies are on the rise as the plague spreads across war-torn London."
}, {
  "imdbId" : "0436992",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "Boom Town",
  "description" : "Stopping off in present-day Cardiff to recharge the TARDIS, The Doctor, Rose and Jack meet up with Mickey and encounter an old foe in the midst of hatching a scheme that could destroy the entire planet."
}, {
  "imdbId" : "0436992",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "Bad Wolf",
  "description" : "The Doctor, Rose and Jack are separated and forced to compete in twisted and deadly games on the Game Station."
}, {
  "imdbId" : "0436992",
  "season" : "1",
  "episodeNumber" : "13",
  "title" : "The Parting of the Ways",
  "description" : "As the Dalek fleet begin their attack on the Earth, the Doctor and his allies make one final stand."
}, {
  "imdbId" : "0436992",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "The Christmas Invasion",
  "description" : "It's Christmas Eve, but this is to be a far from silent night - the cruel Sycorax have come to Earth to enslave mankind and, as ever, only The Doctor can stop them. Unfortunately, he's lying in a coma in Jackie's home..."
}, {
  "imdbId" : "0436992",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "New Earth",
  "description" : "The Doctor and Rose arrive on New Earth and meet old friends and enemies in a hospital which can cure every disease. But the cures come at a terrible cost."
}, {
  "imdbId" : "0436992",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "Tooth and Claw",
  "description" : "The Doctor and Rose are transported to 19th Century Scotland, where they meet Queen Victoria, and try to protect her from a ravenous werewolf and a band of assassinating warrior-monks"
}, {
  "imdbId" : "0436992",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "School Reunion",
  "description" : "The Krillitanes - aliens with a mix-and-match physiology - are trying to crack the 'God-Maker', a paradigm to give them ultimate power. They are using children as a computer, and only the Doctor and Rose, re-united with Sarah Jane Smith and K9 can prevent them from becoming masters of time and space."
}, {
  "imdbId" : "0436992",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "The Girl in the Fireplace",
  "description" : "The Doctor, Mickey and Rose land on a spaceship in the 51st century only to find 18th century Versailles on board, the time of Madame De Pompadour! To find out what's going on the Doctor must enter Versailles and save Madame De Popmpadour but it turns into an emotional roller coaster for the Doctor."
}, {
  "imdbId" : "0436992",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "Rise of the Cybermen",
  "description" : "The TARDIS crash lands in London on a parallel world, where Rose's dad is still alive, people are disappearing off the streets and one of the Doctor's deadliest enemies is about to be reborn."
}, {
  "imdbId" : "0436992",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "The Age of Steel",
  "description" : "The Cybermen take control of London as the population is enslaved and the Doctor and his friends become fugitives."
}, {
  "imdbId" : "0436992",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "The Idiot's Lantern",
  "description" : "As the coronation of Elizabeth II nears, the streets of London live in fear. Faceless people are stolen from their homes in the night and something evil is lurking in the television."
}, {
  "imdbId" : "0436992",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "The Impossible Planet",
  "description" : "When the Doctor and Rose become stranded on a planet orbiting a black hole, they find a human expedition crew and their servants, the Ood, being terrorised by the Devil."
}, {
  "imdbId" : "0436992",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "The Satan Pit",
  "description" : "The Doctor risks his life to investigate the pit and is forced to make a terrible decision, while Rose and the crew fend for their lives against the Legion of the Beast."
}, {
  "imdbId" : "0436992",
  "season" : "2",
  "episodeNumber" : "11",
  "title" : "Love & Monsters",
  "description" : "Elton Pope is an ordinary man intrigued by the world of the Doctor. When he and fellow enthusiasts - L.I.N.D.A. - meet the mysterious Victor Kennedy, their lives will never be the same again."
}, {
  "imdbId" : "0436992",
  "season" : "2",
  "episodeNumber" : "12",
  "title" : "Fear Her",
  "description" : "When children vanish into thin air in 2012 London, the Doctor and Rose find the answers in a seemingly ordinary household and a girl whose drawings can come to life."
}, {
  "imdbId" : "0436992",
  "season" : "2",
  "episodeNumber" : "13",
  "title" : "Army of Ghosts",
  "description" : "When ghosts of loved ones appear all over the world the Doctor traces the phenomena to the Torchwood Tower, where some old friends and enemies are waiting."
}, {
  "imdbId" : "0436992",
  "season" : "2",
  "episodeNumber" : "14",
  "title" : "Doomsday",
  "description" : "Earth becomes a battleground for the Daleks and the Cybermen. With the whole planet at stake and the Genesis Ark activated, how much will the Doctor sacrifice in order to end the war?"
}, {
  "imdbId" : "0436992",
  "season" : "3",
  "episodeNumber" : "1",
  "title" : "The Runaway Bride",
  "description" : "The Doctor is baffled when a young woman is transported to the TARDIS on her wedding day, and attempts to find out how she is connected to an alien plot to destroy Earth."
}, {
  "imdbId" : "0436992",
  "season" : "3",
  "episodeNumber" : "2",
  "title" : "Smith and Jones",
  "description" : "When the hospital she works at is transported to the moon, medical student Martha Jones joins forces with The Doctor to hunt down an alien fugitive before the oxygen runs out."
}, {
  "imdbId" : "0436992",
  "season" : "3",
  "episodeNumber" : "3",
  "title" : "The Shakespeare Code",
  "description" : "The Doctor takes Martha to London in 1599, where William Shakespeare's new play is being used by three witches in an evil plan."
}, {
  "imdbId" : "0436992",
  "season" : "3",
  "episodeNumber" : "4",
  "title" : "Gridlock",
  "description" : "The Doctor takes Martha to New Earth, where she is kidnapped by two carjackers and taken to an underground Motorway, where the remainder of humanity on the planet live in perpetual gridlock."
}, {
  "imdbId" : "0436992",
  "season" : "3",
  "episodeNumber" : "5",
  "title" : "Daleks in Manhattan",
  "description" : "The Doctor and Martha travel to New York in 1930, where people have been mysteriously vanishing from the streets, and an old enemy resurfaces."
}, {
  "imdbId" : "0436992",
  "season" : "3",
  "episodeNumber" : "6",
  "title" : "Evolution of the Daleks",
  "description" : "Concluding part to Daleks in Manhattan. In 1930s New York, the Daleks' plan is in full force. Faced with the cyborgs' most evil and dangerous scheme yet, will the Doctor and Martha be able to defeat their greatest opponents?"
}, {
  "imdbId" : "0436992",
  "season" : "3",
  "episodeNumber" : "7",
  "title" : "The Lazarus Experiment",
  "description" : "The famous Dr Lazarus has appeared to discover the secret of eternal youth - but do his experiments hide a sinister secret?"
}, {
  "imdbId" : "0436992",
  "season" : "3",
  "episodeNumber" : "8",
  "title" : "42",
  "description" : "On a spaceship headed straight for the centre of the sun, the Doctor only has 42 minutes to save Martha and the ship's crew from an inevitable doom."
}, {
  "imdbId" : "0436992",
  "season" : "3",
  "episodeNumber" : "9",
  "title" : "Human Nature",
  "description" : "In 1913, Martha watches in jealousy from afar as The Doctor learns what it is to be human and to fall in love with the local school nurse, Joan Redfern."
}, {
  "imdbId" : "0436992",
  "season" : "3",
  "episodeNumber" : "10",
  "title" : "The Family of Blood",
  "description" : "The Doctor must deal with the repercussions of his decision to become human, as The Family Of Blood unveil themselves..."
}, {
  "imdbId" : "0436992",
  "season" : "3",
  "episodeNumber" : "11",
  "title" : "Blink",
  "description" : "Sally Sparrow receives a cryptic message from the Doctor about a mysterious new enemy species that is after the TARDIS."
}, {
  "imdbId" : "0436992",
  "season" : "3",
  "episodeNumber" : "12",
  "title" : "Utopia",
  "description" : "Soon after bumping into old friend Jack Harkness, Martha and The Doctor head off to Malcassairo, a distant planet where an old professor will do anything he can to keep his people alive..."
}, {
  "imdbId" : "0436992",
  "season" : "3",
  "episodeNumber" : "13",
  "title" : "The Sound of Drums",
  "description" : "The Doctor, Martha and Jack return to the 21st Century eighteen months after the Doctor and Martha left. They find they've missed the election, and the new Prime Minister, Harold Saxon, is someone they've met before by another name."
}, {
  "imdbId" : "0436992",
  "season" : "3",
  "episodeNumber" : "14",
  "title" : "Last of the Time Lords",
  "description" : "It's been a year since The Master unleashed the mysterious Toclafane onto Earth. With the human race and The Doctor enslaved under The Master's control, Martha Jones is the only person that can help stop the evil Time Lord."
}, {
  "imdbId" : "0436992",
  "season" : "4",
  "episodeNumber" : "1",
  "title" : "Voyage of the Damned",
  "description" : "A spacecraft set on an apocalyptic collision course with Earth, a host of killer robot angels and an evil severed headed mastermind - it's just another Christmas for the Doctor... 2007 Christmas special guest starring Kylie Minogue."
}, {
  "imdbId" : "0436992",
  "season" : "4",
  "episodeNumber" : "2",
  "title" : "Partners in Crime",
  "description" : "With a new weight-loss pill tested in London by Adipose Industries, The Doctor goes to investigate the sinister truth behind the product, only to find out that his old friend Donna Noble is investigating as well."
}, {
  "imdbId" : "0436992",
  "season" : "4",
  "episodeNumber" : "3",
  "title" : "The Fires of Pompeii",
  "description" : "Instead of Rome, The Doctor and Donna Noble end up visiting Pompeii in AD 79, on the eve of the catastrophic eruption of Mount Vesuvius. Before anyone even knew it was actually a volcano, the entire city is doomed for destruction."
}, {
  "imdbId" : "0436992",
  "season" : "4",
  "episodeNumber" : "4",
  "title" : "Planet of the Ood",
  "description" : "Finding themselves on the Ood-Sphere planet in the 42nd century, The Doctor and Donna discover the truth over the Ood's willingness to serve humankind."
}, {
  "imdbId" : "0436992",
  "season" : "4",
  "episodeNumber" : "5",
  "title" : "The Sontaran Stratagem",
  "description" : "UNIT's newest recruit Martha Jones enlists The Doctor's help to investigate kid genius Luke Rattigan and his ATMOS system that is used in every car on Earth."
}, {
  "imdbId" : "0436992",
  "season" : "4",
  "episodeNumber" : "6",
  "title" : "The Poison Sky",
  "description" : "With planet Earth choking under the poison sky, the Doctor must stop the Sontarans' threat to the planet."
}, {
  "imdbId" : "0436992",
  "season" : "4",
  "episodeNumber" : "7",
  "title" : "The Doctor's Daughter",
  "description" : "Caught in the middle of a war between the Humans and the Hath in the planet Messaline, the Doctor finds himself once again a father."
}, {
  "imdbId" : "0436992",
  "season" : "4",
  "episodeNumber" : "8",
  "title" : "The Unicorn and the Wasp",
  "description" : "With a 1926 dinner party turning into a murder mystery, The Doctor and Donna Noble get the chance to meet Agatha Christie on the eve of her well-known 9-days disappearance."
}, {
  "imdbId" : "0436992",
  "season" : "4",
  "episodeNumber" : "9",
  "title" : "Silence in the Library",
  "description" : "The Doctor and Donna join a group of archaeologists at a 51st century library. What caused the library to become abandoned? What are the Nodes? And what links the library to one little girl? All they have is one warning - count the shadows."
}, {
  "imdbId" : "0436992",
  "season" : "4",
  "episodeNumber" : "10",
  "title" : "Forest of the Dead",
  "description" : "With the library darkening, the Doctor takes on the Vashta Nerada while figuring out what links River Song to his future. Meanwhile, Donna finds out the mystery of Dr. Moon and the Girl."
}, {
  "imdbId" : "0436992",
  "season" : "4",
  "episodeNumber" : "11",
  "title" : "Midnight",
  "description" : "As part of a well-deserved holiday, the Doctor takes a tour on a planet called Midnight. Little does he know that something is knocking on the walls, although the planet shouldn't be inhabited. Soon the passengers begin to panic when one of them is possessed."
}, {
  "imdbId" : "0436992",
  "season" : "4",
  "episodeNumber" : "12",
  "title" : "Turn Left",
  "description" : "What would happen if Donna never met the Doctor? How would Earth handle the Racnoss, the falling Titanic or the Sontarans? Aided by a familiar blonde time traveler, Donna corrects the alternate time line from happening."
}, {
  "imdbId" : "0436992",
  "season" : "4",
  "episodeNumber" : "13",
  "title" : "The Stolen Earth",
  "description" : "The return of an old enemy leaves Earth along with 26 other planets stolen from their places. As the Doctor and Donna look for the whereabouts of Earth, former companions of the Doctor assemble a resistance against the new Dalek Empire."
}, {
  "imdbId" : "0436992",
  "season" : "4",
  "episodeNumber" : "14",
  "title" : "Journey's End",
  "description" : "In the wake of Davros' threat to destroy the existence of the Universe itself, the Doctor's companions unite to stop the Dalek empire. Which one will die by the prophecies and what will the fate be for the Doctor?"
}]