[{
  "imdbId" : "0098825",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Episode #1.1",
  "description" : "Francis Urquhart is the Conservative Party Chief Whip who keeps the party's Members of Parliament in line. The party has selected a new leader, Henry Collingridge, and at the general election the government is returned with a reduced majority. Urquhart expects his proper reward - a senior Cabinet post - but is shocked when the Prime Minister tells him he's to stay where he is. Urquhart decides to exact his revenge. Using an ambitious young journalist, Mattie Storin, he plants rumors of dissension in party. Through the Party's PR expert Roger O'Neill - who has had his ..."
}, {
  "imdbId" : "0098825",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Episode #1.2",
  "description" : "Francis Urqhart continues his surreptitious campaign to force Prime Minister Henry Collingridge's resignation. After the tabloids spend the summer excoriating the PM's brother Charles, it's time for the fall party conference in Brighton. There, Urqhart ensures that journalist Mattie Storin gets the results of an internal party poll showing they have fallen 30 points behind Labour. He also ensures those numbers make it to print. When the PM asks Urqhart's advice on who is out to get him, he lays the blame at the feet of Party chairman Lord Billsborough. Urqhart also ..."
}, {
  "imdbId" : "0098825",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Episode #1.3",
  "description" : "The Prime Minister resigns and the race is to replace him. Environment Minister Michael Samuels and Foreign Minister Patrick Woolton are the apparent front-runners, though the Chronicle newspaper comes out publicly in support of Urquhart. At his wife's encouragement, Urquhart seduces journalist Mattie Storin but doesn't realize she recorded their conversation. She traces Charles Collingridge to the rehab center and begins to doubt that he was the engineer of the scandal. When she learns that someone altered the files at the Conservative central office, she has proof ..."
}, {
  "imdbId" : "0098825",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Episode #1.4",
  "description" : "Francis Urquhart announces his intention to seek the leadership of the Conservative Party and become Prime Minister. It's six days until the first ballot and Urquhart plots against his rivals. One by one, the minor candidates fall by the wayside - the Health Minister who has an accident; an MP who had an encounter on a train with a young man. He finishes second on the first ballot and has another week to deal with his main rivals, Patrick Woolton and Michael Samuels. Woolton gets tripped up by the recording of him in bed at the party conference and throws his support ..."
}]