[{
  "imdbId" : "0056777",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "The Galaxy Being",
  "description" : "Adventurous radio station operator contacts a fellow experimenter in another galaxy. The operator locks in 3D communication, but a DJ who wants to impress his girlfriend with the station's range, boosts the signal all the way up, unknowingly sucking the alien, who's composed of electricity, into the remote desert town."
}, {
  "imdbId" : "0056777",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "The Hundred Days of the Dragon",
  "description" : "The election draws near and William Lyons Selby seems destined to win. Elsewhere, the communist nation of dictator Li Kwan has achieved a remarkable breakthrough: a serum that renders human flesh plastic. A simple injection and a process of molding allows an agent to quietly murder Selby and take his place! America has elected a spy to the highest office in that nation. Selby's daughter and his aide suspect all is not right, but have no idea what the real problem is. One thing seems certain: if they can't find out soon, the problem of \"who's who\" is sure to widen, and..."
}, {
  "imdbId" : "0056777",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "The Architects of Fear",
  "description" : "A secret group of scientists decide to surgically alter one of their members into an 'alien', in order to convince the world that an alien invasion is imminent. They hope that such a threat will force all governments to make peace with one another. However such a complex plan has many vulnerabilities... including the wife of the volunteer."
}, {
  "imdbId" : "0056777",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "The Man with the Power",
  "description" : "Milquetoast college teacher Harold lacks tenure, and the ability to stand up to anyone, especially his shrewish wife. But after a brain operation so he can aide in a space project to mine asteroids, a giant electrical vortex appears when he's angry at someone, unleashing the earth's Magnetic Fields against the offender. Harold is unaware of the new power of his Id, while the rocket scientists are thrilled at compliant Harold's conscious ability to focus massive energy."
}, {
  "imdbId" : "0056777",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "The Sixth Finger",
  "description" : "A scientist experimenting with speeding up human evolution, hires on uneducated, but bright Gwyllim, from the nearby Welsh mining town. He proves a devoted lab assistant, but not content to stick to animal subjects, Gwyllim speeds up his own evolution, becoming a super genius with 6 fingers and a huge cranium. With such mental powers does the rebellious, former coal miner acquire equivalent wisdom and maturity too ?"
}, {
  "imdbId" : "0056777",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "The Man Who Was Never Born",
  "description" : "Earth awaits a terrible fate in the far future, so a 20th Century astronaut and a typically hideously malformed future Earthling go back in time hoping to change history. They target a beautiful young woman just before she gives birth to the scientist who created the bio-warfare agent which ravages the future Earth and all humans. But how can the repulsive Andro succeed when he's likely to be shot on sight ?"
}, {
  "imdbId" : "0056777",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "O.B.I.T.",
  "description" : "The Outer Band Individuated Teletracer, or O.B.I.T., is a remarkable technology that can track and monitor any individual, anywhere, for any length of time! When a man is found dead, slumped over the machine, it and the military base where it is in used come under scrutiny. But what no one suspects is who built O.B.I.T. and why. And on that answer may hang the fate of civilization..."
}, {
  "imdbId" : "0056777",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "The Human Factor",
  "description" : "At an isolated military installation in Greenland, Major Brothers (Harry Guardino) has allowed one of his men to die after falling in a crevasse. Suffering from hallucinations, he goes to Dr. Hamilton (Gary Merrill). Hamilton has invented a device that allows him to read the thoughts of another person. Hamilton and Brothers connect via the device, but then a power surge causes the unthinkable: the minds of the two men switch bodies. The deranged Maj. Brothers is bent on destroying the whole base. Unfortunately, his mind is in the psychiatrist's body, and the other ..."
}, {
  "imdbId" : "0056777",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "Corpus Earthling",
  "description" : "Parasitic advance guard from outer space strive to kill a physician, the only human who can hear them. Instead the physician believes he's gone insane, because he first heard the aliens right after suffering a concussion in a lab explosion. His wife, the laboratory 's assistant, comforts him, while the lab's geologist is targeted for takeover by the parasites."
}, {
  "imdbId" : "0056777",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "Nightmare",
  "description" : "A stranded team of soldiers are captured and experimented on by demonic looking aliens."
}, {
  "imdbId" : "0056777",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "It Crawled Out of the Woodwork",
  "description" : "An accidentally-created energy-being overruns an experimental power station, where personnel whom it has killed are restored to life with electronically-controlled pacemakers and are made to service the \"being\" by a fanatical German scientist who overtly pretends to be looking for a way to destroy it. After the force kills a security guard and newly-recruited scientist, the latter's psychologically disturbed brother attempts to uncover the station's secret, along with the police sergeant investigating the most recent death with the assistance of a dead-but-alive woman..."
}, {
  "imdbId" : "0056777",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "The Borderland",
  "description" : "After a scientist appears to invent a machine which can contact the afterlife, he convinces a rich man to finance his experiments with the possibility of contacting his benefactor's dead son."
}, {
  "imdbId" : "0056777",
  "season" : "1",
  "episodeNumber" : "13",
  "title" : "Tourist Attraction",
  "description" : "The capture of a legendary, ancient monster in a Latin American lake obsesses a dilettante U.S. adventurer and the country's ego-maniacal military dictator. The adventurer wants glory & fame, the general craves the tourist influx. The amazing powers of the creature, the reverence of locals for it, and the ideals of both countries' scientists stand in the way of the power-crazed adversaries' schemes."
}, {
  "imdbId" : "0056777",
  "season" : "1",
  "episodeNumber" : "14",
  "title" : "The Zanti Misfits",
  "description" : "The perfectionist rulers of the planet Zanti have solved the problem of what to do with their non desirable citizens...they are incapable of executing their own species so they have exiled them to the planet Earth. At a Top Secret Military base in the ghost town of Morgue, California a small group of Air Force officers and guards is awaiting the landing of the Zanti penal ship. They are informed that the Zanti regard their privacy and told to leave the ship alone. The military is prepared to comply until a car with a runaway wife and a three time loser named Ben Garth..."
}, {
  "imdbId" : "0056777",
  "season" : "1",
  "episodeNumber" : "15",
  "title" : "The Mice",
  "description" : "An advanced civilization contacts the U.S. to test both worlds' experimental-stage teleportation systems by exchanging citizens. Fearing the matter transport will fail, U.S. military select a prisoner serving a life sentence, not caring that a murderer's being loosed on Chromos, because it's 10 light years away. But will the ex-boxer escape before the exchange is completed, in the narrow window when the planets are aligned?"
}, {
  "imdbId" : "0056777",
  "season" : "1",
  "episodeNumber" : "16",
  "title" : "Controlled Experiment",
  "description" : "Two Martians, equipped with a device for controlling time, try to understand the human phenomena of murder. They choose a crime of passion in the lobby of a shabby hotel. But what seems like a simple assignment rapidly runs out of control."
}, {
  "imdbId" : "0056777",
  "season" : "1",
  "episodeNumber" : "17",
  "title" : "Don't Open Till Doomsday",
  "description" : "A tiny space creature, bent on destruction, is captured by the scientist Mordecai Spazman. His rival, professor Harvey Kry, convinces the media that Spazman's claims are bogus. The vengeful Spazman boxes up the invader's miniature spacecraft as a wedding gift, presenting it to Kry's son. The alien imprisons Harvey Jr. inside the ship, to force Dr. Kry to help him complete his mission."
}, {
  "imdbId" : "0056777",
  "season" : "1",
  "episodeNumber" : "18",
  "title" : "ZZZZZ",
  "description" : "An entomologist is developing a machine to communicate with bees. Unknown to him, a queen bee has taken on human form in order to mate with him to advance her species."
}, {
  "imdbId" : "0056777",
  "season" : "1",
  "episodeNumber" : "19",
  "title" : "The Invisibles",
  "description" : "Aliens plan to take over the U.S. by recruiting disaffected loners, who are practically \"invisible\" to U.S. authorities. Each invisible is para-sited by a fish-like creature who adapts and controls the human. A U.S. government agent infiltrates the cats' paws, who are to get close to powerful U.S. government officials and transfer the creatures into the officials."
}, {
  "imdbId" : "0056777",
  "season" : "1",
  "episodeNumber" : "20",
  "title" : "The Bellero Shield",
  "description" : "Richard Bellero, a dedicated scientist, is working on experiments involving sending laser beams into outer space. His father, Richard Bellero Sr., believes the scientist isn't strong enough to take over the Bellero business empire. In the meantime, Richard's wife Judith has more than enough ambition for the two of them. Richard, through a freak accident, reels in a being from another dimension with his laser experiment. The being has a small device that can project a shield that no force can penetrate. The alien at first wants to learn all about earth that he can and ..."
}, {
  "imdbId" : "0056777",
  "season" : "1",
  "episodeNumber" : "21",
  "title" : "The Children of Spider County",
  "description" : "LBJ's CIA seizes young supermen, except Ethan who's facing trumped-up murder charges, back in the children's Maryland home county. Ethan's the only one who wasn't hounded out of Spider County by suspicious locals. The spooks believe the boys had the same super-father, though each was born to a different mother. Ethan's plotting escape from the clutches of beady-eyed Sheriff Simon Stakefield anyway - to avoid an old-fashioned down-home lynching."
}, {
  "imdbId" : "0056777",
  "season" : "1",
  "episodeNumber" : "22",
  "title" : "Specimen: Unknown",
  "description" : "Astronauts operating an orbiting space station find a strange and deadly species of plant life. Higher ups consider: Should the craft be destroyed with four men aboard or left to land knowing the plants could destroy the rest of mankind?"
}, {
  "imdbId" : "0056777",
  "season" : "1",
  "episodeNumber" : "23",
  "title" : "Second Chance",
  "description" : "Carnival space ride becomes frighteningly real when an alien bird-man secretly rigs it with actual rockets. The ominous bird-man carefully picks his unknowing crew including the carny ride captain who's a closet intellectual, an angry middle-aged man, and a star high school quarterback accompanied by his adoring buddy and his steady girl."
}, {
  "imdbId" : "0056777",
  "season" : "1",
  "episodeNumber" : "24",
  "title" : "Moonstone",
  "description" : "A lunar exploration team from Earth encounters alien life, and must make a difficult decision."
}, {
  "imdbId" : "0056777",
  "season" : "1",
  "episodeNumber" : "25",
  "title" : "The Mutant",
  "description" : "A scientist visits an isolated expedition on a planet plagued by radioactive dust storms. He discovers that one of the team has been mutated by the dust and gained telepathic powers, which he is using to tyrannize the rest of the colony."
}, {
  "imdbId" : "0056777",
  "season" : "1",
  "episodeNumber" : "26",
  "title" : "The Guests",
  "description" : "A drifter enters a lonely house, unaware that it is actually an alien creature in disguise. Soon he realizes that he is a prisoner, along with several other half-mad inhabitants, but he is determined to escape."
}, {
  "imdbId" : "0056777",
  "season" : "1",
  "episodeNumber" : "27",
  "title" : "Fun and Games",
  "description" : "A distant planet teleports a young man and woman from an apartment building to compete in a gladiatorial contest. For the aliens it's just an amusing jungle reality show, but if the humans fail, Earth will be destroyed. The woman is desperate to save Earth, but the man is a vicious, petty crook on the run, who has little to lose, but doesn't care about humanity's fate."
}, {
  "imdbId" : "0056777",
  "season" : "1",
  "episodeNumber" : "28",
  "title" : "The Special One",
  "description" : "The parents of a child science prodigy are approached by a mysterious official called Mr Zeno, who offers to give him special private tutoring. Unknown to them, Mr Zeno is an alien who wants to use their son's talents for evil."
}, {
  "imdbId" : "0056777",
  "season" : "1",
  "episodeNumber" : "29",
  "title" : "A Feasibility Study",
  "description" : "The inhabitants of a typical suburban street find that they've been abducted by a diseased alien race, which wants to discover if humans will make suitable slaves for them."
}, {
  "imdbId" : "0056777",
  "season" : "1",
  "episodeNumber" : "30",
  "title" : "Production and Decay of Strange Particles",
  "description" : "An accident at a nuclear research facility creates a dimensional doorway in which aliens need to widen to invade our world. A scientist races to discover a way to reverse the damage and close the doorway."
}, {
  "imdbId" : "0056777",
  "season" : "1",
  "episodeNumber" : "31",
  "title" : "The Chameleon",
  "description" : "To save Earth from invasion, scientists alter a human into a replica of one of the aliens. The human subject Mace is a remorseless killer, who easily adapts to any personality required. Giving up his body and life means little to him, he relishes this ultimate test of his chameleon powers. But how much loyalty will the vicious Mace have to his fellow humans ?"
}, {
  "imdbId" : "0056777",
  "season" : "1",
  "episodeNumber" : "32",
  "title" : "The Forms of Things Unknown",
  "description" : "Two female friends poison a sadistic blackmailer, then while fleeing happen upon an isolated house containing a time machine. Kasha his lover, & Leonora the daughter of the blackmail target, fight to bury him before the idealistic inventor Tone is able to re-animate the murdered man, by tilting him back into the past."
}, {
  "imdbId" : "0056777",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "Soldier",
  "description" : "A soldier from the far future is accidentally teleported back to our present. The psychiatrist assigned to examine the soldier realizes that he has been bred purely as a killing machine, but he believe he can reawaken the warrior's humanity. Meanwhile a second soldier arrives, dedicated to hunting and killing his enemy."
}, {
  "imdbId" : "0056777",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "Cold Hands, Warm Heart",
  "description" : "Following a mission to Venus, an astronaut finds himself constantly cold and has strange dreams about encountering an alien outside his spacecraft."
}, {
  "imdbId" : "0056777",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "Behold Eck!",
  "description" : "A two-dimensional alien inadvertently causes havoc in Los Angeles. The alien is stranded in our three-dimensional world and only a mild-mannered optician and his secretary have to power to help."
}, {
  "imdbId" : "0056777",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "Expanding Human",
  "description" : "Trying to speed up man's evolution, a scientist recklessly experiments on himself. He does indeed gain super intelligence and new abilities, but at the cost of his morality and humanity."
}, {
  "imdbId" : "0056777",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "Demon with a Glass Hand",
  "description" : "Days ago Trent awoke with no memory of his past. Since then, sinister men have pursued him constantly. He manages to stay one step ahead of them by following the advice of... his hand! Made of glass and apparently capable of speech, Trent's hand can answer many of his questions. But it cannot tell him who he is or why his enemies seek him until he finds all of its fingers. The only trouble is, they're in the... hands... of his enemies!"
}, {
  "imdbId" : "0056777",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "Cry of Silence",
  "description" : "A couple find themselves lost and in middle of a deserted valley. Then they come under attack by a series rocks, tumbleweeds and animals. What could be causing this assault?"
}, {
  "imdbId" : "0056777",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "The Invisible Enemy",
  "description" : "The first manned expedition to Mars finds itself being killed one by one by an alien predator."
}, {
  "imdbId" : "0056777",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "Wolf 359",
  "description" : "A scientist creates a tiny model of another solar system's planet, seeding it with life, to study planetary development. The miniaturization allows the simulation's evolution to advance much faster. A ghostly bat-like creature hovers on the in-closed model watching the humans, while emitting waves of fear terrifying them."
}, {
  "imdbId" : "0056777",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "I, Robot",
  "description" : "A cynical lawyer is hired by a young woman to prove that her father was not killed by his invention - a sophisticated robot."
}, {
  "imdbId" : "0056777",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "The Inheritors: Part 1",
  "description" : "Four soldiers have been shot in the head by bullets made from the fragment of a meteorite. As a result, they have developed genius level IQs. Three of them have disappeared, one remains in hospital. Adam Ballard, Assistant Secretary of Science, believes the men have been taken over by an alien intelligence, and that they are working to bring some evil plan to fruition."
}, {
  "imdbId" : "0056777",
  "season" : "2",
  "episodeNumber" : "11",
  "title" : "The Inheritors: Part 2",
  "description" : "Four soldiers have been shot in the head by bullets made from the fragment of a meteorite. As a result, they have developed genius level IQs. Three of them have disappeared, one remains in hospital. Adam Ballard, Assistant Secretary of Science, believes the men have been taken over by an alien intelligence, and that they are working to bring some evil plan to fruition."
}, {
  "imdbId" : "0056777",
  "season" : "2",
  "episodeNumber" : "12",
  "title" : "Keeper of the Purple Twilight",
  "description" : "A driven scientist is approached by a unearthly being who offers to exchange his alien intelligence in return for the experience of human emotions. Their experiment however has unforeseen consequences for both of them and soon a team of alien enforcers has arrived to destroy both of them and the scientist's wife."
}, {
  "imdbId" : "0056777",
  "season" : "2",
  "episodeNumber" : "13",
  "title" : "The Duplicate Man",
  "description" : "When a dangerous alien creature called a Megasoid escapes, the scientist who smuggled him to Earth creates an illegal clone of himself to hunt it down. But his plan is complicated when his neglected wife begins to fall in love with his duplicate."
}, {
  "imdbId" : "0056777",
  "season" : "2",
  "episodeNumber" : "14",
  "title" : "Counterweight",
  "description" : "Six men and two women volunteer to be locked into a mock spacecraft and undergo a simulated space mission to a distant planet. However a series of strange events lead to paranoia and suspicion growing between them."
}, {
  "imdbId" : "0056777",
  "season" : "2",
  "episodeNumber" : "15",
  "title" : "The Brain of Colonel Barham",
  "description" : "A dying astronaut volunteers his mind be linked to a supercomputer, to enable the U.S. to beat the Soviet Union to Mars. His wife and an Air Force psychiatrist oppose the brain removal, fearing that the arrogant spaceman's brain won't adapt, making his death futile. But the Cold War space race takes precedence, so the experiment proceeds, despite eerie developments."
}, {
  "imdbId" : "0056777",
  "season" : "2",
  "episodeNumber" : "16",
  "title" : "The Premonition",
  "description" : "When a test pilot crashes in his experimental X-15 plane, he and his wife discover they are in a reality where time has slowed down almost to a standstill. Returning to the airbase, they are horrified to see their daughter standing in the path of a moving truck and they seem to be unable to prevent her death."
}, {
  "imdbId" : "0056777",
  "season" : "2",
  "episodeNumber" : "17",
  "title" : "The Probe",
  "description" : "When an airplane crashes into the sea, its crew awake to find themselves inside a large metal chamber. Soon their bewilderment is replaced by fear when they come under attack by a huge machine and large blob-like creature."
}]