[{
  "imdbId" : "0061287",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Arrival",
  "description" : "After resigning, a secret agent finds himself trapped in a bizarre prison known only as The Village."
}, {
  "imdbId" : "0061287",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "The Chimes of Big Ben",
  "description" : "A new Number 8 named Nadia arrives in The Village, and together Number 6 and she plot their escape."
}, {
  "imdbId" : "0061287",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "A. B. and C.",
  "description" : "Number 2 believes that Number 6 resigned because he was going to sell out. Using dream manipulation, Number 2 tries to determine which one of three possible candidates Number 6 was dealing with."
}, {
  "imdbId" : "0061287",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Free for All",
  "description" : "Number 6 runs for the office of Number 2."
}, {
  "imdbId" : "0061287",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "The Schizoid Man",
  "description" : "Number Six wakes up with a new identity. Now he's Number Twelve. Worse, Number Two asks him to impersonate someone--Number Six. But the new Number Six is more like him than he is."
}, {
  "imdbId" : "0061287",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "The General",
  "description" : "An instant learning process becomes the Village's latest fad, but Number 6 is sure that Number 2 is using it as a brain washing tool."
}, {
  "imdbId" : "0061287",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Many Happy Returns",
  "description" : "Number 6 wakes up to find the Village totally deserted."
}, {
  "imdbId" : "0061287",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Dance of the Dead",
  "description" : "Number 6 comes across a body that has washed ashore with a radio. After sending the body back out to sea, he tries to use the radio to get rescued."
}, {
  "imdbId" : "0061287",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "Checkmate",
  "description" : "After waking up from an artificial sleep, Number 6 discovers a game of \"live chess\" on the Village green in which the \"chessmen\" are Villagers and the players sit in elevated chairs and call out the moves with megaphones. Recruited by one player as the Queen's pawn, he only reluctantly obeys his \"master's\" orders. After the match, Number 6 enacts a new escape plan that requires the complicity of a specific type of individual. He chooses one of the rooks from the chess game, a man known for his rebellious nature."
}, {
  "imdbId" : "0061287",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "Hammer Into Anvil",
  "description" : "Number 6 vows revenge and goes after a sadistic Number 2 after he drives a fellow village resident to her death."
}, {
  "imdbId" : "0061287",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "It's Your Funeral",
  "description" : "Number Six hears of an assassination plot against Number Two, but it's the new Number Two doing all the plotting against the retiring Number Two."
}, {
  "imdbId" : "0061287",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "A Change of Mind",
  "description" : "After a brawl Number 6 is declared \"unmutual\" and is made to think that he has undergone \"instant social treatment.\""
}, {
  "imdbId" : "0061287",
  "season" : "1",
  "episodeNumber" : "13",
  "title" : "Do Not Forsake Me, Oh My Darling",
  "description" : "With his mind transferred to another body, Number 6 wakes up in his London flat and can't convince his colleagues who he is. He takes off to Austria to find the one man who can help him, the person Number 2 wants him to find."
}, {
  "imdbId" : "0061287",
  "season" : "1",
  "episodeNumber" : "14",
  "title" : "Living in Harmony",
  "description" : "Number 6 finds himself in the middle of a wild west version of his imprisonment."
}, {
  "imdbId" : "0061287",
  "season" : "1",
  "episodeNumber" : "15",
  "title" : "The Girl Who Was Death",
  "description" : "Back in London, Number 6 is trying to track down a crazed scientist who is protected by his homicidal daughter."
}, {
  "imdbId" : "0061287",
  "season" : "1",
  "episodeNumber" : "16",
  "title" : "Once Upon a Time",
  "description" : "Because all other attempts to break Number 6 have failed, Number 2 decides to engage him in a game where one of them will end up dead."
}, {
  "imdbId" : "0061287",
  "season" : "1",
  "episodeNumber" : "17",
  "title" : "Fall Out",
  "description" : "After witnessing the trials of Number 2 and Number 48 and meeting the President of the Assembly, Number 6 escapes during the chaos that follows."
}]