[{
  "imdbId" : "0810788",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Pilot",
  "description" : "Michael Weston, a contract agent for various agencies including the CIA, finds that a burn notice has been issued for him. Stranded in Miami, he takes the case of a caretaker accused of stealing millions from his boss."
}, {
  "imdbId" : "0810788",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Identity",
  "description" : "Weston is roped into helping his mother's friend get back money she lost in a scam, but Fi and Sam may ruin everything with their bumbling and bickering."
}, {
  "imdbId" : "0810788",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Fight or Flight",
  "description" : "Michael's landlord, Oleg, is having a problem with one of his waitresses. She hasn't come into work because she witnessed a crime committed by a man who just happens to be a member of a local drug cartel. Michael is (mostly) happy to look into it, as he also continues his investigation into who stuck him with his burn notice."
}, {
  "imdbId" : "0810788",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Old Friends",
  "description" : "Michael's brother is back in town, and he involves him in the search for a friend's daughter for less than pure motives. Elsewhere, an agent with a grudge comes after Michael."
}, {
  "imdbId" : "0810788",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Family Business",
  "description" : "Michael takes on arms dealers for an airport worker, while Nate obsesses about the car and their dad's will."
}, {
  "imdbId" : "0810788",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Unpaid Debts",
  "description" : "Michael helps out an old SEAL buddy of Sam's who has gotten himself on the wrong side of a smuggler while trying to repossess his boat, and a new agent hits town set on making Michael's life miserable since he won't give up on finding his burn notice."
}, {
  "imdbId" : "0810788",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Broken Rules",
  "description" : "Michael works to rid a community in little Havana of a crime boss, all the while baiting Jason Bly at the risk of his family and friends."
}, {
  "imdbId" : "0810788",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Wanted Man",
  "description" : "Fiona decides to try bounty-hunting, but then convinces Michael to help prove the man innocent."
}, {
  "imdbId" : "0810788",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "Hard Bargain",
  "description" : "A slightly dim house sitter's fiancée has been kidnapped, and Sam guilts Michael into a rescue while he's negotiating with a D.C. bureaucrat to stop the burn notice."
}, {
  "imdbId" : "0810788",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "False Flag",
  "description" : "Michael makes plans to leave Miami, but has to do one last job - locate a woman's missing son - so he can get a new identity."
}, {
  "imdbId" : "0810788",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "Loose Ends, Part 1",
  "description" : "Phillip Cowan has arrived in Miami, but Michael has to put him off when a job involving heroin and blackmail goes south."
}, {
  "imdbId" : "0810788",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "Loose Ends, Part 2",
  "description" : "With Cowan's bosses now tracking him, Michael must protect his family and rescue Sam all before his own capture if he doesn't move fast enough."
}, {
  "imdbId" : "0810788",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "Breaking and Entering",
  "description" : "Stepping out of the back of the eighteen-wheeler he was riding in, Michael Westen is greeted with an exploding plane, dead bodies, and one hog-tied, live \"client\", Jimmy. The phone rings, and a female voice, calling herself \"Carla\", lets Michael know that if he gets this man back to Miami, and help him play ball, she will finally let him know who burned him. After agreeing to help his new client, Jimmy, steal data from the fortress at Security Associates, and get the man's family back, who are now being held hostage, Michael enlists the help of his friends Fiona and ..."
}, {
  "imdbId" : "0810788",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "Turn and Burn",
  "description" : "While Michael's new handler asks him to locate a Tunisian counterfeiter, Sam asks him to help a woman who says she is being stalked by a drug dealer, and his mother asks him to join her in seeing a therapist."
}, {
  "imdbId" : "0810788",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "Trust Me",
  "description" : "Michael tries to help a man who lost the money he owes to loan sharks to a conman, and blackmails a Pakistani spy in order to get information about his new operative. Meanwhile, Michael's mother asks Fi about their breakup."
}, {
  "imdbId" : "0810788",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "Comrades",
  "description" : "Michael's brother shows up to ask him to help a Russian woman whose sister is being held by Russian mobsters, and Sam tries to work a local agriculture source to find out more information about Michael's handler."
}, {
  "imdbId" : "0810788",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "Scatter Point",
  "description" : "Michael poses as a safe cracker to help out a reformed ex-con who is unwittingly part of a heist, and tries to sneak into the heavily-guarded office of his handler. Meanwhile, Sam gets an unexpected proposition from his girlfriend."
}, {
  "imdbId" : "0810788",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "Bad Blood",
  "description" : "Michael meets his new \"wrangler\"/\"rodeo clown\". Also Michael's childhood friend Ricky needs help proving his innocence to his boss, Valantine."
}, {
  "imdbId" : "0810788",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "Rough Seas",
  "description" : "An early client of Michael's returns with a new job for him which will disrupt Fi's social life, and spark Madeline's, and the search for the buyer of the sniper rifle turns dangerous."
}, {
  "imdbId" : "0810788",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "Double Booked",
  "description" : "Michael tries to foil a hit that he was hired for by an old spy colleague he thought was dead, which becomes more complicated when he discovers that there is more than one contract out on the target."
}, {
  "imdbId" : "0810788",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "Good Soldier",
  "description" : "Michael and Sam are busy running counter-surveillance on Carla and the sniper. However, the job is interrupted when Fiona's new boyfriend asks Michael to help a friend involved in a kidnapping conspiracy plot."
}, {
  "imdbId" : "0810788",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "Do No Harm",
  "description" : "Michael has questions for Carla, and he wants to know who tried to blow him up. But first he goes after a group of medical scam artists who stole the life savings from a man trying to take care of his sick child."
}, {
  "imdbId" : "0810788",
  "season" : "2",
  "episodeNumber" : "11",
  "title" : "Hot Spot",
  "description" : "While Fi tries to help Michael by getting the identity of the man who may have tried to blow him up, Michael tries to help a football player who is in trouble with a gang of car thieves."
}, {
  "imdbId" : "0810788",
  "season" : "2",
  "episodeNumber" : "12",
  "title" : "Seek and Destroy",
  "description" : "Michael turns to a familiar arms dealer for help in tracking down the bomber, and decides to help out a woman track down her dead artist father's stolen painting."
}, {
  "imdbId" : "0810788",
  "season" : "2",
  "episodeNumber" : "13",
  "title" : "Bad Breaks",
  "description" : "Michael and former handler Jason Bly are trapped together in a bank robbery. The pair must work together in order to get out alive"
}, {
  "imdbId" : "0810788",
  "season" : "2",
  "episodeNumber" : "14",
  "title" : "Truth and Reconciliation",
  "description" : "Michael helps a Haitian man who is trying to prove that a man currently living in Miami is actually a fugitive who killed his daughter in a Haitian prison."
}, {
  "imdbId" : "0810788",
  "season" : "2",
  "episodeNumber" : "15",
  "title" : "Sins of Omission",
  "description" : "Michael's ex-fiancée asks for help after a black market dealer kidnaps her son to force her to steal a tracking chip for him."
}, {
  "imdbId" : "0810788",
  "season" : "2",
  "episodeNumber" : "16",
  "title" : "Lesser Evil",
  "description" : "Michael captures the rogue agent responsible for trying to bomb him, but he decides to form an alliance with him and together go after Carla and her boss. But that decision also puts Michael's mother in jeopardy."
}, {
  "imdbId" : "0810788",
  "season" : "3",
  "episodeNumber" : "1",
  "title" : "Friends and Family",
  "description" : "An old colleague frees Michael from prison and asks for his help in capturing a man who is stealing land from Venezuelan farmers, but is that his real mission?"
}, {
  "imdbId" : "0810788",
  "season" : "3",
  "episodeNumber" : "2",
  "title" : "Question and Answer",
  "description" : "It's Michael's birthday, but he and Sam are busy performing a dangerous \"reverse interrogation\" to find the location of a kidnapped boy."
}, {
  "imdbId" : "0810788",
  "season" : "3",
  "episodeNumber" : "3",
  "title" : "End Run",
  "description" : "Arms dealer Brennen returns and threatens to kill Michael's brother Nate if he does not cooperate and perform a mission for him."
}, {
  "imdbId" : "0810788",
  "season" : "3",
  "episodeNumber" : "4",
  "title" : "Fearless Leader",
  "description" : "Michael, Fi, and Sam pose as an under boss' crew to bring down a criminal and hopefully get Detective Paxson off Michael's case. Meanwhile, Sam is audited by a humorless, no-nonsense IRS agent."
}, {
  "imdbId" : "0810788",
  "season" : "3",
  "episodeNumber" : "5",
  "title" : "Signals and Codes",
  "description" : "Michael's quest to get a new CIA connection is interrupted when a mentally disturbed man comes to him with credible evidence that someone is sending encrypted messages that reveal the names of operatives."
}, {
  "imdbId" : "0810788",
  "season" : "3",
  "episodeNumber" : "6",
  "title" : "The Hunter",
  "description" : "Michael is outnumbered and on the run in The Everglades from an old Ukranian nemesis, and his only ally is an angry gunrunner whom Michael inadvertently got roped into the situation."
}, {
  "imdbId" : "0810788",
  "season" : "3",
  "episodeNumber" : "7",
  "title" : "Shot in the Dark",
  "description" : "As Michael tries to gather intelligence on the \"agent to the spies\" who is offering him work, he comes to the aid of a teenage boy with a violent and abusive stepfather who is trying to take custody away from his mother."
}, {
  "imdbId" : "0810788",
  "season" : "3",
  "episodeNumber" : "8",
  "title" : "Friends Like These",
  "description" : "While Michael takes a job from Strickler despite Fi's reservations, Barry the money launderer cashes in his favors and asks Michael to help retrieve the ledger with his clients' information which was stolen from him."
}, {
  "imdbId" : "0810788",
  "season" : "3",
  "episodeNumber" : "9",
  "title" : "Long Way Back",
  "description" : "Michael is about to get his name cleared at the agency, but Fi is leaving him to return to Ireland. However, their plans are interrupted when Fi's brother arrives with news that an enemy is in Miami with plans to kill Fi."
}, {
  "imdbId" : "0810788",
  "season" : "3",
  "episodeNumber" : "10",
  "title" : "A Dark Road",
  "description" : "Michael's quest to find out who killed Diego is interrupted as he helps a widow take on a network of insurance scammers. However, the job could be jeopardized when Madeline befriends an \"asset\" during the mission."
}, {
  "imdbId" : "0810788",
  "season" : "3",
  "episodeNumber" : "11",
  "title" : "Friendly Fire",
  "description" : "Michael helps track down a child predator for one of Sam's old friends, and winds up igniting a war between two rival gang leaders. Meanwhile, Michael also makes contact with Diego's killer, who has in interest in his services."
}, {
  "imdbId" : "0810788",
  "season" : "3",
  "episodeNumber" : "12",
  "title" : "Noble Causes",
  "description" : "An old drug-dealing acquaintance asks Michael to help his mentally-challenged cousin, who is unknowingly involved in a heist. Meanwhile, Gilroy gives Michael a mission, but he is forced to work with a dangerous partner."
}, {
  "imdbId" : "0810788",
  "season" : "3",
  "episodeNumber" : "13",
  "title" : "Enemies Closer",
  "description" : "Michael's old spy partner Larry is back, and gets Michael in trouble with a cartel. Meanwhile, Michael needs Sam's help for Gilroy's latest black op assignment, and Nate is back in town with a wife and a proposition for Madeline."
}, {
  "imdbId" : "0810788",
  "season" : "3",
  "episodeNumber" : "14",
  "title" : "Partners in Crime",
  "description" : "A socialite fashion designer who hired Sam and Michael to find out who's stealing from her turns up dead during the operation. Meanwhile, Michael needs Fi's help to find out more information about the flight that Gilroy's interested in."
}, {
  "imdbId" : "0810788",
  "season" : "3",
  "episodeNumber" : "15",
  "title" : "Good Intentions",
  "description" : "Michael's job for Gilroy approaches its conclusion, but he is temporarily sidetracked as he is forced to come to the rescue of Fi, who may be in over her head after she takes a job for a violent kidnapper."
}, {
  "imdbId" : "0810788",
  "season" : "3",
  "episodeNumber" : "16",
  "title" : "Devil You Know",
  "description" : "After Gilroy's plan goes horribly wrong, the FBI is on the lookout for Michael, and they try to use Madeline to get to him. Meanwhile, the man Michael and Gilroy helped to escape turns to Michael to arrange a \"meeting\" with management."
}, {
  "imdbId" : "0810788",
  "season" : "4",
  "episodeNumber" : "1",
  "title" : "Friends and Enemies",
  "description" : "While Michael contemplates working with a man who is trying to uncover the identity of the arms dealers who were responsible for Simon's escape, the old gang helps a lawyer who has been green-lighted for death by a biker gang."
}, {
  "imdbId" : "0810788",
  "season" : "4",
  "episodeNumber" : "2",
  "title" : "Fast Friends",
  "description" : "A burned spy turns to Michael to help protect him from an enemy who has found him and wants him dead, not knowing that Michael is the person who burned him."
}, {
  "imdbId" : "0810788",
  "season" : "4",
  "episodeNumber" : "3",
  "title" : "Made Man",
  "description" : "Jesse convinces Michael, Sam, and Fi to help a warehouse security guard being harassed by mobsters. But when Michael's cover is compromised, Sam is forced to take over and run point in the operation."
}, {
  "imdbId" : "0810788",
  "season" : "4",
  "episodeNumber" : "4",
  "title" : "Breach of Faith",
  "description" : "While Jesse and Fi try to gather information on a dead gunrunner, Michael and Sam are caught in the middle of a hostage situation while trying to help a man who lost his charity's money to a con artist."
}, {
  "imdbId" : "0810788",
  "season" : "4",
  "episodeNumber" : "5",
  "title" : "Neighborhood Watch",
  "description" : "While Kendra the assassin tries to set up a meeting with Michael to get a stolen computer disk, the gang tries to help a clinic doctor who is being harassed by neighborhood drug dealers."
}, {
  "imdbId" : "0810788",
  "season" : "4",
  "episodeNumber" : "6",
  "title" : "Entry Point",
  "description" : "While Michael and Fi try to foil the heist of a priceless antique sword, Sam and Jesse try an interrogation trick to get information out of Kendra."
}, {
  "imdbId" : "0810788",
  "season" : "4",
  "episodeNumber" : "7",
  "title" : "Past & Future Tense",
  "description" : "Michael helps a former Cold War spy who has been targeted by Russian operatives, while Fi helps Jesse get a chance to speak with his old boss about who burned him."
}, {
  "imdbId" : "0810788",
  "season" : "4",
  "episodeNumber" : "8",
  "title" : "Where There's Smoke",
  "description" : "Michael and Jesse's plans to steal a safe deposit box are interrupted when Fi and a businessman's wife are kidnapped while Fi and Sam prepare to work security for a party."
}, {
  "imdbId" : "0810788",
  "season" : "4",
  "episodeNumber" : "9",
  "title" : "Center of the Storm",
  "description" : "In the aftermath of a hurricane, Michael poses as a hitman as part of his plan to protect a federal witness, and is forced to turn to Vaughn so that he can speak to Simon about his coded Bible."
}, {
  "imdbId" : "0810788",
  "season" : "4",
  "episodeNumber" : "10",
  "title" : "Hard Times",
  "description" : "After Vaughn sets up a meeting with Simon for Michael about his Bible, Michael gets himself placed in a prison to help one of Sam's friends who has been targeted for death by a gang leader."
}, {
  "imdbId" : "0810788",
  "season" : "4",
  "episodeNumber" : "11",
  "title" : "Blind Spot",
  "description" : "As Sam and Jesse reach out to the CEO who wants Simon's encoded Bible, Sam continues to mislead Jesse about who burned him. Meanwhile, Sam and Fi try to out-con a conman who is stealing money from unsuspecting widows."
}, {
  "imdbId" : "0810788",
  "season" : "4",
  "episodeNumber" : "12",
  "title" : "Guilty as Charged",
  "description" : "As Michael prepares for his meeting with John Barrett, he also agrees to help a sleazy defense attorney whose daughter has been kidnapped, while Fi and Madeline try to convince Jesse not to kill Michael for burning him."
}, {
  "imdbId" : "0810788",
  "season" : "4",
  "episodeNumber" : "13",
  "title" : "Eyes Open",
  "description" : "As Michael tries to catch a mad bomber who was hired by one of Michael's former clients to kill a kidnapper, Jesse reluctantly helps Fi find the man who possesses the Bible that has information on who burned Michael."
}, {
  "imdbId" : "0810788",
  "season" : "4",
  "episodeNumber" : "14",
  "title" : "Hot Property",
  "description" : "A thief blackmails the gang into helping her get a chemical weapon back from the Venezuelans who stole it, and Jesse turns to Marv, his former handler, to help Michael get his hands on the Bible."
}, {
  "imdbId" : "0810788",
  "season" : "4",
  "episodeNumber" : "15",
  "title" : "Brotherly Love",
  "description" : "While Sam and Jesse travel to the Dominican Republic to get their hands on the list of people who burned Michael, Michael helps his brother Nate, who is back in Miami to find a stolen car."
}, {
  "imdbId" : "0810788",
  "season" : "4",
  "episodeNumber" : "16",
  "title" : "Dead or Alive",
  "description" : "While Michael recruits Marv to help turn the list in to the authorities, Sam plots revenge when he finds out that an old police buddy of his was killed under the orders of his dirty partner."
}, {
  "imdbId" : "0810788",
  "season" : "4",
  "episodeNumber" : "17",
  "title" : "Out of the Fire",
  "description" : "Brennen teams Michael up with Larry to track down and kill the people on the list."
}, {
  "imdbId" : "0810788",
  "season" : "4",
  "episodeNumber" : "18",
  "title" : "Last Stand",
  "description" : "Michael, Fi, and Jesse are trapped in an abandoned hotel, held under siege by Vaughn's team of killers. Meanwhile, Sam and Madeline are forced to turn to congressman Cowley as their only hope to save them."
}, {
  "imdbId" : "0810788",
  "season" : "5",
  "episodeNumber" : "1",
  "title" : "Company Man",
  "description" : "Now employed as a CIA asset, Michael travels to Caracas with Sam and Fi to find the man who burned him."
}, {
  "imdbId" : "0810788",
  "season" : "5",
  "episodeNumber" : "2",
  "title" : "Bloodlines",
  "description" : "While the CIA assigns Michael to babysit a scientist, Jesse asks him for help in bringing a group of Yakuza human traffickers to justice."
}, {
  "imdbId" : "0810788",
  "season" : "5",
  "episodeNumber" : "3",
  "title" : "Mind Games",
  "description" : "Fi and Sam ask Michael to take a break and let go of the past now that the people who burned him have been brought to justice, but he soon decides to help one of Nate's friends who is being harassed by a loan shark."
}, {
  "imdbId" : "0810788",
  "season" : "5",
  "episodeNumber" : "4",
  "title" : "No Good Deed",
  "description" : "While Michael works with Max to intercept some files on a stolen tablet computer, Barry asks the gang to help his brother, who is having problems with a hacker."
}, {
  "imdbId" : "0810788",
  "season" : "5",
  "episodeNumber" : "5",
  "title" : "Square One",
  "description" : "Michael volunteers to help the CIA find Max's killer, even though he is the prime suspect. At the same time, he helps out a former Army sniper who wants revenge on the people who nearly beat his sister to death."
}, {
  "imdbId" : "0810788",
  "season" : "5",
  "episodeNumber" : "6",
  "title" : "Enemy of My Enemy",
  "description" : "Michael plays a heroin dealer from his past against Serbian mobsters so that he can help the agency retrieve a stolen predator drone. However, his plan threatens to put Sam in serious danger."
}, {
  "imdbId" : "0810788",
  "season" : "5",
  "episodeNumber" : "7",
  "title" : "Besieged",
  "description" : "The gang takes on a militia group so that Michael can return a boy to his mother, while also trying to get answers out of the man hired as Michael's impostor."
}, {
  "imdbId" : "0810788",
  "season" : "5",
  "episodeNumber" : "8",
  "title" : "Hard Out",
  "description" : "Michael goes on a CIA mission to stop a team of mercenaries in the Bahamas, while Fi is forced to turn to a shady arms dealer from her past to get information for Michael."
}, {
  "imdbId" : "0810788",
  "season" : "5",
  "episodeNumber" : "9",
  "title" : "Eye for an Eye",
  "description" : "While Michael and Sam interrogate the war criminal who made the bomb that was supposed to kill him, Fi and Jesse help a man get revenge on his former business partner who betrayed him."
}, {
  "imdbId" : "0810788",
  "season" : "5",
  "episodeNumber" : "10",
  "title" : "Army of One",
  "description" : "Jesse asks Michael to sabotage a team of corporate spies, not knowing that they are planning a hostage situation. Meanwhile, Sam and Fi turn to an old \"friend\" to help gather information about who framed Michael and killed Max."
}, {
  "imdbId" : "0810788",
  "season" : "5",
  "episodeNumber" : "11",
  "title" : "Better Halves",
  "description" : "While Sam and Jesse get some help to get to Tavian, the assassin who framed Michael, Michael and Fi pose as a married couple for a CIA extraction assignment."
}, {
  "imdbId" : "0810788",
  "season" : "5",
  "episodeNumber" : "12",
  "title" : "Dead to Rights",
  "description" : "After Michael gets off the hook for Max's murder, Larry returns to force Michael to help him break into the British Consulate."
}, {
  "imdbId" : "0810788",
  "season" : "5",
  "episodeNumber" : "13",
  "title" : "Damned If You Do",
  "description" : "Anson forces Michael to kidnap a computer hacker, Oswald, to find a virus that he created that can wipe the records of a person undetected. But Anson isn't the only one after the virus."
}, {
  "imdbId" : "0810788",
  "season" : "5",
  "episodeNumber" : "14",
  "title" : "Breaking Point",
  "description" : "While Sam and Fi do surveillance to find Anson's secret hideout, Michael poses as a gun dealer to trap the gang leader who killed one of his childhood friends and get him arrested."
}, {
  "imdbId" : "0810788",
  "season" : "5",
  "episodeNumber" : "15",
  "title" : "Necessary Evil",
  "description" : "While Sam and Jesse try to save a weapons maker held against his will to build a missile for an African warlord, Michael and Fi discover that Madeline's new boyfriend actually working for Anson."
}, {
  "imdbId" : "0810788",
  "season" : "5",
  "episodeNumber" : "16",
  "title" : "Depth Perception",
  "description" : "Fi and Jesse are sent to the Caribbean to transfer Anson's money to a new account. Meanwhile, Michael and Anson put aside their differences to help an old friend of Sam's, who's being targeted by a Russian spy."
}, {
  "imdbId" : "0810788",
  "season" : "5",
  "episodeNumber" : "17",
  "title" : "Acceptable Loss",
  "description" : "While Michael turns to Vaughn to get answers about Anson, the rest of the crew helps Jesse's friend take down a diplomat dealing in blood diamonds."
}, {
  "imdbId" : "0810788",
  "season" : "5",
  "episodeNumber" : "18",
  "title" : "Fail Safe",
  "description" : "When Anson demands that Michael burn the CIA team he's working with, Fi decides she's had enough and takes a drastic step to settle Michael's debt to Anson once and for all."
}, {
  "imdbId" : "0810788",
  "season" : "6",
  "episodeNumber" : "1",
  "title" : "Scorched Earth",
  "description" : "With Fiona now in custody and facing an old foe inside prison, Michael pulls out all the stops to take on Anson."
}, {
  "imdbId" : "0810788",
  "season" : "6",
  "episodeNumber" : "2",
  "title" : "Mixed Messages",
  "description" : "Michael takes on a drug cartel for his former mentor to gain access to Fiona, who must befriend a fellow prisoner to fend off a gang leader."
}, {
  "imdbId" : "0810788",
  "season" : "6",
  "episodeNumber" : "3",
  "title" : "Last Rites",
  "description" : "Pearce asks Michael to track down her fiancé's killer. Fiona investigates who tried to kill her inside of prison."
}, {
  "imdbId" : "0810788",
  "season" : "6",
  "episodeNumber" : "4",
  "title" : "Under the Gun",
  "description" : "Michael, Sam, and Jesse take on a mission in the Everglades, but Sam gets kidnapped. Fiona makes a new ally inside prison when two prisoners go after her."
}, {
  "imdbId" : "0810788",
  "season" : "6",
  "episodeNumber" : "5",
  "title" : "Split Decision",
  "description" : "Michael's mentor, Tom Card, offers Fiona a chance to leave prison and avoid extradition in exchange for becoming a CIA asset. Michael tracks down a vicious gangster with some unexpected help."
}, {
  "imdbId" : "0810788",
  "season" : "6",
  "episodeNumber" : "6",
  "title" : "Shock Wave",
  "description" : "Sam and Barry are pinned down by an assassin as Michael gets a lead on Anson. An MI-6 agent tries to prevent Fiona's release from prison."
}, {
  "imdbId" : "0810788",
  "season" : "6",
  "episodeNumber" : "7",
  "title" : "Reunion",
  "description" : "Sam tries to help his girlfriend's son, who is indebted to a vicious loan shark. Michael and Fiona must pick up the pieces from their last mission."
}, {
  "imdbId" : "0810788",
  "season" : "6",
  "episodeNumber" : "8",
  "title" : "Unchained",
  "description" : "To help the FBI take down a vicious Boston mobster, Michael gets himself arrested. Jesse and Pearce run into trouble while investigating a gun sale."
}, {
  "imdbId" : "0810788",
  "season" : "6",
  "episodeNumber" : "9",
  "title" : "Official Business",
  "description" : "Fiona must help a CIA asset who is targeted by a black-market businessman. Sam and Jesse infiltrate a mercenary training camp to track down a sniper."
}, {
  "imdbId" : "0810788",
  "season" : "6",
  "episodeNumber" : "10",
  "title" : "Desperate Times",
  "description" : "Madeline confronts Michael's mentor, Tom Card. The team runs into trouble as they head to Panama to track down an assassin."
}, {
  "imdbId" : "0810788",
  "season" : "6",
  "episodeNumber" : "11",
  "title" : "Desperate Measures",
  "description" : "Michael and the team must evade a vicious drug-runner and hijack a plane to escape Panama."
}, {
  "imdbId" : "0810788",
  "season" : "6",
  "episodeNumber" : "12",
  "title" : "Means & Ends",
  "description" : "A former inmate asks for Fiona's help to take down a corrupt detective. Michael teams up with an old adversary to take down a treacherous enemy."
}, {
  "imdbId" : "0810788",
  "season" : "6",
  "episodeNumber" : "13",
  "title" : "Over the Line",
  "description" : "With the authorities after him for the death of Tom Card, Michael must risk Sam's life in order to escape."
}, {
  "imdbId" : "0810788",
  "season" : "6",
  "episodeNumber" : "14",
  "title" : "Down & Out",
  "description" : "Riley puts pressure on Maddie to assist her in finding Michael. Michael gets himself captured to locate a ham-fisted smuggler."
}, {
  "imdbId" : "0810788",
  "season" : "6",
  "episodeNumber" : "15",
  "title" : "Best Laid Plans",
  "description" : "Maddie asks Barry for help. Michael's plan to sell an important piece of technology puts Sam in the crossfire when things go awry."
}, {
  "imdbId" : "0810788",
  "season" : "6",
  "episodeNumber" : "16",
  "title" : "Odd Man Out",
  "description" : "Michael gets caught between a smuggler and the client against whom he's seeking revenge."
}, {
  "imdbId" : "0810788",
  "season" : "6",
  "episodeNumber" : "17",
  "title" : "You Can Run",
  "description" : "Each side takes a hostage as agent Riley finally catches up with Michael, but Sam may not make it out alive."
}, {
  "imdbId" : "0810788",
  "season" : "6",
  "episodeNumber" : "18",
  "title" : "Game Change",
  "description" : "When agent Riley turns to a drug cartel to take out Michael and his friends, Michael is forced to turn to Jason Bly for help."
}, {
  "imdbId" : "0810788",
  "season" : "7",
  "episodeNumber" : "1",
  "title" : "New Deal",
  "description" : "Michael must deal with a terrorist who recruits him to steal hardware from the Department of Defense. Sam and Jesse discover Michael's life might be in danger."
}, {
  "imdbId" : "0810788",
  "season" : "7",
  "episodeNumber" : "2",
  "title" : "Forget Me Not",
  "description" : "Michael returns to Miami but can't contact his mother or his friends in order to maintain his cover."
}, {
  "imdbId" : "0810788",
  "season" : "7",
  "episodeNumber" : "3",
  "title" : "Down Range",
  "description" : "Sam and Jesse head to the Dominican Republic to help with Michael's undercover mission. Fiona must help Maddie take care of a bookie attempting to collect on a debt."
}, {
  "imdbId" : "0810788",
  "season" : "7",
  "episodeNumber" : "4",
  "title" : "Brother in Arms",
  "description" : "In order to help Michael free a prisoner trapped in Cuba by the Russians, Fiona and Maddie must frame a corrupt bureaucrat."
}, {
  "imdbId" : "0810788",
  "season" : "7",
  "episodeNumber" : "5",
  "title" : "Exit Plan",
  "description" : "Strong must convince Fiona to help Michael, who must escape from Cuba with the help of a former Russian spy in Burke's organization."
}, {
  "imdbId" : "0810788",
  "season" : "7",
  "episodeNumber" : "6",
  "title" : "All or Nothing",
  "description" : "Michael is conflicted when he asks Fiona to help him steal intelligence data for Sonya. Sam and Jesse help Barry track down an old girlfriend."
}, {
  "imdbId" : "0810788",
  "season" : "7",
  "episodeNumber" : "7",
  "title" : "Psychological Warfare",
  "description" : "Michael postulates and is painstakingly questioned by the very organization he is trying to take down and could reveal damaging secrets when he is drugged."
}, {
  "imdbId" : "0810788",
  "season" : "7",
  "episodeNumber" : "8",
  "title" : "Nature of the Beast",
  "description" : "While Michael is tasked by the organization he infiltrated to take down a drug smuggler, Fiona, Jesse, and Strong find out more about its leader, James."
}, {
  "imdbId" : "0810788",
  "season" : "7",
  "episodeNumber" : "9",
  "title" : "Bitter Pill",
  "description" : "Maddie suspects she is being followed and takes matters into her own hands. The team tries to help a Middle Eastern diplomat when the individual is poisoned."
}, {
  "imdbId" : "0810788",
  "season" : "7",
  "episodeNumber" : "10",
  "title" : "Things Unseen",
  "description" : "A figure from Michael's past could reveal his cover in a crucial mission. Fiona's boyfriend is targeted by a gang, which places Sam and Jesse in the crossfire."
}, {
  "imdbId" : "0810788",
  "season" : "7",
  "episodeNumber" : "11",
  "title" : "Tipping Point",
  "description" : "A conflicted Michael goes to Mexico on a mission with Sonya, not knowing what ruthless mercenaries Strong has hired to capture James."
}, {
  "imdbId" : "0810788",
  "season" : "7",
  "episodeNumber" : "12",
  "title" : "Sea Change",
  "description" : "Fiona and Jesse fear for Michael's life when he reveals his true identity to James."
}, {
  "imdbId" : "0810788",
  "season" : "7",
  "episodeNumber" : "13",
  "title" : "Reckoning",
  "description" : "Michael must win back the trust of everyone he betrayed as James becomes obsessed with ending his life."
}]