[{
  "imdbId" : "0058846",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Yesterday's Enemies",
  "description" : "Brett is known to be giving away British industrial secrets. However, when Drake confronts him, he discovers things are a lot more complicated and that Brett is not the only person being investigated."
}, {
  "imdbId" : "0058846",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "The Professionals",
  "description" : "Mrs Pearson's upset when her husband, Desmond, seems to have disappeared from Prague. The man at the British embassy is unsympathetic, but the ambassador knows Desmond's an M9 agent. Drake's bright in to find out what's happening, by posing as an embassy employee with a weakness for spirits. As Drake digs into the social life of Prague by going to a party being organised by Milos Kaldor, he's drugged and arrested for drunk driving and seriously injuring a pedestrian. It appears Kaldor is in charge of a blackmail ring and has been keeping Desmond as a hostage. Drake ..."
}, {
  "imdbId" : "0058846",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Colony Three",
  "description" : "Drake takes the place of a defector and goes behind the iron curtain to find out what is happening when foreign agents reach England. When he gets there he finds a replica English village, which is a school where foreign agents are taught to 'be British'. Actual British subjects, such as Drake, are employed to teach the agents the finer points of the British way of life. Drake sets out to disrupt their education and stop the supply of agents from reaching England."
}, {
  "imdbId" : "0058846",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "The Galloping Major",
  "description" : "Drake is sent to Africa to protect the prime minister, who is in the midst of an election campaign. It is suspected that the opposition leader is planning to overthrow the government but Drake finds out that it is much more complicated."
}, {
  "imdbId" : "0058846",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Fair Exchange",
  "description" : "In a poignant reminder that spies are merely people and that they often take terrible punishment when caught, Drake tries to stop a former agent from killing the East German government official who had her tortured beyond repair."
}, {
  "imdbId" : "0058846",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Fish on the Hook",
  "description" : "M9 receives a mayday signal from an agent in an Arab country. He has been compromised and must get out. The agent is also the contact for a local spy called the Fish. Drake is sent undercover to bring the Fish out."
}, {
  "imdbId" : "0058846",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "The Colonel's Daughter",
  "description" : "Drake is in India when he is asked by an old friend, the Delhi police chief, to investigate the mysterious death of the employee of a retired colonel. The colonel sells exotic butterflies but Drake finds out that there is a lot more to it."
}, {
  "imdbId" : "0058846",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "The Battle of the Cameras",
  "description" : "A woman disguised as a clumsy tea lady steals some secret papers, which are sold to the highest bidder by a Mr Kent. M9 sends Drake to investigate a number of similar thefts by befriending the woman and infiltrating the organisation."
}, {
  "imdbId" : "0058846",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "No Marks for Servility",
  "description" : "An international financier has come to the notice of M9, as he is believed to be an extortionist and murderer. When some important people are found dead, Drake goes undercover as a butler at the financier's rented villa in Rome."
}, {
  "imdbId" : "0058846",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "A Man to Be Trusted",
  "description" : "Two M9 agents have been tortured and murdered on a Caribbean island, and Drake's sent to find out who killed them and to determine how much information they divulged before dying."
}, {
  "imdbId" : "0058846",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "Don't Nail Him Yet",
  "description" : "An agent is selling secrets to a foreign government. How he is doing this is unclear so Drake is brought in to find out, which he does by befriending him as a bumbling teacher on stress leave."
}, {
  "imdbId" : "0058846",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "A Date with Doris",
  "description" : "A glamorous actress is murdered and an M9 agent, whose cover has been discovered, is framed for her murder. Drake task is to get him out of jail and off the island using a submarine code-named Doris."
}, {
  "imdbId" : "0058846",
  "season" : "1",
  "episodeNumber" : "13",
  "title" : "That's Two of Us Sorry",
  "description" : "Confidential papers go missing, and Drake travels to a small island off the coast of Scotland in search of them and the culprit."
}, {
  "imdbId" : "0058846",
  "season" : "1",
  "episodeNumber" : "14",
  "title" : "Such Men Are Dangerous",
  "description" : "A prisoner is soon to be released and is offered a well-paid job that is obviously crooked. As he wants to go straight, he reports the approach. Drake takes his place in order to find out what the crime is to be, which is murder."
}, {
  "imdbId" : "0058846",
  "season" : "1",
  "episodeNumber" : "15",
  "title" : "Whatever Happened to George Foster?",
  "description" : "Drake discovers that a woman is financing political agitators in Santo Marco trying to bring down the government. He sets out to find out who employs her and why. Drake finds it is being funded by a rich member of the aristocracy."
}, {
  "imdbId" : "0058846",
  "season" : "1",
  "episodeNumber" : "16",
  "title" : "A Room in the Basement",
  "description" : "To save a friend with sensitive information who is being held in the Romanian embassy in Geneva, Drake must break into the embassy, in defiance of the British ambassador, retrieve his friend, and avoid an international incident."
}, {
  "imdbId" : "0058846",
  "season" : "1",
  "episodeNumber" : "17",
  "title" : "The Affair at Castelevara",
  "description" : "A former republican leader returns to his home country to retire. However, he is arrested by the current president and faces the death sentence, something both the British and Americans do not want to happen. Drake is sent in to stop it."
}, {
  "imdbId" : "0058846",
  "season" : "1",
  "episodeNumber" : "18",
  "title" : "The Ubiquitous Mr. Lovegrove",
  "description" : "After a driving accident, Drake finds he has a £500 gambling debt at a club he has no knowledge of, yet the staff seem to know him, and the club's manager, Mr. Alexander knows all about Drake's career with M9, and plans to blackmail him."
}, {
  "imdbId" : "0058846",
  "season" : "1",
  "episodeNumber" : "19",
  "title" : "It's Up to the Lady",
  "description" : "Glover has defected to China and M9 wants him back. Drake is ordered to try and get him. He follows Glover's wife to a remote Greek island near Albania where he encounters an Albanian agent keen on getting Glover's wife over the border."
}, {
  "imdbId" : "0058846",
  "season" : "1",
  "episodeNumber" : "20",
  "title" : "Have a Glass of Wine",
  "description" : "Drake follows a young lady, who has been selling secrets, to France where he confronts her with what he knows. Kathleen is being blackmailed and her role is to take the information to France. She offers to help Drake find who employs her."
}, {
  "imdbId" : "0058846",
  "season" : "1",
  "episodeNumber" : "21",
  "title" : "The Mirror's New",
  "description" : "Bierce is a British diplomat in France. He shoots a man, to whom he owes money, and hides the body. He then suddenly disappears. Drake is sent to try and find out what has happened to him."
}, {
  "imdbId" : "0058846",
  "season" : "1",
  "episodeNumber" : "22",
  "title" : "Parallel Lines Sometimes Meet",
  "description" : "A British husband and wife, both atomic scientists, disappear whilst on holiday. The suspicion is they've been kidnapped and Drake is sent to investigate."
}, {
  "imdbId" : "0058846",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "You're Not in Any Trouble, Are You?",
  "description" : "An M9 agent investigating the death of another man is murdered in Rome. Drake is sent to investigate what the circumstances of his death are and who murdered him. He finds the agent's tape recorder and this reveals that there is a murderers-for-hire organisation. To find the killers, Drake hires the organisation to kill him and sets a trap for the killer."
}, {
  "imdbId" : "0058846",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "The Black Book",
  "description" : "A British general asks Drake to help his brother-in-law in Paris, who is being blackmailed. By placing a tracking device in the blackmail money, Drake gets to the first stage in the chain, a beautiful French girl."
}, {
  "imdbId" : "0058846",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "A Very Dangerous Game",
  "description" : "Drake is sent to Singapore is to infiltrate the local Chinese spy ring. He impersonates a man who was going to defect to the East and his task is to find out as much about the foreign agency as possible, including the local spies."
}, {
  "imdbId" : "0058846",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "Sting in the Tail",
  "description" : "Noureddine assassinates the Shah of Assimi and Drake is brought in to get him to leave Beirut and travel to where he can be arrested. He does this by impersonating a struggling artist and befriending Noureddine's girlfriend."
}, {
  "imdbId" : "0058846",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "English Lady Takes Lodgers",
  "description" : "A spying agency is selling stolen secrets in Portugal. Drake is sent there disguised as an unsuccessful, indigent writer. He makes contact with the wife of a smuggler who has disappeared, and who is believed to be involved in the spy ring."
}, {
  "imdbId" : "0058846",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "Loyalty Always Pays",
  "description" : "Drake is sent to an African nation after M9 has received a report that the defence minister has been negotiating a secret treaty with the Chinese. Drake's task is to obtain a copy of the treaty in a heavily fortified ministry building."
}, {
  "imdbId" : "0058846",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "The Mercenaries",
  "description" : "An M9 agent infiltrating a group of mercenaries is killed, supposedly in an ambush. Drake is sent to Africa to join Colonel Coote's mercenaries and to find out what happened. He finds a plot to overthrow the government. a government."
}, {
  "imdbId" : "0058846",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "Judgement Day",
  "description" : "At an airport waiting to return home, Drake recurves a garbled message; he's diverted to pick up a doctor, and bring him back to London. However, the man's very nervous as somebody tried to kill him. Drake realises there's something the doctor's he wants to keep hidden."
}, {
  "imdbId" : "0058846",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "The Outcast",
  "description" : "A WREN 's murdered, and i she's been carrying top secret documents. Drake's sent to investigate. why she has the papers. The only clue;'s a radio operator who disappeared right after she was killed."
}, {
  "imdbId" : "0058846",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "Are You Going to Be More Permanent?",
  "description" : "An M9 controller in Geneva vanishes and is replaced. The replacement also disappears so Drake is assigned to fill in and discover which of the controller's three contacts is a traitor."
}, {
  "imdbId" : "0058846",
  "season" : "2",
  "episodeNumber" : "11",
  "title" : "To Our Best Friend",
  "description" : "Drake is sent to Bagdad as there appears to be a leak coming from one of his best friends. He sets a trap for his friend, which is sprung. When his friend vehemently denies his involvement, Drake must go looking for somebody else."
}, {
  "imdbId" : "0058846",
  "season" : "2",
  "episodeNumber" : "12",
  "title" : "The Man on the Beach",
  "description" : "Drake claims to be under orders to find a double-agent but the person who's meant to have given him the orders can't be found. Drake ends up under suspicion of having gone double."
}, {
  "imdbId" : "0058846",
  "season" : "2",
  "episodeNumber" : "13",
  "title" : "Say It with Flowers",
  "description" : "An agent that is sometimes used by M9 has disappeared and Drake is sent to Switzerland to find out what has happened. He finds that he is supposed to have died 3 months, ago but someone has withdrawn money out of his account recently."
}, {
  "imdbId" : "0058846",
  "season" : "2",
  "episodeNumber" : "14",
  "title" : "The Man Who Wouldn't Talk",
  "description" : "An M9 agent has been captured in Sofia and is being tortured to make him identify local agents, which threatens M9's operations in the area. Drake frees him but, still being affected by the torture, he mistakenly kills another agent."
}, {
  "imdbId" : "0058846",
  "season" : "2",
  "episodeNumber" : "15",
  "title" : "Someone Is Liable to Get Hurt",
  "description" : "An M9 agent is murdered in the Caribbean while investigating illegal arms deals. The deals are supposed to be the precursor to an armed overthrow of the government. Drake is sent to take his place and investigate the dealings."
}, {
  "imdbId" : "0058846",
  "season" : "2",
  "episodeNumber" : "16",
  "title" : "Dangerous Secret",
  "description" : "Two children end up in hospital after they stumble into a government germ warfare research unit. This troubles the chief scientist's conscience and he flees to France. Drake is sent to bring him back to England."
}, {
  "imdbId" : "0058846",
  "season" : "2",
  "episodeNumber" : "17",
  "title" : "I Can Only Offer You Sherry",
  "description" : "In a Muslim country, Drake must investigate a British secretary who's been giving sensitive information to a mysterious local man who's seduced her, but now holds her in check by lies and intimidation."
}, {
  "imdbId" : "0058846",
  "season" : "2",
  "episodeNumber" : "18",
  "title" : "The Hunting Party",
  "description" : "Investigating several seemingly random leaks, Drake finds they've one thing in common; the wealthy Jordan's - Claudia and Basil. Drake becomes manservant to the very disparate couple, at their chateau in the Loire Valley of France, in order to find our what's so fascinating about the pair.."
}, {
  "imdbId" : "0058846",
  "season" : "2",
  "episodeNumber" : "19",
  "title" : "Two Birds with One Bullet",
  "description" : "Drake steps into a trap set for him by a double agent, and is accused of the killing the Communist candidate who's about to win an election."
}, {
  "imdbId" : "0058846",
  "season" : "2",
  "episodeNumber" : "20",
  "title" : "I Am Afraid You Have the Wrong Number",
  "description" : "When an agent's death is faked in Geneva, Drake must find and retrieve him while avoiding the authorities finding proof that he or the missing agent are spies."
}, {
  "imdbId" : "0058846",
  "season" : "2",
  "episodeNumber" : "21",
  "title" : "The Man with the Foot",
  "description" : "After his cover is blown in an operation, Drake heads for \"sunny Spain\" to hide out for a while. With an apparent enemy arriving and Drake's friend telling the hotelier he intends to shoot Drake, it becomes a puzzle as to who can be trusted and who is really up to what. One of the lighter-hearted episodes yet still intriguing."
}, {
  "imdbId" : "0058846",
  "season" : "2",
  "episodeNumber" : "22",
  "title" : "The Paper Chase",
  "description" : "A British diplomat in Rome leaves some secret papers in a briefcase in his car. While he is having a drink, a man steals the briefcase. The diplomat calls in Drake, who goes on a chase and finds that the briefcase has been on-sold."
}, {
  "imdbId" : "0058846",
  "season" : "2",
  "episodeNumber" : "23",
  "title" : "Not So Jolly Roger",
  "description" : "The Jolly Roger is pirate radio station on an old sea fort. A DJ is killed just as he sends a message saying that the station is sending coded messages to foreign submarines. Drake goes undercover as a DJ to find out what is happening."
}, {
  "imdbId" : "0058846",
  "season" : "3",
  "episodeNumber" : "1",
  "title" : "Koroshi",
  "description" : "A Japanese agent warns that a UN negotiator will be assassinated in New York by a Tokyo-based organisation. She is killed before she can give the details and Drake is sent to Tokyo to investigate. The only clue is a pendant the girl had."
}, {
  "imdbId" : "0058846",
  "season" : "3",
  "episodeNumber" : "2",
  "title" : "Shinda Shima",
  "description" : "An electronics expert working for the government suddenly retires. M9 wants to know why, and Drake takes his place. His search leads to an island off Japan; Shinda Shima."
}]