[{
  "imdbId" : "1877514",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Déjà Vu (1858-1961)",
  "description" : "After nearly a century of French colonial rule, Vietnam emerges independent, but divided."
}, {
  "imdbId" : "1877514",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Riding the Tiger (1961-1963)",
  "description" : "President John F. Kennedy and his advisers consider how deeply the U.S. should get involved in South Vietnam as a communist insurgency and Buddhist protests intensify."
}, {
  "imdbId" : "1877514",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "The River Styx (January 1964-December 1965)",
  "description" : "Fearing Saigon's collapse, President Lyndon B. Johnson authorizes the bombing of North Vietnam, and sends U.S. ground troops to the south."
}, {
  "imdbId" : "1877514",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Resolve (January 1966-June 1967)",
  "description" : "North Vietnamese troops make their way down the Ho Chi Minh Trail, defying American air power. While the anti-war movement escalates back home, American soldiers realize this war is like no other."
}, {
  "imdbId" : "1877514",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "This Is What We Do (July-December 1967)",
  "description" : "As casualties mount on both sides, American soldiers face deadly ambushes and artillery. President Lyndon B. Johnson assures the American public that victory is within reach."
}, {
  "imdbId" : "1877514",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Things Fall Apart (January 1968-July 1968)",
  "description" : "Shaken by the violence of the Tet Offensive, assassinations of leaders and domestic unrest, Americans begin to doubt President Lyndon B. Johnson's promise that victory in Vietnam is near and he ultimately decides not to seek re-election."
}, {
  "imdbId" : "1877514",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "The Veneer of Civilization (June 1968-May 1969)",
  "description" : "Draft-age Americans wrestle with their choices. Richard Nixon narrowly wins the presidential election. Soldiers on all sides of the conflict witness savagery and courage."
}, {
  "imdbId" : "1877514",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "The History of the World (April 1969-May 1970)",
  "description" : "President Richard Nixon begins withdrawing American troops from Vietnam, but his authorization of the invasion of Cambodia sparks large protests in America."
}, {
  "imdbId" : "1877514",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "A Disrespectful Loyalty (May 1970-March 1973)",
  "description" : "The South Vietnamese fight on their own, succumbing to terrible losses in Laos. After he is re-elected, President Richard Nixon strikes a peace deal with Hanoi that sees the release of American prisoners of war."
}, {
  "imdbId" : "1877514",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "The Weight of Memory (March 1973-Onward)",
  "description" : "Civil war continues in Vietnam as President Richard Nixon resigns. After North Vietnamese troops regain control of Saigon and the war ends, Americans and Vietnamese from all sides search for reconciliation."
}]