[{
  "imdbId" : "2758950",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Pilot",
  "description" : "A Center for Disease Control medical team's investigation of a disease outbreak at a high tech arctic research lab uncovers the truth about a secretive research project that could threaten the future of humankind."
}, {
  "imdbId" : "2758950",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Vector",
  "description" : "As Dr. Alan Farragut (Billy Campbell) accelerates the hunt for his infected brother Peter (Neil Napier), the quarantine of three scientists threatens to create panic at the lab. Doreen (Catherine Lemieux) finds evidence that Dr. Hatake (Hiroyuki Sanada) is lying about his research."
}, {
  "imdbId" : "2758950",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "274",
  "description" : "As Alan (Billy Campbell) sets up an isolation unit to quarantine the infected lab workers, Walker (Kyra Zagorsky) and Jordan (Jordan Hayes) each face the possibility that they have the deadly virus, too."
}, {
  "imdbId" : "2758950",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Single Strand",
  "description" : "The quarantine floor has been sealed off but now that the communication satellite dish has been destroyed, Dr. Alan Farragut worries about their future. In particular, there is only one week's food on that level. In the quarantine itself, Julia tries to calm those who think they've just been locked away to die. They find a way to get some attention. She also finds someone lurking in the corridors. Alan wants to use the universal vaccine the lab has developed on his brother who he thinks is on his last legs. Sarah works with one of the scientists who thinks she is ..."
}, {
  "imdbId" : "2758950",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "The White Room",
  "description" : "As Alan's (Billy Campbell) controversial cure leaves Peter (Neil Napier) clinging to life, the unchecked virus forces Jordan (Jordan Hayes) to make a devastating decision. Walker (Kyra Zagorsky) discovers the surprising truth about her new ally, while Daniel (Meegwun Fairbrother) squares off against Balleseros (Mark Ghanimé)."
}, {
  "imdbId" : "2758950",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Aniqatiga",
  "description" : "After Daniel (Meegwun Fairbrother) leaves Balleseros (Mark Ghanimé) to die, the mystery surrounding his connection to Hatake (Hiroyuki Sanada) is revealed. As he works to save Peter (Neil Napier), Alan (Billy Campbell) struggles with his feelings for both Walker (Kyra Zagorsky) and Jordan (Jordan Hayes)."
}, {
  "imdbId" : "2758950",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Survivor Zero",
  "description" : "As Ilaria CEO Constance Sutton arrives to collect the virus and its cure, Alan finds Walker (Kyra Zagorsky) seemingly symptom-free. Daniel (Meegwun Fairbrother) learns the truth about his \"adoption\" by Hatake (Hiroyuki Sanada)."
}, {
  "imdbId" : "2758950",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Bloodline",
  "description" : "Alan (Billy Campbell) risks his life to save his brother Peter from Ilaria CEO Constance Sutton (Jeri Ryan), only to see him re-captured by Vectors. Julia Walker (Kyra Zagorsky) deals with the mystery of her \"cure\" while her half-brother Daniel confronts their father, Dr. Hatake (Hiroyuki Sanada), about being abducted as a child."
}, {
  "imdbId" : "2758950",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "Level X",
  "description" : "The Vectors - 50 or so - seem to have disappeared and Alan learns there is another level below Level R - Level X, the virus vault. He and Julia set off to destroy the core virus samples in the vault but in order to do so, they will have to immobilize the Vectors - by lowering the temperature in the facility to match outside temperatures. On level X, they find something out of Julia's past. Hatake warns everyone that the war is not over and that Ilaria will not simply give up - they can now expect an army to come and take the virus. His relationship to Julia is ..."
}, {
  "imdbId" : "2758950",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "Fushigi",
  "description" : "Hatake finds surveillance video showing Victor Adrian with the Narvik vaccine and leaving the facility. He tells Alan that Adrian could not have survived the weather and must be dead. When Alan learns that there is an abandoned satellite station just 50 miles away, he and Julia set off to him and hopefully, the vaccine as well. What they are not prepared for is what they find in the facility's underground storage. Back at the lab, Sarah makes an important discovery and manages to record her findings before she loses consciousness. Daniel, Ballesteros and Anana flee ..."
}, {
  "imdbId" : "2758950",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "Black Rain",
  "description" : "With the injection of Julia's spinal fluid, Sarah's tumor seems to be shrinking. Julia, who finally tells Alan she didn't destroy the Narvik virus, may have found a way to destroy it after people are infected. Dr. Duchamp tells Peter that people are disappearing from the facility. It seems apparent that, after a two day hiatus, the Vectors have returned and are now setting traps for humans. Hatake sees a text message on Constance Sutton's phone telling her that she is to be picked up in 6 hours. He now expects a strike team of at least 100 mercenaries to arrive. His ..."
}, {
  "imdbId" : "2758950",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "The Reaping",
  "description" : "The uninfected are hiding in a secret bunker on the base as the CDC attempt to retrieve the canisters with the virus and the cure while the Ilaria assassins capture Hatake and force him to chose between which one of his children they will kill first."
}, {
  "imdbId" : "2758950",
  "season" : "1",
  "episodeNumber" : "13",
  "title" : "Dans L'Ombre",
  "description" : "Alan (Billy Campbell) and Peter capture the assassin Scythe and demand to know the whereabouts of Julia's (Kyra Zagorsky) mother. Balleseros confronts Hatake (Hiroyuki Sanada) about the missing Inuit children, while Anana and her brother learn of Daniel's fate. Concerns that the virus is in Ilaria's possession again forces Alan and the team off the base to search the world in order to retrieve it."
}, {
  "imdbId" : "2758950",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "San Jose",
  "description" : "Peter Farragut, Sarah Jordan and Dr. Kyle Sommer go to a mysterious island to investigate an unknown pathogen that killed everyone, except Leila, aboard the Mist of Avalon."
}, {
  "imdbId" : "2758950",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "Reunion",
  "description" : "A sick child appears while the team is investigating the island, but Sarah suspects something is amiss when the child is miraculously healed; Julia and Caleb make a discovery that furthers the mystery of the island when they dig up Alan's grave."
}, {
  "imdbId" : "2758950",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "Scion",
  "description" : "Peter and Jordan leave the safety of the Abbey to retrieve some specimens and discover just what's living in the woods, meanwhile Sister Amy plots to make them leave forever."
}, {
  "imdbId" : "2758950",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "Densho",
  "description" : "Michael struggles to keep the abbey under control as the CDC team move closer toward tracking the source of the pathogen; at the same time, Alan fights the urge to rejoin his former colleagues and comes to terms with the reality about Peter's allegiances. In the future, Walker takes a risk attempting to escape her delusional father."
}, {
  "imdbId" : "2758950",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "Oubliette",
  "description" : "Peter reveals his brother's secret and gets them both in trouble, meanwhile Kyle has his hands full trying to quarantine the orchard and the infected hive."
}, {
  "imdbId" : "2758950",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "M. Domestica",
  "description" : "The CDC team are forced to work together when another outbreak threatens to overwhelm the Abbey"
}, {
  "imdbId" : "2758950",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "Cross-Pollination",
  "description" : "Things go from bad to worse on the island. Elsewhere, Walker decides to go to St. Germain after learning about Brother Michael."
}, {
  "imdbId" : "2758950",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "Vade In Pace",
  "description" : "The Coast Guard arrives on the island to take the CDC team to another island to deal with another outbreak of the pathogen, meanwhile Sister Amy has to contend with Brother Michael and his plans."
}, {
  "imdbId" : "2758950",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "Ectogenesis",
  "description" : "Walker and Balleseros arrive at the Abbey while Alan, Kyle and Winger are out in the woods searching for the tree with red sap that might be a cure for the pathogen."
}, {
  "imdbId" : "2758950",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "Mother",
  "description" : "At the Abbey Sister Amy makes a bargain for immortality, while in the woods the race is on to find the Bleeding Tree now that Kyle is infected."
}, {
  "imdbId" : "2758950",
  "season" : "2",
  "episodeNumber" : "11",
  "title" : "Plan B",
  "description" : "Walker prepares to implant Jordan's baby into Amy while the Navy prepares to implement Plan B, a final solution to ensure the virus and all infected people never leave the island."
}, {
  "imdbId" : "2758950",
  "season" : "2",
  "episodeNumber" : "12",
  "title" : "The Ascendant",
  "description" : "While Kyle and Jordan try to escape the island as the followers hunt them, Walker and Alan search for the Mother Tree so that Walker can halt ILARIA's deadly plan."
}, {
  "imdbId" : "2758950",
  "season" : "2",
  "episodeNumber" : "13",
  "title" : "O Brave New World",
  "description" : "In the Season 2 finale, Alan's relationship with Walker reaches a bloody climax, while his sibling feud with Peter erupts in flames. Elsewhere, Kyle does his best to protect a possible cure for the mycosis."
}]