[{
  "imdbId" : "1358522",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Pilot",
  "description" : "With a few months left on his four-year sentence, criminal mastermind Neal Caffrey escapes from maximum security prison to save his relationship with his girlfriend. FBI Agent Peter Burke, the man who had chased him for years and had finally caught him, is called in to track him down. He easily finds Neal at his girlfriend's apartment, deflated and defeated. She has completely disappeared. Back in prison and with four years added to his sentence, Neal decides to make a deal with Agent Burke to help him in finding other master criminals. The deal is made and Neal is ..."
}, {
  "imdbId" : "1358522",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Threads",
  "description" : "It's Fashion Week, and while Neal is enjoying himself, Peter is less enthusiastic about the legion of beautiful women that has descended on Manhattan. Things get worse when one of those beautiful women is witness to a murder. Peter and Neal interview a model named Tara who watched as the notorious Israeli counterfeiter Ghovat killed one of his business associates. Peter thinks Ghovat is in town with something to sell, and fashion week gives him the perfect cover. But how to find this man they call \"The Ghost?\" Neal has an unorthodox suggestion: throw a party. Judging ..."
}, {
  "imdbId" : "1358522",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Book of Hours",
  "description" : "Mob baron Burrelli asks FBI's help to solve the theft of his parish church's Bible, from 17th century Naples, where it would have worked several miracles. Neal assumes it may be meant for healing, as it's very hard to fence, having contacted expert Fiametta, who points out it's actually a breviary, not a Bible. Neal and Peter soon find the vagrant who was hired to steal it but robbed himself, and suspect a link with the nearby murder of rivaling mob family member, which is alas assigned exclusive to a jealously rivaling FBI agent from organized crime."
}, {
  "imdbId" : "1358522",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Flip of the Coin",
  "description" : "Burke's wife brings a friend of hers to see him. She tells him her husband a soldier is being sought for smuggling gold into the country. Burke tells her that her husband should turn himself in which he does but claims to be innocent. But Burke says the evidence against him is irrefutable; his fingerprints and hair were found in the gold. The soldier claims that someone from the State Department tried to get him to bring the gold in but he refused. With Neal's help they deduce that the evidence against him may have been planted. And it takes them to a news reporter ..."
}, {
  "imdbId" : "1358522",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "The Portrait",
  "description" : "When a painting is stolen, Peter and Neal are tasked with finding it. They get a lead on the thief, they set a meeting but something goes wrong and the man disappears. They try to find him using info he uttered at the meeting. Later a curator from a museum in Europe claims that the painting was stolen from the museum years ago and when the painting is recovered, he expects it to be returned to him. Neal talks to the owner and learns that her family has a connection to the painting, which makes Neal wonder who the painting really belongs to."
}, {
  "imdbId" : "1358522",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "All In",
  "description" : "Peter is looking for an FBI agent who went under cover to get something on an Asian criminal who appears to have vanished. He sends Neal under the guise of being a high roller playing Pai Gow. While in the midst of the operation, there's a raid and Neal is aided by the hostess. When they're alone she disengages Neal's wire and reveals that she's an Interpol agent. She wants Neal to make sure the FBI doesn't interfere with an operation in exchange for information about Kate. When asked he doesn't tell Peter anything. But Peter checks her out and learns that the reason ..."
}, {
  "imdbId" : "1358522",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Free Fall",
  "description" : "Neal Caffrey has no alibi for the robbery from a Manhattan fashion house's safe of the world's largest pink diamond, which was replaced by a masked man resembling him with a synthetic one bearing his initials. Peter Burke has nothing to prevent Neal being jailed by a hostile agent from OPR, the FBI's internal affairs branch. Neal however escapes, helped only by Mozzie, 'hides' at the Burke home invited by Elisabeth and sets out to prove the only other logical suspect, Tumblane, faked his alibi and was hired by a third party."
}, {
  "imdbId" : "1358522",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Hard Sell",
  "description" : "Neal and Peter go undercover to take down a corrupt group of Wall Street brokers. If the mission fails, Neal's deal with the FBI could be negated."
}, {
  "imdbId" : "1358522",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "Bad Judgment",
  "description" : "Peter Burke accepts to help David Sullivan and other victims of a plot in which people are forced to take and pay off a second mortgage due to wrong foreclosures. Neil finds out those are all signed by federal judge Michelle Clark. Mozz helps him collect evidence from her chambers, but Fowler helps Clark turn the table on Burke who tried to trick her into bribing him. Neil must turn the tables on both the fiends."
}, {
  "imdbId" : "1358522",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "Vital Signs",
  "description" : "When June's granddaughter Samantha needs a donor organ, Peter and Neal stumble on the trail of illegal organ trade. Neal approaches Dr. Wayne Powell, the ringleader, posing as an 'approachable' doctor. That leaves only Peter to seduce his female cahoot. Finally an elaborate 'Indian' trap is set."
}, {
  "imdbId" : "1358522",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "Home Invasion",
  "description" : "A female thief escapes from the home of a murdered art collector, posing as a victim. Neal helps bothersome Burke, who invites himself to his luxury home while his apartment has state of the rat HiFi installed, identify and find her. They work out her latest robberies are after a historically priceless set of imperial Chinese jade elephants, a matter of diplomatic interest, but find setting a trap unusually hard."
}, {
  "imdbId" : "1358522",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "Bottlenecked",
  "description" : "An old rival of Neal's issues a challenge to re-create a rare bottle of wine owned by Ben Franklin."
}, {
  "imdbId" : "1358522",
  "season" : "1",
  "episodeNumber" : "13",
  "title" : "Front Man",
  "description" : "When the daughter of a man Neal once robbed, is kidnapped and the kidnapper is a man whom Neal worked with and betrayed, will only deal with Neal. So the FBI agent in charge of the kidnapping takes possession of Neal and sends him to meet with the man. When Peter talks to the father, he realizes that the man wants Neal but before he could warn him, he's grabbed. He wants Neal to help pull a job. Peter tries to find him. Neal gets word to Mozzie what he's been doing who tells Peter who figures out what the man is doing."
}, {
  "imdbId" : "1358522",
  "season" : "1",
  "episodeNumber" : "14",
  "title" : "Out of the Box",
  "description" : "Alex Hunter finally teams up with Neil to steal the music-box, which she located in the Italian consul's safe, doubtlessly obtained illegally. Pete smells a rat but is kept at a distance, as the plan requires entering a witness protection relocation to Canada, arranged by dirty agent Garrett Fowler. An explosion changes everything."
}, {
  "imdbId" : "1358522",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "Withdrawal",
  "description" : "Manhattan is the latest branch of a bank to receive the calling card of the Architect, a master robber who got away with three earlier, similarly bloodless hold-ups. Peter sort of clears himself and gets jailed Neal his ankle device parole back, but on a trial basis for both of them. Neal proves the security insufficient and works out the likely identity of the Architect, squeaky clean but bored and arrogant wall Street mogul Edward Walker. Catching him proves harder, his easily seduced secretary and an inside accomplice the keys. Meanwhile Mozzie helps Burke keep ..."
}, {
  "imdbId" : "1358522",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "Need to Know",
  "description" : "Neal goes undercover as a political \"fixer\" in order to bring down a corrupt politician."
}, {
  "imdbId" : "1358522",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "Copycat Caffrey",
  "description" : "FBI stumbles upon a new con-artist who is using Neal's styles to steal paintings from the museum."
}, {
  "imdbId" : "1358522",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "By the Book",
  "description" : "Mozzie fears that the object of his affection has been kidnapped, and turns to Neal and Peter for help. For the first time, Mozzie must put his faith in the FBI - and when the rescue mission takes an unexpected turn, he is forced to step out of the shadows and into the line of fire."
}, {
  "imdbId" : "1358522",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "Unfinished Business",
  "description" : "Neal finds himself working with Sara Ellis an insurance investigator who has it for him. He and Peter are helping her find out who has possession of Japanese bonds. They believe that man named Mr. Black who they believe is a courier whom the one is possession of the bonds wants to move them. So they come up with a plan for Neal to take his place. When he meets the contact he gives Neal a gun and brings him to the apartment of Ellis, whom he has to kill. When they fake her death, she along with Peter and Neal try to find out who wants her dead."
}, {
  "imdbId" : "1358522",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "In the Red",
  "description" : "The arrest of a jewel thief leads Peter and Neal toward a much more heinous extortion case against adoptive parents. To catch the heartless mastermind, Peter and Neal dive headfirst into the world of high-stakes gambling to force the criminal's hand."
}, {
  "imdbId" : "1358522",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "Prisoner's Dilemma",
  "description" : "An FBI Agent is accused of selling witness locations during criminal trials, and the U.S. Marshals ask Peter and Neal for help tracking down the suspect. But when Peter uncovers the truth behind the plot, he must dive into the world of exotic cars and go on the run with his fellow agent until he can prove the man's innocence."
}, {
  "imdbId" : "1358522",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "Company Man",
  "description" : "Wesley Kent's microchip firm's head researcher Joseph Hayes is murdered by poisonous overdose, presumably on account of his revolutionary invention. The duo goes undercover, but due to his major, Peter now gets the cushy alias of pampered rating agency accountancy expert. Neal joins the competitive junior executives in a cubicle, but gathers no less information there. After Mozzie discovers Peter has the music-box, he must accept to continue the Kate investigation officially, with a stuck-up FBI agent as equally unamused partner."
}, {
  "imdbId" : "1358522",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "Point Blank",
  "description" : "Realizing the music box is part of the treasures Alex Hunter robbed from single ship, Neal lets Mozzie fake an FBI file so Brooks will enlist his help to investigate just that. They realize the musical code requires an expert, Akihiro, but he's found murdered later. Neal is found out having arranged the music-box being stolen and donated to a Russian action, then refuses to accept being 'benched' when the trail leads to rogue FBO agent Garrett Fowler, whom he presumes Kate's murdered. His excessive risks pay off."
}, {
  "imdbId" : "1358522",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "Burke's Seven",
  "description" : "Mozzie was shot by a hit-man but surgery saved him. Neal agrees to go by the FBI book to see the hit-man, soon identified as Julian Larssen, and whoever hired him caught and punished. Larssen is suspiciously easily arrested after the forgers help burn his known aliases except one, but somehow managed to plant false evidence pointing to Burke as the killer. That suffices for Peter's suspension from the FBI, leaving only Neal's ways."
}, {
  "imdbId" : "1358522",
  "season" : "2",
  "episodeNumber" : "11",
  "title" : "Forging Bonds",
  "description" : "With the mastermind behind Kate's death uncovered, Peter and Neal explore their pasts to gain answers."
}, {
  "imdbId" : "1358522",
  "season" : "2",
  "episodeNumber" : "12",
  "title" : "What Happens in Burma",
  "description" : "The desperate UN ambassador to the UN called a favor from the FBI to help his estranged son, a human rights activist, who was arrested in Burma and faces an atrocious sentence for ruby theft. Neal, who grew up fatherless, convinces reluctant Peter to condone dodgy means against the Myanmar junta. After finding out the true master thief, Andrew Collins, Neal has an irresistible fake made by Mozzie as a trap for greedy Burmese ambassador Kyi, but it can only work if they find a way around the inviolability of his diplomatic pouch confided to his assistant Suu."
}, {
  "imdbId" : "1358522",
  "season" : "2",
  "episodeNumber" : "13",
  "title" : "Countermeasures",
  "description" : "An old friend of June's late husband, Ford, has returned after a stint in prison. Neal suspects the man is dangerous and fears for June."
}, {
  "imdbId" : "1358522",
  "season" : "2",
  "episodeNumber" : "14",
  "title" : "Payback",
  "description" : "When Peter is kidnapped by an old nemesis, Neal must race against time and defy the FBI to save him."
}, {
  "imdbId" : "1358522",
  "season" : "2",
  "episodeNumber" : "15",
  "title" : "Power Play",
  "description" : "Peter and Neal assume each other's identities to uncover a collusion scheme."
}, {
  "imdbId" : "1358522",
  "season" : "2",
  "episodeNumber" : "16",
  "title" : "Under the Radar",
  "description" : "Neal gets closer to finding out the truth about Kate's death."
}, {
  "imdbId" : "1358522",
  "season" : "3",
  "episodeNumber" : "1",
  "title" : "On Guard",
  "description" : "Despite successfully escaping after having robbed the Federal Reserve, a notorious thief returns to retrieve the stash he left behind. Peter and Neal must put their differences aside to capture the criminal before he disappears for good."
}, {
  "imdbId" : "1358522",
  "season" : "3",
  "episodeNumber" : "2",
  "title" : "Where There's a Will",
  "description" : "The Roland brothers Josh and James, not on speaking terms for years, inherit a fortune from their eccentric, astronomy-obsessed father, but in the form of an intricate treasure hunt. Time presses as their only offspring is kidnapped by the infamous Brett Gelles. Pressed for time, Neal takes charge of the clues while the FBI tracks down the hostage. Meanwhile Mozzie plans to sell off a Degas from the Nazi treasure, but Neal learns about a partially preserved manifesto rendering that too dangerous."
}, {
  "imdbId" : "1358522",
  "season" : "3",
  "episodeNumber" : "3",
  "title" : "Deadline",
  "description" : "When a magazine journalist's life is threatened, Diana goes undercover as her assistant to protect her while Peter and Neal investigate the subject of the journalist's story: a crooked pharmaceutical company."
}, {
  "imdbId" : "1358522",
  "season" : "3",
  "episodeNumber" : "4",
  "title" : "Dentist of Detroit",
  "description" : "When a mobster from Mozzie's Detroit childhood surfaces in Manhattan, Neal and Peter must help their friend rework a scam from his past to take down the ruthless gangster and prevent a mob war."
}, {
  "imdbId" : "1358522",
  "season" : "3",
  "episodeNumber" : "5",
  "title" : "Veiled Threat",
  "description" : "Peter and Neal are investigating a woman who's been married several to wealthy older men who died shortly after their weddings. They hope to get her by sending Neal into a bachelor auction hoping she'll get him. Peter goes with him and it's Peter whom she bids on. And when they learn that she has a partner, Peter has to keep seeing her which doesn't make Elizabeth happy."
}, {
  "imdbId" : "1358522",
  "season" : "3",
  "episodeNumber" : "6",
  "title" : "Scott Free",
  "description" : "A talented teenage con artist wreaks havoc in Manhattan, and Neal must decide if he should help him or take him down."
}, {
  "imdbId" : "1358522",
  "season" : "3",
  "episodeNumber" : "7",
  "title" : "Taking Account",
  "description" : "Neal's girlfriend Sara Ellis is among the victims of bank hacking. It's apparently as good as claimed by the legendary Vulture, Mozzie's virtual hero. Posing as him, Neal sets a trap, but their prime suspect is actually shot at by the real hacker, who proves elusive even once identified."
}, {
  "imdbId" : "1358522",
  "season" : "3",
  "episodeNumber" : "8",
  "title" : "As You Were",
  "description" : "Jones' classmate from the Naval Academy goes missing, prompting Peter and Neal to investigate an international private-security team, which could be linked to the disappearance."
}, {
  "imdbId" : "1358522",
  "season" : "3",
  "episodeNumber" : "9",
  "title" : "On the Fence",
  "description" : "Peter learns that Keller stole an Egyptian artifact and that he's trying to get into New York. Mozzie is anxious to unload the art but Neal wants him to wait. Peter asks Neal how Keller will get the artifact into New York, so he brings Peter to a fence he knows. Later the man turns up dead. When they learn of a person who handles artifacts Neal goes undercover."
}, {
  "imdbId" : "1358522",
  "season" : "3",
  "episodeNumber" : "10",
  "title" : "Countdown",
  "description" : "Neal and Mozzie must stay one step ahead of the the FBI while appearing to work with them in order to keep them from discovering that they possess the treasure."
}, {
  "imdbId" : "1358522",
  "season" : "3",
  "episodeNumber" : "11",
  "title" : "Checkmate",
  "description" : "Peter and Neal work together to save Elizabeth from Keller."
}, {
  "imdbId" : "1358522",
  "season" : "3",
  "episodeNumber" : "12",
  "title" : "Upper West Side Story",
  "description" : "When scholarship funds from a prestigious prep school mysteriously disappear, Neal poses as a substitute teacher to help Peter and the FBI figure out where the money is really going."
}, {
  "imdbId" : "1358522",
  "season" : "3",
  "episodeNumber" : "13",
  "title" : "Neighborhood Watch",
  "description" : "Peter brings home a scanner that can pick up sounds from far away. He goes to work and leaves it, Elizabeth is there when she hears a conversation it's picking up that the neighbors are having. That's when she hears them talking about a crime they're planning. She calls Peter and tells him about it. He and Neal go to check it out but nothing is happening. He attributes the whole thing to her recent abduction. She then calls Mozzie and the two of them check out the neighbors. They discover something but instead of telling Peter, she calls Neal and asks for his help. ..."
}, {
  "imdbId" : "1358522",
  "season" : "3",
  "episodeNumber" : "14",
  "title" : "Pulling Strings",
  "description" : "Peter takes the day in an attempt to give Elizabeth an extraordinary birthday complete with her parents. He leaves Diana in charge to find a missing Stradivarius with Sara and Neil all under the prying eyes of Agent Kramer."
}, {
  "imdbId" : "1358522",
  "season" : "3",
  "episodeNumber" : "15",
  "title" : "Stealing Home",
  "description" : "When a wealthy Yankees fan recruits Neal to help steal a prized piece of memorabilia, Neal is reminded of what life could be like again as a high-end thief."
}, {
  "imdbId" : "1358522",
  "season" : "3",
  "episodeNumber" : "16",
  "title" : "Judgment Day",
  "description" : "When Agent Kramer returns to derail Neal's commutation, Neal races to right a wrong from his past. Peter in turn must choose a side. Set against the backdrop of Neal's commutation hearing, Neal will ultimately decide between fight and flight."
}, {
  "imdbId" : "1358522",
  "season" : "4",
  "episodeNumber" : "1",
  "title" : "Wanted",
  "description" : "Peter must locate Neal on a tropical island before an FBI-sanctioned bounty hunter does."
}, {
  "imdbId" : "1358522",
  "season" : "4",
  "episodeNumber" : "2",
  "title" : "Most Wanted",
  "description" : "Peter must devise a plan to return Neal to New York and avoid Collins."
}, {
  "imdbId" : "1358522",
  "season" : "4",
  "episodeNumber" : "3",
  "title" : "Diminishing Returns",
  "description" : "Neal, Peter, and Mozzie track down a sly thief long sought by the FBI."
}, {
  "imdbId" : "1358522",
  "season" : "4",
  "episodeNumber" : "4",
  "title" : "Parting Shots",
  "description" : "When Neal and Peter go undercover to investigate a beautiful widow about to receive a huge life insurance payment, things become complicated when Neal begins to develop feelings for her."
}, {
  "imdbId" : "1358522",
  "season" : "4",
  "episodeNumber" : "5",
  "title" : "Honor Among Thieves",
  "description" : "Unbeknownst to Peter, Neal considers assisting a thief in stealing a valuable piece of art in exchange for information about his past."
}, {
  "imdbId" : "1358522",
  "season" : "4",
  "episodeNumber" : "6",
  "title" : "Identity Crisis",
  "description" : "Mozzie discovers clues to a treasure he is convinced were left by a spy ring."
}, {
  "imdbId" : "1358522",
  "season" : "4",
  "episodeNumber" : "7",
  "title" : "Compromising Positions",
  "description" : "A political fixer attempts to undermine the trial of a criminal Peter wants behind bars."
}, {
  "imdbId" : "1358522",
  "season" : "4",
  "episodeNumber" : "8",
  "title" : "Ancient History",
  "description" : "The team investigates a series of museum heists where ancient artifacts were the target."
}, {
  "imdbId" : "1358522",
  "season" : "4",
  "episodeNumber" : "9",
  "title" : "Gloves Off",
  "description" : "Neal has to resume his Wall Street alias to apply for a broker position in the investment firm of slick 'friend' Eric Dunham, who is suspected of systematic insider trading. That requires tipping him off and entering the inner circle, an after-hours boxing club, where only the winning fighters share in the valuable secrets. Peter insists to enter and win, but Neal is in no mood to help him after finding out Peter's suspicion scared off Sam Phelps, the undercover cop who promised Neal to tell what happened to his absent cop father."
}, {
  "imdbId" : "1358522",
  "season" : "4",
  "episodeNumber" : "10",
  "title" : "Vested Interest",
  "description" : "Despite their bitter row over Sam Phelps, Neal accepts to keep collaborating professionally with Peter, even appearing together as 'model team' agent-informer at agent Walt Furlong's international law enforcement convention. Together, they counter Ted Anderson's presumed evil plans at Dr. Drugov's presentation of a revolutionary new bullet proof vest. While Mozzie helps Neal contacting Sam again, Burke's men discover he stole that identity or as Neal presumes staged his death, but a killer is also on Phelp's trail."
}, {
  "imdbId" : "1358522",
  "season" : "4",
  "episodeNumber" : "11",
  "title" : "Family Business",
  "description" : "Neal, Peter, and Mozzie take down the Irish mob's whiskey counterfeiting ring, and Neal learns more about his father's past."
}, {
  "imdbId" : "1358522",
  "season" : "4",
  "episodeNumber" : "12",
  "title" : "Brass Tacks",
  "description" : "Neal and Peter investigate Senator Pratt's involvement with corrupt cops, which leads to a real estate developer running a kickback scheme."
}, {
  "imdbId" : "1358522",
  "season" : "4",
  "episodeNumber" : "13",
  "title" : "Empire City",
  "description" : "Neal and Peter investigate Mozzie's claims of taxi cab forgery and money laundering. Which leads to back to a jazz club owner."
}, {
  "imdbId" : "1358522",
  "season" : "4",
  "episodeNumber" : "14",
  "title" : "Shoot the Moon",
  "description" : "Peter and Elizabeth are kidnapped by a young couple on a romantic crime spree. Meanwhile Neal tries to plot where the couple will strike next."
}, {
  "imdbId" : "1358522",
  "season" : "4",
  "episodeNumber" : "15",
  "title" : "The Original",
  "description" : "Neal goes under cover as sculpture forger in order to help the FBI arrest an art forger. Also Neal and Mozzie narrow down the location of the evidence box."
}, {
  "imdbId" : "1358522",
  "season" : "4",
  "episodeNumber" : "16",
  "title" : "In the Wind",
  "description" : "The FBI begins searching the building for the evidence box. Peter, Diana, and Clinton try to stall the search. While Neal, Mozzie, Sara, and James try to get to the box first."
}, {
  "imdbId" : "1358522",
  "season" : "5",
  "episodeNumber" : "1",
  "title" : "At What Price",
  "description" : "With Peter in prison facing murder charges and every shred of evidence pointing to him for Senator Pratt's untimely death, Neal must strike a deal with the devil to help try and clear Peter's name."
}, {
  "imdbId" : "1358522",
  "season" : "5",
  "episodeNumber" : "2",
  "title" : "Out of the Frying Pan",
  "description" : "Peter assigns Neal a new handler to investigate an online black market, but Neal's loyalties will be tested when he discovers the trail might lead to Mozzie."
}, {
  "imdbId" : "1358522",
  "season" : "5",
  "episodeNumber" : "3",
  "title" : "One Last Stakeout",
  "description" : "Neal is blackmailed to steal a chapter from a valuable book for Hagen. With his new partner at the FBI watching his every move, Neal and Mozzie devise a diversionary heist to set up their enemy and get the book."
}, {
  "imdbId" : "1358522",
  "season" : "5",
  "episodeNumber" : "4",
  "title" : "Controlling Interest",
  "description" : "Peter send Neal undercover with a psychiatrist who may be manipulating her patients into committing robberies."
}, {
  "imdbId" : "1358522",
  "season" : "5",
  "episodeNumber" : "5",
  "title" : "Master Plan",
  "description" : "Neal must go undercover as a butler to expose an imposter who aims to inherit a Manhattan family's fortune."
}, {
  "imdbId" : "1358522",
  "season" : "5",
  "episodeNumber" : "6",
  "title" : "Ice Breaker",
  "description" : "Neal and Peter look for a U.S. passport forger from Russia."
}, {
  "imdbId" : "1358522",
  "season" : "5",
  "episodeNumber" : "7",
  "title" : "Quantico Closure",
  "description" : "While Neal delves further into the mystery of the Codex, Peter takes on a classified espionage case with a fellow FBI agent: his ex-girlfriend."
}, {
  "imdbId" : "1358522",
  "season" : "5",
  "episodeNumber" : "8",
  "title" : "Digging Deeper",
  "description" : "Neal and Peter take on an unprecedented asset recovery case for the Museum of Natural History: a stolen Tyrannosaurus Rex skeleton and its egg."
}, {
  "imdbId" : "1358522",
  "season" : "5",
  "episodeNumber" : "9",
  "title" : "No Good Deed",
  "description" : "Peter's thrown back into an unsolved larceny case that has Neal worried - because Neal's the one who committed the crime."
}, {
  "imdbId" : "1358522",
  "season" : "5",
  "episodeNumber" : "10",
  "title" : "Live Feed",
  "description" : "FBI catches Hagen for a forgery. Hagen takes Agent Burke along with him to reveal his relations with Neal where suddenly Hagen gets shot by someone who is believed to be the same person who shot Siegel."
}, {
  "imdbId" : "1358522",
  "season" : "5",
  "episodeNumber" : "11",
  "title" : "Shot Through the Heart",
  "description" : "When Neal and Peter go after an assassin, the stakes are raised even higher when they realize this may be the same person who has been pulling Neal's strings."
}, {
  "imdbId" : "1358522",
  "season" : "5",
  "episodeNumber" : "12",
  "title" : "Taking Stock",
  "description" : "When a corporate espionage case has personal ties to Neal, Peter recruits Diana from maternity leave for an undercover sting on a rogue stock trader."
}, {
  "imdbId" : "1358522",
  "season" : "5",
  "episodeNumber" : "13",
  "title" : "Diamond Exchange",
  "description" : "Neal and Peter race against a criminal mastermind to unearth an invaluable treasure hidden in New York."
}, {
  "imdbId" : "1358522",
  "season" : "6",
  "episodeNumber" : "1",
  "title" : "Borrowed Time",
  "description" : "Neal hatches a final last \"Big\" score and will ask eventually (surprise) Peter to become involved. To keep up appearances Neal solves F.B.I cases as usual while plotting the caper."
}, {
  "imdbId" : "1358522",
  "season" : "6",
  "episodeNumber" : "2",
  "title" : "Return to Sender",
  "description" : "In order to cement his trust with the Pink Panthers, Neal must align with a dangerous enemy from his past and obtain an extremely valuable artifact. Peter finds it difficult to keep their secret from Neal and Mozzie."
}, {
  "imdbId" : "1358522",
  "season" : "6",
  "episodeNumber" : "3",
  "title" : "Uncontrolled Variables",
  "description" : "Neal feels conflicted about scamming an innocent mark while running a con for the Pink Panthers. Meanwhile, Peter is working with a reckless Interpol agent who could put their entire operation in jeopardy."
}, {
  "imdbId" : "1358522",
  "season" : "6",
  "episodeNumber" : "4",
  "title" : "All's Fair",
  "description" : "With the Pink Panthers having gone silent, Peter and Neal focus on a case dealing with someone from Mozzie's past, who's returned to tie up loose ends and pull another con, this one at Mozzie's expense."
}, {
  "imdbId" : "1358522",
  "season" : "6",
  "episodeNumber" : "5",
  "title" : "Whack-A-Mole",
  "description" : "With a mole in the panthers now, Woodford has to find who it is while Neal and FBI have to figure out how they will bring the panthers down in their next heist."
}, {
  "imdbId" : "1358522",
  "season" : "6",
  "episodeNumber" : "6",
  "title" : "Au Revoir",
  "description" : "Neal will need a little helping hand with his latest heist, and the FBI agent will take part in the dangerous con during \"Au Revoir.\""
}]