[{
  "imdbId" : "10738752",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Breaking Ground",
  "description" : "In an era of exclusion and U.S. empire, new immigrants arrive from China, India, Japan, the Philippines and beyond. Barred by anti-Asian laws they become America’s first 'undocumented immigrants', yet they build railroads, dazzle on the silver screen, and take their fight for equality to the U.S. Supreme Court."
}, {
  "imdbId" : "10738752",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "A Question of Loyalty",
  "description" : "An American-born generation straddles their country of birth and their parents’ homelands in Japan and Korea. Those loyalties are tested during World War II, when families are imprisoned in detention camps, and brothers find themselves on opposite sides of the battle lines."
}, {
  "imdbId" : "10738752",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Good Americans",
  "description" : "During the Cold War years, Asian Americans are simultaneously heralded as a Model Minority, and targeted as the perpetual foreigner. It is also a time of bold ambition, as Asian Americans aspire for the first time to national political office and a coming culture-quake simmers beneath the surface."
}, {
  "imdbId" : "10738752",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Generation Rising",
  "description" : "During a time of war and social tumult, a young generation fights for equality in the fields, on campuses and in the culture, and claim a new identity: Asian Americans. The war’s aftermath brings new immigrants and refugees who expand the population and the definition of Asian America."
}, {
  "imdbId" : "10738752",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Breaking Through",
  "description" : "At the turn of the new millennium, the national conversation turns to immigration, race, and economic disparity.  As the U.S becomes more diverse, yet more divided, a new generation of Asian Americans tackle the question, how do we as a nation move forward together?"
}]
