[{
  "imdbId" : "0995832",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Get Some",
  "description" : "Meet the battle hungry USMC 1st Recon Battalion as they deal with the mundane issues of grooming standards, sand storms, a by the book CO and ... waiting. But a variety of creative racial, gay and gender slurs, pizza relieve the tension."
}, {
  "imdbId" : "0995832",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "The Cradle of Civilization",
  "description" : "Under orders to consider any Iraqi carrying a weapon hostile, Bravo busts north towards Nasiriyah. Chomping at the bit while others are carrying the fight, the platoon finally gets 'lit up' in a violent but successful skirmish in Al Gharraf."
}, {
  "imdbId" : "0995832",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Screwby",
  "description" : "Having survived its first trial by fire, Bravo presses forward, awaiting orders for a new recon mission. Scoping out a roadside hamlet, the company watches in horror and disbelief as a regimental combat team arrives with guns firing."
}, {
  "imdbId" : "0995832",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Combat Jack",
  "description" : "Having raced to capture the airfield, First Recon is now miles ahead of the rest of the American force and has some time to rest and regroup. The abandoned supply truck has been looted and destroyed and the company is now down to one meal a day."
}, {
  "imdbId" : "0995832",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "A Burning Dog",
  "description" : "As they scope a tiny hamlet, the men of Bravo are frustrated by the capricious nature of the war, and Colbert struggles to defend the actions of the higher-ups. Meanwhile, First Recon runs into a number of surprises as they try to cross a bridge."
}, {
  "imdbId" : "0995832",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Stay Frosty",
  "description" : "Outside of Al Kut, Captain America is over-eager in his attempts to subdue a prisoner, while his men's growing disillusionment with his command is growing more apparent."
}, {
  "imdbId" : "0995832",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Bomb in the Garden",
  "description" : "Bravo reaches Baghdad, where the men are shocked by the sheer size and scope of the city. As their time there comes to an end, the Marines take inventory and reflect--even as tensions boil over and disaster strikes."
}]