[{
  "imdbId" : "0348913",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Pilot",
  "description" : "Georgia 'George' Lass is an emotionally lost, 18-year-old slacker whose life changes (or ends) when she is killed by a toilet seat that falls from the sky after being separated from the orbiting Mir space station which hurtles to Earth. Immediately, she discovers that the afterlife does indeed exist, where she has been assigned a job as a 'Grim Reaper.' It's her job to reap the souls from the living and guide them to their eternal reward. Besides coping with her new job, she must learn to deal with being young and starting out and of course, being dead..."
}, {
  "imdbId" : "0348913",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Dead Girl Walking",
  "description" : "George is still dealing with her transition, sneaking home at night, shirking her reaping duties and meeting Brendan's parents. Reggie is also having some difficulty, and starts lying and stealing toilet seats. Mason comes up with a new scheme to gather money, and Roxy is not very appreciative. Betty gets stuck chaperoning George. Eventually, George learns just how important being a reaper is."
}, {
  "imdbId" : "0348913",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Curious George",
  "description" : "A caged bear mutilates some protesters, and makes an appearance later as well. George keeps going home, and this time finds all of her old stuff boxed up. Betty continues chaperoning George. Plus, George is stuck answering phones at Happy Time while everyone else has cake. Mason has some problems reaping, but eventually gets some money."
}, {
  "imdbId" : "0348913",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Reapercussions",
  "description" : "When one of Roxy's reaps doesn't show up, George gets the idea to \"help\" fate along, with very dire consequences. Mason tries smuggling drugs, and Rube gets stressed at the airport. George catches Crystal messing with some workstations, and get into a little office war."
}, {
  "imdbId" : "0348913",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Reaping Havoc",
  "description" : "George goes looking for a friend, and gets into a scrapping with Delores. We also get to see how Betty died and became a reaper. Betty, Rube, and George go to a family reunion for a reap. Mason, meanwhile, spends some quality time with the recently dead owner of a house. And, George gets her first paycheck."
}, {
  "imdbId" : "0348913",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "My Room",
  "description" : "Daisy Adair shows up to replace Betty, and promptly moves into George's apartment. George tries her hand at bowling, and Joy discovers Reggie's toilet tree. Rube talks to Joy while waiting for his reap. Mason reaps the new guy in the Happy Time office. George starts to live a little as her own person, rather than just trying to avoid everything."
}, {
  "imdbId" : "0348913",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Reaper Madness",
  "description" : "George finds herself in a strange and potentially romantic relationship with a man who can see gravelings."
}, {
  "imdbId" : "0348913",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "A Cook",
  "description" : "George gets a pet and Rube takes a shift on the grill at Der Waffle Haus."
}, {
  "imdbId" : "0348913",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "Sunday Mornings",
  "description" : "George makes a new friend and discovers her dad is not the person she thought he was."
}, {
  "imdbId" : "0348913",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "Business Unfinished",
  "description" : "George is saddled with a tedious collating task and Daisy recruits her and Mason to make money from her reap. Roxy grieves her own death."
}, {
  "imdbId" : "0348913",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "The Bicycle Thief",
  "description" : "George is changing jobs to be able to buy a bike. Daisy takes a painting when she reaps an artist, but he doesn't want to move on while she has it. Mason spends time with a gay couple he is supposed to reap."
}, {
  "imdbId" : "0348913",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "Nighthawks",
  "description" : "George has insomnia and goes to the diner where she finds Rube proctoring the other Reapers doing self-evaluation tests. She discovers that Rube has a reap scheduled in George's family's driveway, causing anxiety for George."
}, {
  "imdbId" : "0348913",
  "season" : "1",
  "episodeNumber" : "13",
  "title" : "Vacation",
  "description" : "The Gravelings have the day off so the reaping is replaced with paperwork for Rube and the Reapers. George convinces Rube to computerize the data at Happy Time. George's family takes their first vacation since George's death."
}, {
  "imdbId" : "0348913",
  "season" : "1",
  "episodeNumber" : "14",
  "title" : "Rest in Peace",
  "description" : "George takes Delores and her cat to the vet, where they encounter a young pet Reaper. Rube reaps a yoga instructor, and George's family prepares for a ceremony dedicating her gravestone."
}, {
  "imdbId" : "0348913",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "Send in the Clown",
  "description" : "George falls for the cute guy she's assigned to train at Happy Time, much to Delores' chagrin. Mason's reap at a children's birthday party turns out to be his worst experience ever."
}, {
  "imdbId" : "0348913",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "The Ledger",
  "description" : "George's bike is stolen, her parents are selling the family house, Daisy's cross necklace spurs her interest in religion, and Mason tries to hustle some additional money."
}, {
  "imdbId" : "0348913",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "Ghost Story",
  "description" : "George goes on a Happy Time retreat and struggles to let down her defenses. George's family continues to try to sell their house. Mason loses the note with his intended reap and Daisy helps him correct his mistake."
}, {
  "imdbId" : "0348913",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "The Shallow End",
  "description" : "George experiments with being a mean girl at work, while Mason has a reap who wants to attend his own funeral. Daisy takes her reap to church, and Reggie goes clothes shopping."
}, {
  "imdbId" : "0348913",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "Hurry",
  "description" : "George must deal with an efficiency expert at Happy Time. Rube hangs out at the Post Office all day, Daisy does some speed dating, Roxy works the airport and Mason chases after a bike messenger that owes him money. Meanwhile, Joy and Clancy work on finishing their divorce while making Reggie join the band."
}, {
  "imdbId" : "0348913",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "In Escrow",
  "description" : "Delores makes Millie select the new temp assignment. Joy and Reggie meet the mysterious Angelo. Reggie is left home alone when her babysitter bails and Rube's gang does a group reap."
}, {
  "imdbId" : "0348913",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "Rites of Passage",
  "description" : "The other reapers are jealous when George draws a VIPR - Very Important Person Reap. Daisy restores a cynical priest's faith and Reggie visits the scene of her sister's death."
}, {
  "imdbId" : "0348913",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "The Escape Artist",
  "description" : "Mason and Roxy fly the friendly skies on T&A Airlines. Rube teaches grade school. George phones home and Joy resists buying in to her mom's philosophy."
}, {
  "imdbId" : "0348913",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "Be Still My Heart",
  "description" : "George goes looking for Trip at his father's funeral, with major consequences; Daisy is traumatized by her reap, a murder; Mason is the sensible one (seriously), while Rube places Roxy in temporary charge as he goes searching for something. Clancy has Reggie stay over. Many, many loose ends are left..."
}, {
  "imdbId" : "0348913",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "Death Defying",
  "description" : "George is in a foul mood, after Trip. Daisy makes a new friend which makes Mason jealous. Rube leaves, looking for a mysterious woman from his past."
}, {
  "imdbId" : "0348913",
  "season" : "2",
  "episodeNumber" : "11",
  "title" : "Ashes to Ashes",
  "description" : "George tries to pass herself off as the relative of a homeless man, while Daisy performs as a temptress on Ray's reality show - much to Mason's disgust. Reggie, meanwhile, tries Goth on for size."
}, {
  "imdbId" : "0348913",
  "season" : "2",
  "episodeNumber" : "12",
  "title" : "Forget Me Not",
  "description" : "Ray and Mason fight for Daisy's affection, and their game turns into something worse when Daisy wants to break up with Ray. In a hospital, George must convince an elderly woman of her death. Joy is looking for a job at Happy Time, where she finds out more information about the time George worked there. Rube seeks help from Penny, a another reaper, to find his daughter."
}, {
  "imdbId" : "0348913",
  "season" : "2",
  "episodeNumber" : "13",
  "title" : "Last Call",
  "description" : "Mason and Daisy try to keep Ray's death a secret. Mason receives a purple post-it, possibly his final reap before moving on. Roxy investigates Ray's disappearance, questioning Daisy. George attends another going-away party at Happy Time. Reggie accidentally lets J.D. out, and searches for the dog."
}, {
  "imdbId" : "0348913",
  "season" : "2",
  "episodeNumber" : "14",
  "title" : "Always",
  "description" : "George finds out that her mother was in Happy Time looking for her file. Rube goes to see his daughter after receiving upsetting news from Penny. Ray continues to cause problems even after his death and Mason runs into a bit of trouble with Kiffany."
}, {
  "imdbId" : "0348913",
  "season" : "2",
  "episodeNumber" : "15",
  "title" : "Haunted",
  "description" : "It's Halloween and reaper legend has it that the reapers can be seen as they were when alive; a serial killer stalks a neighbourhood, the reapers collecting his victims as he goes, George getting the bad guy; Joy and Reggie pay a late night visit to George's grave. So does George."
}]