[{
  "imdbId" : "6821044",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "1995",
  "description" : "Roger Ailes joins forces with media magnate Rupert Murdoch to form Fox News Channel. Working feverishly to get ahead of the competition, Roger must do the unthinkable - put an entire network on the air in the space of six months."
}, {
  "imdbId" : "6821044",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "2001",
  "description" : "Fox News Channel is on the cusp of passing CNN to become the #1 rated news network. Then 9/11 changes everything. Roger begins pushing the news with an agenda, and finally puts Fox on top of the ratings race."
}, {
  "imdbId" : "6821044",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "2008",
  "description" : "With the election of \"Barack Hussein Obama,\" Roger and Fox News Channel have found the ultimate enemy-one that will drive Fox's coverage as well as cement ratings at #1. What no one suspects are the hidden depths of Roger's secret world."
}, {
  "imdbId" : "6821044",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "2009",
  "description" : "Roger finds his legacy in Joe Lindsley, a 25-year-old acolyte he hires as editor of a newspaper he bought in upstate New York. Turning this paper into a conservative news source, Roger achieves his revenge against the Obama White House."
}, {
  "imdbId" : "6821044",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "2012",
  "description" : "Fox News Channel is now the dominant news outlet and Roger is working the levers of his power. But he doesn't see the danger posed by Gretchen Carlson. After years of harassment by Roger, she's finally had enough."
}, {
  "imdbId" : "6821044",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "2015",
  "description" : "Gretchen Carlson secretly tapes Roger's harassment for over a year and works with a lawyer specializing in sexual harassment. Roger goes all in to achieve his goal of electing a president, and finds the perfect candidate in Donald Trump."
}, {
  "imdbId" : "6821044",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "2016",
  "description" : "Once Gretchen Carlson's lawsuit becomes public, Roger moves into crisis mode, doing everything he can to save his career and legacy. But even as he loses everything, his greatest achievement eclipses him-Donald Trump wins the presidency."
}]