[{
  "imdbId" : "0086759",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Brother's Keeper",
  "description" : "Miami detective Sonny Crockett reluctantly teams with New York cop Rico Tubbs when both of them end up pursuing a drug dealer who killed their partners."
}, {
  "imdbId" : "0086759",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Heart of Darkness",
  "description" : "Investigating a porn baron, Crockett and Tubbs become involved with an undercover FBI agent who may have gone native and become a criminal, and may have murdered an underage porn starlet. Meanwhile, Zito and Switek pose as fences, and Elvis the crocodile feels unloved!"
}, {
  "imdbId" : "0086759",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Cool Runnin'",
  "description" : "Crockett and Tubbs must enlist the help of an unreliable petty thief to bust a drug operation run by a trio of homicidal Jamaicans."
}, {
  "imdbId" : "0086759",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Calderone's Return: Part 1 - The Hit List",
  "description" : "The team moves to protect Crockett and his family from an assassin, hired by Calderone to re-empty the void he left behind."
}, {
  "imdbId" : "0086759",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Calderone's Return: Part 2 - Calderone's Demise",
  "description" : "While on the trail of Calderone in Bimini, Tubbs falls in love with a woman who forces him to consider his loyalties."
}, {
  "imdbId" : "0086759",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "One Eyed Jack",
  "description" : "Crockett attempts to help an old flame free herself from a racketeer, then is framed for taking bribes. Martin Castillo becomes the squad's new lieutenant."
}, {
  "imdbId" : "0086759",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "No Exit",
  "description" : "Crockett and Tubbs reluctantly help government agents in their pursuit of a dangerous arms dealer."
}, {
  "imdbId" : "0086759",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "The Great McCarthy",
  "description" : "Crockett and Tubbs get involved in the world of offshore power boat racing and drug smuggling."
}, {
  "imdbId" : "0086759",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "Glades",
  "description" : "Crockett & Tubbs have to recover a witness in a major drug dealer's trial, who has ran off to the Everglades and must testify in 48 hours."
}, {
  "imdbId" : "0086759",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "Give a Little, Take a Little",
  "description" : "In court, Crockett refuses to identify an informant and spends more time in jail than the drug dealer he is trying to bust. Gina and Trudy infiltrate a prostitution ring. Gina is placed in a compromising position when they are suspicious that she is not a hooker."
}, {
  "imdbId" : "0086759",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "Little Prince",
  "description" : "Crockett thinks that a wealthy industrialist's son nailed in a heroin bust could lead them to bigger connections in the supply network."
}, {
  "imdbId" : "0086759",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "Milk Run",
  "description" : "Crockett and Tubbs encounter two naive young men smuggling cocaine-filled statues for a murderous criminal."
}, {
  "imdbId" : "0086759",
  "season" : "1",
  "episodeNumber" : "13",
  "title" : "Golden Triangle: Part 1",
  "description" : "Crockett and Tubbs work undercover in a hotel. They uncover criminals that are an old enemies of Lt. Castillo and have also kidnapped Castillo's long-lost wife."
}, {
  "imdbId" : "0086759",
  "season" : "1",
  "episodeNumber" : "14",
  "title" : "Golden Triangle: Part 2",
  "description" : "Lt. Castillo must bring down his old enemy, who has passed his organization to his grandsons. They have kidnapped Castillo's long-lost wife to ensure their escape from prosecution."
}, {
  "imdbId" : "0086759",
  "season" : "1",
  "episodeNumber" : "15",
  "title" : "Smuggler's Blues",
  "description" : "Someone in law enforcement is murdering drug dealers and their families in cold blood. To find the culprit, Crockett and Tubbs go undercover and travel to Colombia with a laid-back pilot to pose as dealers."
}, {
  "imdbId" : "0086759",
  "season" : "1",
  "episodeNumber" : "16",
  "title" : "Rites of Passage",
  "description" : "Sparks fly between Tubbs and an old flame who has come to Miami to rescue her sister from a life of prostitution."
}, {
  "imdbId" : "0086759",
  "season" : "1",
  "episodeNumber" : "17",
  "title" : "The Maze",
  "description" : "A group of young punks kill a cop and then take hostages - including an undercover Tubbs - while negotiators try to end the situation without more bloodshed and a SWAT team closes in."
}, {
  "imdbId" : "0086759",
  "season" : "1",
  "episodeNumber" : "18",
  "title" : "Made for Each Other",
  "description" : "Switek and Zito use two of their favorite informants to set up a transaction with a stolen goods dealer."
}, {
  "imdbId" : "0086759",
  "season" : "1",
  "episodeNumber" : "19",
  "title" : "The Home Invaders",
  "description" : "The squad is assigned to assist Robbery with a string of brutal home invasions. Castillo is concerned the officer in charge - who was Crockett's mentor - is mishandling the investigation and the two clash, leaving Crockett torn between loyalty and a resolved case."
}, {
  "imdbId" : "0086759",
  "season" : "1",
  "episodeNumber" : "20",
  "title" : "Nobody Lives Forever",
  "description" : "A passionate romance distracts Crockett to the point that it nearly derails the pursuit of three thugs on a rampage."
}, {
  "imdbId" : "0086759",
  "season" : "1",
  "episodeNumber" : "21",
  "title" : "Evan",
  "description" : "Crockett and Tubbs join forces with the Federal Bureau of Alcohol, Tobacco and Firearms ... including Crockett's old partner Evan Freed. Tubbs tries to understand their troubled relationship."
}, {
  "imdbId" : "0086759",
  "season" : "1",
  "episodeNumber" : "22",
  "title" : "Lombard",
  "description" : "Crockett and Tubbs must protect a reluctant witness from his prior employers -- the Mafia family that wants to silence him."
}, {
  "imdbId" : "0086759",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "The Prodigal Son",
  "description" : "Crockett and Tubbs travel to New York to take down a powerful Colombian cartel."
}, {
  "imdbId" : "0086759",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "Whatever Works",
  "description" : "The murder of two beat cops outside their jurisdiction immerses the team in the Santeria religion, while Crockett tries to recover his repossessed Ferrari."
}, {
  "imdbId" : "0086759",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "Out Where the Buses Don't Run",
  "description" : "Crockett and Tubbs stake out a drug dealer, an investigation that is being helped along by an ex-cop that seems to know a bit too much about the case."
}, {
  "imdbId" : "0086759",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "The Dutch Oven",
  "description" : "Trudy's old boyfriend has ties to a drug lord and enlists Crockett's help investigating him."
}, {
  "imdbId" : "0086759",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "Buddies",
  "description" : "The team is investigating the murder of a comic who works at a club owned by two criminals. And a young single mother is being sought by the police cause they think she killed him and his employers for some reason are also looking for her. While conducting surveillance, they discover a man who went to see them is a friend of Crockett's. When Crockett and Tubbs goes to see him, he claims that they loaned him money to help with his business. While Crockett believes him, Tubbs thinks he's holding something back. Tubbs later does a background check on him and discovers ..."
}, {
  "imdbId" : "0086759",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "Junk Love",
  "description" : "When Crockett & Tubbs bust the owner of a bordello (Miles Davis), they discover that one of his drug-addicted prostitutes is the object of a powerful drug dealer's obsession."
}, {
  "imdbId" : "0086759",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "Tale of the Goat",
  "description" : "Crockett and Tubbs escort a coffin containing a criminal to his final Miami resting place ... until its learned that he has risen from the dead and has a similar zombie fate scheduled for Tubbs."
}, {
  "imdbId" : "0086759",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "Bushido",
  "description" : "Castillo is forced to choose between friendship and duty when Jack Gretsky, his best friend from his days in Vietnam with the CIA, reemerges from the criminal underground complete with a Russian wife who is being pursued by the KGB."
}, {
  "imdbId" : "0086759",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "Bought and Paid For",
  "description" : "Gina's cleaning woman was raped in her home. Investigation leads to the spoiled son of a wealthy man, who thinks he's above the law. And despite evidence being circumstantial, Gina wants to have the man arrested."
}, {
  "imdbId" : "0086759",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "Back in the World",
  "description" : "Crockett flashes to his role during the Saigon evacuation as he and a war correspondent uncover heroin smuggled in body bags. Ten years later in Miami the H resurfaces and so does the reporter looking for the CIA connection."
}, {
  "imdbId" : "0086759",
  "season" : "2",
  "episodeNumber" : "11",
  "title" : "Phil the Shill",
  "description" : "A British television personality who has dealings with a major cocaine dealer is targeted by Crockett and Tubbs."
}, {
  "imdbId" : "0086759",
  "season" : "2",
  "episodeNumber" : "12",
  "title" : "Definitely Miami",
  "description" : "Crockett finds out first hand about Charlie Basset as a violent drug runner with an enticing wife that Sonny just can't get out of his mind."
}, {
  "imdbId" : "0086759",
  "season" : "2",
  "episodeNumber" : "13",
  "title" : "Yankee Dollar",
  "description" : "When Crockett sees his stewardess girlfriend die from smuggling balloons of cocaine into the country, he and Tubbs go undercover to expose the ring."
}, {
  "imdbId" : "0086759",
  "season" : "2",
  "episodeNumber" : "14",
  "title" : "One Way Ticket",
  "description" : "When the State Attorney's killed, Crockett investigates. And brings him in contact with the man's friend an attorney whom Crockett hates. They learn that a Canadian, the S.A. was investigating could be the man who ordered it. Later Crockett gets an anonymous call telling him that the Canadian and a man who was arrested on a minor charge, whom the lawyer got off, are indeed responsible for the S.A.'s death."
}, {
  "imdbId" : "0086759",
  "season" : "2",
  "episodeNumber" : "15",
  "title" : "Little Miss Dangerous",
  "description" : "Crocket and Tubbs visit Miami's kinky Sex World parlor when a sailor shows up murdered. The trail leads to a mysterious underage dancer Tubbs tries to straighten out - but is this more than social work?"
}, {
  "imdbId" : "0086759",
  "season" : "2",
  "episodeNumber" : "16",
  "title" : "Florence Italy",
  "description" : "Set around the Miami Grand Prix, the episode starts out with a young 17 year old hooker called \"Florence Italy\", being picked up by one of the racers in the Grand Prix, he then races around Miami attracting the attention of Crockett and Tubbs, a chase ensues where the Porsche 906 Carrera eventually escapes Crockett and Tubbs because the young hooker had been thrown out of the passenger seat at speed and killed. The Vice cops follow up on the car and find it belongs to a Danny Tepper, Crockett and Tubbs track down Danny and question him, they feel he is telling the ..."
}, {
  "imdbId" : "0086759",
  "season" : "2",
  "episodeNumber" : "17",
  "title" : "French Twist",
  "description" : "When a known terrorist comes to Miami the team tries to find him. And an Interpol operative comes to assist them. Crockett is taken with her but Tubbs thinks there's something odd about her."
}, {
  "imdbId" : "0086759",
  "season" : "2",
  "episodeNumber" : "18",
  "title" : "The Fix",
  "description" : "After Crockett and Tubbs arrests a dealer and at the bail hearing the judge sets a low bail. Crockett is curious if there's something wrong with him. So he investigates. It seems the man has a gambling problem. And now he's being told to tell his son whose the star player of his school to throw a game to settle his debts."
}, {
  "imdbId" : "0086759",
  "season" : "2",
  "episodeNumber" : "19",
  "title" : "Payback",
  "description" : "Crockett goes undercover to take down Mario Fuente (Zappa), a dealer of 'weasel dust'."
}, {
  "imdbId" : "0086759",
  "season" : "2",
  "episodeNumber" : "20",
  "title" : "Free Verse",
  "description" : "The team is assigned to protect a renowned poet who has come to the US seeking political asylum. With sexy Carmen in the mix, things get complicated."
}, {
  "imdbId" : "0086759",
  "season" : "2",
  "episodeNumber" : "21",
  "title" : "Trust Fund Pirates",
  "description" : "A Bolivian cruise ship is attacked by pirates leading Crockett and Tubbs to enlist the help of a renegade pilot in the contraband business to solve the case."
}, {
  "imdbId" : "0086759",
  "season" : "2",
  "episodeNumber" : "22",
  "title" : "Sons and Lovers",
  "description" : "The son of Tubbs' arch-enemy Calderone oozes to the surface with a $1 million contract on Tubbs, while Calderone's sister Angelina says Tubbs he is the father of her child."
}, {
  "imdbId" : "0086759",
  "season" : "3",
  "episodeNumber" : "1",
  "title" : "When Irish Eyes Are Crying",
  "description" : "Gina falls for an Irish pacifist who believes there is no point fighting fire with fire anymore - or so she thinks."
}, {
  "imdbId" : "0086759",
  "season" : "3",
  "episodeNumber" : "2",
  "title" : "Stone's War",
  "description" : "When Ira Stone films a video of American forces on illegal operations in South America, Crockett must protect him from their old nemesis Maynard, who will stop at nothing to silence Stone."
}, {
  "imdbId" : "0086759",
  "season" : "3",
  "episodeNumber" : "3",
  "title" : "Killshot",
  "description" : "Crockett and Tubbs are working with Customs Agent Frank Arriola to get a criminal, whom Frank once arrested but walked because of a technicality. Frank's brother Tico a Jai Alai player goes to a brothel and the girl he's with provokes him into getting rough with her. He thinks he killed her but didn't. The madame who's connected to the criminal Frank is trying to get calls him and shows him the tape of Tico \"killing\" the girl. That's when she and the criminal tell Frank that he should tell of them of any operation against him and he reveals Crockett and Tubbs are cops."
}, {
  "imdbId" : "0086759",
  "season" : "3",
  "episodeNumber" : "4",
  "title" : "Walk-Alone",
  "description" : "Tubbs goes undercover in a penitentiary to try and smoke out a group of corrupt prison guards."
}, {
  "imdbId" : "0086759",
  "season" : "3",
  "episodeNumber" : "5",
  "title" : "The Good Collar",
  "description" : "Crockett attempts to help a high-school football star achieve his dream, while others pressure him to help bring down a teenage drug lord."
}, {
  "imdbId" : "0086759",
  "season" : "3",
  "episodeNumber" : "6",
  "title" : "Shadow in the Dark",
  "description" : "Crockett risks his sanity to try and enter the mind of a bizarre cat burglar."
}, {
  "imdbId" : "0086759",
  "season" : "3",
  "episodeNumber" : "7",
  "title" : "El Viejo",
  "description" : "Crockett and Tubbs are working on nailing a Bolivian drug dealer. When something goes wrong at the meeting, the Bolivian loses something very important to him and he won't deal until it's returned to him. They discover that an old man who was at the meeting has it. He tries to sell it back but the Bolivian won't agree to that. One of his people tries to get it back but the old man proves to be tough. Crockett and Tubbs offers to act his intermediary but the old man insists on being involved. They later learn that the old man is a Texas Ranger."
}, {
  "imdbId" : "0086759",
  "season" : "3",
  "episodeNumber" : "8",
  "title" : "Better Living Through Chemistry",
  "description" : "Tubbs' attempts to stop synthetic cocaine of the highest purity from hitting the streets are threatened by his ex-NYPD-partner, whose career was destroyed by Tubbs' testimony regarding a confused shooting."
}, {
  "imdbId" : "0086759",
  "season" : "3",
  "episodeNumber" : "9",
  "title" : "Baby Blues",
  "description" : "The team learns of a baby selling ring when one of the children's mother comes to Miami looking for her child. The trail leads them to a sleazy lawyer. When the lawyer manages to tie up any loose ends. They decide to use the mother to trap him."
}, {
  "imdbId" : "0086759",
  "season" : "3",
  "episodeNumber" : "10",
  "title" : "Streetwise",
  "description" : "A prostitution bust at a motel snares an officer from another precinct. Castillo wants to take his badge, but Crockett haves him hold off and uses the officer to find the source of pure cocaine found on one of the prostitutes, a girl the wayward cop is in love with."
}, {
  "imdbId" : "0086759",
  "season" : "3",
  "episodeNumber" : "11",
  "title" : "Forgive Us Our Debts",
  "description" : "New evidence leads Crockett to fight against the execution of Frank Hackman, put on Death Row for murdering Crockett's old partner."
}, {
  "imdbId" : "0086759",
  "season" : "3",
  "episodeNumber" : "12",
  "title" : "Down for the Count: Part 1",
  "description" : "Zito goes undercover as a boxing manager to take down a crooked bookie, but pays the ultimate price for it."
}, {
  "imdbId" : "0086759",
  "season" : "3",
  "episodeNumber" : "13",
  "title" : "Down for the Count: Part 2",
  "description" : "Shaken and angered by Zito's death, Switek and the squad pull out all the stops to take Guzman down."
}, {
  "imdbId" : "0086759",
  "season" : "3",
  "episodeNumber" : "14",
  "title" : "Cuba Libre",
  "description" : "Crockett and Tubbs go undercover to move on a major Miami dealer and stumble into a runaway paramilitary group with blood in their sights and plans of their own for the deal money."
}, {
  "imdbId" : "0086759",
  "season" : "3",
  "episodeNumber" : "15",
  "title" : "The Savage",
  "description" : "When some prostitutes are being killed, Castillo recognizes the M.O. as similar to some killings he saw when he was in Vietnam and working with a Vietnamese investigator. And the investigator shows up in Miami."
}, {
  "imdbId" : "0086759",
  "season" : "3",
  "episodeNumber" : "16",
  "title" : "Theresa",
  "description" : "Evidence against a criminal is destroyed, during an investigation. It is evident that the man somehow found out where it was being kept and destroyed it, and that he could only have gotten that information from someone on the inside. Crockett learns that the one who gave the man the information is his girlfriend and that she's an addict and the criminal is her supplier."
}, {
  "imdbId" : "0086759",
  "season" : "3",
  "episodeNumber" : "17",
  "title" : "The Afternoon Plane",
  "description" : "Tubbs wins a free vacation and he brings his girlfriend with him. But when he arrives, he discovers a man he arrested. He eventually learns that he's been set up by Calderone, who is arriving on the next plane. Tubbs is trapped and with no weapon and no one is willing to help him. He also eventually discovers another woman he knew who is now with Calderone."
}, {
  "imdbId" : "0086759",
  "season" : "3",
  "episodeNumber" : "18",
  "title" : "Lend Me an Ear",
  "description" : "Crockett and Tubbs' investigation of a paranoid dealer is complicated by a surveillance expert who decides to play both sides against one another."
}, {
  "imdbId" : "0086759",
  "season" : "3",
  "episodeNumber" : "19",
  "title" : "Red Tape",
  "description" : "Crockett and Tubbs along with a couple of other cops were about to make a bust but instead are ambushed and one of the cops is killed. It seems that this was not the first time this happened. It's evident that someone on the inside is giving dealers info on busts. Tubbs then loses it. Later he is approached by a cop who wants him to work with him. The partner of the cop who was killed is determined to find out what happened. And when he sees Tubbs with the cop, he follows him."
}, {
  "imdbId" : "0086759",
  "season" : "3",
  "episodeNumber" : "20",
  "title" : "By Hooker by Crook",
  "description" : "A call girl witnesses two henchmen take her client and ultimately murder him, causing her to go into hiding, confiding and staying with a friend, a woman Crockett falls for big time. Unknown to him, there is far more to her than he knows."
}, {
  "imdbId" : "0086759",
  "season" : "3",
  "episodeNumber" : "21",
  "title" : "Knock, Knock... Who's There?",
  "description" : "While Crockett and Tubbs are meeting with a dealer, some men wearing DEA gear come in and take the cash and drugs. But the DEA is not admitting to anything. Later more incidents occur. In the meantime, an Internal Affairs man believes that Crockett may have turned and is determined to take him down. Crockett decides to talk to someone he knows in the DEA, who unknown to him is the one responsible."
}, {
  "imdbId" : "0086759",
  "season" : "3",
  "episodeNumber" : "22",
  "title" : "Viking Bikers from Hell",
  "description" : "A member of a violent biker gang is accidentally killed during a drug sting by Crockett. The other members of his biker gang avenge his death by killing everybody that may have been a part of it until they find the wire."
}, {
  "imdbId" : "0086759",
  "season" : "3",
  "episodeNumber" : "23",
  "title" : "Everybody's in Show Biz",
  "description" : "While under cover, Tubbs and a powerful drug lord are robbed and taken in the process is a brief case. Now the two brothers are marked for death by the drug lord."
}, {
  "imdbId" : "0086759",
  "season" : "3",
  "episodeNumber" : "24",
  "title" : "Heroes of the Revolution",
  "description" : "The team is working on a Cuban named Pedroza. They discover another man keeping tabs on him. They learn that he's a Communist agent. He goes to see Gina and tells her that he knew her mother when she was still in Cuba and that she was murdered by a jealous ex-lover, Pedroza."
}, {
  "imdbId" : "0086759",
  "season" : "4",
  "episodeNumber" : "1",
  "title" : "Contempt of Court",
  "description" : "Crocket goes to jail to protect his source when he and Tubbs tackle organized crime."
}, {
  "imdbId" : "0086759",
  "season" : "4",
  "episodeNumber" : "2",
  "title" : "Amen... Send Money",
  "description" : "The wife of a tele-vangelist is arrested by Tubbs who finds himself the target of preacher's vengeance."
}, {
  "imdbId" : "0086759",
  "season" : "4",
  "episodeNumber" : "3",
  "title" : "Death and the Lady",
  "description" : "Crockett attempts to prove that a murder in a snuff film was real."
}, {
  "imdbId" : "0086759",
  "season" : "4",
  "episodeNumber" : "4",
  "title" : "The Big Thaw",
  "description" : "A cryogenically frozen Reggae star comes to Miami to be unfrozen by Switek and Izzy."
}, {
  "imdbId" : "0086759",
  "season" : "4",
  "episodeNumber" : "5",
  "title" : "Child's Play",
  "description" : "Tormented by his shooting a 13-year-old kid, Crockett tries to reconnect with his estranged son while attempting to take down a gun runner."
}, {
  "imdbId" : "0086759",
  "season" : "4",
  "episodeNumber" : "6",
  "title" : "God's Work",
  "description" : "When the son of a crime boss returns to Miami, Castillo wonders if he's returned to take control of the business. When the man's brother-in-law, a priest, who is a friend of Castillo is killed, they wonder if he was killed by the crime boss."
}, {
  "imdbId" : "0086759",
  "season" : "4",
  "episodeNumber" : "7",
  "title" : "Missing Hours",
  "description" : "Trudy encounters what appears to be a UFO. Or is it a secret government project?"
}, {
  "imdbId" : "0086759",
  "season" : "4",
  "episodeNumber" : "8",
  "title" : "Like a Hurricane",
  "description" : "Crockett is assigned to bodyguard fading singing sensation and makes his displeasure known -- until he gets to know her a bit better."
}, {
  "imdbId" : "0086759",
  "season" : "4",
  "episodeNumber" : "9",
  "title" : "The Rising Sun of Death",
  "description" : "Crockett and Tubbs take on the Yakuza - Japanese organized crime - as they try to control Miami."
}, {
  "imdbId" : "0086759",
  "season" : "4",
  "episodeNumber" : "10",
  "title" : "Love at First Sight",
  "description" : "Crockett and new bride Caitlin trade barbs as he goes undercover in the singles scene looking for a serial killer."
}, {
  "imdbId" : "0086759",
  "season" : "4",
  "episodeNumber" : "11",
  "title" : "A Rock and a Hard Place",
  "description" : "Newly married Crockett gets entangled with Caitlin's record companies executives."
}, {
  "imdbId" : "0086759",
  "season" : "4",
  "episodeNumber" : "12",
  "title" : "The Cows of October",
  "description" : "Miami Vice is on the trail of bull semen to help the Dept. of Agriculture stop a threat to the meat supply."
}, {
  "imdbId" : "0086759",
  "season" : "4",
  "episodeNumber" : "13",
  "title" : "Vote of Confidence",
  "description" : "The department raids of a train of prostitutes and Johns and finds one of the candidates for governor on board, literally with his pants down."
}, {
  "imdbId" : "0086759",
  "season" : "4",
  "episodeNumber" : "14",
  "title" : "Baseballs of Death",
  "description" : "Crockett and Tubbs are investigating the murders of prostitutes which appears to be the work of a sadist. They discover that the killer is a Chilean police official. They try to arrest him but someone from the government gets him out. It's obvious that the government man and the Chilean have something going on. So they try to find out what it is."
}, {
  "imdbId" : "0086759",
  "season" : "4",
  "episodeNumber" : "15",
  "title" : "Indian Wars",
  "description" : "Castillo goes under cover as a drug lord to break up another operation, but things are complicated by a group of paramilitary Indian tribe members who want to stop the ring and restore honor to their tribe which has been caught up by ring leader's greed. To further complicate matters, the tribe and the drug lord are about to cross war paths."
}, {
  "imdbId" : "0086759",
  "season" : "4",
  "episodeNumber" : "16",
  "title" : "Honor Among Thieves?",
  "description" : "While under cover to bust a drug lord, Crockett and Tubbs are caught in the middle of a DEA agent and the director of homicide wanting to bust a sudden show of 100% pure cocaine being found injected into the dead bodies of kidnapped teenage girls, and the drug lord enraged over the killings which are drawing unwanted attention from the police. Things go from bad to life-threatening worse when a shocking twist puts Crockett in an awkward situation."
}, {
  "imdbId" : "0086759",
  "season" : "4",
  "episodeNumber" : "17",
  "title" : "Hell Hath No Fury",
  "description" : "When a convicted rapist is released after serving just 20 months, Trudy tries to protect the victim from further torment. The entire OCB team end up getting involved, some protecting the victim and some protecting the rapist after she hires a mercenary to kill him. Needless to say Castillo is not happy about his team going outside the law."
}, {
  "imdbId" : "0086759",
  "season" : "4",
  "episodeNumber" : "18",
  "title" : "Badge of Dishonor",
  "description" : "A group of rogue cops are dealing dirty and murdering drug dealers. Things take a turn when members of the force become the next targets."
}, {
  "imdbId" : "0086759",
  "season" : "4",
  "episodeNumber" : "19",
  "title" : "Blood & Roses",
  "description" : "Gina becomes a little too close to mobster Frank Mosca in an attempt to take him down."
}, {
  "imdbId" : "0086759",
  "season" : "4",
  "episodeNumber" : "20",
  "title" : "A Bullet for Crockett",
  "description" : "While taking down a drug dealer, Crockett is shot. While he fights for his life, Tubbs tries to find the shooter. And we take a look at Crockett's life."
}, {
  "imdbId" : "0086759",
  "season" : "4",
  "episodeNumber" : "21",
  "title" : "Deliver Us from Evil",
  "description" : "Frank Hackman returns to make life hell for Crockett - in the most devastating way possible."
}, {
  "imdbId" : "0086759",
  "season" : "4",
  "episodeNumber" : "22",
  "title" : "Mirror Image",
  "description" : "Head trauma from a massive explosion causes Crockett to believe he is his alter-ego Sonny Burnett."
}, {
  "imdbId" : "0086759",
  "season" : "5",
  "episodeNumber" : "1",
  "title" : "Hostile Takeover",
  "description" : "Crockett, as Burnett, murders and manipulates his way to the top of the crime organization he works for."
}, {
  "imdbId" : "0086759",
  "season" : "5",
  "episodeNumber" : "2",
  "title" : "Redemption in Blood",
  "description" : "Burnett begins to remember who he really is, as Tubbs and the rest of the squad decide he must be taken down."
}, {
  "imdbId" : "0086759",
  "season" : "5",
  "episodeNumber" : "3",
  "title" : "Heart of Night",
  "description" : "A conflicted Castillo protects his ex-wife from a drug lord who is trying to kill her and her new husband."
}, {
  "imdbId" : "0086759",
  "season" : "5",
  "episodeNumber" : "4",
  "title" : "Bad Timing",
  "description" : "Trying to come to grips with himself after the trouble with Burnett, Crockett takes a vacation that becomes a pursuit with three escaped convicts and their hostage."
}, {
  "imdbId" : "0086759",
  "season" : "5",
  "episodeNumber" : "5",
  "title" : "Borrasca",
  "description" : "Tubbs and Switek go undercover and pose as drug dealing middlemen to take down Borrasca, a very dangerous counter revolutionary who uses drug money to fight the war against communism in his country."
}, {
  "imdbId" : "0086759",
  "season" : "5",
  "episodeNumber" : "6",
  "title" : "Line of Fire",
  "description" : "A drug kingpin on trial for murder puts a million dollar contract out on a punk rocker who is the star witness for the prosecution. The FBI want Crockett and Tubbs to safe house the witness, but keeping him alive is going to be a challenge."
}, {
  "imdbId" : "0086759",
  "season" : "5",
  "episodeNumber" : "7",
  "title" : "Asian Cut",
  "description" : "Trudy poses as a prostitute to help Crockett and Tubbs catch a serial killer who they suspect is Asian because of the ritualistic way in which he mutilates his female victims."
}, {
  "imdbId" : "0086759",
  "season" : "5",
  "episodeNumber" : "8",
  "title" : "Hard Knocks",
  "description" : ""
}, {
  "imdbId" : "0086759",
  "season" : "5",
  "episodeNumber" : "9",
  "title" : "Fruit of the Poison Tree",
  "description" : "Crockett and Tubbs have their efforts to bust a shady business man denied time and again by an attorney and his daughter, Lisa. She also happens to be the one who could testify and close the books on the case for the Police."
}, {
  "imdbId" : "0086759",
  "season" : "5",
  "episodeNumber" : "10",
  "title" : "To Have and to Hold",
  "description" : "Aside from chasing bad guys as usual, Crockett must also attend to family matters. His son, Billy, has begun to break away from his old self in the wake of his new life and family. Crockett goes on leave to spend time with him."
}, {
  "imdbId" : "0086759",
  "season" : "5",
  "episodeNumber" : "11",
  "title" : "Miami Squeeze",
  "description" : ""
}, {
  "imdbId" : "0086759",
  "season" : "5",
  "episodeNumber" : "12",
  "title" : "Jack of All Trades",
  "description" : "Crockett's cousin, Jack, comes to Miami to visit Sonny for the first time since he moved there. However, it is soon revealed that Jack is in serious debt with a drug dealer who will stop at nothing to collect."
}, {
  "imdbId" : "0086759",
  "season" : "5",
  "episodeNumber" : "13",
  "title" : "The Cell Within",
  "description" : "Tubbs is held prisoner by a \"reformed\" psycho he put away years ago, who is obsessed with eradicating crime through extreme methods."
}, {
  "imdbId" : "0086759",
  "season" : "5",
  "episodeNumber" : "14",
  "title" : "The Lost Madonna",
  "description" : "When a drug bust nabs artwork instead of drugs, Crockett and Tubbs enter the underground art scene, but a cop from New York (Michael Chiklis) takes control of the operation to protect the artwork."
}, {
  "imdbId" : "0086759",
  "season" : "5",
  "episodeNumber" : "15",
  "title" : "Over the Line",
  "description" : "When a routine bust goes bad, the team gets approached by a group of rogue cops who have their own vigilante justice in mind. Castillo approves Crockett and Tubbs decision to infiltrate the group, but when one good cop is killed, that decision comes into question."
}, {
  "imdbId" : "0086759",
  "season" : "5",
  "episodeNumber" : "16",
  "title" : "Victims of Circumstance",
  "description" : "Crockett and Tubbs are meeting with a drug dealer when someone comes in and starts shooting killing the drug dealer. When the shooter strikes again but this time not killing a drug dealer but an old man. They realize that an old man who was where when they were meeting the drug dealer was the actual target and that the two men are World War II death camp survivors. They learn that the men along with a few others were scheduled to testify at the hearing of a suspected Nazi who's living in Miami. So Crockett goes undercover joining a group a modern Nazis."
}, {
  "imdbId" : "0086759",
  "season" : "5",
  "episodeNumber" : "17",
  "title" : "Freefall",
  "description" : "Crockett and Tubbs, figuring they're on their way out, are recruited by the government to help a dictator escape from his war-torn country - with double-crosses at every turn."
}, {
  "imdbId" : "0086759",
  "season" : "5",
  "episodeNumber" : "18",
  "title" : "World of Trouble",
  "description" : "An aging mob moss believed to be dead, reappears and must avoid a drug kingpin who has vowed to kill him."
}, {
  "imdbId" : "0086759",
  "season" : "5",
  "episodeNumber" : "19",
  "title" : "Miracle Man",
  "description" : "The team has double trouble, first with a strung out vigilante (Miracle Man) messing up their busts, and second, a TV crew who wants to film it all for a reality TV show."
}, {
  "imdbId" : "0086759",
  "season" : "5",
  "episodeNumber" : "20",
  "title" : "Leap of Faith",
  "description" : "The Young Victims Unit, a new squad of undercover officers, is put to the test when a new drug begins to surface on a college campus within Miami. As they investigate into a professor at the school they find he is not working alone."
}, {
  "imdbId" : "0086759",
  "season" : "5",
  "episodeNumber" : "21",
  "title" : "Too Much, Too Late",
  "description" : "Valerie returns to Miami to help a friend with a drug problem and possibly rekindle her romance with Tubbs. Meanwhile Stan returns to his gambling ways."
}]