[{
  "imdbId" : "3155320",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Re-Entry",
  "description" : "Astronaut Molly Woods tries to reconnect with her husband, John, and son, Ethan, after returning from a 13-month solo mission in outer space. Molly's mystifying experiences in space lead to events that will ultimately change the course of human history."
}, {
  "imdbId" : "3155320",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Extinct",
  "description" : "After Molly collapses and experiences a vision of her encounter on the Seraphim, Sam agrees to give her an ultrasound so she can learn more about her mysterious pregnancy. Also, Molly tracks down Kryger and he reveals the disturbing details of his own solo mission that the International Space Exploration Agency (ISEA) is keeping secret."
}, {
  "imdbId" : "3155320",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Wish You Were Here",
  "description" : "Molly has to decide if she is going to reveal her pregnancy to John after he confronts her about her distant behavior. Meanwhile, John and Molly face parents who are suspicious of Ethan when he goes to school for the first time."
}, {
  "imdbId" : "3155320",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Shelter",
  "description" : "After Sparks attempts to quarantine Molly, she and her family seek refuge on a remote island with her estranged father, Quinn. When the agency closes in on their whereabouts, Ethan is exposed to grave danger. Meanwhile, Yasumoto experiments with a strange and deadly substance."
}, {
  "imdbId" : "3155320",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "What on Earth Is Wrong?",
  "description" : "John begins to doubt Molly's mental state when the validity of her pregnancy is questioned. Meanwhile, Ethan suffers a serious setback, and John and Julie disagree over how to care for him."
}, {
  "imdbId" : "3155320",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Nightmares",
  "description" : "Molly uncovers footage that may reveal the real reason the ISEA chose her for the solo mission, Meanwhile, Ethan experiences his first dream, an unforeseen advancement for which he was not programmed, and Julie distracts herself from work with a mysterious man she meets at the gym."
}, {
  "imdbId" : "3155320",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "More in Heaven and Earth",
  "description" : "Convinced the agency has her baby, Molly is determined to find out where. Meanwhile, John discovers new and startling advancements in Ethan's programming, and Kern holds Kryger hostage in an attempt to recover the incriminating video he stole from the ISEA."
}, {
  "imdbId" : "3155320",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Incursion",
  "description" : "When Molly learns that her baby is alive, she sets out with Kern and Kryger to devise a plan to intercept the baby before Sparks and Yasumoto can relocate him. Meanwhile, John struggles to keep up with Ethan's rapid development."
}, {
  "imdbId" : "3155320",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "Care and Feeding",
  "description" : "When Sparks falls under the influence of the vision of his deceased daughter, he flees with Molly's baby to a remote location. Now, Yasumoto and Molly must rely on each other to track down the offspring."
}, {
  "imdbId" : "3155320",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "A Pack of Cards",
  "description" : "As Molly gets closer to finding her \"offspring,\" John learns that Yasumoto might not have his family's best interests at heart, and Sparks commits to do whatever it takes to keep the \"offspring\" alive and maintain the visions of his dead daughter."
}, {
  "imdbId" : "3155320",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "A New World",
  "description" : "As the offspring's powers grow, Molly learns of Yasumoto's painful path to immortality. When Sparks starts to have doubts about the mission, Anya takes charge. Meanwhile, Odin tries to secretly access Ethan's circuitry."
}, {
  "imdbId" : "3155320",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "Before the Blood",
  "description" : "When Molly finally comes face-to-face with her offspring, she realizes she may be the only one who can stop the coming danger. Meanwhile, Julie uncovers grave secrets about Odin."
}, {
  "imdbId" : "3155320",
  "season" : "1",
  "episodeNumber" : "13",
  "title" : "Ascension",
  "description" : "Molly returns to space in an attempt redirect the Seraphim away from Earth and protect the world's population from the deadly spores. Also, John discovers that Odin's plan has put Ethan in terrible danger."
}, {
  "imdbId" : "3155320",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "Change Scenario",
  "description" : "Six months after her life unraveled and dark secrets were revealed, Molly is confined to a psychiatric hospital when she learns of bizarre deaths that sound eerily similar to those she witnessed in space. When she escapes to investigate, she crosses paths with JD Richter, a determined cop who just signed on to the case. Jeffrey Dean Morgan joins the cast as JD Richter."
}, {
  "imdbId" : "3155320",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "Morphoses",
  "description" : "Molly and JD discover another pregnant woman suffering from inexplicable and fatal symptoms, while Molly begins to question her own mental stability. Meanwhile, Julie struggles with Ethan's rebellion."
}, {
  "imdbId" : "3155320",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "Empathy for the Devil",
  "description" : "Molly finally learns the frightening truth about what happened to her son. Also, Julie's decision to erase Ethan's memory has disturbing conveniences."
}, {
  "imdbId" : "3155320",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "Cracking the Code",
  "description" : "As Molly continues to experience blackouts, she is helping the government crack the DNA code of the spores."
}, {
  "imdbId" : "3155320",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "The New Frontier",
  "description" : "Molly discovers Ethan is alive and sets out to get her son back. Also, suspicions about John's death cause JD to investigate Julie's potential involvement."
}, {
  "imdbId" : "3155320",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "You Say You Want an Evolution",
  "description" : "Molly has become convinced the Aliens are on Earth for peaceful reasons. She and J.D. reach out to Toby for peaceful negotiations with the aliens."
}, {
  "imdbId" : "3155320",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "The Other",
  "description" : "The second hour of a two-hour episode, Molly tries to reconcile whether she wants to be loyal to the aliens or remain loyal to the humans. JD becomes skeptical of the aliens after one gives him a flashback to his days in combat."
}, {
  "imdbId" : "3155320",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "Arms and the Humanich",
  "description" : "After a Global Security Commission raid on the hybrid compound, Molly desperately tries to save her son Adhu, while JD attempts to rescue his daughter who is being held captive by Shepherd. Meanwhile, Lucy becomes more of a threat to humans."
}, {
  "imdbId" : "3155320",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "The Other Side",
  "description" : "As Molly struggles after being infected by the virus, Ares makes his move on the GSC."
}, {
  "imdbId" : "3155320",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "Don't Shoot the Messenger",
  "description" : "Following a near-death experience, Molly has a harrowing vision she can't shake. Also, Shepherd's loyalty to the Global Space Commission is called into question."
}, {
  "imdbId" : "3155320",
  "season" : "2",
  "episodeNumber" : "11",
  "title" : "Zugzwang",
  "description" : "Molly manages to find John's former colleague with JD and Ethan hoping to be able to stop the Humanich threat. Julie sends Charlie on a mission to discover where Lucy's orders are coming from."
}, {
  "imdbId" : "3155320",
  "season" : "2",
  "episodeNumber" : "12",
  "title" : "Double Vision",
  "description" : "Molly reveals disturbing new details about Shepherd's death to the GSC, and Lucy makes a powerful move against the humans and hybrids that could have devastating global repercussions."
}, {
  "imdbId" : "3155320",
  "season" : "2",
  "episodeNumber" : "13",
  "title" : "The Greater Good",
  "description" : "Molly and JD frantically race to the hybrids to stop a Humanich plot that will destroy the human race. Also, Lucy has a shocking realization about the GSC that forces her to question her allegiance and put Ethan at risk."
}]