[{
  "imdbId" : "1466074",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Ransom for a Dead Man",
  "description" : "A brilliant tort attorney gets rid of her boring husband by faking his kidnapping and keeping the ransom. The FBI may be fooled, but not Columbo."
}, {
  "imdbId" : "1466074",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Murder by the Book",
  "description" : "When one member of a mystery writing team wants to break from his less talented partner, he becomes the victim in a real-life murder mystery."
}, {
  "imdbId" : "1466074",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Death Lends a Hand",
  "description" : "When the CEO of a private detective agency threatens the wife of a publisher with blackmail and she threatens to expose him, he accidentally kills her."
}, {
  "imdbId" : "1466074",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Dead Weight",
  "description" : "A war hero shoots and kills his business partner; an easily manipulated young divorcée is the only witness."
}, {
  "imdbId" : "1466074",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Suitable for Framing",
  "description" : "Noted art critic Dale Kingston kills his uncle for his valuable collection of paintings. Despite Columbo's suspicions, all the clues point to the dead man's ex-wife. Can the lieutenant reveal the true culprit before it is too late?"
}, {
  "imdbId" : "1466074",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Lady in Waiting",
  "description" : "A mousy heiress murders her brother, pretending she thought he was a burglar. Lt. Columbo unravels her alibi."
}, {
  "imdbId" : "1466074",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Short Fuse",
  "description" : "A chemical plant's director gets threats and issues threats, and one of the employees develops and plants a bomb in his car. When the car turns out to be missing, Columbo is called to find out what happened."
}, {
  "imdbId" : "1466074",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Blueprint for Murder",
  "description" : "Elliot Markham, a brilliant architect and con-man, murders a Texas millionaire and hides his body in order to keep his visionary construction project financed."
}, {
  "imdbId" : "1466074",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "Étude in Black",
  "description" : "An amoral conductor murders the gifted pianist with whom he is having an affair. Lt. Columbo is on the case."
}, {
  "imdbId" : "1466074",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "The Greenhouse Jungle",
  "description" : "Columbo arrives at a kidnapping case, which at some point turns into a murder. Everything seems to be related to a trust fund, that is being managed by a man with a great love for orchids."
}, {
  "imdbId" : "1466074",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "The Most Crucial Game",
  "description" : "The manager of a football team murders its callow owner, making it look as if the young man had had an accident in his swimming pool. Lt. Columbo is on the case."
}, {
  "imdbId" : "1466074",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "Dagger of the Mind",
  "description" : "Lilian Stanhope and Nicholas Frame are two actors in London. They have to act in Macbeth and the producer is Sir Roger Haversham who is Lilian's lover. Sir Roger finds out he has been deceived by the couple and he threatens to interrupt the performance. Lilian kills him accidentally during a fight and afterwards the two actors take the corpse to his mansion, staging an accident. But Lt. Columbo is in London to learn about the new methods to investigate used by Scotland Yard. And Columbo smells something fishy in the accident."
}, {
  "imdbId" : "1466074",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "Requiem for a Falling Star",
  "description" : "A faded movie actress commits murder. Lt. Columbo, one of her biggest fans, is on the case."
}, {
  "imdbId" : "1466074",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "A Stitch in Crime",
  "description" : "A surgeon has an ingenious plan for murdering his partner in a research project, but a nurse catches onto the scheme."
}, {
  "imdbId" : "1466074",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "The Most Dangerous Match",
  "description" : "A chess player murders his opponent before a big match. Lt. Columbo must out-maneuver this crafty, but craven, killer."
}, {
  "imdbId" : "1466074",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "Double Shock",
  "description" : "A smarmy TV chef and his identical twin brother, a rigidly proper banker, are suspects in the electrocution of their rich uncle."
}, {
  "imdbId" : "1466074",
  "season" : "3",
  "episodeNumber" : "1",
  "title" : "Lovely But Lethal",
  "description" : "The formula for a miracle wrinkle cream leads the founder of a cosmetics company to murder. Lt. Columbo is on the case."
}, {
  "imdbId" : "1466074",
  "season" : "3",
  "episodeNumber" : "2",
  "title" : "Any Old Port in a Storm",
  "description" : "A connoisseur running a California winery murders his younger half-brother to prevent him from selling the family business. Lt. Columbo is on the case."
}, {
  "imdbId" : "1466074",
  "season" : "3",
  "episodeNumber" : "3",
  "title" : "Candidate for Crime",
  "description" : "Senatorial candidate Nelson Hayward murders his domineering campaign manager, staging it to appear that Hayward himself was the intended victim of a mob hit gone wrong. Columbo hits the campaign trail to catch the killer."
}, {
  "imdbId" : "1466074",
  "season" : "3",
  "episodeNumber" : "4",
  "title" : "Double Exposure",
  "description" : "A self-styled \"motivation research specialist\" uses subliminal cues to commit a murder. Lt. Columbo is on the case."
}, {
  "imdbId" : "1466074",
  "season" : "3",
  "episodeNumber" : "5",
  "title" : "Publish or Perish",
  "description" : "A publisher hires a bomb enthusiast to murder a bestselling author of sex novels. Lt. Columbo is on the case."
}, {
  "imdbId" : "1466074",
  "season" : "3",
  "episodeNumber" : "6",
  "title" : "Mind Over Mayhem",
  "description" : "The director of a government institute that employs various scientific geniuses commits a clever murder. But another kind of genius is on the case: Lt. Columbo."
}, {
  "imdbId" : "1466074",
  "season" : "3",
  "episodeNumber" : "7",
  "title" : "Swan Song",
  "description" : "A gospel singer wants to be rid of his zealous wife. But a murder made to look like an airplane accident does not fool the wily Lt. Columbo."
}, {
  "imdbId" : "1466074",
  "season" : "3",
  "episodeNumber" : "8",
  "title" : "A Friend in Deed",
  "description" : "A police commissioner provides a false alibi for a wife killer, but then expects an alibi in return."
}, {
  "imdbId" : "1466074",
  "season" : "4",
  "episodeNumber" : "1",
  "title" : "An Exercise in Fatality",
  "description" : "A health club owner murders one of his franchisees; Lt. Columbo is on the case."
}, {
  "imdbId" : "1466074",
  "season" : "4",
  "episodeNumber" : "2",
  "title" : "Negative Reaction",
  "description" : "A photographer murders his wife and blames her death on a bungled kidnapping. But Lt. Columbo has an even sharper eye than the Pulitzer Prize winner."
}, {
  "imdbId" : "1466074",
  "season" : "4",
  "episodeNumber" : "3",
  "title" : "By Dawn's Early Light",
  "description" : "The commandant of a military academy murders the chairman of the board, who wants to oust him. Lt. Columbo takes up residence in the barracks to expose the killer."
}, {
  "imdbId" : "1466074",
  "season" : "4",
  "episodeNumber" : "4",
  "title" : "Troubled Waters",
  "description" : "Lt. Columbo takes a trip to Acapulco, but finds himself on a new case when a used car dealer commits murder on the cruise ship."
}, {
  "imdbId" : "1466074",
  "season" : "4",
  "episodeNumber" : "5",
  "title" : "Playback",
  "description" : "A gadget-happy inventor murders his mother-in-law; Lt. Columbo is on the case."
}, {
  "imdbId" : "1466074",
  "season" : "4",
  "episodeNumber" : "6",
  "title" : "A Deadly State of Mind",
  "description" : "A psychiatrist, who specializes in hypnosis, murders the husband of his mistress and convinces her to lie to the police; it's up to Lt. Columbo to discover the truth."
}, {
  "imdbId" : "1466074",
  "season" : "5",
  "episodeNumber" : "1",
  "title" : "Forgotten Lady",
  "description" : "A faded dance star of film and stage murders her husband and makes it look like a suicide; Lt. Columbo doubts her seemingly perfect alibi."
}, {
  "imdbId" : "1466074",
  "season" : "5",
  "episodeNumber" : "2",
  "title" : "A Case of Immunity",
  "description" : "The first secretary to the Suarian king may have immunity from the consequences of committing murder, but Lt. Columbo is wilier than any foreign diplomat."
}, {
  "imdbId" : "1466074",
  "season" : "5",
  "episodeNumber" : "3",
  "title" : "Identity Crisis",
  "description" : "A top CIA operative commits murder the way only a brilliant spy can, never guessing he'll have to contend with a man like Lt. Columbo."
}, {
  "imdbId" : "1466074",
  "season" : "5",
  "episodeNumber" : "4",
  "title" : "A Matter of Honor",
  "description" : "When a famous bullfighter's trusted bookkeeper turns up dead in a bullring, Lt. Columbo suspects murder--with a bull as the murder weapon."
}, {
  "imdbId" : "1466074",
  "season" : "5",
  "episodeNumber" : "5",
  "title" : "Now You See Him",
  "description" : "A stage illusionist kills his employer and makes it look like a contract killing; it's up to Lt. Columbo to trick the master trickster."
}, {
  "imdbId" : "1466074",
  "season" : "5",
  "episodeNumber" : "6",
  "title" : "Last Salute to the Commodore",
  "description" : "Charlie Clay runs the ship building business of his father-in-law, Commodore Swanson, who turns up murdered; Lt. Columbo is on the case."
}, {
  "imdbId" : "1466074",
  "season" : "6",
  "episodeNumber" : "1",
  "title" : "Fade in to Murder",
  "description" : "An egotistical but successful star off a TV detective show murders his blackmailing producer and makes it look like a robbery."
}, {
  "imdbId" : "1466074",
  "season" : "6",
  "episodeNumber" : "2",
  "title" : "Old Fashioned Murder",
  "description" : "The spinster head of a family run museum murders her brother when he threatens to dissolve the financially strapped institution."
}, {
  "imdbId" : "1466074",
  "season" : "6",
  "episodeNumber" : "3",
  "title" : "The Bye-Bye Sky High I.Q. Murder Case",
  "description" : "Sigma Society member Oliver Brandt murders his business partner when he threatens to expose him as an embezzler and constructs a seemingly foolproof alibi."
}, {
  "imdbId" : "1466074",
  "season" : "7",
  "episodeNumber" : "1",
  "title" : "Try and Catch Me",
  "description" : "A successful mystery writer suspects her niece's husband murdered her, and she exacts revenge by asphyxiating him in her house safe."
}, {
  "imdbId" : "1466074",
  "season" : "7",
  "episodeNumber" : "2",
  "title" : "Murder Under Glass",
  "description" : "Food critic Paul Gerard, who has been extorting money from restaurant owners in exchange for good reviews, murders one when threatened with exposure."
}, {
  "imdbId" : "1466074",
  "season" : "7",
  "episodeNumber" : "3",
  "title" : "Make Me a Perfect Murder",
  "description" : "An Emmy-winning TV executive kills her lover (who is also her boss); Lt. Columbo is on the case."
}, {
  "imdbId" : "1466074",
  "season" : "7",
  "episodeNumber" : "4",
  "title" : "How to Dial a Murder",
  "description" : "A behavioral psychologist whose wife died under suspicious circumstances trains his dogs to kill on command using a telephone."
}, {
  "imdbId" : "1466074",
  "season" : "7",
  "episodeNumber" : "5",
  "title" : "The Conspirators",
  "description" : "An IRA terrorist executes an arms dealer he considers traitorous; Lt. Columbo is on the case."
}, {
  "imdbId" : "1466074",
  "season" : "8",
  "episodeNumber" : "1",
  "title" : "Columbo Goes to the Guillotine",
  "description" : "An egocentric psychic murders his old mentor, a magician charged to expose him as fraud, by beheading him while he's rehearsing his guillotine trick."
}, {
  "imdbId" : "1466074",
  "season" : "8",
  "episodeNumber" : "2",
  "title" : "Murder, Smoke and Shadows",
  "description" : "An egocentric wunderkind director murders a childhood friend who threatens to expose his negligent complicity in the death of his sister years earlier."
}, {
  "imdbId" : "1466074",
  "season" : "8",
  "episodeNumber" : "3",
  "title" : "Sex and the Married Detective",
  "description" : "When a successful sex therapist with a best selling book and a hit TV show is crushed to learn her business partner/lover is cheating on her, she plots appropriate revenge."
}, {
  "imdbId" : "1466074",
  "season" : "8",
  "episodeNumber" : "4",
  "title" : "Grand Deceptions",
  "description" : "After the head of a private paramilitary think tank who is embezzling funds murders a blackmailer, he has to match wits with the persistent Lieutenant Columbo."
}, {
  "imdbId" : "1466074",
  "season" : "9",
  "episodeNumber" : "1",
  "title" : "Murder, a Self Portrait",
  "description" : "Columbo investigates the apparent drowning of a famous painters first wife."
}, {
  "imdbId" : "1466074",
  "season" : "9",
  "episodeNumber" : "2",
  "title" : "Columbo Cries Wolf",
  "description" : "When the business-savvy publisher of a \"Playboy\"-type men's magazine wants to sell her stock to a Rupert Murdoch-like media tycoon, she apparently disappears on a London-bound flight."
}, {
  "imdbId" : "1466074",
  "season" : "9",
  "episodeNumber" : "3",
  "title" : "Agenda for Murder",
  "description" : "This time Columbo is put on a murder that was made to look like a suicide. However, he notices some loose ends, and asks a lawyer and a governor to clear these problems up."
}, {
  "imdbId" : "1466074",
  "season" : "9",
  "episodeNumber" : "4",
  "title" : "Rest in Peace, Mrs. Columbo",
  "description" : "A woman who blames Lt. Columbo for the loss of her husband sets out to get back at him. But before she goes after him, she first goes after the man who informed on her husband and by showing the Lt. how it feels to lose a love one; by going after his wife."
}, {
  "imdbId" : "1466074",
  "season" : "9",
  "episodeNumber" : "5",
  "title" : "Uneasy Lies the Crown",
  "description" : "The unsuccessful junior partner in a dental group, a bad husband and degenerate gambler, faces divorce and ostracism from his father-in-law's firm."
}, {
  "imdbId" : "1466074",
  "season" : "9",
  "episodeNumber" : "6",
  "title" : "Murder in Malibu",
  "description" : "A successful writer of romance novels who is involved with a young, ambitious womanizer, is found shot to death in her Malibu home."
}]