[{
  "imdbId" : "0098769",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "The Cause (1861)",
  "description" : "Slavery began to flourish in the U.S. at the end of the 18th century with Eli Whitney's invention of the cotton gin. Whereas it would take one person a day to produce a pound of clean cotton, the cotton gin could produce 1000 lbs per day. Business boomed and the demand for slaves to work new cotton fields rose accordingly. Serious objections to slavery began as early as 1831 and the abolitionist movement in the North grew quickly. There was particular concern about whether new States entering the Union would be free or slave States. Some, like John Brown, added ..."
}, {
  "imdbId" : "0098769",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "A Very Bloody Affair (1862)",
  "description" : "By 1862, both sides had 1 million men in uniform across a 1000 mile battle front ranging from Manassas, Virginia to Missouri. Battles had taken a horrendous toll in human lives on both sides. Lincoln and his Cabinet were frustrated by the slow pace of the war and with Gen. George B. McClellan who apparently did not want to engage the enemy. The eventual attack on the Confederate capital, Richmond - by transporting Union troops by boat to the peninsula southeast of Confederate capital - was met by stiff resistance from a force one-tenth its size. McClellan dug in at ..."
}, {
  "imdbId" : "0098769",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Forever Free (1862)",
  "description" : "While Gen. McClellan sat outside Richmond, three Union armies were being kept occupied by Stonewall Jackson and J.E.B. Stuart in northwestern Virginia. Lee was named commander of the army of Northern Virginia and immediately seized the initiative and attacked McClellan at Mechanicsville. Growing increasingly frustrated at McClellan's lack of progress, Lincoln visited him on the battlefield. When the general told the President that hew needed yet more troops, Lincoln ordered him to withdraw. Cotton production was cut in the south hoping this would spur the major ..."
}, {
  "imdbId" : "0098769",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Simply Murder (1863)",
  "description" : "By early 1863, Union soldiers with the Army of the Potomac had not been paid for 6 months and supplies were thin. Some 200 men were deserting every day and by January one-quarter of the men were AWOL. Gen. Ambrose Burnside, the new Union commander, wanted to take Fredericksburg but delays in getting the pontoon boats to cross the Rappahannock river allowed Lee to amass 75,000 men. The Union army was blown away and 9,000 men were killed. Elsewhere, the Confederate army was matching this success and a Union flotilla was captured. Lincoln called for more troops and in ..."
}, {
  "imdbId" : "0098769",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "The Universe of Battle (1863)",
  "description" : "In trying to draw Union troops away from the siege of Vicksburg, Robert E. Lee invaded Pennsylvania and over three days 150,000 men would do battle at Gettysburg. Confederate soldiers had gone into Gettysburg as they had heard there was a large supply of shoes available. The town soon became the focus of the battle that would shape the rest of the conflict. On the first day at Gettysburg, the Union forces were pushed back and by mid-afternoon, Confederate soldiers occupied the town. The second day focused on positioning leading to the battle of Little Round Top. an ..."
}, {
  "imdbId" : "0098769",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Valley of the Shadow of Death (1864)",
  "description" : "By 1864, Union forces had the upper hand, though the end of war was not yet in sight. President Lincoln named U.S. Grant overall commander of the Union army, 533,000 strong and the largest army in the world. He was made him a three star Lieutenant General, a rank last held by George Washington. He brought a different approach than his predecessors choosing to aggressively pursue Lee's army realizing that to do so would likely see them take control of Richmond. Success was not assured and did not come quickly. Their first encounter went to Lee but Grant used a flanking..."
}, {
  "imdbId" : "0098769",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Most Hallowed Ground (1864)",
  "description" : "By the summer of 1864, the Union push had been stopped. At Petersburg, Union troops had been entrenched in an intricate network trenches for two months. The key to victory lay in Sherman capturing Atlanta and on July 22, the battle began and by September, Confederate Gen. Hood abandoned the city. In Virginia, Gen. Sheridan was laying waste to the Shenandoah Valley. For Lincoln, he faced an election in the midst of a civil war, something unknown at the time. Lincoln seemed unelectable and the Democrats were running the ousted Gen McClellan as their candidate. The ..."
}, {
  "imdbId" : "0098769",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "War Is All Hell (1865)",
  "description" : "By the beginning of 1865, the Confederacy was coming to an end. Atlanta had been overrun and Sherman was marching to the sea. Lincoln approved Sherman's plan against the advice of those around him. Sherman set fire to Atlanta, burning anything that could be of use to the opposition. With 62,000 men, he set off toward Savannah. While Sherman went south, the bulk of the Confederate army outside Virginia was destroyed at the battle of Franklin, Tenn. and by early January, Sherman turned northward into the Carolinas. In Virginia meanwhile, Lee's army was under-equipped ..."
}, {
  "imdbId" : "0098769",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "The Better Angels of Our Nature (1865)",
  "description" : "The North celebrated Lee's surrender and the end of the war. On April 14, Good Friday, John Wilkes Booth learned that President Lincoln, General Grant and others were to attend a play at the Ford theater. The Grants decided not to attend and left Washington for Philadelphia. Booth shot the President in the back of the head, and Lincoln died the next day at 7:22 a.m. The news flashed across the country via the telegraph and celebration turned to sorrow. Scattered fighting continued into May but on May 23, a victory parade was held in Washington. By July, eight of ..."
}]