[{
  "imdbId" : "3230854",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Dulcinea",
  "description" : "In the asteroid belt near Saturn, James Holden and the crew of the ice freighter Canterbury, on its way to Ceres Station, investigate a distress call from an unknown derelict ship, the Scopuli."
}, {
  "imdbId" : "3230854",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "The Big Empty",
  "description" : "Holden and crew are trapped in badly damaged shuttle. On Ceres, Miller uncovers clues about Julie Mao. On Earth, Chrisjen Avasarala questions a terrorist."
}, {
  "imdbId" : "3230854",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Remember the Cant",
  "description" : "While Avasarala plays a dangerous game of politics, Holden and his crew are forced to turn on one another while held captive by the Martian Navy."
}, {
  "imdbId" : "3230854",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "CQB",
  "description" : "Holden and crew are caught in the middle of a desperate battle as mysterious war ships attack and board the Donnager. As Miller continues to investigate Julie Mao, his partner Havelock continues to go missing."
}, {
  "imdbId" : "3230854",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Back to the Butcher",
  "description" : "The crew has survived the loss of the Canterbury and the Donnager and are contacted by an unlikely ally. Miller, on Ceres, continues his investigation and his thoughts of a conspiracy grow."
}, {
  "imdbId" : "3230854",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Rock Bottom",
  "description" : "Holden's team makes an uneasy alliance with Fred Johnson while Miller fights for his life against Anderson Dawe's thugs."
}, {
  "imdbId" : "3230854",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Windmills",
  "description" : "Holden and crew realize that they're not alone on the Rocinante and find themselves up against a Martian Marine blockade. Miller's dark night of the soul, believing all is lost, finds a new reason to keep going. Avasarala visits Holden's family in Montana."
}, {
  "imdbId" : "3230854",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Salvage",
  "description" : "A derelict vessel holds a potentially devastating secret. Holden and his crew cross paths with Miller on Eros. Avasarala receives bad news."
}, {
  "imdbId" : "3230854",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "Critical Mass",
  "description" : "A flashback to Julie's origin story reveals her trajectory. Holden and Miller finally meet and team up to get to the bottom of the strange emergency situation happening on Eros. As the true horror of the events on Eros is revealed, an ailing Holden and Miller must overcome incredible odds if they hope to live to fight another day. Part 1 of 2"
}, {
  "imdbId" : "3230854",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "Leviathan Wakes",
  "description" : "A flashback to Julie's origin story reveals her trajectory. Holden and Miller finally meet and team up to get to the bottom of the strange emergency situation happening on Eros. As the true horror of the events on Eros is revealed, an ailing Holden and Miller must overcome incredible odds if they hope to live to fight another day. Part 2 of 2"
}, {
  "imdbId" : "3230854",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "Safe",
  "description" : "Unlikely allies Joe Miller and the crew of the Rocinante led by Jim Holden uncover more about the conspiracy to release the proto-molecule on Eros station."
}, {
  "imdbId" : "3230854",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "Doors & Corners",
  "description" : "Holden and crew stage a dangerous raid in search of information about the protomolecule."
}, {
  "imdbId" : "3230854",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "Static",
  "description" : "Holden and Miller butt heads about how the raid was handled."
}, {
  "imdbId" : "3230854",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "Godspeed",
  "description" : "Miller devises a dangerous plan to eradicate what's left of the protomolecule on Eros."
}, {
  "imdbId" : "3230854",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "Home",
  "description" : "The asteroid Eros takes direct collision course towards Earth. The Rocinante chases it. As last defense Earth launches missiles against Eros. Miller went inside Eros and makes a surprising discovery."
}, {
  "imdbId" : "3230854",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "Paradigm Shift",
  "description" : "Earth is planning an expedition to the point of Eros impact. Chrisjen conflicts with Sadavir about Jules-Pierre Mao. Col. Frederick Lucius Johnson improves his position in unexpected way. New battleground is opening."
}, {
  "imdbId" : "3230854",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "The Seventh Man",
  "description" : "Draper struggles with what happened on Ganymede while the coming Earth/Mars peace conference tighten the tension on Errinwright. Dawes confronts Fred Johnson about what the OPA's course of action should be regarding the protomolecule."
}, {
  "imdbId" : "3230854",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "Pyre",
  "description" : "Naomi tracks down signs of protomolecule and Fred Johnson's control over OPA collapses."
}, {
  "imdbId" : "3230854",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "The Weeping Somnambulist",
  "description" : "Bobbie becomes a pawn in a struggle between Earth and Mars."
}, {
  "imdbId" : "3230854",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "Cascade",
  "description" : "Holden leads his crew through the war-torn station on Ganymede."
}, {
  "imdbId" : "3230854",
  "season" : "2",
  "episodeNumber" : "11",
  "title" : "Here There Be Dragons",
  "description" : "Bobbie makes a decision that changes her life forever."
}, {
  "imdbId" : "3230854",
  "season" : "2",
  "episodeNumber" : "12",
  "title" : "The Monster and the Rocket",
  "description" : "A discovery pushes Naomi and Holden apart and sets the Roci crew against each other."
}, {
  "imdbId" : "3230854",
  "season" : "2",
  "episodeNumber" : "13",
  "title" : "Caliban's War",
  "description" : "In the final episode of this season, the crew of the Rocinante comes face to face with an evolving intelligence infused with the alien protomatter."
}, {
  "imdbId" : "3230854",
  "season" : "3",
  "episodeNumber" : "1",
  "title" : "Fight or Flight",
  "description" : "The crew has to deal with Naomi's betrayal while caught in a war between Earth and Mars. Avasarala and Bobbie hatch up an escape plan."
}, {
  "imdbId" : "3230854",
  "season" : "3",
  "episodeNumber" : "2",
  "title" : "IFF",
  "description" : "The Rocinante answers an unexpected distress signal. Bobbie and Avasarala find themselves being hunted by a mysterious captor. UN Secretary-General Sorrento-Gillis brings in a colleague from his past to lend an ear during this crucial time of war."
}, {
  "imdbId" : "3230854",
  "season" : "3",
  "episodeNumber" : "3",
  "title" : "Assured Destruction",
  "description" : "Earth strategizes a costly ploy to gain advantage in the war against Mars; Anna struggles to convince Sorrento-Gillis to do the right thing; Avasarala and Bobbie seek refuge aboard the Rocinante."
}, {
  "imdbId" : "3230854",
  "season" : "3",
  "episodeNumber" : "4",
  "title" : "Reload",
  "description" : "The Rocinante tends to wounded Martian soldiers in exchange for supplies; Avasarala struggles with how to disseminate a key piece of evidence despite being in hiding."
}, {
  "imdbId" : "3230854",
  "season" : "3",
  "episodeNumber" : "5",
  "title" : "Triple Point",
  "description" : "The search for Prax's daughter comes to a head; officers loyal to Admiral Souther plan to mutiny aboard the Agatha King."
}, {
  "imdbId" : "3230854",
  "season" : "3",
  "episodeNumber" : "6",
  "title" : "Immolation",
  "description" : "The final battle between Earth and Mars threatens the very future of humanity; a new monster is unleashed on Prospero Station; Anna receives the smoking gun she needs."
}, {
  "imdbId" : "3230854",
  "season" : "3",
  "episodeNumber" : "7",
  "title" : "Delta-V",
  "description" : "All eyes turn to the edge of the solar system as a mysterious new presence emerges; Naomi recommits to her roots; Drummer butts heads with a seasoned new commander aboard the Behemoth; and a young Belter makes a name for himself."
}, {
  "imdbId" : "3230854",
  "season" : "3",
  "episodeNumber" : "8",
  "title" : "It Reaches Out",
  "description" : "An old friend taunts Holden with the answers he seeks; Naomi struggles to fit in; a mysterious low-level tech aboard the Thomas Prince enacts a terrifying plan."
}, {
  "imdbId" : "3230854",
  "season" : "3",
  "episodeNumber" : "9",
  "title" : "Intransigence",
  "description" : "The Rocinante seeks a new game plan as they attempt to avoid capture; Melba's true motives are revealed; Naomi is torn between identity and ideal; Anna seeks a way to stay aboard the Thomas Prince."
}, {
  "imdbId" : "3230854",
  "season" : "3",
  "episodeNumber" : "10",
  "title" : "Dandelion Sky",
  "description" : "Holden sees past, present, and future; a ghost from Melba's past threatens her mission; Bobbie struggles to trust an old friend as she leads a group into uncharted territory."
}, {
  "imdbId" : "3230854",
  "season" : "3",
  "episodeNumber" : "11",
  "title" : "Fallen World",
  "description" : "Drummer and Ashford find themselves trapped with few options for survival; Anna tends to the wounded masses as Melba continues to hunt down her prey; the Rocinante crew struggles to survive as Naomi reunites with her true family."
}, {
  "imdbId" : "3230854",
  "season" : "3",
  "episodeNumber" : "12",
  "title" : "Congregation",
  "description" : "Wounded survivors arrive at the Behemoth. Holden and Ashford have a conversation. Holden tries to come to grips with what he has seen and tries to find out what is going on with the Station."
}, {
  "imdbId" : "3230854",
  "season" : "3",
  "episodeNumber" : "13",
  "title" : "Abaddon's Gate",
  "description" : "Humanity's fate is on the line as Holden and his allies race against time to save the ring by countering the plan Ashford's team is implementing. A new chapter opens for humanity."
}, {
  "imdbId" : "3230854",
  "season" : "4",
  "episodeNumber" : "1",
  "title" : "New Terra",
  "description" : "With 1300 new worlds within reach, a new interplanetary \"land rush\" has begun. The UN charges the crew of the Rocinante to settle a land dispute on its new colony world \"New Terra.\" Meanwhile, the OPA begins transitioning the Behemoth to become outpost and gatekeeper to humanity's new frontier."
}, {
  "imdbId" : "3230854",
  "season" : "4",
  "episodeNumber" : "2",
  "title" : "Jetsam",
  "description" : "Avasarala is blindsided while on a visit to Mars. The Roci crew continue their protomolecule investigation while tensions between the RCE and Belters reach a tipping point. Drummer and Ashford track down a terrorist."
}, {
  "imdbId" : "3230854",
  "season" : "4",
  "episodeNumber" : "3",
  "title" : "Subduction",
  "description" : "New alien threats emerge on Ilus as Naomi battles health challenges on the planet. Bobbie searches for a missing person on Mars. Avasarala faces a new challenge in the UN."
}, {
  "imdbId" : "3230854",
  "season" : "4",
  "episodeNumber" : "4",
  "title" : "Retrograde",
  "description" : "Drummer and Ashford confront a dangerous person from Naomi's past. Murtry hunts down a target. Bobbie's makes a life-changing confession."
}, {
  "imdbId" : "3230854",
  "season" : "4",
  "episodeNumber" : "5",
  "title" : "Oppressor",
  "description" : "As tensions on Ilus reach a boiling point, Holden reveals a secret. Avasarala debates Nancy Gao while an emergency on the Roci forces Alex and Naomi into action."
}, {
  "imdbId" : "3230854",
  "season" : "4",
  "episodeNumber" : "6",
  "title" : "Displacement",
  "description" : "The Roci crew prepares for an incoming disaster on Ilus. Ashford and Drummer close in on an enemy within the Belt. Bobbie takes on a dangerous job."
}, {
  "imdbId" : "3230854",
  "season" : "4",
  "episodeNumber" : "7",
  "title" : "A Shot in the Dark",
  "description" : "Naomi and Alex work to keep the Barbapiccola in orbit amidst a power outage. Avasarala faces a tough decision. Holden and Elvi race to find a cure for a disease spreading on Ilus."
}, {
  "imdbId" : "3230854",
  "season" : "4",
  "episodeNumber" : "8",
  "title" : "The One-Eyed Man",
  "description" : "Avasarala faces fallout for the UN's military mission. Ashford and Drummer makes big decisions about their future within the OPA. A spreading illness on Ilus takes a toll on Amos. Alex and Naomi's attempt to rescue the Barb turns desperate."
}, {
  "imdbId" : "3230854",
  "season" : "4",
  "episodeNumber" : "9",
  "title" : "Saeculum",
  "description" : "Holden and Miller race to save Ilus. Murtry puts his endgame into motion, putting the Roci crew's lives at risk."
}, {
  "imdbId" : "3230854",
  "season" : "4",
  "episodeNumber" : "10",
  "title" : "Cibola Burn",
  "description" : "Ashford closes in on an enemy while uncovering a dangerous plot. Avasarala faces a crossroads in her personal and political life. The Roci crew works to reestablish life on Ilus in the wake of a deadly catastrophe."
}]