[{
  "imdbId" : "5164196",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Pilot",
  "description" : "A slightly unhinged former Navy SEAL lands a job as a police officer in Los Angeles where he's partnered with a veteran detective trying to maintain a low stress level in his life."
}, {
  "imdbId" : "5164196",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Surf N Turf",
  "description" : "Riggs and Murtaugh respond to a noise complaint at a party at heavyweight boxer Ronald Dawson's Hollywood hills home. When gunshots go off, they are drawn into a major case involving illegal gun runners with advanced military technology. Riggs becomes personally invested in the case when he discovers one of their targets is a pregnant woman who reminds him of his deceased wife. Meanwhile, Trish worries about Murtaugh's health, as partnering with Riggs tests his limits."
}, {
  "imdbId" : "5164196",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Best Buds",
  "description" : "Riggs and Murtaugh follow a violent case involving a drug cartel, theft, two killings and, unfortunately, Murtaugh's old T.O., Ned Brower. As the case unfolds, it turns out that Ned is more involved than just driving the cash, which leaves Murtaugh with an inevitably dangerous decision to make. Looking for back-up, the duo turns to Cruz for help. In the midst of all the chaos, Riggs continues to depend on outside vices, rather than face the reality of Miranda's death, while Murtaugh and Trish struggle to find alone time."
}, {
  "imdbId" : "5164196",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "There Goes the Neighborhood",
  "description" : "A string of burglaries hits close to home for Murtaugh when one occurs in his own neighborhood, and it gets just as personal for Riggs when another break-in ends in a casualty. Meanwhile, Roger Junior connects with an old friend who might be twisted up in some criminal action of his own."
}, {
  "imdbId" : "5164196",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Spilt Milk",
  "description" : "Murtaugh and Riggs target a former Navy SEAL. Murtaugh sees a parallel between the suspect and Riggs. Murtaugh sees Riggs connection to the suspect threatens to interfere with the case."
}, {
  "imdbId" : "5164196",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Ties That Bind",
  "description" : "When Riggs and Murtaugh investigate a high-profile case surrounding the murder of a young model, they uncover a vicious secret behind the locked mansion gates of one of LA's wealthiest families. Riggs gets a jolt from his past when he discovers that an old friend of his wife has ties to the case. Back at home, Murtaugh is shocked to hear that his daughter is sending promiscuous photos to her new boyfriend."
}, {
  "imdbId" : "5164196",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Fashion Police",
  "description" : "As Riggs and Murtaugh examine the murder of one of L.A.'s fashion expeditors, they follow a trail of evidence that leads them to an ongoing and exceptionally dangerous underground investigation led by the Drug Enforcement Administration. In the meantime, Trish and the kids are off visiting colleges, leaving Murtaugh to a \"bender\" of his own, while Riggs has trouble sleeping through the night due to his all-too-real dreams of Miranda."
}, {
  "imdbId" : "5164196",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Can I Get a Witness?",
  "description" : "When a million dollar casino heist takes a deadly turn, Riggs befriends the only credible witness, an eight-year-old boy, and takes him into his care. On the flip side, Murtaugh pulls some dangerous stunts in an attempt to prove to everyone that he can be a motorcycle guy. Meanwhile, Riggs contemplates what to do with the money he received from selling his home in Texas."
}, {
  "imdbId" : "5164196",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "Jingle Bell Glock",
  "description" : "Holiday celebrations are cut short when the precinct is called to examine a homicide linked to the deranged nephew of the drug lord who has ties to Riggs; and Murtaugh has a problem with his neighbor's excessive holiday decorations."
}, {
  "imdbId" : "5164196",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "Homebodies",
  "description" : "Riggs and Murtaugh end up in the middle of a turf war as they investigate the murder of a millennial \"designer drug\" dealer."
}, {
  "imdbId" : "5164196",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "Lawmen",
  "description" : "Murtaugh and Riggs suspect misuse of power in the LA Sheriff's department when they investigate the killing of a Texas Ranger."
}, {
  "imdbId" : "5164196",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "Brotherly Love",
  "description" : "Roger and Trish find themselves pitted against each other when a stolen car full of cocaine is traced to a ring of car thieves."
}, {
  "imdbId" : "5164196",
  "season" : "1",
  "episodeNumber" : "13",
  "title" : "The Seal Is Broken",
  "description" : "Riggs and Murtaugh investigate a series of violent crimes with one thing in common - the victims are all members of the same church. While investigating the case, Riggs faces a moral dilemma of his own when the one-year anniversary of Miranda's death sends him to a new low. Also, Trish and Roger disagree with RJ about his future."
}, {
  "imdbId" : "5164196",
  "season" : "1",
  "episodeNumber" : "14",
  "title" : "The Murtaugh File",
  "description" : "Murtaugh and Riggs discover that Cahill is being targeted by a murderous stalker after a violent car accident; Riggs begins to obsess over Murtaugh's past after finding his file in Cahill's office; Roger and Trish find their daughter's fake ID"
}, {
  "imdbId" : "5164196",
  "season" : "1",
  "episodeNumber" : "15",
  "title" : "As Good as It Getz",
  "description" : "Riggs and Murtaugh are forced to work with DEA agent Karen Palmer again, to protect Leo Getz, an ambulance-chasing attorney who was linked to the Cartel. As the three delve further into the case, they begin to realize that Leo may not be the only one with a target on his back. In the meantime, Riggs begins to view Agent Palmer in a new light while Murtaugh is left worried after Trish makes a spontaneous decision."
}, {
  "imdbId" : "5164196",
  "season" : "1",
  "episodeNumber" : "16",
  "title" : "Unnecessary Roughness",
  "description" : "A murder involving a high school football phenomenon draws Riggs and Murtaugh into the lucrative - and corrupt - world of college recruiting. Meanwhile, Murtaugh considers a big change in his professional life, and Riggs contemplates an even bigger shift in his personal life, as he spends more time with DEA Agent Karen Palmer."
}, {
  "imdbId" : "5164196",
  "season" : "1",
  "episodeNumber" : "17",
  "title" : "A Problem Like Maria",
  "description" : "Riggs and Murtaugh team up again with DEA Agent Karen Palmer, and together they gain inside knowledge of dangerous new cartel operations. As Riggs' attachment to Palmer deepens, so do his impulsive actions, further worrying Captain Avery and Delgado. In the meantime, Trish explores the potential of an amazing new career opportunity."
}, {
  "imdbId" : "5164196",
  "season" : "1",
  "episodeNumber" : "18",
  "title" : "Commencement",
  "description" : "Riggs makes a shocking discovery about Miranda's death that leads him back to the cartel in a frantic search for answers. His wild desperation leaves Murtaugh torn between his commitment to his partner and his commitment to his family."
}]