[{
  "imdbId" : "0081871",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "The Greatest American Hero",
  "description" : "The Pilot episode of the series. School teacher Ralph Hinkley meets FBI agent Bill Maxwell on a field trip to the desert, where they are met by a UFO that gives them a mission and a red costume with amazing powers. The new team must then use those powers to thwart a conspiracy."
}, {
  "imdbId" : "0081871",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "The Hit Car",
  "description" : "Ralph's class prepares to perform Shakespeare while he works with Bill to dodge professional killers and transport a beautiful and flirtatious FBI informant to testify against her drug-dealing mobster boyfriend."
}, {
  "imdbId" : "0081871",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Here's Looking at You, Kid",
  "description" : "A military aircraft with a top-secret prototype targeting system is stolen, and Bill recruits Ralph to help him find the gun-sight, during which Ralph discovers a new superpower that he is unable to control. Meanwhile, Ralph's students press a classmate to run for class president, and Pam's mother and judgmental father fly in from Minnesota to meet Ralph."
}, {
  "imdbId" : "0081871",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Saturday Night on Sunset Boulevard",
  "description" : "FBI agents and Russian killers pursue a man and woman, Ralph's students are disillusioned and preparing to drop out of school, and Bill is given a lie detector test where he is caught covering for his extra-terrestrial and super-suit escapades, causing him to be suspended from the FBI until he takes a follow-up test. Bill comes up with a plan to resolve the high-profile FBI case in order to buy himself out of the failed test predicament, enlisting Ralph and Pam to help him."
}, {
  "imdbId" : "0081871",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Reseda Rose",
  "description" : "Ralph and Pam's plans (all of them) take a back seat when Rhonda's Mom Rose is kidnapped, opening the door to a Soviet operation to steal U.S. secrets."
}, {
  "imdbId" : "0081871",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "My Heroes Have Always Been Cowboys",
  "description" : "Ralph retires the suit after his super-heroics result in a near-tragedy. Bill desperately needs Ralph to help him crack a corrupt cop caper masterminded by a war buddy. Can the Lone Ranger remind Ralph of a hero's great responsibility?"
}, {
  "imdbId" : "0081871",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Fire Man",
  "description" : "Tony is accused of arson, and Bill and Ralph must find evidence to clear his name."
}, {
  "imdbId" : "0081871",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "The Best Desk Scenario",
  "description" : "Pam and Ralph get promotions, and Bill begins to worry about his mistakes and mortality. Pam's new boss is mixed up with the mob, and the team must rescue her and Bill's career."
}, {
  "imdbId" : "0081871",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "The Two-Hundred-Mile-an-Hour Fast Ball",
  "description" : "Crooks needing cash to swing an arms deal bet heavily on a baseball game and beat up the star of the team they bet against. Ralph joins the underdogs to make sure they win and the gamblers lose their money."
}, {
  "imdbId" : "0081871",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "Operation Spoilsport",
  "description" : "The aliens return and tell Ralph and Bill that they have to stop World War III when they are told that a failsafe system which will launch an attack on the other side if the country's been decimated has been activated. So they have to stop it. But unfortunately they discover someone on their side is behind the whole thing."
}, {
  "imdbId" : "0081871",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "Don't Mess Around with Jim",
  "description" : "Ralph and Bill are knocked out and the suit is taken by their abductors. They're brought some place and are taken to see that the man who abducted them is a millionaire who's suppose to have died recently. He reveals that he knows about the aliens and the suit. He tells them that he entrusted his doctor with his final will and testament which basically gives all of his fortune to charity. But the President of his company convinced the doctor to give him the will so that he could remain in control of the company. So he wants Ralph and Bill to get the will back. They're..."
}, {
  "imdbId" : "0081871",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "Hog Wild",
  "description" : "When a motorcycle gang learns about Ralph and the suit, they grab Bill and force Ralph to help them get back at the Sheriff who humiliated them."
}, {
  "imdbId" : "0081871",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "Classical Gas",
  "description" : "Ralph and Pam help the kids rehearse their rock band for a show not realizing the promoter plans to release nerve gas into their crowd."
}, {
  "imdbId" : "0081871",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "The Beast in the Black",
  "description" : "Bill is possessed by a woman's spirit. To rescue him, Ralph crosses to another dimension and discovers that his super-suit won't function."
}, {
  "imdbId" : "0081871",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "The Lost Diablo",
  "description" : "Bill learns of a lost gold mine and tricks Ralph and the kids into helping him search for it."
}, {
  "imdbId" : "0081871",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "Plague",
  "description" : "Bill and Ralph must track down a group of gun-runners while dealing with a plague threat."
}, {
  "imdbId" : "0081871",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "Train of Thought",
  "description" : "Ralph suffers amnesia after a collision with a train and can't remember who he is, or what his super powers are. Meanwhile a terrorist cell plans to release atomic waste in a small town."
}, {
  "imdbId" : "0081871",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "Now You See It",
  "description" : "Ralph discovers a new power - the ability to see the future. For example, he can see the plane on which Pam is traveling will crash."
}, {
  "imdbId" : "0081871",
  "season" : "2",
  "episodeNumber" : "11",
  "title" : "The Hand-Painted Thai",
  "description" : "American pilots, hypnotized years ago in Vietnam, are activated to bomb a dam, destroy valuable farm land and disrupt an important scientific meeting. Ralph and Bill must stop the planes before they reach their target."
}, {
  "imdbId" : "0081871",
  "season" : "2",
  "episodeNumber" : "12",
  "title" : "Just Another Three-Ring Circus",
  "description" : "Bill is assigned to locate a missing circus clown. Ralph is recruited to infiltrate the circus as a human cannonball act."
}, {
  "imdbId" : "0081871",
  "season" : "2",
  "episodeNumber" : "13",
  "title" : "The Shock Will Kill You",
  "description" : "While rescuing a stricken space shuttle Ralph becomes hyper-magnetized resulting his being attracted to all things metal."
}, {
  "imdbId" : "0081871",
  "season" : "2",
  "episodeNumber" : "14",
  "title" : "A Chicken in Every Plot",
  "description" : "Ralph, Pam and the kids fly to a Caribbean to visit a friend of Bill Maxwell's. When they arrive they find Bill's friend murdered and island racked by a voodoo-driven revolt against the government."
}, {
  "imdbId" : "0081871",
  "season" : "2",
  "episodeNumber" : "15",
  "title" : "The Devil and the Deep Blue Sea",
  "description" : "While visiting Bermuda, Bill investigates whether dinosaur attacks may cause the loss of ships in the Bermuda Triangle."
}, {
  "imdbId" : "0081871",
  "season" : "2",
  "episodeNumber" : "16",
  "title" : "It's All Downhill from Here",
  "description" : "Ralph goes undercover as a skier to help a defector escape his pursuers."
}, {
  "imdbId" : "0081871",
  "season" : "2",
  "episodeNumber" : "17",
  "title" : "Dreams",
  "description" : "A man arrested by Bill and Ralph is released from prison and vows vengeance upon the two men. The normally unperturbed Maxwell is scared out of his wits by the threats."
}, {
  "imdbId" : "0081871",
  "season" : "2",
  "episodeNumber" : "18",
  "title" : "There's Just No Accounting...",
  "description" : "Ralph has to deal with an IRS audit, Bill is suspended for losing a kidnapping ransom, and everyone is harassed by the IRS. Fun times."
}, {
  "imdbId" : "0081871",
  "season" : "2",
  "episodeNumber" : "19",
  "title" : "The Good Samaritan",
  "description" : "Ralph, tired of just going after criminals, decides he wants to help people. And he starts by helping a man who's being forced out of his home."
}, {
  "imdbId" : "0081871",
  "season" : "2",
  "episodeNumber" : "20",
  "title" : "Captain Bellybuster and the Speed Factory",
  "description" : "A man who plays a superhero for a hamburger chain discovers the stores are a front for drug dealers. When a reporter investigating his claims for murder, the icon calls on Ralph for help."
}, {
  "imdbId" : "0081871",
  "season" : "2",
  "episodeNumber" : "21",
  "title" : "Who's Woo in America",
  "description" : "Ralph's mother comes for a visit, and announces that she is engaged to be married to Philip Kabala, a much younger man. Kabala has a shady background though, and a bunch of thugs mistake Ralph for the fiancée."
}, {
  "imdbId" : "0081871",
  "season" : "2",
  "episodeNumber" : "22",
  "title" : "Lilacs, Mr. Maxwell",
  "description" : "Ralph breaks into the FBI archives and helps Bill solve a number of cold cases. As a result, Bill becomes a hero and a target for a beautiful KGB assassin."
}, {
  "imdbId" : "0081871",
  "season" : "3",
  "episodeNumber" : "1",
  "title" : "Divorce, Venusian Style",
  "description" : "After a loud argument with Bill, Ralph quits the hero business and turns in his super-suit. Unknown to both men, a gang of neo-Nazis plans to murder them."
}, {
  "imdbId" : "0081871",
  "season" : "3",
  "episodeNumber" : "2",
  "title" : "The Price Is Right",
  "description" : "While attending a high-school reunion, Ralph discovers that the wife of a famous pro football player is held hostage to ensure her husband will throw the big game."
}, {
  "imdbId" : "0081871",
  "season" : "3",
  "episodeNumber" : "3",
  "title" : "This Is the One the Suit Was Meant For",
  "description" : "With their relationship in trouble, Ralph convinces Pam to go on a vacation without Bill or his suit. Unfortunately Bill shows up unannounced with his suit and trouble ensues."
}, {
  "imdbId" : "0081871",
  "season" : "3",
  "episodeNumber" : "4",
  "title" : "The Resurrection of Carlini",
  "description" : "A magician who was killed performing his greatest trick seemingly returns from the grave to murder his three rivals."
}, {
  "imdbId" : "0081871",
  "season" : "3",
  "episodeNumber" : "5",
  "title" : "The Newlywed Game",
  "description" : "The day of Pam's and Ralph's wedding is coming fast, but unfortunately what appears to be the United States government has found out about the suit and makes life very complicated for all involved."
}, {
  "imdbId" : "0081871",
  "season" : "3",
  "episodeNumber" : "6",
  "title" : "Heaven Is in Your Genes",
  "description" : "Bill is believed to have been killed. However, after the funeral, Ralph sees visions of him, leading him to Mexico in search of the truth."
}, {
  "imdbId" : "0081871",
  "season" : "3",
  "episodeNumber" : "7",
  "title" : "Live at Eleven",
  "description" : "While foiling a Plutonium robbery, Ralph gets exposed, and discovers a new ability. He mentally influence people. He and Bill must discover who is behind the attempt, and prevent his other plans."
}, {
  "imdbId" : "0081871",
  "season" : "3",
  "episodeNumber" : "8",
  "title" : "Space Ranger",
  "description" : "A person who goes by the codename of \"Space Ranger\" has tapped into Russian satellites and is giving information to the CIA. Once it is discovered that Space Ranger is one of Ralph's students (who the KGB is after), complications ensue."
}, {
  "imdbId" : "0081871",
  "season" : "3",
  "episodeNumber" : "9",
  "title" : "Thirty Seconds Over Little Tokyo",
  "description" : "Ralph and Bill find themselves trying to protect a Japanese man after a gang tries to kidnap him."
}, {
  "imdbId" : "0081871",
  "season" : "3",
  "episodeNumber" : "10",
  "title" : "Wizards and Warlocks",
  "description" : "When an Arab prince who is the country studying disappears, Bill tries to find him with help from Ralph. They learn that he is taking part in a game called Wizards and Warlocks wherein someone gives him a task to do. Now the people who are trying to grab the prince have taken the only person who knows what the prince is doing. So Ralph and Bill have to turn to the only person who might know where the prince is--the man who created the game."
}, {
  "imdbId" : "0081871",
  "season" : "3",
  "episodeNumber" : "11",
  "title" : "It's Only Rock and Roll",
  "description" : "A bomb threat is called in on a private flight that is transporting Elvira, the popular rock band. After the situation is rectified, Bill must take Elvira's singer under his wing for protection, but problems ensue with a gang that is plotting the singer's death."
}, {
  "imdbId" : "0081871",
  "season" : "3",
  "episodeNumber" : "12",
  "title" : "Desperado",
  "description" : "Ralph, Pam and Bill try to save a beautiful stallion from an obsessed rancher."
}, {
  "imdbId" : "0081871",
  "season" : "3",
  "episodeNumber" : "13",
  "title" : "Vanity, Says the Preacher",
  "description" : "Bill accepts an invitation to be honored as Man of the Year by a Latin American country where years before he was instrumental in helping them establish a democratic government."
}, {
  "imdbId" : "0081871",
  "season" : "3",
  "episodeNumber" : "14",
  "title" : "The Greatest American Heroine",
  "description" : "The aliens tell Ralph to find a suitable replacement for himself when his secret identity is revealed to the world. Much to Bill's disgust he selects a woman to be his successor."
}]