[{
  "imdbId" : "9288030",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Welcome to Margrave",
  "description" : "Jack Reacher, recently discharged from the Army, travels to Margrave, GA where he discovers that the idyllic town is a cesspool of corruption. After it becomes personal, he vows to burn it down."
}, {
  "imdbId" : "9288030",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "First Dance",
  "description" : "When more victims are discovered, Reacher attempts to get answers but is set up. Roscoe discovers a threatening message."
}, {
  "imdbId" : "9288030",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Spoonful",
  "description" : "Reacher and Finlay's investigation leads them into a confrontation with Kliner. Roscoe learns unsettling news about Reacher."
}, {
  "imdbId" : "9288030",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "In A Tree",
  "description" : "As the danger increases, Reacher and Roscoe grow closer and make plans to meet their contact at Homeland Security."
}, {
  "imdbId" : "9288030",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "No Apologies",
  "description" : "As the mystery deepens, Reacher teams up with an old colleague and Finlay makes a shocking discovery."
}, {
  "imdbId" : "9288030",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Papier",
  "description" : "While the town is rocked by another murder, Reacher heads to New York and learns the truth about the illegal business in Margrave. Roscoe faces danger in the woods."
}, {
  "imdbId" : "9288030",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Reacher Said Nothing",
  "description" : "Reacher springs a trap and then gets trapped himself."
}, {
  "imdbId" : "9288030",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Pie",
  "description" : "Reacher leads a rescue mission at the warehouse that ends in a showdown."
}, {
  "imdbId" : "9288030",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "ATM",
  "description" : "Reacher and Neagley investigate the murder of a member of 110th, a group of Special investigators assembled by Reacher, only to realize the whole unit may be at risk."
}, {
  "imdbId" : "9288030",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "What Happens In Atlantic City",
  "description" : " The investigation into Franz's murder takes Reacher and the surviving members of his former Army unit to Atlantic City where the mystery deepens, danger awaits, and an old flame is rekindled."
}, {
  "imdbId" : "9288030",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "Picture Says A Thousand Words",
  "description" : "After more of his friends fall victim, Reacher forges an uneasy alliance with a dogged detective, and their only clue in the case leads the 110th to a troubling discovery."
}, {
  "imdbId" : "9288030",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "A Night at the Symphony",
  "description" : "Reacher and his team head to Boston to track down a political aide with insider knowledge of a top secret military-defense contract that may be the reason behind their friends deaths."
}, {
  "imdbId" : "9288030",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "Burial",
  "description" : "Neagley and Dixon discover shocking information about an old friend in Denver while Reacher and O'Donnell learn more about the nefarious and mysterious A.M."
}, {
  "imdbId" : "9288030",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "New York's Finest",
  "description" : "As the mystery continues to unfold, Reacher and his team set a trap to even the score."
}, {
  "imdbId" : "9288030",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "The Man Goes Through",
  "description" : "As the team close in on Langston, two members of the 110th face danger, compelling Reacher to devise a dangerous plan to rescue them."
}, {
  "imdbId" : "9288030",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "Fly Boy",
  "description" : "Reacher and Neagley make a final desperate attempt to save O'Donnell and Dixon, stop A.M. and avenge their friends' murder."
}]