[{
  "imdbId" : "0411008",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Pilot: Part 1",
  "description" : "Forty-eight survivors of an airline flight originating from Australia, bound for the U.S., which crash-lands onto an unknown island 1000 miles off course, struggle to figure out a way to survive while trying to find a way to be rescued."
}, {
  "imdbId" : "0411008",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Pilot: Part 2",
  "description" : "Jack, Kate and Charlie return to the group, but the transceiver is broken. Sayid Jarrah fixes the apparatus and organizes an expedition with Kate, Charlie, Shannon Rutherford and her brother Boone Carlyle and the dangerous James \"Sawyer\" Ford to hike and climb a mountain to transmit a SOS. The group receives a sixteen years old distress call from a French woman in the island instead and kills a polar bear. They return to the survivor's base and decide to hide the information to preserve the hope of the group."
}, {
  "imdbId" : "0411008",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Tabula Rasa",
  "description" : "The U.S. marshal's assignment is revealed. Later, there is a difference of opinion between Jack and Sawyer as to how to help the critically injured marshal. Flashback to what Kate was doing in Australia. Scenes of the crash from Kate's POV. A small group sets off with a transceiver in an effort to send a mayday signal. Michael forbids Walt to speak to Locke. Locke later extends an act of kindness toward Michael that may help the father-son relationship. Sayid makes a bid to organize some island committees."
}, {
  "imdbId" : "0411008",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Walkabout",
  "description" : "When the survivors run out of food, Locke, Kate, and Michael go out hunting for boar. Michael gets injured, so he and Kate go back. But Locke stays out hunting, and ends up running into the creature living in the jungle."
}, {
  "imdbId" : "0411008",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "White Rabbit",
  "description" : "Jack begins to experience visions of his dead father Christian. He runs into the jungle trying to find him, but things go wrong when he falls down a hill and off a cliff."
}, {
  "imdbId" : "0411008",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "House of the Rising Sun",
  "description" : "Jin tries to beat up Michael for no reason at all; Jack wants to move the survivors over to the caves, although some people disagree; Sun reveals to Michael that she can speak English."
}, {
  "imdbId" : "0411008",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "The Moth",
  "description" : "Trying to kick his drug habit with encouragement from Locke, Charlie starts to go through heroin withdrawl, struggling with his resolve. Jack is trapped in a cave-in, and Charlie becomes trapped with him when the first rescue tunnel collapses as well. Kate, Sayid, and Sawyer attempt to triangulate the position of the distress signal coming from the island. Charlie has flashbacks of his rock band, and his decent into drug abuse."
}, {
  "imdbId" : "0411008",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Confidence Man",
  "description" : "Shannon is having an asthma attack, and Boone is sure that Sawyer has her medications. As Kate's way of dealing with this situation doesn't work, Sayid takes things into his own hands.."
}, {
  "imdbId" : "0411008",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "Solitary",
  "description" : "Ashamed with his behavior torturing Sawyer, Sayid Jarrah decides to leave the group of survivors and travel alone through the island, trying to find the source of transmission and map the place. He is arrested and tortured by the French survivor Danielle Rousseau and recalls his beloved Nadia back to his days years earlier in Iraq as part of the interrogation/torturer for the Republican Guard. Meanwhile, Hurley decides to get the survivors spirits up by getting up a golf course in a sunny field."
}, {
  "imdbId" : "0411008",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "Raised by Another",
  "description" : "Claire begins to have reoccurring nightmares which one night result in her turning up with bloody hands, which leads Charlie to find out what is really going on. However, Jack isn't sure that anything really happened. Meanwhile, Hurley finds the flight manifest and discovers something shocking about a certain passenger."
}, {
  "imdbId" : "0411008",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "All the Best Cowboys Have Daddy Issues",
  "description" : "Jack, Kate, Locke and Boone go after Ethan, Claire and Charlie. They separate, and while Jack and Kate confront Ethan, Locke and Boon find another mystery at the jungle. Flashbacks reveal more about Jack's past with his dad."
}, {
  "imdbId" : "0411008",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "Whatever the Case May Be",
  "description" : "Kate and Sawyer discover a briefcase and the race begins to win ownership of it. Charlie is still depressed over Claire, and is given a sharp talking to by Rose."
}, {
  "imdbId" : "0411008",
  "season" : "1",
  "episodeNumber" : "13",
  "title" : "Hearts and Minds",
  "description" : "Boone Carlyle is jealous of Sayid Jarrah, because he becomes close to his half-sister Shannon Rutherford. Boone tells John Locke that he wants to reveal the secret about the hatch in the woods to Shannon. Locke hits Boone, heals his head with a medicine and fastens him with a rope in a tree, living him alone in the forest. Boone's background story reveals his complicated relationship with the irresponsible Shannon, and about why he ventured to Australia to rescue her from a bad relationship, while in the present he tries to save her from the unseen forest creature. ..."
}, {
  "imdbId" : "0411008",
  "season" : "1",
  "episodeNumber" : "14",
  "title" : "Special",
  "description" : "John Locke is teaching Walt Lloyd to throw knives, and Michael Dawson feels jealous with the situation. He forbids Walt to meet Locke, and recalls his romance with Walt's mother Susan Lloyd (Tamara Taylor), an overachieving executive who took the infant Walt away, and having an awkward reunion 10 years later with the uncertain and spoiled Walt in Australia. Walt becomes upset with the situation and decides to hike with his dog Vincent into the woods. At the end, Locke and Boone Carlyle find Claire Littleton wandering in the forest."
}, {
  "imdbId" : "0411008",
  "season" : "1",
  "episodeNumber" : "15",
  "title" : "Homecoming",
  "description" : "After the missing Claire returns with no recollection of what has happened since before the doomed flight of Oceanic 815, Jack and Locke formulate a plan of defense against her kidnapper, the mysterious Ethan Rom, who threatens to kill off the other survivors unless Claire is returned to him. Meanwhile, the disappointment Charlie feels when Claire does not remember him triggers recollections of Lucy, a woman he had let down in the past back in England where Charlie ruined their engagement so he could steal money from her to fuel his escalating heroin addition."
}, {
  "imdbId" : "0411008",
  "season" : "1",
  "episodeNumber" : "16",
  "title" : "Outlaws",
  "description" : "Sawyer believes that a boar is harassing him. So he and Kate go to find it. They bond on the journey. They run into Locke, who tells them a story that seems to mean something to Sawyer."
}, {
  "imdbId" : "0411008",
  "season" : "1",
  "episodeNumber" : "17",
  "title" : "...In Translation",
  "description" : "When Jin Kwon is having a serious quarrel with his wife Sun Kwon, Michael Dawson defends her. Later, when Michael's raft is set afire and Jin has his arms injured by heat, Michael and Sawyer blame him for the incident. Sun finally reveals her secret when she speaks in English to defend her husband and he feels ashamed leaving her. Jin recalls how his love for Sun was destroyed by her evil and unscrupulous father."
}, {
  "imdbId" : "0411008",
  "season" : "1",
  "episodeNumber" : "18",
  "title" : "Numbers",
  "description" : "When Hurley becomes obsessed with the French woman and heads into the jungle to find her, Jack, Sayid and Charlie have no choice but to follow. Meanwhile, Locke asks Claire to help build a mysterious item."
}, {
  "imdbId" : "0411008",
  "season" : "1",
  "episodeNumber" : "19",
  "title" : "Deus Ex Machina",
  "description" : "Locke and Boone build a trebuchet in an attempt to open the hatch, but Locke is injured when the trebuchet fails. Literally following a hallucination, Locke and Boone discover a small plane crashed high in a tree. Sawyer, suffering from severe headaches, is forced to turn to Jack for help."
}, {
  "imdbId" : "0411008",
  "season" : "1",
  "episodeNumber" : "20",
  "title" : "Do No Harm",
  "description" : "Claire goes into labor while a helpless Charlie goes into panic mode. Meanwhile Locke is missing, Jack tends to a wounded survivor and Sayid presents Shannon with a romantic surprise."
}, {
  "imdbId" : "0411008",
  "season" : "1",
  "episodeNumber" : "21",
  "title" : "The Greater Good",
  "description" : "After burying one of their own, tempers flare as the castaways' suspicions of each other grow -- and an unlikely survivor vows revenge. Meanwhile, Claire and Charlie struggle to calm her newborn."
}, {
  "imdbId" : "0411008",
  "season" : "1",
  "episodeNumber" : "22",
  "title" : "Born to Run",
  "description" : "Jack suspects foul play when Michael becomes violently ill while building the raft. Meanwhile a secret from Kate's past is revealed, the mysterious hatch is shown to a few of the survivors, and Walt gives Locke a warning."
}, {
  "imdbId" : "0411008",
  "season" : "1",
  "episodeNumber" : "23",
  "title" : "Exodus: Part 1",
  "description" : "Danielle Rousseau arrives in the camp of survivors at the beach and advises that \"The Others\" are coming. There is black smoke in the sky, and they have three choices: run, hide, or die. Jack recalls his meeting with Ana-Lucia Cortez in the airport. Meanwhile, the group is about to launch the raft. Sawyer tells Jack the conversation he had with his father in a bar in Australia. Jack, Kate, Locke, Hurley and Leslie Arzt go on an expedition to bring explosives from the Black Rock to blow the hatch. There they can shelter the survivors against \"The Others\". Meanwhile, ..."
}, {
  "imdbId" : "0411008",
  "season" : "1",
  "episodeNumber" : "24",
  "title" : "Exodus: Part 2",
  "description" : "(Part II of II) The castaways on the raft are surprised at sea by something unexpected. Meanwhile, remaining islanders attempt to blow open the hatch, and a visitor to the encampment might be a threat to Claire's infant son."
}, {
  "imdbId" : "0411008",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "Man of Science, Man of Faith",
  "description" : "One of the castaways is chosen to descend into the mysterious hatch, and Shannon stumbles upon a shockingly familiar face in the jungle."
}, {
  "imdbId" : "0411008",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "Adrift",
  "description" : "After the raft explodes, Michael and Sawyer are left on what is left on the raft. They argue and nearly get eaten by a shark. Jin is no where in sight; Meanwhile, what happened to Locke and Kate when they went into the hatch is revealed."
}, {
  "imdbId" : "0411008",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "Orientation",
  "description" : "Jack, Locke and Kate learn more secrets about the hatch. Meanwhile, after being beaten and taken captive, Sawyer, Michael and Jin wonder if their captors are fellow survivors or the dreaded \"Others.\""
}, {
  "imdbId" : "0411008",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "Everybody Hates Hugo",
  "description" : "Disturbing memories from Hurley's past cause him to struggle with a task he's assigned inside the hatch to watch over the food storage locker. Meanwhile Sawyer, Michael and Jin discover the identities of their captors whom are what's left of a group of two dozen Flight 815 survivors from the tail end of the plane led by the tough minded Ana-Lucia Cortez who insists they walk to a more secure location. Claire uncovers a shocking piece of information about the fate of the raft when the message bottled washes ashore."
}, {
  "imdbId" : "0411008",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "...And Found",
  "description" : "A desperate and growingly insane Michael sets off into the jungle by himself determined to find Walt, but discovers that he is not alone. Meanwhile, Sawyer and Jin are ordered by their captors, the tail crash survivors, to take them to their camp. But they are delayed when Jin and the hulking Mr. Eko are forced to go into the jungle to look for Michael before the dreaded \"others\" find him first. Back at the beach camp, Sun frantically searches for her missing wedding ring which triggers flashbacks to Sun and Jin's past showing how they met for the first time in early ..."
}, {
  "imdbId" : "0411008",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "Abandoned",
  "description" : "Sawyer's wound becomes life-threatening as he, Michael and Jin make their way through the interior of the island with the tail section survivors, Ana-Lucia, Mr. Eko, Bernard, Libby, and flight attendant Cindy. Meanwhile, Shannon is once again haunted by visions of Walt, but she cannot convince a skeptic Sayid that her visions are real. More of Shannon's background story shows her difficult relationship with her late half-brother Boone and further detailing how her step-mother financially cut her off after the death of their father. Also, Charlie becomes jealous of ..."
}, {
  "imdbId" : "0411008",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "The Other 48 Days",
  "description" : "48 days ago, the tail section of Flight 815 crashes. The survivors struggle to live when some other people on the island continue to kidnap some of them."
}, {
  "imdbId" : "0411008",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "Collision",
  "description" : "Tempers flare when Ana Lucia and her group stumble upon Sayid and the other castaways."
}, {
  "imdbId" : "0411008",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "What Kate Did",
  "description" : "Kate's original crime that started her life on the run is revealed. Meanwhile, the survivors lay one of their own to rest, Kate sleeplessly watches over a feverish Sawyer, and Mr. Eko has a surprise for Locke regarding the hatch."
}, {
  "imdbId" : "0411008",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "The 23rd Psalm",
  "description" : "When Claire comments to Mr. Eko about the Virgin Mary statue which belongs to Charlie, he asks to see it, breaks it open, and exposes Charlie's secret to Claire. Mr. Eko makes Charlie show him the place where he found the crashed plane, while his past in Nigeria is presented in flashback. John Locke teaches Michael how to shoot a rifle, and Michael uses the computer to contact someone he believes to be Walt. Claire does not want Charlie to live close to her and her son any longer."
}, {
  "imdbId" : "0411008",
  "season" : "2",
  "episodeNumber" : "11",
  "title" : "The Hunting Party",
  "description" : "Jack, Locke and Sawyer follow Michael who left to look for his son. They meet \"the others\". More is shown about Jack's back-story."
}, {
  "imdbId" : "0411008",
  "season" : "2",
  "episodeNumber" : "12",
  "title" : "Fire + Water",
  "description" : "When Charlie's vividly surreal dreams lead him to believe Claire's baby, Aaron, is in danger, Locke suspects Charlie may be using drugs again. More of Charlie's background story shows his difficult relationship with his heroin addicted brother. Meanwhile, Sawyer encourages Hurley to act on his attraction to Libby."
}, {
  "imdbId" : "0411008",
  "season" : "2",
  "episodeNumber" : "13",
  "title" : "The Long Con",
  "description" : "Survivors fear that \"The Others\" may have returned when Sun is injured during a failed kidnapping attempt. Meanwhile, Sawyer is an amused, but highly interested, bystander when tension escalates between Jack, Locke, Kate and Ana Lucia over control of the hatch computer, and the storage of the weapons."
}, {
  "imdbId" : "0411008",
  "season" : "2",
  "episodeNumber" : "14",
  "title" : "One of Them",
  "description" : "The mysterious French woman, Danielle Rousseau returns to lead Sayid to a mysterious captive who claims he crashed on the island. Meanwhile, Sawyer recruits Hurley to help him find another island animal that is harassing him: a loud tree frog."
}, {
  "imdbId" : "0411008",
  "season" : "2",
  "episodeNumber" : "15",
  "title" : "Maternity Leave",
  "description" : "When Claire's baby falls ill, she becomes determined to find out what happened to her to regain her memory during her captivity with the Others, triggering flashbacks to her experience among the Others, and her ordeals concerning her baby. Also, Mr. Eko learns about Henry Gale and asks Jack and Loche to give him a meeting with their captive."
}, {
  "imdbId" : "0411008",
  "season" : "2",
  "episodeNumber" : "16",
  "title" : "The Whole Truth",
  "description" : "When Sun comes to the realization that she might be pregnant, she struggles on whether to tell Jin about the situation. After no success from Jack or Sayid, Ana-Lucia is called in by Locke to interrogate the prisoner, Henry Gale, to get more information out of him about how he arrived on the island. Ana-Lucia, Sayid, and Charlie then set out into the jungle to try and confirm Henry's story."
}, {
  "imdbId" : "0411008",
  "season" : "2",
  "episodeNumber" : "17",
  "title" : "Lockdown",
  "description" : "When the hatch suddenly takes on a life of its own, Locke is trapped alone in the bunker and is forced to enlist the help of an unlikely ally: the captive Henry Gale to try to free him. Meanwhile, Jack faces off against Sawyer in a series of card games for supplies. Also, Ana Lucia, Sayid and Charlie find out the truth about Henry in the jungle."
}, {
  "imdbId" : "0411008",
  "season" : "2",
  "episodeNumber" : "18",
  "title" : "Dave",
  "description" : "Hurley begins to think the island is affecting him in a very strange way, so Libby attempts to offer him support. Hurley also recalls his past in a mental hospital with his friend Dave. Meanwhile, the prisoner calling himself Henry Gale offers new information about the Hatch, which severely shakes Locke's sense of purpose."
}, {
  "imdbId" : "0411008",
  "season" : "2",
  "episodeNumber" : "19",
  "title" : "S.O.S.",
  "description" : "Bernard tries to convince the survivors to build a S.O.S. signal with rocks on the sand, hoping to be seen by a satellite or an airplane. His first encounter with Rose, who was terminal, and their romance, are disclosed through flashbacks. Bernard never gives up searching for the cure of Rose before crashing the island. Meanwhile, Jack invites Kate to join him in the woods to propose to \"The Others\" a trade between Henry and Walt. John Locke is intrigued with the words of Henry about the unnecessary use of the computer. Is Henry playing him for a fool? Elsewhere, ..."
}, {
  "imdbId" : "0411008",
  "season" : "2",
  "episodeNumber" : "20",
  "title" : "Two for the Road",
  "description" : "Jack and Kate bring an exhausted Michael back to camp where he has news about \"The Others\". Meanwhile, Ana Lucia attempts to get the prisoner, Henry Gale to confess to being a spy for the Others, and he attempts to kill her. Also, Hurley plans a surprise date for Libby."
}, {
  "imdbId" : "0411008",
  "season" : "2",
  "episodeNumber" : "21",
  "title" : "?",
  "description" : "Mr. Eko enlists Locke to help find a secret location he believes houses answers to the island's mysteries. Meanwhile, Jack, Sawyer, and Kate struggle to cope with the horrific situation in the hatch following the escape of \"Other\" Henry Gale, and of the shooting deaths of Ana-Lucia and Libby, unaware that it was Michael who is responsible."
}, {
  "imdbId" : "0411008",
  "season" : "2",
  "episodeNumber" : "22",
  "title" : "Three Minutes",
  "description" : "Michael's whereabouts during his 13 days in captivity in the \"Others\" camp are detailed while in the present, he tries to convince Jack to help him mount a search party for his son Walt still being held captive. Meanwhile, Locke struggles with a choice whether or not to abandon the hatch."
}, {
  "imdbId" : "0411008",
  "season" : "2",
  "episodeNumber" : "23",
  "title" : "Live Together, Die Alone",
  "description" : "After discovering a sailboat just offshore containing former hatch oversee Desmond, Jack and Sayid come up with a plan to confront \"The Others\" and hopefully get Walt back. Meanwhile, Eko and Locke come to blows as Locke makes a potentially cataclysmic decision regarding the \"button\" and the hatch."
}, {
  "imdbId" : "0411008",
  "season" : "3",
  "episodeNumber" : "1",
  "title" : "A Tale of Two Cities",
  "description" : "Now prisoners of \"The Others,\" head games begin for Jack, Kate, and Sawyer."
}, {
  "imdbId" : "0411008",
  "season" : "3",
  "episodeNumber" : "2",
  "title" : "The Glass Ballerina",
  "description" : "Sayid's attempt to rescue Jack, Kate and Sawyer from the others jeopardizes Sun and Jin's lives."
}, {
  "imdbId" : "0411008",
  "season" : "3",
  "episodeNumber" : "3",
  "title" : "Further Instructions",
  "description" : "Locke experiences visions of Boone, leading him to a new mystery on the island."
}, {
  "imdbId" : "0411008",
  "season" : "3",
  "episodeNumber" : "4",
  "title" : "Every Man for Himself",
  "description" : "The Others perform a sadistic medical procedure on Sawyer in order to prevent him from causing any more mischief."
}, {
  "imdbId" : "0411008",
  "season" : "3",
  "episodeNumber" : "5",
  "title" : "The Cost of Living",
  "description" : "After Mr. Eko has a vision of his dead brother, he sets out to return to the site of his plane crash."
}, {
  "imdbId" : "0411008",
  "season" : "3",
  "episodeNumber" : "6",
  "title" : "I Do",
  "description" : "Kate desperately tries to protect Sawyer from being killed by The Others. But at the same time, The Others plan to use her as a pawn on Jack to get him to perform surgery on Ben."
}, {
  "imdbId" : "0411008",
  "season" : "3",
  "episodeNumber" : "7",
  "title" : "Not in Portland",
  "description" : "Sawyer and Kate struggle to escape the island while Jack sabotages Ben's surgery, and Juliet's plan to make a deal with Jack to kill Ben on the operating table is exposed."
}, {
  "imdbId" : "0411008",
  "season" : "3",
  "episodeNumber" : "8",
  "title" : "Flashes Before Your Eyes",
  "description" : "After Desmond saves Claire from drowning, Charlie and Hurley suspect that he can see the future. So they try to get him drunk to get some answers out of him."
}, {
  "imdbId" : "0411008",
  "season" : "3",
  "episodeNumber" : "9",
  "title" : "Stranger in a Strange Land",
  "description" : "Sawyer, Kate, and Karl reach their Island at night, and a reluctant Kate wishes to return for Jack. Meanwhile, Jack is interrogated by \"Others\" constable, Isabel about the incident with Juliet. When she mentions the meaning of his tattoo, he recalls his vacation in the paradisaical island of Phuket, in Thailand, where he dated the sexy, mystic, and mysterious local Achara. Ben has an infection in his spinal column, and Jack negotiates the freedom of Juliet, who was going to be sentenced to death for Pickett's murder. Later Jack recalls what happened to him when he ..."
}, {
  "imdbId" : "0411008",
  "season" : "3",
  "episodeNumber" : "10",
  "title" : "Tricia Tanaka Is Dead",
  "description" : "Having returned to camp, Sawyer's help is enlisted by Hugo, who has an obsession with retrieving an old VW van found on the island. More events in Hugo's life are also revealed, showing what brought him to be on the doomed flight."
}, {
  "imdbId" : "0411008",
  "season" : "3",
  "episodeNumber" : "11",
  "title" : "Enter 77",
  "description" : "Sayid, John and Kate find another Dharma station on their way to rescue Jack. In the meantime Sawyer tries to get his stuff back in the camp."
}, {
  "imdbId" : "0411008",
  "season" : "3",
  "episodeNumber" : "12",
  "title" : "Par Avion",
  "description" : "Claire launches a plan to use migratory birds to send a message, but she doesn't understand why Desmond keeps sabotaging it. Elsewhere on the island, Sayid, Locke and Kate scale The Others' protective perimeter and discover their camp."
}, {
  "imdbId" : "0411008",
  "season" : "3",
  "episodeNumber" : "13",
  "title" : "The Man from Tallahassee",
  "description" : "Jack tells Kate that he has made a deal with The Others and is leaving via submarine tomorrow. But Locke blows up the submarine before Jack can leave, after having a long conversation with Ben about the island's powers."
}, {
  "imdbId" : "0411008",
  "season" : "3",
  "episodeNumber" : "14",
  "title" : "Exposé",
  "description" : "Nikki and Paulo are two more of the castaways with a past just like any of the others. What have they been doing since the plane crash?"
}, {
  "imdbId" : "0411008",
  "season" : "3",
  "episodeNumber" : "15",
  "title" : "Left Behind",
  "description" : "With their secret location now compromised, The Others abandon camp and take Locke with them. But they also leave Juliet behind, handcuffed to Kate in the middle of the jungle."
}, {
  "imdbId" : "0411008",
  "season" : "3",
  "episodeNumber" : "16",
  "title" : "One of Us",
  "description" : "Jack takes Juliet back to their camp after being abandoned by The Others. However, nobody else at the camp trusts her or wants her there, until she saves Claire's life."
}, {
  "imdbId" : "0411008",
  "season" : "3",
  "episodeNumber" : "17",
  "title" : "Catch-22",
  "description" : "Desmond's latest fragmented vision suggests that his old girlfriend, Penny, will crash-land onto the island. Desmond organizes a posse of himself, Hurley, Jin, and Charlie to come along with him into the jungle expecting Penny to parachute onto the island. But the vision also suggests that Charlie will die by stumbling upon a trip-wire if he comes along with them. But Desmond insists that Charlie must come along to make the vision come true. Meanwhile, Desmond recalls his days in a monastery in Scotland over 10 years earlier after leaving his old fiancée, Ruth, a few ..."
}, {
  "imdbId" : "0411008",
  "season" : "3",
  "episodeNumber" : "18",
  "title" : "D.O.C.",
  "description" : "An unlikely person helps Desmond save the life of the mysterious woman who crashed onto the island, and Juliet helps Sun find out whether she conceived on the island or before the plane crash."
}, {
  "imdbId" : "0411008",
  "season" : "3",
  "episodeNumber" : "19",
  "title" : "The Brig",
  "description" : "Locke tells Sawyer that he needs to come with him to kill Ben. But the man Locke wants him to kill is actually his father--who also happens to be a figure from Sawyer's past."
}, {
  "imdbId" : "0411008",
  "season" : "3",
  "episodeNumber" : "20",
  "title" : "The Man Behind the Curtain",
  "description" : "As Ben takes Locke to see Jacob and reveal the island's secrets, Ben's background on the island is exposed--as well as what happened to the Dharma Initiative."
}, {
  "imdbId" : "0411008",
  "season" : "3",
  "episodeNumber" : "21",
  "title" : "Greatest Hits",
  "description" : "Desmond has another vision of Charlie's death, but this time his death ultimately will result in Claire's rescue. Meanwhile, the survivors discover that an attack by the others is even more imminent than originally expected."
}, {
  "imdbId" : "0411008",
  "season" : "3",
  "episodeNumber" : "22",
  "title" : "Through the Looking Glass",
  "description" : "Jack and the survivors wait for Charlie to turn off The Others' signal-jamming device, not knowing that he has been captured at the Looking Glass station. In addition, Sayid, Jin and Bernard are captured after The Others invade the camp."
}, {
  "imdbId" : "0411008",
  "season" : "4",
  "episodeNumber" : "1",
  "title" : "The Beginning of the End",
  "description" : "Charlie's dying message casts doubt on the intentions of the people that Jack believes to be their rescuers. A power struggle ensues between Jack, who wants to leave the island, and Locke, who thinks that they're supposed to stay."
}, {
  "imdbId" : "0411008",
  "season" : "4",
  "episodeNumber" : "2",
  "title" : "Confirmed Dead",
  "description" : "The surviving members of the supposed \"rescue team\" are scattered around the island after a helicopter problem. However, once they are located, they reluctantly reveal that they are indeed not there to rescue them."
}, {
  "imdbId" : "0411008",
  "season" : "4",
  "episodeNumber" : "3",
  "title" : "The Economist",
  "description" : "Sayid negotiates a deal with Locke to hand over Charlotte from the \"rescue team,\" so that he can get on their helicopter and reach their ship. Kate joins Sayid for the mission, but she decides to stay behind with Sawyer."
}, {
  "imdbId" : "0411008",
  "season" : "4",
  "episodeNumber" : "4",
  "title" : "Eggtown",
  "description" : "Kate goes behind Locke's back to arrange a meeting between Miles and Ben, where Miles offers his terms for not giving Ben up to his colleagues. However, Locke discovers what she has done, and banishes her from his camp."
}, {
  "imdbId" : "0411008",
  "season" : "4",
  "episodeNumber" : "5",
  "title" : "The Constant",
  "description" : "During the helicopter ride to the ship, Desmond's consciousness begins jumping back and forth between present day 2004 and 1996. He is forced to find Daniel Faraday in 1996 in order to get answers and stop the jumps."
}, {
  "imdbId" : "0411008",
  "season" : "4",
  "episodeNumber" : "6",
  "title" : "The Other Woman",
  "description" : "Daniel and Charlotte leave Jack's camp to fulfill their objective, and Jack and Juliet try to track them down before they are successful. Juliet's romantic history on the island with The Others is exposed."
}, {
  "imdbId" : "0411008",
  "season" : "4",
  "episodeNumber" : "7",
  "title" : "Ji Yeon",
  "description" : "Juliet exposes Sun's pre-island affair to Jin so that they won't defect to Locke's camp. Sayid and Desmond meet the ship's captain and discover that Michael is working on the boat."
}, {
  "imdbId" : "0411008",
  "season" : "4",
  "episodeNumber" : "8",
  "title" : "Meet Kevin Johnson",
  "description" : "Michael's journey from escaping the island to working as Ben's spy on Widmore's ship is revealed, as well as his mission. Ben tells Danielle and Alex to leave Locke's camp and go to the island temple, but they are ambushed on the way."
}, {
  "imdbId" : "0411008",
  "season" : "4",
  "episodeNumber" : "9",
  "title" : "The Shape of Things to Come",
  "description" : "The team from the ship attacks Locke's camp looking for Ben, with Alex as a hostage. Meanwhile, the doctor from the ship washes up on shore at Jack's camp, and Daniel Faraday provides some distressing news to Jack."
}, {
  "imdbId" : "0411008",
  "season" : "4",
  "episodeNumber" : "10",
  "title" : "Something Nice Back Home",
  "description" : "Juliet is forced to perform an emergency appendectomy on Jack, Jack's post-rescue relationship with Kate is revealed, and Sawyer, Claire, and Aaron head back to Jack's camp with Miles."
}, {
  "imdbId" : "0411008",
  "season" : "4",
  "episodeNumber" : "11",
  "title" : "Cabin Fever",
  "description" : "Locke, Ben, and Hurley continue their search for the cabin so that Locke can talk to Jacob. Back on the boat, Keamy prepares to take off again, this time for a all-out assault on the island."
}, {
  "imdbId" : "0411008",
  "season" : "4",
  "episodeNumber" : "12",
  "title" : "There's No Place Like Home: Part 1",
  "description" : "Ben, Locke, and Hurley go to The Orchid, but Keamy and his men beat them there. Jack and Kate go after the helicopter, and are later joined by Sawyer. Sayid comes back to the island with a rescue boat, and then goes after them too."
}, {
  "imdbId" : "0411008",
  "season" : "4",
  "episodeNumber" : "13",
  "title" : "There's No Place Like Home: Part 2",
  "description" : "Ben tries to escape Keamy's custody so that he and Locke can follow through with Jacob's request to move the island. Michael tries to neutralize the explosives on the boat, while the \"Oceanic 6\" move closer to rescue."
}, {
  "imdbId" : "0411008",
  "season" : "4",
  "episodeNumber" : "14",
  "title" : "There's No Place Like Home: Part 3",
  "description" : "In the season finale, the Oceanic Six find themselves closer to rescue."
}, {
  "imdbId" : "0411008",
  "season" : "5",
  "episodeNumber" : "1",
  "title" : "Because You Left",
  "description" : "As a result of Ben moving the island, the survivors left on the island begin skipping through time. Meanwhile, three years later in Los Angeles, Ben starts convincing the Oceanic 6 to return to the island."
}, {
  "imdbId" : "0411008",
  "season" : "5",
  "episodeNumber" : "2",
  "title" : "The Lie",
  "description" : "While Ben and Jack try to round the Oceanic 6 up, Sayid and Hurley are on the run from the law. Meanwhile, back on the island, the survivors, still skipping through time, come under attack."
}, {
  "imdbId" : "0411008",
  "season" : "5",
  "episodeNumber" : "3",
  "title" : "Jughead",
  "description" : "Desmond returns to Oxford to fulfill Faraday's request to find his mother. Back on the island, the survivors discover that they've run into The Others 50 years in the past, but Richard Alpert is the same age."
}, {
  "imdbId" : "0411008",
  "season" : "5",
  "episodeNumber" : "4",
  "title" : "The Little Prince",
  "description" : "In Los Angeles, Kate tries to find out who is trying to take Aaron away from her. Back on the island, Locke convinces everyone that they have to go to The Orchid."
}, {
  "imdbId" : "0411008",
  "season" : "5",
  "episodeNumber" : "5",
  "title" : "This Place Is Death",
  "description" : "In order to avoid being killed, Ben promises to offer proof to Sun that Jin is still alive. On the island, Jin meets up with the survivors as Locke reaches The Orchid and fulfills his mission."
}, {
  "imdbId" : "0411008",
  "season" : "5",
  "episodeNumber" : "6",
  "title" : "316",
  "description" : "Eloise explains that the Oceanic 6 have a very limited window to return to the island, and leaves Jack instructions to bring one of his father's items to John Locke."
}, {
  "imdbId" : "0411008",
  "season" : "5",
  "episodeNumber" : "7",
  "title" : "The Life and Death of Jeremy Bentham",
  "description" : "John Locke, now alive again and back on the island after the second plane crash, flashes back to his return to civilization, where he is brought in by Charles Widmore and asked to convince the Oceanic 6 to return to the island."
}, {
  "imdbId" : "0411008",
  "season" : "5",
  "episodeNumber" : "8",
  "title" : "LaFleur",
  "description" : "The survivors left on the island, now led by Sawyer after Locke's departure, find themselves back in the 1970s, where they are now forced to become members of the Dharma Initiative."
}, {
  "imdbId" : "0411008",
  "season" : "5",
  "episodeNumber" : "9",
  "title" : "Namaste",
  "description" : "Jack, Kate and Hurley wind up on the island in 1977, where they meet up with Sawyer and also join the Dharma Initiative. Meanwhile, Sun is stuck on the island in the present with Ben and the other passengers after the plane crash."
}, {
  "imdbId" : "0411008",
  "season" : "5",
  "episodeNumber" : "10",
  "title" : "He's Our You",
  "description" : "Sayid is held as a prisoner by the Dharma Initiative, presumed to be a Hostile. However, during his capture, he believes he has discovered the reason why he's back on the island."
}, {
  "imdbId" : "0411008",
  "season" : "5",
  "episodeNumber" : "11",
  "title" : "Whatever Happened, Happened",
  "description" : "Jack refuses to help save young Ben after Sayid shoots him, so Sawyer and Kate turn to Richard Alpert for help. Meanwhile, what Sawyer said to Kate on the chopper is revealed, as well as what Kate did with Aaron before the flight."
}, {
  "imdbId" : "0411008",
  "season" : "5",
  "episodeNumber" : "12",
  "title" : "Dead Is Dead",
  "description" : "Ben and Locke return to the island, where Ben says he is going to summon the Smoke \"monster\" and atone for his daughter's death. In addition, the falling-out on the island between Ben and Charles Widmore is revealed."
}, {
  "imdbId" : "0411008",
  "season" : "5",
  "episodeNumber" : "13",
  "title" : "Some Like It Hoth",
  "description" : "Miles is chosen by Horace to transport a dead body across the island. During the trip, Miles reveals to Hurley that Dr. Pierre Chang (a.k.a. Dr. Marvin Candle) is his father, whom he resents for leaving him and his mother."
}, {
  "imdbId" : "0411008",
  "season" : "5",
  "episodeNumber" : "14",
  "title" : "The Variable",
  "description" : "Faraday returns to the island and tells Jack that his mother, Eloise Hawking, lied to them--they don't belong on the island. He then initiates a dangerous plan to get them back home."
}, {
  "imdbId" : "0411008",
  "season" : "5",
  "episodeNumber" : "15",
  "title" : "Follow the Leader",
  "description" : "Jack attempts to follow through with Daniel Faraday's plan to detonate the hydrogen bomb after Faraday is killed, Locke instructs Alpert to take him to Jacob, and Sawyer is interrogated about an incriminating surveillance video."
}, {
  "imdbId" : "0411008",
  "season" : "5",
  "episodeNumber" : "16",
  "title" : "The Incident: Part 1",
  "description" : "Jack and Sayid's plan faces resistance from Sawyer, Juliet, and Kate. Ben and The Others/Hostiles reach Jacob at the Foot of the Statue, and are soon met by the 316 survivors, who reveal the contents of their mysterious package."
}, {
  "imdbId" : "0411008",
  "season" : "5",
  "episodeNumber" : "17",
  "title" : "The Incident: Part 2",
  "description" : "Jack and Sawyer fight against each other about the fate of the island and the passengers of the Oceanic Flight 815 but Juliet ends the discussion, changing her mind. In the Swan station, Radzinsky is informed by Phil that a group is heading to the spot with a bomb. There is a shooting between Jack's group and Radzinsky's group with tragic consequences. Meanwhile, Locke, Ben, Sun, Richard and The Others head to the temple to meet Jacob. Locke and Ben enter in the temple and Ben stabs Jacob to death. Ilana reaches Richard and The Others and shows the content of the box ..."
}, {
  "imdbId" : "0411008",
  "season" : "6",
  "episodeNumber" : "1",
  "title" : "LA X - Part 1",
  "description" : "Flight 815 is shown successfully landing in Los Angeles with no crash on the island, but the survivors are simultaneously shown still on the island after Juliet detonates the bomb."
}, {
  "imdbId" : "0411008",
  "season" : "6",
  "episodeNumber" : "2",
  "title" : "LA X - Part 2",
  "description" : "Sawyer buries Juliet with Miles while Jack, Kate, Hurley and Jin bring Sayid to the underground of the temple; out of the blue, they are attacked by mysterious natives. Hurley shows the guitar case that Jacob gave to him and save the group. Sawyer asks Miles to tell him what Juliet wanted to tell him. Sayid is drowned by the natives and dies. Sawyer and Miles are captured by the natives and Hurley is interrogated and tells that Jacob is dead, panicking the natives. John attacks Richard in front of his group. Meanwhile, in a parallel reality, Kate succeeds to escape ..."
}, {
  "imdbId" : "0411008",
  "season" : "6",
  "episodeNumber" : "3",
  "title" : "What Kate Does",
  "description" : "Sayid miraculously comes back to life, but his problems have only just begun. Sawyer escapes, and Kate and Jin go after him. Back in Los Angeles, fugitive Kate helps Claire as she goes into labor."
}, {
  "imdbId" : "0411008",
  "season" : "6",
  "episodeNumber" : "4",
  "title" : "The Substitute",
  "description" : "On the island, the being now occupying Locke's body turns to Sawyer and promises to tell him why he's on the island. Back in Los Angeles, Locke loses his job and encounters a number of familiar faces."
}, {
  "imdbId" : "0411008",
  "season" : "6",
  "episodeNumber" : "5",
  "title" : "Lighthouse",
  "description" : "Jacob sends Hurley on a mission across the island, but Jack must accompany him. In Los Angeles, Jack's difficult relationship with his son is revealed. Meanwhile, Jin discovers that Claire thinks the people at the temple stole her son."
}, {
  "imdbId" : "0411008",
  "season" : "6",
  "episodeNumber" : "6",
  "title" : "Sundown",
  "description" : "Claire arrives at the temple and warns the inhabitants that the being inhabiting Locke wants to talk, but Dogen sends Sayid to kill him instead. In Los Angeles, Sayid saves his brother, who is in trouble with a loan shark."
}, {
  "imdbId" : "0411008",
  "season" : "6",
  "episodeNumber" : "7",
  "title" : "Dr. Linus",
  "description" : "Ilana prepares to kill Ben after Miles reveals that Ben killed Jacob. In Los Angeles, Ben contemplates a power play at his high school. Meanwhile Richard and Jack share their secrets and experiences with Jacob and form an alliance."
}, {
  "imdbId" : "0411008",
  "season" : "6",
  "episodeNumber" : "8",
  "title" : "Recon",
  "description" : "Locke sends Sawyer on a recon mission to the other island, where he runs into Charles Widmore and his submarine crew. In Los Angeles, Sawyer works as a police officer obsessed with finding the conman who destroyed his family."
}, {
  "imdbId" : "0411008",
  "season" : "6",
  "episodeNumber" : "9",
  "title" : "Ab Aeterno",
  "description" : "The mysteries behind Richard Alpert's arrival to the island, his immortality, and his alliance with Jacob are revealed--plus more details about the purpose of the island and the relationship between Jacob and the smoke monster."
}, {
  "imdbId" : "0411008",
  "season" : "6",
  "episodeNumber" : "10",
  "title" : "The Package",
  "description" : "Sun and Jin's search for each other is interrupted when Widmore's crew kidnaps Jin, and Locke heads to the other island to bring him back. In Los Angeles, Jin's job for Sun's father is sidetracked when his money is taken at customs."
}, {
  "imdbId" : "0411008",
  "season" : "6",
  "episodeNumber" : "11",
  "title" : "Happily Ever After",
  "description" : "Charles Widmore brings Desmond back to the island so that he can conduct a dangerous electromagnetic experiment, which sends him back to the alternate reality in Los Angeles, a reality where he has never met Penny."
}, {
  "imdbId" : "0411008",
  "season" : "6",
  "episodeNumber" : "12",
  "title" : "Everybody Loves Hugo",
  "description" : "Michael appears to Hurley and gives him a new mission, and Sayid captures Desmond and sends him to Locke. In Los Angeles, Desmond sets up a meeting between Libby and Hurley to further his assignment."
}, {
  "imdbId" : "0411008",
  "season" : "6",
  "episodeNumber" : "13",
  "title" : "The Last Recruit",
  "description" : "As the battle between Locke and Widmore commences, Sawyer launches his plan to change allegiances. Back in Los Angeles, fate continues to intervene and bring the original survivors together."
}, {
  "imdbId" : "0411008",
  "season" : "6",
  "episodeNumber" : "14",
  "title" : "The Candidate",
  "description" : "With Jack's help, Locke rescues the candidates from Widmore's compound, but their plans for leaving the island are forced to change. In Los Angeles, Jack tries to convince Locke to try an experimental surgery for his paralysis."
}, {
  "imdbId" : "0411008",
  "season" : "6",
  "episodeNumber" : "15",
  "title" : "Across the Sea",
  "description" : "The story of how Jacob and his brother came to the island, their uneasy relationship with their \"mother,\" their eventual falling-out, and revelation of what Jacob was on the island to protect."
}, {
  "imdbId" : "0411008",
  "season" : "6",
  "episodeNumber" : "16",
  "title" : "What They Died For",
  "description" : "Jacob appears to the survivors of the submarine explosion and tells them what they were chosen for, while Ben joins forces with Locke as they both have a final showdown with Charles Widmore."
}, {
  "imdbId" : "0411008",
  "season" : "6",
  "episodeNumber" : "17",
  "title" : "The End",
  "description" : "Locke searches for Desmond to achieve his goal of destroying the island. Jack, the newly-appointed \"protector\" of the island, sets out to stop him. In Los Angeles, the survivors slowly reunite and recall their island experiences."
}]