[{
  "imdbId" : "0061265",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Beachhead",
  "description" : "An architect's close encounter with a spaceship leads him to investigate a small town's hydroelectric plant."
}, {
  "imdbId" : "0061265",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "The Experiment",
  "description" : "David Vincent meets with an eminent astrophysicist who has proof that aliens are invading the planet."
}, {
  "imdbId" : "0061265",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "The Mutation",
  "description" : "In a border town, David Vincent meets a stripper who claims to have seen something strange in the desert."
}, {
  "imdbId" : "0061265",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "The Leeches",
  "description" : "David Vincent meets with the president of an electronics company, a man who believes aliens have kidnapped various heads of their fields and are planning to kidnap him as well."
}, {
  "imdbId" : "0061265",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Genesis",
  "description" : "David Vincent discovers the aliens have taken over a sea lab for sinister purposes."
}, {
  "imdbId" : "0061265",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Vikor",
  "description" : "David Vincent, using an assumed name, gets a job as a chauffeur in order to infiltrate a manufacturing plant and find proof of alien activity."
}, {
  "imdbId" : "0061265",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Nightmare",
  "description" : "David Vincent visits a small Kansas town, resentful of strangers, and uncovers an alien plot to control locusts and other insects."
}, {
  "imdbId" : "0061265",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Doomsday Minus One",
  "description" : "The aliens plan to explode an anti-matter bomb in Utah during a nuclear test."
}, {
  "imdbId" : "0061265",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "Quantity: Unknown",
  "description" : "A strange, metallic cylinder is stored at a laboratory, waiting to be tested. It belongs to the aliens, and they are willing to kill in order to get it back."
}, {
  "imdbId" : "0061265",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "The Innocent",
  "description" : "The aliens take David Vincent up into their spaceship and then attempt to prove they have nothing but peaceful intentions by showing him what they've done to a desert valley. But all is not what it seems."
}, {
  "imdbId" : "0061265",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "The Ivy Curtain",
  "description" : "A school in New Mexico is really a front for an alien indoctrination center. The head of the school offers a pilot a lot of money to smuggle in its otherworldly students."
}, {
  "imdbId" : "0061265",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "The Betrayed",
  "description" : "David Vincent steals a computer tape in order to expose alien activity on Houston oil fields."
}, {
  "imdbId" : "0061265",
  "season" : "1",
  "episodeNumber" : "13",
  "title" : "Storm",
  "description" : "A mysterious hurricane strikes, sparing only a small Florida town. That draws David's attention, and he soon discovers a nest of aliens there, determined to use the weather against humanity. Their boat creates and controls the storm, but what controls the boat? David must find that control center before the aliens use their storm to wreck the entire eastern seaboard. He's hampered by an injury, and a clever alien who turns his benefactor Father Corelli against him."
}, {
  "imdbId" : "0061265",
  "season" : "1",
  "episodeNumber" : "14",
  "title" : "Panic",
  "description" : "Nick Baxter's touch proves lethal: he has developed an alien illness that promises a slow death for him, but a very rapid death by freezing for any organism that he touches! David tracks him down, but others are also very interested in finding Baxter - his own people. Baxter just wants to reach a saucer so he can get medical help, but he is convinced those hunting him simply want him dead. David's success may depend on convincing an old curmudgeon who has turned his back on humanity to find in himself the desire to help others."
}, {
  "imdbId" : "0061265",
  "season" : "1",
  "episodeNumber" : "15",
  "title" : "Moonshot",
  "description" : "David is drawn into the space program by a series of coincidences that convince him of alien involvement. But why do the aliens want to put one of their own on a manned mission? Surely they can get to space whenever they need to. The answer may lie in the meaning of some photographs taken by an unmanned probe. Photographs that reveal some disturbingly regular objects on the moon's surface."
}, {
  "imdbId" : "0061265",
  "season" : "1",
  "episodeNumber" : "16",
  "title" : "Wall of Crystal",
  "description" : "Bill and his new bride are so happy to be married, their antics cause Bill to lose control of the car. They run a truck off the road, and its driver staggers from the vehicle, falls, glows red and vanishes! Then the young couple suffocates - outside! It's all part of a scheme run by the alien Taugus, and it draws in David's brother Bob, Bob's wife Grace, and crusading newsman Theodore Booth. David has finally managed to convince both his brother and someone able to get the word out that he may be telling the truth about the alien invasion - but is it just in time to ..."
}, {
  "imdbId" : "0061265",
  "season" : "1",
  "episodeNumber" : "17",
  "title" : "The Condemned",
  "description" : "Pressed for cash, Morgan Tate leased a large portion of his plant to Lewis Dunn a year earlier. Now, Tate has discovered that Dunn is not what he appears to be, and that the plant is now a front for a communications center. Tate has managed to seize and hide a file named \"Command Roster One\" and the aliens are desperate to recover it. They bring in Tate's estranged daughter Carol to pressure the man, but with David Vincent's help, Tate may manage to save his daughter and recover the hidden file. If he can, it would be a terrible setback for the invaders."
}, {
  "imdbId" : "0061265",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "Condition: Red",
  "description" : "Major Dan Keller works for NORAD, at the computer control section. There he programs complex machinery that watches the skies, constantly. The aliens need a window to bring in a great many saucers, so that they may establish a base on a remote island. To do that, they place one of their own as Dan Keller's new wife Laurie. She is equipped to hypnotize Dan into replacing a crucial programming tape with one the aliens have forged - one that will instruct the systems to ignore certain things they see."
}, {
  "imdbId" : "0061265",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "The Saucer",
  "description" : "John Carter has summoned the local sheriff to a site where he claims saucers have landed, not once but several times. Each time, the saucers are gone when the sheriff finally arrives. Now David Vincent has come, lured by Carter's claim that he can predict the time of the next landing. When Carter's prediction proves true, he and David Vincent manage to commandeer the saucer - at last, proof of the invasion! But one alien escapes to warn his people. And further complications arise from a couple fleeing the country, whose plane the saucer inadvertently downed."
}, {
  "imdbId" : "0061265",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "The Watchers",
  "description" : "Paul Cook is an electronics genius with an aversion to people. He is also the man several generals are coming to meet, because he can analyze the nation's defenses and suggest ways to correct their flaws. But beings from an alien would would also like a look at those defenses, and they have devised a plan that takes advantage of Cook's reclusive nature. If David Vincent cannot stop them, they will get that information, and use it to advance their invasion timetable!"
}, {
  "imdbId" : "0061265",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "Valley of the Shadow",
  "description" : "A series of mischances leads an alien to kill a human doctor, and get arrested in the small town of Carterville, Wyoming. His alien friends bungle his rescue, and the entire town sees him go up in red flames! Now, the entire town understands that aliens have come to Earth. And the aliens are desperate to keep that knowledge from spreading - so desperate that when David Vincent finds out what they plan to do, he desperately tries to strike a deal with them to stop it. If he fails, the town of Carterville may find itself under water - a lot of water."
}, {
  "imdbId" : "0061265",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "The Enemy",
  "description" : "An alien saucer crashes in the Utah foothills. Reports of its fiery demise draw David Vincent, even after flyovers by Air Force jets failed to locate the site of the mysterious fireball. Vincent soon discovers Gale Frazer, who has helped the craft's only survivor, Blake. Frazer, sick of war after serving in Vietnam, believes Blake's people are peaceful. David must gain her trust and convince her that Blake's mission is not peaceful. That is complicated by the arrival of Sawyer and Lavin, who have come to collect the box Blake's craft brought to Earth."
}, {
  "imdbId" : "0061265",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "The Trial",
  "description" : "David's friend Charlie Gilman stands accused of murdering Fred Wilk, and district attorney Slater is determined to convict. But David knows that Wilk was an invader - and if necessary, he'll use that defense. Then David comes to suspect that Slater himself is an invader. He sets a man to researching Wilk's background, and the man turns up evidence that part of that background was faked - and then suffers a mysterious cerebral hemorrhage before he can reveal that evidence..."
}, {
  "imdbId" : "0061265",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "The Spores",
  "description" : "Courier Tom Jessup loses track of a briefcase containing something vital: spores. These organisms, properly nourished, will grow into aliens able to tolerate Earth's high oxygen content. Through mischance, Jessup loses track of the briefcase, which changes hands several times. Finally, some kids wind up with it, and meanwhile inside it the spores continue to grow, and outside it, Jessup is increasingly desperate."
}, {
  "imdbId" : "0061265",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "Dark Outpost",
  "description" : "David sneaks aboard a saucer - and is knocked unconscious by the force of takeoff. When he awakens, he discovers that he is very near an alien base. With a professor and several students, Vincent discovers that the base is an alien hospital. Stealing a crucial piece of the healing machinery, Vincent goes on the run. But the aliens catch him and the students, and pressure them to return the key component. But they'll have trouble doing that..."
}, {
  "imdbId" : "0061265",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "Summit Meeting: Part I",
  "description" : "Industrialist Michael Tressider all but kidnaps David from a job site. Tressider has learned of an upcoming summit that many world leaders will attend. They'll discuss rising levels of radiation that threaten all life on earth. There is only one place where the radiation is normal - the site of the summit, Premier Thor Halvorsen's country. David soon finds himself up to his neck in invaders, including one who informs him what the real purpose of the summit is - and promises to help him!"
}, {
  "imdbId" : "0061265",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "Summit Meeting: Part II",
  "description" : "David has learned from an alien that the purpose of the summit is to murder all of Earth's most important leaders. But he cannot convince Thor Halvorsen of this. Halvorsen knows the aliens are here, but believes their mission is peaceful. They have offered \"AR-5\" as a solution to rising radiation levels. David and Michael Tressider manage to steal an alien timetable that describes how they will move to take control of the world once the summit attendees are dead - but the aliens want it back, and there are quite a few of them between David and Halvorsen."
}, {
  "imdbId" : "0061265",
  "season" : "2",
  "episodeNumber" : "11",
  "title" : "The Prophet",
  "description" : "Brother Avery has seen the light of a heavenly host. They are coming, and they will bring peace. At the end of each of his services, the red glow that surrounds him reveals the divinity that inspires him! But David Vincent knows that this glow actually signifies that Avery is an alien who needs to regenerate. David's trouble is figuring out how to prove it when Avery is surrounded at all times by fanatics - not all of whom are human. The key may lie in Now magazine writer Bill Shay, if David can trust him with the truth."
}, {
  "imdbId" : "0061265",
  "season" : "2",
  "episodeNumber" : "12",
  "title" : "Labyrinth",
  "description" : "David manages to subdue an alien, and takes him to a doctor. The X-Rays reveal an internal structure unlike anything on Earth. David has proof he can take to a project that investigates the possibility of extraterrestrial contact. He offers the X-Rays to project director Dr. Sam Crowell, but then the wife of the doctor who took them recants, claiming the X-Rays David offered the researchers are fakes! Someone has pressured her - and someone close to the project - Crowell's own daughter - is acting strangely suspicious."
}, {
  "imdbId" : "0061265",
  "season" : "2",
  "episodeNumber" : "13",
  "title" : "The Captive",
  "description" : "Wesley Sanders breaks into the embassy of a foreign power to steal troop movement data. But he fails to disarm the security and gets caught. Examining him, Dr. Serret notices some strange signs, and recalls reading about David Vincent, who might be able to answer her questions. David is interested, but clever misdirection allow Sanders and his allies to pit David and the United States interests against those of the foreign power. The aliens are willing to destroy the embassy to keep Sanders from talking, even knowing that this may precipitate an atomic war! David ..."
}, {
  "imdbId" : "0061265",
  "season" : "2",
  "episodeNumber" : "14",
  "title" : "The Believers",
  "description" : "David Vincent has finally connected with several others who know the invaders are here, including industrialist Edgar Scoville. But immediately following a meeting, David and three of the Believers are ambushed. David is captured and his friends killed. But when he proves invulnerable to hypnosis, the aliens devise a new scheme to enlist David's unwitting aid in tracking down and murdering the rest of the Believers."
}, {
  "imdbId" : "0061265",
  "season" : "2",
  "episodeNumber" : "15",
  "title" : "The Ransom",
  "description" : "David and Edgar intercept an alien en route to a regeneration station, and discover that he is a leader, a powerful figure in the alien hierarchy! But without regeneration he will not last the length of a trip to Washington. And, his people manage to surround David and trap him in a small cabin, the home of poet Cyrus Stone and his niece Claudia. Claudia resents that David has dragged her family into this, even after she sees an alien die the fiery death of his kind when on Earth. David tries to figure out how to get word to a nearby military base, while the aliens ..."
}, {
  "imdbId" : "0061265",
  "season" : "2",
  "episodeNumber" : "16",
  "title" : "Task Force",
  "description" : "David and the Believers are trying to get a powerful publisher, William Mace, on their side. They have competition in Eric Lund, who heads a group seeking to purchase a controlling interest in Mace's publishing empire. If David and Edgar Scoville cannot persuade Mace to their cause, Lund will gain control - a disaster, since Lund is an alien! Just when they think they have Mace in their corner, he dies and his dissolute nephew Jeremy gains control. And Jeremy is very, very afraid of something. Could it have to do with the real cause of his uncle's death? Jeremy will ..."
}, {
  "imdbId" : "0061265",
  "season" : "2",
  "episodeNumber" : "17",
  "title" : "The Possessed",
  "description" : "David's friend Ted Willard has written to him for help, but the letter followed David around the country. He has finally arrived at Willard's clinic, only to discover that the doctor has suffered an accident and been under the psychiatric care of his brother Martin for several weeks. And Ted seems not to remember writing David at all! The answer to this mystery may rest with Adam Lane, and the special research he is doing at the Willard Clinic. Research that could pave the way for a nearly bloodless takeover of the Earth!"
}, {
  "imdbId" : "0061265",
  "season" : "2",
  "episodeNumber" : "18",
  "title" : "Counter-Attack",
  "description" : "Professor Eliot Kramer has completed calculations that will allow the Believers to create an automated jamming station that will cause navigational malfunctions aboard incoming saucers. But unfortunately, he used the university's computers to do the work, instead of Edgar Scoville's secure machines. That has led to his discovery by the aliens. In the scuffle, Kramer dies and David has to go on the run with the key data. When the police catch up with him, Edgar Scoville won't help, because Scoville blames David for the death of his friend Kramer! So David does the only..."
}, {
  "imdbId" : "0061265",
  "season" : "2",
  "episodeNumber" : "19",
  "title" : "The Pit",
  "description" : "Julian Reed has apparently gone barking mad. He's seeing aliens everywhere, and finally has a public breakdown resulting in confinement to a psychiatric facility. David Vincent comes to investigate, and must decide whether Reed is really mad, or if the Invaders actually have infiltrated Reed's place of employment, the highly secret Slaton Research Center. When Julian Reed accuses David himself of being an alien, and when David's wife Pat seems reluctant to even see her own husband, David doesn't know how to proceed. Until a chance encounter between a dog and one of ..."
}, {
  "imdbId" : "0061265",
  "season" : "2",
  "episodeNumber" : "20",
  "title" : "The Organization",
  "description" : "David and Mike Calvin board a ship in search of several crates that contain \"wreckage\" that rained down from the sky - the pieces of a crashed saucer! But the crates are gone; the aliens got to them first. The aliens also took a large shipment of heroin destined for \"The Organization\" - an organized crime ring run by Peter Kalter. Kalter wants his shipment back and he's willing to kill to get it. But if David can convince him that the Invaders are here, he might gain a powerful, if ruthless and unpredictable, ally. On the other hand, others in the Organization simply ..."
}, {
  "imdbId" : "0061265",
  "season" : "2",
  "episodeNumber" : "21",
  "title" : "The Peacemaker",
  "description" : "David Vincent and Archie Harmon manage to capture an alien, and bring him to General Concannon as proof. But another alien manages to slip him a suicide capsule, and soon there is nothing but ashes. Concannon sees the second alien blaze up, and is convinced. But he wants to meet with the alien leaders to see if a peaceful solution is possible. He sends David and several generals to an isolated farmhouse, and David arranges for several alien leaders to attend. But Concannon solves problems with violence, and he's going to solve this one by dropping a large bomb on the ..."
}, {
  "imdbId" : "0061265",
  "season" : "2",
  "episodeNumber" : "22",
  "title" : "The Vise",
  "description" : "David and Edgar intercept an alien data drop and recover the partially burned contents of a briefcase. A picture inside convinces them that Arnold Warren is an alien. Warren is seeking confirmation to a post supervising a space tracking project. He would be one of the few black men to hold such a high post. Standing between him and that goal is Jim Baxter, a Senate investigator who also happens to be black. Baxter's wife Celia wants black heroes for her son, so she's pressuring her husband to recommend Warren. Against that, David Vincent only has a wildly implausible ..."
}, {
  "imdbId" : "0061265",
  "season" : "2",
  "episodeNumber" : "23",
  "title" : "The Miracle",
  "description" : "Near a Catholic shrine in New Mexico, a teenage girl sees an alien die and disintegrate after he is bitten by a snake. Before he dies he hands her a strange crystal. She assumes that the alien and the crystal are miracles and signs from God. Knowing that the crystal is actually an important alien apparatus, David Vincent tries to buy it from her, but she is unwilling to give it up and her uncle wants more money. David tries to explain to them that the aliens will kill to get it back."
}, {
  "imdbId" : "0061265",
  "season" : "2",
  "episodeNumber" : "24",
  "title" : "The Life Seekers",
  "description" : "A police officer is shot and seriously wounded by an alien, whom he then shoots and sees disintegrate. A roadblock is set up for the other two in the car that sped off. Investigating, David is brought to the two aliens. They claim that they disagree with their fellow aliens' plan to invade and take over the earth, and that other aliens want to destroy them before they can get back to their planet and make the case against invasion. They persuade David to help them evade the police roadblock and get them to their spaceship safely."
}, {
  "imdbId" : "0061265",
  "season" : "2",
  "episodeNumber" : "25",
  "title" : "The Pursued",
  "description" : "David is contacted by Anne Gibbs, an alien who is on the run from both her fellow aliens and humans. She is the undesired result of an attempt to mimic human behavior by creating emotion. It's been successful in part, as she now values her own life as well as those of humans, but in the process she frequently now loses control and becomes violent when even mildly angered, and has killed a woman in one of her outbursts. Still, she tells David she will come with him to Washington to tell officials everything she knows about the aliens' plans. But the aliens plan to kill..."
}, {
  "imdbId" : "0061265",
  "season" : "2",
  "episodeNumber" : "26",
  "title" : "Inquisition",
  "description" : "In Washington, a senator is killed by a bomb blast just after David and Edgar try unsuccessfully to convince him that a security advisor is an alien. A zealous and politically ambitious prosecuting attorney then plans to make a name for himself by indicting the members of the Believers for the murder, just as they are discovering that the aliens' grand plan to take over the earth and wipe out humanity is imminent."
}]