[{
  "imdbId" : "2070791",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Pilot",
  "description" : "15 years after a global shutdown of all electricity, the Matheson family are hunted by an authoritarian regime known as the Monroe Militia."
}, {
  "imdbId" : "2070791",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Chained Heat",
  "description" : "Miles seeks help from a former acquaintance in order to rescue Danny. Meanwhile, Aaron confides in Maggie and Danny lays witness to what Neville is capable of."
}, {
  "imdbId" : "2070791",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "No Quarter",
  "description" : "On the run from Militia, Nora leads Miles and Charlie back to the Rebel camp. Meanwhile, Aaron and Maggie search for Grace, and Danny stands up to one of Neville's men."
}, {
  "imdbId" : "2070791",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "The Plague Dogs",
  "description" : "As Miles, Charlie and Nora meet up with Aaron and Maggie, Nate continues to track them."
}, {
  "imdbId" : "2070791",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Soul Train",
  "description" : "As Miles and the others near Neville and his men, Nora re-connects with a fellow rebel. Orders from Monroe up the value of Danny's life."
}, {
  "imdbId" : "2070791",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Sex and Drugs",
  "description" : "Neville delivers Danny to Monroe. Miles, Charlie and Aaron visit an old acquaintance of Miles's to get medical help for Nora."
}, {
  "imdbId" : "2070791",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "The Children's Crusade",
  "description" : "Charlie convinces Miles to help save a group of children from the Militia. Meanwhile, Rachel grows weary of Monroe as she meets someone from her past."
}, {
  "imdbId" : "2070791",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Ties That Bind",
  "description" : "Nora makes a difficult choice between family and a promise when she encounters her estranged sister. Meanwhile, Strausser tracks Miles and the others, while Monroe gives Neville a warning."
}, {
  "imdbId" : "2070791",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "Kashmir",
  "description" : "Miles, Charlie, Nora and Aaron struggle to separate fantasy from reality on an underground journey to Independence Hall. Meanwhile, Monroe starts to grow suspicious of Rachel."
}, {
  "imdbId" : "2070791",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "Nobody's Fault But Mine",
  "description" : "Miles and Monroe meet face to face. Charlie is conflicted by a shocking discovery. Rachel tests Monroe's patience."
}, {
  "imdbId" : "2070791",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "The Stand",
  "description" : "Miles leads the rebels out of Philadelphia and away from Monroe's machine guns. Rachel is forced to leave Charlie and Danny again as she provides power to the rebels."
}, {
  "imdbId" : "2070791",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "Ghosts",
  "description" : "Everyone is devastated by Danny's death. Miles and Nora set out to recruit a former militia comrade. Meanwhile, Rachel attempts to elude the grip of Randall."
}, {
  "imdbId" : "2070791",
  "season" : "1",
  "episodeNumber" : "13",
  "title" : "The Song Remains the Same",
  "description" : "Neville faces danger and hard choices as Monroe questions his loyalty. Rachel makes a dangerous journey to the mysterious Tower in order to turn the power back on."
}, {
  "imdbId" : "2070791",
  "season" : "1",
  "episodeNumber" : "14",
  "title" : "The Night the Lights Went Out in Georgia",
  "description" : "Monroe becomes paranoid when Neville disappears. Jason makes a big decision. Miles experiences romantic attraction towards both Rachel and Nora."
}, {
  "imdbId" : "2070791",
  "season" : "1",
  "episodeNumber" : "15",
  "title" : "Home",
  "description" : "Miles and the troops provided by the Georgia Federation have been having a good deal of success and Monroe travels to their hometown where he threatens to kill every living soul unless Miles gives himself up to him. He says he will start the killing with Emma, a woman they both loved long ago. Monroe hasn't returned to his hometown since his family died and Emma has an important piece of information for him. Rachel and Aaron travel west, crossing the Mississippi to the Plains Nation, arriving at La Grange, Missouri. In the marketplace, Aaron sees someone from his past..."
}, {
  "imdbId" : "2070791",
  "season" : "1",
  "episodeNumber" : "16",
  "title" : "The Love Boat",
  "description" : "With Tom Neville now a Georgia Federation officer and in charge of their troops hem Miles, Charlie and Nora head into Monroe Republic territory by boat to capture Dr. Stephen Camp who is developing an anthrax weapon for Monroe. They lift him easily and get him aboard the boat for the return trip. It comes out that he hasn't been working voluntarily as Monroe has been holding his family hostage. Not to worry they tell him: while Miles, Charlie and Nora were kidnapping him, Neville was out snatching his family and as long as he works for them, his family will be safe. ..."
}, {
  "imdbId" : "2070791",
  "season" : "1",
  "episodeNumber" : "17",
  "title" : "The Longest Day",
  "description" : "Monroe realizes the rebels are winning the war and decides they must eliminate Miles. They launch a drone attack against the rebel camp but most and Miles believes they have a mole in their midst. Charlie is trapped in the rubble leaving Miles and Nora to rescue her while Neville rescues his son. The tide turns and the entire Georgia Federation is threatened. There's an attempt on Monroe's life and Jeremy Baker pays the price. Meanwhile, Aaron tries to use the device Rachel took out of her son Danny to heal her badly broken leg. They are taken prisoner by people who ..."
}, {
  "imdbId" : "2070791",
  "season" : "1",
  "episodeNumber" : "18",
  "title" : "Clue",
  "description" : "Nora has been taken prisoner and Monroe has her tortured after she refuses to tell him where Miles is hiding. She breaks after three weeks telling them everything they want to know including the fact that Rachel is heading to the tower in Colorado. Randall explains that it's an old Department of Defense facility in Colorado of no importance but caught in a lie, he confesses what can really be found there. In Atlanta, the population is fleeing the city as Miles and the Federation's forces prepare to attack Philadelphia. Nora is rescued by Sanborn and taken to the city...."
}, {
  "imdbId" : "2070791",
  "season" : "1",
  "episodeNumber" : "19",
  "title" : "Children of Men",
  "description" : "Rachel's attempt to kill Monroe is unsuccessful but it turns out that she can open the blast doors to the tower while Randall Flynn can't. Once inside Flynn says they need to go down to level 12 but only get as as level 11 where those who are guarding the tower ambush them. The tower is a former Defense Department base and safe haven for senior government personnel. Rachel and Monroes escape the ambush but she is loath to help him find a way out. Meanwhile Miles, Charlie, Nora, Jason and Tom Neville have also arrived at the tower. They soon meet up with Aaron who uses..."
}, {
  "imdbId" : "2070791",
  "season" : "1",
  "episodeNumber" : "20",
  "title" : "The Dark Tower",
  "description" : "As the Rebels infiltrate the tower, Rachel and Aaron try to convince Dan and Grace to let them turn the power back on."
}, {
  "imdbId" : "2070791",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "Born in the U.S.A.",
  "description" : "Rachel unexpectedly encounters an important figure from her past. Charlie finds herself on a mission in the Plains Nation. Neville and Jason search a refugee camp for Julia."
}, {
  "imdbId" : "2070791",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "There Will Be Blood",
  "description" : "Miles finds himself in danger when he ends up in the clutches of Andover, Charlie searches for Monroe, Rachel and Gene desperately try to revive Aaron, and Neville devises a plan to infiltrate The Patriots."
}, {
  "imdbId" : "2070791",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "Love Story",
  "description" : "Rachel attempts to rescue Miles and to escape with Andover's terminally ill wife. Neville and Jason are caught off-guard. Charlie and Adam are at odds over what to do with Monroe."
}, {
  "imdbId" : "2070791",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "Patriot Games",
  "description" : "Rachel is suspicious when she awakens to find the Patriots in charge of Willoughby."
}, {
  "imdbId" : "2070791",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "One Riot, One Ranger",
  "description" : "Aaron and Rachel speculate on the extreme effects of Nano technology. Meanwhile a figure from Miles's past reemerges."
}, {
  "imdbId" : "2070791",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "Dead Man Walking",
  "description" : "With Monroe facing the death penalty, Miles considers the consequences of his actions. As Charlie, Rachel and Gene question Monroe's true allegiance - since he might be their only ally in stopping the patriots, Miles himself is wary of his former friend's intentions. Meanwhile, Aaron continues to have visions that lead to endless questions."
}, {
  "imdbId" : "2070791",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "The Patriot Act",
  "description" : "Miles and Company are trapped in Willoughby. When Rachel discovers some unsettling truths, Miles does what he does best to overcome obstacles before him and those he cares about. Meanwhile, Charlie shares a moment with her mom, as Neville and Jason continue their struggles between father and son."
}, {
  "imdbId" : "2070791",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "Come Blow Your Horn",
  "description" : "Aaron's deathly experience catches people's attention. As Miles and the gang try to escape the perils of their current situation, Rachel and Gene continue to struggle with their relationship, which affects Charlie. Meanwhile, Neville takes a gamble with the Patriots."
}, {
  "imdbId" : "2070791",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "Everyone Says I Love You",
  "description" : "Neville and Jason run into a familiar face. Rachel and Gene's relationship remains strained. Aaron continues to have strange visions."
}, {
  "imdbId" : "2070791",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "Three Amigos",
  "description" : "Neville and Julia mount a new plot while Aaron quests after the nanites in Spring City. Monroe, Miles and Rachel travel to Mexico to find Monroe's son."
}, {
  "imdbId" : "2070791",
  "season" : "2",
  "episodeNumber" : "11",
  "title" : "Mis Dos Padres",
  "description" : "As Monroe finds himself in unfamiliar territory, Neville and Julia continue to tango at Jason's dismay. Meanwhile, Gene leads Charlie to an uneasy discovery."
}, {
  "imdbId" : "2070791",
  "season" : "2",
  "episodeNumber" : "12",
  "title" : "Captain Trips",
  "description" : "A reluctant Rachel and Charlie help Gene when he decides to assist the residents of Willoughby. Meanwhile, Miles and Monroe continue to join forces in order to survive."
}, {
  "imdbId" : "2070791",
  "season" : "2",
  "episodeNumber" : "13",
  "title" : "Happy Endings",
  "description" : "While Monroe leads Connor and Charlie on a risky mission, Miles and Rachel watch over Willoughby. Meanwhile, Aaron and Priscilla reunite with an old friend and Neville gets a new assignment."
}, {
  "imdbId" : "2070791",
  "season" : "2",
  "episodeNumber" : "14",
  "title" : "Fear and Loathing",
  "description" : "Doyle hits Willoughby, Peter threatens Aaron and Priscilla, and Monroe and Connor are forced to fight to the death."
}, {
  "imdbId" : "2070791",
  "season" : "2",
  "episodeNumber" : "15",
  "title" : "Dreamcatcher",
  "description" : "Familiar faces re-appear as a confused Aaron awakes to a world with power."
}, {
  "imdbId" : "2070791",
  "season" : "2",
  "episodeNumber" : "16",
  "title" : "Exposition Boulevard",
  "description" : "Miles, Charlie and Connor discover Willoughby now has a reeducation center. Rachel and Miles clash over how to fight the Patriots. Neville and Jason gain an ally."
}, {
  "imdbId" : "2070791",
  "season" : "2",
  "episodeNumber" : "17",
  "title" : "Why We Fight",
  "description" : "While Gene and Miles venture into Willoughby in search of allies, Monroe seizes an opportunity to surprise the Patriots. Meanwhile, Neville's political maneuverings put him and Jason in serious danger."
}, {
  "imdbId" : "2070791",
  "season" : "2",
  "episodeNumber" : "18",
  "title" : "Austin City Limits",
  "description" : "Jason turns to Miles with crucial information about the Patriots' next steps for Texas. Aaron grows suspicious of Priscilla's increasingly unusual behavior."
}, {
  "imdbId" : "2070791",
  "season" : "2",
  "episodeNumber" : "19",
  "title" : "S#!& Happens",
  "description" : "When Neville finds out about his son, he threatens Charlie to tell him what happened."
}, {
  "imdbId" : "2070791",
  "season" : "2",
  "episodeNumber" : "20",
  "title" : "Tomorrowland",
  "description" : "Empowered with authority by the President, Truman launches a mustard gas attack to kill Miles and Monroe. To Rachel's disappointment, Miles agrees to join Monroe in a ruthless plot to beat the Patriots at their own game. Meanwhile, Neville faces his own challenge from the Patriots, and Aaron grows increasingly alarmed by the power of the nanotech."
}, {
  "imdbId" : "2070791",
  "season" : "2",
  "episodeNumber" : "21",
  "title" : "Memorial Day",
  "description" : "United by their desire to take the Patriots down, Neville and Monroe form an uneasy alliance. While searching for Aaron, Rachel comes face to face with the nanotech; and things don't go according to plan for Miles, Charlie and Gene when they try to steal the Patriots' supply of mustard gas."
}, {
  "imdbId" : "2070791",
  "season" : "2",
  "episodeNumber" : "22",
  "title" : "Declaration of Independence",
  "description" : "In the series finale, the stakes are higher than ever as the Patriots prepare for war. Miles, Charlie and Monroe launch an attack on the Patriots, but must improvise a risky new plan in order to halt the oncoming war between California and Texas. Out for revenge, Neville sets his sights on President Davis. Meanwhile, Aaron and Rachel's efforts to save Priscilla from the nanotech have unexpected consequences."
}]