[{
  "imdbId" : "0080297",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Return to the Circus",
  "description" : "Retired espionage veteran George Smiley is called out on a top secret mission: to uncover a Soviet agent within MI6's echelons."
}, {
  "imdbId" : "0080297",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Tarr Tells His Story",
  "description" : "A British agent, who was thought to have defected, resurfaces with sensational information - confirmation of a Russian spy mole existing in the Service."
}, {
  "imdbId" : "0080297",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Smiley Tracks the Mole",
  "description" : "The investigation begins, with Peter Guillam burgling the archives for information, while Smiley visits an old comrade whose past knowledge could prove vital to locating the spy."
}, {
  "imdbId" : "0080297",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "How It All Fits Together",
  "description" : "While Guillam and Tarr come under pressure, Smiley recounts his one meeting with the Soviet master spy Karla, who is undoubtedly running the spy inside MI6."
}, {
  "imdbId" : "0080297",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Tinker Tailor",
  "description" : "Smiley goes to meet Jim Prideaux who is now back in Britain having survived his experience in Czechoslovakia. His testimony and that of others sheds new light on the \"Testify\" fiasco and source \"Merlin\"."
}, {
  "imdbId" : "0080297",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Smiley Sets a Trap",
  "description" : "Smiley confronts one of his suspects and gives him the results of his investigations, which could prove a considerable embarrassment to those concerned."
}, {
  "imdbId" : "0080297",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Flushing Out the Mole",
  "description" : "Smiley springs his trap and catches the spy. He later interrogates the spy and learns about how and why it happened, and the answers he gets robs him of any sense of victory."
}]