[{
  "imdbId" : "0437696",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Minimum Wage",
  "description" : "Morgan Spurlock and his fiancée Alex try to survive 30 days on minimum wage."
}, {
  "imdbId" : "0437696",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Anti-Aging",
  "description" : "A former athlete tries to get back to his body weight after a decade and a half by participating in an anti-aging program while dealing with his family and his career"
}, {
  "imdbId" : "0437696",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Muslims and America",
  "description" : "David Stacy is a West Virginian Christian that is moved to Dearborn, Michigan to live for 30 days in a large Muslim community."
}, {
  "imdbId" : "0437696",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Straight Man in a Gay World",
  "description" : "A 24-year old straight man moves to San Francisco to live in what is known to have the largest gay community in the country."
}, {
  "imdbId" : "0437696",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Off the Grid",
  "description" : "Two young, hip, environmentally unaware consumers from New York City spend 30 days on an ecological farm. Do they learn anything about the difference that one person can make in the world?"
}, {
  "imdbId" : "0437696",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Binge Drinking Mom",
  "description" : "A strait-laced mother takes up binge-drinking in a desperate last-ditch attempt to show her teenage daughter how ridiculously dangerous her excessive behavior can be."
}, {
  "imdbId" : "0437696",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "Immigration",
  "description" : "A border security guard moves in with a family of illegal immigrants."
}, {
  "imdbId" : "0437696",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "Outsourcing",
  "description" : "After a man loses his job to outsourcing, he travels to India to see the effects his job has on their culture."
}, {
  "imdbId" : "0437696",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "Christian/Atheist",
  "description" : "An atheist wife and mother stays with a family of Christians for 30 days, attending their Bible study sessions and going with them to their Texas megachurch."
}, {
  "imdbId" : "0437696",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "New Age",
  "description" : "A stressed-out salesman gets 30 days of sessions with a life coach. She introduces him to various new age practices intended to give him a more balanced and calm outlook on life. Adding to his tension is a skeptical girlfriend."
}, {
  "imdbId" : "0437696",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "Abortion",
  "description" : "A childless pro-choice woman spends a month living at a maternity home which operates as a pro-life ministry."
}, {
  "imdbId" : "0437696",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "Jail",
  "description" : "Morgan Spurlock sentences himself to a jail term of 30 days."
}, {
  "imdbId" : "0437696",
  "season" : "3",
  "episodeNumber" : "1",
  "title" : "Working in a Coal Mine",
  "description" : "John Deer and Rob Zombie have to work inside of a coal mine for 30 days. During this time they will experience the hard lives of miners."
}, {
  "imdbId" : "0437696",
  "season" : "3",
  "episodeNumber" : "2",
  "title" : "30 Days in a Wheelchair",
  "description" : "30 Days follows former professional football player Ray Crockett as he learns about the difficulties faced by people with spinal cord injuries by spending 30 days in a wheelchair. He experiences the difficulties faced by those in wheelchairs and talks to those have experienced spinal injuries first hand."
}, {
  "imdbId" : "0437696",
  "season" : "3",
  "episodeNumber" : "3",
  "title" : "Animal Rights",
  "description" : "A hunter from North Carolina who believes animals are here for our use must live with an animal activist family for 30 days."
}, {
  "imdbId" : "0437696",
  "season" : "3",
  "episodeNumber" : "4",
  "title" : "Same Sex Parenting",
  "description" : "30 Days follows a woman who opposes same-sex parenting as she spends a month with a same sex couple who is raising four adopted boys. Although she is impressed by the parenting of the couple, she remains steadfastly against the idea of a same sex parenting."
}, {
  "imdbId" : "0437696",
  "season" : "3",
  "episodeNumber" : "5",
  "title" : "Gun Nation",
  "description" : "30 Days follows Pia Lalli an advocates for gun control as she spends a month with gun enthusiasts Ken and Zach Ekermeyer. Initially she is disturbed by their interest in guns, but later views it as an acceptable hobby though she does continue to believe that more must be done to stop gun-related crime."
}, {
  "imdbId" : "0437696",
  "season" : "3",
  "episodeNumber" : "6",
  "title" : "Life on an Indian Reservation",
  "description" : "Morgan Spurlock spends 30 days living on a Native American reservation in New Mexico. He stays with a Native American family, attempts to learn the Navajo language, and tries to become more acquainted with Navajo culture by participating in several tribal ceremonies."
}]