[{
  "imdbId" : "3843168",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Puppies and Kittens",
  "description" : "Three years into the zombie apocalypse, Lt. Hammond assembles a team of everyday heroes to transport the only known survivor of the zombie virus from New York to California in hopes of using his blood for a vaccine."
}, {
  "imdbId" : "3843168",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Fracking Zombies",
  "description" : "In New Jersey, the survivors run out of fuel and embark on a dangerous mission to replenish their supply. Meanwhile, Cassandra's past comes back to haunt her."
}, {
  "imdbId" : "3843168",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Philly Feast",
  "description" : "The survivors make their way through the mean streets of Philadelphia, where they cross paths with a group of psychotic outlaws with ties to one of their own."
}, {
  "imdbId" : "3843168",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Full Metal Zombie",
  "description" : "What's worse than zombies? Soldier zombies. Plus: Ten Thousand's mysterious past is revealed."
}, {
  "imdbId" : "3843168",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Home Sweet Zombie",
  "description" : "The survivors visit Warren's home town, but will they find her long missing husband? Oh, yeah - there's also a zombie tornado."
}, {
  "imdbId" : "3843168",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Resurrection Z",
  "description" : "An encounter with a seeming utopian enclave and a religious cult results in a series game changer."
}, {
  "imdbId" : "3843168",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Welcome to the Fu-Bar",
  "description" : "As the survivors try to recover from what happened, they come upon a gun show that makes the zombie apocalypse look calm."
}, {
  "imdbId" : "3843168",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Zunami",
  "description" : "The group finds themselves trapped in a morgue as a giant hoard of zombies approach. Citizen Z gets an unexpected visitor who might not be who he seems to be."
}, {
  "imdbId" : "3843168",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "Die Zombie Die... Again",
  "description" : "The travails of Mack and Addy, separated from the group."
}, {
  "imdbId" : "3843168",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "Going Nuclear",
  "description" : "The survivors must prevent a nuclear meltdown, while dealing with glowing and radioactive zombies."
}, {
  "imdbId" : "3843168",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "Sisters of Mercy",
  "description" : "An all-female commune in Utah is where the two groups of survivors find each other, but when one of them is shot, the idea of Utopia is destroyed."
}, {
  "imdbId" : "3843168",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "Murphy's Law",
  "description" : "Murphy is kidnapped by a group of outlaws trying to crack the 'Fort Knox of Oxycotin.' While the survivors fight drug enhanced zombies, Murphy makes a startling discovery about his abilities."
}, {
  "imdbId" : "3843168",
  "season" : "1",
  "episodeNumber" : "13",
  "title" : "Doctor of the Dead",
  "description" : "The team is rerouted to a Colorado lab where they hope to find Dr. Merch."
}, {
  "imdbId" : "3843168",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "The Murphy",
  "description" : "Season 2 picks up where Season 1 left off, moments after the launch of the tactical nuclear weapons triggered by Murphy. It's every man for him/herself. Our Heroes split up as they try to outrun the impending blast. Citizen Z finds himself battling thawed zombies and unable to communicate with the team. In a desperate attempt to help them out on their quest to get to California and the CDC, Citizen Z issues an on air bounty for Murphy. Suddenly everyone wants a piece of the Murphy, including a mysterious and deadly bounty hunter, Vasquez."
}, {
  "imdbId" : "3843168",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "White Light",
  "description" : "Following Citizen Z's on-air bounty announcement, it seems like everyone left who isn't a zombie is on the hunt for Murphy -- and they're not afraid to do whatever it takes to bring him in dead or alive! Newly reunited, our Heroes find themselves battling both zombies and over-eager bounty hunters. The fighting is fierce, resulting in a near-death experience for each of our Heroes, culminating in a tragedy no one saw coming. In all the confusion, Murphy manages to give our Heroes the slip yet again. Vasquez, at first interested only in bagging Murphy for himself, ..."
}, {
  "imdbId" : "3843168",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "Zombie Road",
  "description" : "Our Heroes manage to finally track Murphy down. They come across a wagon train caravan of desperate survivors transporting victims of the nuclear blast to safety. Along the way they are attacked by \"Blasters,\" superfast zombies mutated by the radioactive fallout. Our Heroes are introduced to \"Z-Weed,\" an ultra-potent strain of marijuana grown in zombie compost. They go on a quest for \"Batch 47,\" a potential cure for the Zombie Virus."
}, {
  "imdbId" : "3843168",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "Batch 47",
  "description" : "Cassandra and Murphy visit the botanical labs to check out the so-called herbal cure."
}, {
  "imdbId" : "3843168",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "Zombaby!",
  "description" : "The gang runs into trouble while trying to deliver Serena and Murphy's baby to safety. But is the baby worth saving?"
}, {
  "imdbId" : "3843168",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "Zombie Baby Daddy",
  "description" : "The group worries about the hybrid baby's true nature, prompting Murphy to escape with his daughter."
}, {
  "imdbId" : "3843168",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "Down the Mississippi",
  "description" : "Our Heroes try to cross the Mississippi but are involved in a boating accident and split up again. 10K is drawn into Sketchy and Skeezy's latest scam, resulting in a run in with Escorpion. Playing judge, jury and executioner all in one, Escorpion sentences 10K, Sketchy and Skeezy all to death. Warren and the rest of our Heroes arrive on the scene, but is it too late?"
}, {
  "imdbId" : "3843168",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "The Collector",
  "description" : "Tricked into a trap by use of a fresh brain lure, Murphy is captured by an overly enthusiastic and slightly unbalanced zombie fan, \"The Collector,\" who is hell-bent on adding him to his zombie museum. Murphy must match wits with the Collector if he's to survive, much less escape."
}, {
  "imdbId" : "3843168",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "Rozwell",
  "description" : "Mysterious things are starting to happen as our Heroes drive through RoZwell, New Mexico. Bright lights in the sky and the appearance of a beautiful but slightly 'spacey' woman, Bernadette, lead the team on an adventure through an abandoned Air Force base in search of zombie aliens. There they discover what looks like alien technology and quite possibly the answer to the question, \"Are we really alone in the universe?\""
}, {
  "imdbId" : "3843168",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "We Were Nowhere Near the Grand Canyon",
  "description" : "The team splits up because of a massive zombie horde, and encounters a Native American tribe fighting against itself."
}, {
  "imdbId" : "3843168",
  "season" : "2",
  "episodeNumber" : "11",
  "title" : "Corporate Retreat",
  "description" : "Our Heroes find themselves eyeball deep in corporate politics after they decide to seek shelter at a hotel taken over by a group of white collar survivors. While they're participating in trust falls and talking stick circles, someone tries to kill Murphy by shooting him. Suddenly faced with a possible killer in their midst, our Heroes play a dangerous game of \"Clue\" - with zombies!"
}, {
  "imdbId" : "3843168",
  "season" : "2",
  "episodeNumber" : "12",
  "title" : "Party with the Zeros",
  "description" : "The team meets La Reina, Queen of the Zeros, after being captured."
}, {
  "imdbId" : "3843168",
  "season" : "2",
  "episodeNumber" : "13",
  "title" : "Adiós, Muchachos",
  "description" : "All hell breaks loose when it's discovered that Dr. Kurian's Z-Vaccine doesn't work at all! Instead of building an immunity to the Zombie Virus, the bad vaccine actually makes anyone inoculated susceptible to Murphy's unique brand of mind manipulation. Vasquez gets caught in his plot to kill Escorpion and is sentenced to death by La Reina. Murphy uses mental manipulation to position Warren as La Reina's new second in command. Warren frees Vasquez just in time to watch everyone who was inoculated succumb to a bizarre new form of the Zombie Virus."
}, {
  "imdbId" : "3843168",
  "season" : "2",
  "episodeNumber" : "14",
  "title" : "Day One",
  "description" : "As Citizen Z looks for answers as to who has hacked his system, the others reflect on where they were when it all began as they travel further towards their goal of finding a cure in California."
}, {
  "imdbId" : "3843168",
  "season" : "2",
  "episodeNumber" : "15",
  "title" : "All Good Things Must Come to an End",
  "description" : "Los Angeles! Our Heroes drive through the abandoned city on their way to the coordinates of the mobile CDC lab given to them by Citizen Z. They head up towards Malibu where they discover the CDC lab isn't just a lab...it's a submarine! Dr. Merch welcomes our Heroes aboard and not a moment too soon as the Zeros show up hot on their heels. It's a bittersweet moment as Murphy says goodbye to the rest of our Heroes. As they leave Murphy and the fate of humanity with Dr. Merch, one question lingers; is this really the end of our grand adventure?"
}, {
  "imdbId" : "3843168",
  "season" : "3",
  "episodeNumber" : "1",
  "title" : "No Mercy",
  "description" : "The gang protects the town against a new enemy."
}, {
  "imdbId" : "3843168",
  "season" : "3",
  "episodeNumber" : "2",
  "title" : "A New Mission",
  "description" : "In the season 3 premiere, Warren and gang are taken prisoner, while Murphy escapes the sub with his newly formed group of blends."
}, {
  "imdbId" : "3843168",
  "season" : "3",
  "episodeNumber" : "3",
  "title" : "Murphy's Miracle",
  "description" : "Murphy begins starting his new world plans. Warren leads the new mission group to a strange town with a single inhabitant."
}, {
  "imdbId" : "3843168",
  "season" : "3",
  "episodeNumber" : "4",
  "title" : "Escorpion and the Red Hand",
  "description" : "More people flock to Murphy's new cult. The others are stuck in the middle of a war."
}, {
  "imdbId" : "3843168",
  "season" : "3",
  "episodeNumber" : "5",
  "title" : "Little Red and the Wolfz",
  "description" : "10K, injured and alone, is stalked by a pack of wolves."
}, {
  "imdbId" : "3843168",
  "season" : "3",
  "episodeNumber" : "6",
  "title" : "Doc Flew Over the Cuckoo's Nest",
  "description" : "Doc is captured by the residents of a mental hospital and must help them escape."
}, {
  "imdbId" : "3843168",
  "season" : "3",
  "episodeNumber" : "7",
  "title" : "Welcome to Murphytown",
  "description" : "The Man discovers Lucy's existence. 10k reunites with the gang and he tells them about Murphy's growing army."
}, {
  "imdbId" : "3843168",
  "season" : "3",
  "episodeNumber" : "8",
  "title" : "Election Day",
  "description" : "Doc and Addy run into Sketch & Skezzy when the Murphymobile isn't working. Sketch is running for President of the Apocalypse."
}, {
  "imdbId" : "3843168",
  "season" : "3",
  "episodeNumber" : "9",
  "title" : "Heart of Darkness",
  "description" : "Warren and the others inspect Murphytown and realize they are going to need a bigger army to extract Murphy."
}, {
  "imdbId" : "3843168",
  "season" : "3",
  "episodeNumber" : "10",
  "title" : "They Grow Up So Quickly",
  "description" : "Doc and Addy try to convince Lucy's family to follow them. Murphy tests 10K's allegiance."
}, {
  "imdbId" : "3843168",
  "season" : "3",
  "episodeNumber" : "11",
  "title" : "Doc's Angels",
  "description" : "Doc tries to find a way to communicate with Warren, but instead encounters something much more menacing."
}, {
  "imdbId" : "3843168",
  "season" : "3",
  "episodeNumber" : "12",
  "title" : "The Siege of Murphytown",
  "description" : "Warren leads an attack against Murphytown to extract its smug leader."
}, {
  "imdbId" : "3843168",
  "season" : "3",
  "episodeNumber" : "13",
  "title" : "Duel",
  "description" : "Addy is being pummeled with whatever The Man can throw at her, and Lucy does the same to The Man."
}, {
  "imdbId" : "3843168",
  "season" : "3",
  "episodeNumber" : "14",
  "title" : "Everybody Dies in the End",
  "description" : "The gang reunites and faces the biggest battle yet."
}, {
  "imdbId" : "3843168",
  "season" : "4",
  "episodeNumber" : "1",
  "title" : "Warren's Dream",
  "description" : "The group is confronted by the inhabitants of Zona."
}, {
  "imdbId" : "3843168",
  "season" : "4",
  "episodeNumber" : "2",
  "title" : "Escape from Zona",
  "description" : "Driven by Warren's dream of a black rainbow, Warren and Murphy make their way back to the mainland."
}, {
  "imdbId" : "3843168",
  "season" : "4",
  "episodeNumber" : "3",
  "title" : "The Vanishing",
  "description" : "When Sun Mei and Red vanish, 10K and the group must decide whether to keep looking for them, or give up and press on to Newmerica."
}, {
  "imdbId" : "3843168",
  "season" : "4",
  "episodeNumber" : "4",
  "title" : "A New Mission: Keep Moving",
  "description" : "Following Warren's dream, the team doesn't stop while crossing The Great Pile, a seemingly endless landscape of rubble and destruction."
}, {
  "imdbId" : "3843168",
  "season" : "4",
  "episodeNumber" : "5",
  "title" : "The Unknowns",
  "description" : "An Unseen Force captures the team and forces them to work in an underground facility doing dangerous and bizarre tasks."
}, {
  "imdbId" : "3843168",
  "season" : "4",
  "episodeNumber" : "6",
  "title" : "Back From the Undead",
  "description" : "Lucy fights to save Murphy's life; and the others Battle of biologically modified Franken zombie."
}, {
  "imdbId" : "3843168",
  "season" : "4",
  "episodeNumber" : "7",
  "title" : "Warren's Wedding",
  "description" : "Shaken by the death of one of the team, something snaps in Murphy, and Warren is unable to stop him and the others from committing an atrocity as misplaced revenge."
}, {
  "imdbId" : "3843168",
  "season" : "4",
  "episodeNumber" : "8",
  "title" : "Crisis of Faith",
  "description" : "Warren and the others encounter a mysterious stranger who they think is a grave robber, but he's something much more than that."
}, {
  "imdbId" : "3843168",
  "season" : "4",
  "episodeNumber" : "9",
  "title" : "We Interrupt This Program",
  "description" : "The group explores an abandoned TV news station and encounters news crew zombies triggering haunting flashbacks from day one."
}, {
  "imdbId" : "3843168",
  "season" : "4",
  "episodeNumber" : "10",
  "title" : "Frenemies",
  "description" : "Doc and Our Heroes are reunited with Sketchy and Skeezy when they take refuge in a working Barber Shop full of mysterious, and murderous, characters"
}, {
  "imdbId" : "3843168",
  "season" : "4",
  "episodeNumber" : "11",
  "title" : "Return to Mercy Labs",
  "description" : "Warren's dream leads the group back to Mercy Labs where she must perform a dangerous task without knowing why."
}, {
  "imdbId" : "3843168",
  "season" : "4",
  "episodeNumber" : "12",
  "title" : "Mt. Weather",
  "description" : "Warren and the group must stop Zona from launching operation Black Rainbow to cleanse the landscape of zombies- and humans."
}, {
  "imdbId" : "3843168",
  "season" : "4",
  "episodeNumber" : "13",
  "title" : "The Black Rainbow",
  "description" : "The secret of Warren's dream is unlocked when they reach their final destination, the \"Black Rainbow\" facility."
}, {
  "imdbId" : "3843168",
  "season" : "5",
  "episodeNumber" : "1",
  "title" : "Welcome to the Newpocalypse",
  "description" : "Warren recovers from the drone crash with handsome, mysterious Cooper; Doc and the others finally arrive in Newmerica, where they meet George, who is helping form the new country."
}, {
  "imdbId" : "3843168",
  "season" : "5",
  "episodeNumber" : "2",
  "title" : "A New Life",
  "description" : "Warren must leave her new life behind and find her way to Newmerica, reuniting with Murphy and the other heroes, while discovering George is an old friend."
}, {
  "imdbId" : "3843168",
  "season" : "5",
  "episodeNumber" : "3",
  "title" : "Escape from Altura",
  "description" : "10K nearly loses everything as Panic and anti-Talker sentiments flare after an explosion derails the vote."
}, {
  "imdbId" : "3843168",
  "season" : "5",
  "episodeNumber" : "4",
  "title" : "Pacifica",
  "description" : "Warren, Doc and George find evidence of vigilante violence against Talkers, and Lt. Dante may be part of an underground network helping Talkers flee humans."
}, {
  "imdbId" : "3843168",
  "season" : "5",
  "episodeNumber" : "5",
  "title" : "Killing All the Books",
  "description" : "Pacifica is bombed and the heroes decide to follow the Talker Underground to stop whoever is behind the attacks."
}, {
  "imdbId" : "3843168",
  "season" : "5",
  "episodeNumber" : "6",
  "title" : "Limbo",
  "description" : "Warren and the gang find Limbo and are reunited with an old friend. Murphy and his band of Blends runs the casino there which also serves as a sanctuary for the Talkers."
}, {
  "imdbId" : "3843168",
  "season" : "5",
  "episodeNumber" : "7",
  "title" : "Doc's Stoned History",
  "description" : "Skeezy and Sketchy re-enact Doc's stories of the Founding Fathers. Warren and the others search for the bizkit bakery and the secret ingredient in them."
}, {
  "imdbId" : "3843168",
  "season" : "5",
  "episodeNumber" : "8",
  "title" : "Heartland",
  "description" : "The heroes arrive in the farming outpost that produces flour for bizkits and find it overrun by zombies."
}, {
  "imdbId" : "3843168",
  "season" : "5",
  "episodeNumber" : "9",
  "title" : "Water Keepers",
  "description" : "Doc must spirit walk again to help save the Chief of the Water Keepers and get the water flowing to Newmerica."
}, {
  "imdbId" : "3843168",
  "season" : "5",
  "episodeNumber" : "10",
  "title" : "State of Mine",
  "description" : "Talkers are forced by the Altura militiamen to mine a hazardous landfill for the secret ingredient to bizkits."
}, {
  "imdbId" : "3843168",
  "season" : "5",
  "episodeNumber" : "11",
  "title" : "Hackerville",
  "description" : "With some help from an outpost of renegade hackers, Warren and George hack Altura's defenses and discover Estes' secret plan."
}, {
  "imdbId" : "3843168",
  "season" : "5",
  "episodeNumber" : "12",
  "title" : "At All Cost",
  "description" : "Estes imprisons the captive Talkers and Blends, while Warren and George plan their attack on Altura."
}, {
  "imdbId" : "3843168",
  "season" : "5",
  "episodeNumber" : "13",
  "title" : "The End of Everything",
  "description" : "The heroes try to bring Estes and Pandora to justice. Cooper reappears and shocks Warren with a new revelation."
}]