[{
  "imdbId" : "1582459",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "I Haven't Told You Everything",
  "description" : "Computer expert Sean Walker booked a relaxed cruise from Antigua with his girlfriend, airline pilot's daughter Leila. Its tranquility turns into a nightmare when apparently pleasant fellow passengers and crew kidnap her and set him up as a murderer. Meanwhile Blake Sterling and his national intelligence supporters are determined to protect a project they intended to keep secret even from president Martinez, involving a mysterious group of detainees."
}, {
  "imdbId" : "1582459",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "To Keep Us Safe",
  "description" : "As the shockwave of the plane dissipates, President Martinez's staff must work quickly to assess what happened and how to respond. Director of National Intelligence, Blake Sterling, locks down Sophia for interrogation. The conspiracy widens, engulfing FBI Agent Collier and Carter, a mercenary with questionable ties. Meanwhile, a shadowy figure, Thomas, emerges with knowledge of the detainees and their plan."
}, {
  "imdbId" : "1582459",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Protect Them from the Truth",
  "description" : "President Martinez's administration unveils a tough new strategy to force Sophia to reveal the detainees' plan, putting into play a new detainee, Maya. Elsewhere, we learn that Vicky and Carter are in possession of a crucial hostage. FBI Agent Collier's suspicion grows deeper."
}, {
  "imdbId" : "1582459",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "A Matter of Life and Death",
  "description" : "The White House grapples with a mysterious biological threat. Their only hope is to crack Sophia during interrogation. Meanwhile, Vicky and Carter keep their hostage captive while they await further instructions. FBI Agent Collier, on her search for Leila, stumbles upon Vicky's secret life. Elsewhere, a powerful businessman, Dempsey with classified intelligence and ties to the White House, emerges from the shadows."
}, {
  "imdbId" : "1582459",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Casualties of War",
  "description" : "The biological threat intensifies. The CDC rushes to identify the contagion and treat the infected people, while the White House and Director of National Intelligence face a difficult dilemma in their negotiation with Thomas. Meanwhile, Simon appeals to Sophia to turn on Thomas. Elsewhere, FBI Agent Collier closes in on Vicky and Carter, but appearances are not always what they seem."
}, {
  "imdbId" : "1582459",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Loyalty",
  "description" : "President Martinez and the Director of National Intelligence, Blake Sterling, fulfill their agreement with Thomas, but after their plan goes awry, they suspect that there is a possible mole in their midst. Elsewhere, Sean Walker digs for answers at Leila's home, where he encounters Madeline, a mysterious conspiracy theorist. Meanwhile, Simon's past is illuminated, and his allegiances are tested."
}, {
  "imdbId" : "1582459",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "I Know Who You Are",
  "description" : "President Martinez orders Director of National Intelligence, Blake Sterling, to root out the mole from their staff, which causes Sterling to question his judgment of people close to him. Sophia reasserts her power over Thomas and the other detainees, and she prepares them for the next leg of their mission. Elsewhere, with the aid of Madeline, Sean continues his hunt for answers, all the while trying to stay one step ahead of the covert agents who trail him."
}, {
  "imdbId" : "1582459",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "For the Good of Our Country",
  "description" : "President Martinez, furious about recent security failures, demands answers from Director of National Intelligence, Blake Sterling. When he doesn't receive the progress that he desires, Martinez decides to personally interrogate Michael Buchanan about his involvement in the assassination attempt. While Michael holds to his claim that he doesn't know who is involved, he inadvertently reveals incriminating evidence about someone deep inside the President's staff. Meanwhile, Dempsey dispatches Vicky on a new clandestine mission. And, elsewhere, Sean and Leila scramble to..."
}, {
  "imdbId" : "1582459",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "Your World to Take",
  "description" : "President Martinez reacts to the knowledge of who betrayed him within his administration. Meanwhile, after revealing her plan for the Sleepers' future, Sophia learns of dissension among her people. She sets a trap for the perpetrators and acts decisively to quell any future mutiny. Elsewhere, Sean and Leila try to unravel the mystery of Samantha's kidnapping, while evading Dempsey's nefarious clutches."
}, {
  "imdbId" : "1582459",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "Everything Will Change",
  "description" : "President Martinez confronts the traitor in his administration, only to be met with threats of exposing the cover-up of Avias Air 514. Even after testing the loyalty of Isabel and Thomas, Sophia still suspects their subterfuge, so she sends Simon on a fact-finding mission. Her suspicions are confirmed when Thomas unveils a shocking new plan. Meanwhile, on the hunt for Samantha, Sean and Leila battle the mercenaries sent by Dempsey."
}, {
  "imdbId" : "1582459",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "And Then There Were More",
  "description" : "President Martinez and his longtime Chief of Staff charge the intelligence community with decrypting Thomas's satellite message, but more importantly determining to whom it was sent. While they are distracted, Thomas unveils a surprise attack, but he does not anticipate a heroic stand-off with Blake Sterling, who learns an important lesson about Sleepers from Maya."
}, {
  "imdbId" : "1582459",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "Inostranka",
  "description" : "Meanwhile, newly appointed Alaskan Senator Catherine Lewis threatens to divulge information about the Mt. Inostranka detention facility on an episode of \"HARDBALL with Chris Matthews.\" Elsewhere, Sean and Leila get a fresh lead on the whereabouts of Samantha, but it leads them to a dramatic turn in their lives. James Dempsey foresees that he and Sean will once again cross paths."
}, {
  "imdbId" : "1582459",
  "season" : "1",
  "episodeNumber" : "13",
  "title" : "Turnabout",
  "description" : "Still reeling from the attack in Alaska, President Martinez reasserts control over the situation and his administration, counseled by Sterling and his Chief of Staff. Sophia learns the details of Thomas's murderous rampage. Thomas sets Sophia and Martinez further at odds. Elsewhere, Michael leaves Leila in safekeeping with a close friend, Diane Geller, while he goes on the hunt for Thomas. The NSA continues to decrypt the satellite transmission, hopefully before it's too late."
}, {
  "imdbId" : "1582459",
  "season" : "1",
  "episodeNumber" : "14",
  "title" : "A Message Back",
  "description" : "Thomas summons Sophia, Diane Geller, and the other Sleepers to reveal the contents of the game-changing message he received. With newfound intensity, President Martinez confronts Vice President Ray Jarvis about his betrayal. Sean blackmails Vicky into helping him on a mission of vengeance. Elsewhere, Dempsey continues on his hunt for experimental subjects."
}, {
  "imdbId" : "1582459",
  "season" : "1",
  "episodeNumber" : "15",
  "title" : "Face Off",
  "description" : "President Martinez and Blake Sterling have the Sleepers surrounded, but after Sophia triggers a national disaster, negotiations ensue. Elsewhere, with a lead on the whereabouts of Dempsey, Sean and Vicky continue on their mission."
}, {
  "imdbId" : "1582459",
  "season" : "1",
  "episodeNumber" : "16",
  "title" : "You Bury Other Things Too",
  "description" : "Sophia and the other Sleepers mourn their losses after negotiations are derailed. While observing Simon's reaction to the events, Sterling begins to doubt his loyalties and devises a test. President Martinez tasks Senator Catherine Lewis with rooting out any other moles within the White House. Elsewhere, Sean and Vicky are on the verge of tracking down Dempsey, but it may be exactly what he was anticipating."
}, {
  "imdbId" : "1582459",
  "season" : "1",
  "episodeNumber" : "17",
  "title" : "Cut Off the Head",
  "description" : "Vice President Jarvis vocalizes his lack of faith in President Martinez's leadership and agrees to meet with an adversary. Senator Catherine Lewis reports the findings of her surreptitious blood testing of the White House staff only to find one holdout, someone very close to the President. Sophia pushes forward in her search for a super weapon. And, after witnessing injustices within the Sleeper community, Leila begins to question where she belongs. Elsewhere, Sean and Vicky find whom they've been hunting for, but it may be too late."
}, {
  "imdbId" : "1582459",
  "season" : "1",
  "episodeNumber" : "18",
  "title" : "Strain",
  "description" : "The White House is rocked by the sudden illness of one of their own, leaving Chief of Staff Peel and Sterling to investigate possible conspirators. Michael Buchanan comes to the aid of Leila, but it leaves them both at risk of Sophia's wrath. Across the globe in Russia, Sean and Vicky race to stop Sophia's weapon from being loaded onto a plane heading to the United States."
}, {
  "imdbId" : "1582459",
  "season" : "1",
  "episodeNumber" : "19",
  "title" : "Us or Them",
  "description" : "The White House grapples with the unfolding tragedy as Sterling continues the investigation into his primary suspect. Sophia manipulates the traitor inside the White House, confirming the suspicions of Chief of Staff Peel. Leila and Michael attempt to rescue Simon, but at tremendous personal risk. Elsewhere, Sean and Vicky try to identify Sophia's secret courier before it's too late."
}, {
  "imdbId" : "1582459",
  "season" : "1",
  "episodeNumber" : "20",
  "title" : "One Will Live, One Will Die",
  "description" : "Lee tries to get help taking the antidote to president Martinez. Sean and Vicky try to stop Sophia's virus at all cost and save hundreds of people. Jarvis continues as a puppet in the hands of Sophia... but something he wasn't expecting happens."
}, {
  "imdbId" : "1582459",
  "season" : "1",
  "episodeNumber" : "21",
  "title" : "The Beginning of the End",
  "description" : "Martinez having received the antidote returns to work looking for revenge. Sophia continues her plan but battles an inner demon. Sean, Vicky, Simon, and Sterling work together to locate and stop Sophia."
}, {
  "imdbId" : "1582459",
  "season" : "1",
  "episodeNumber" : "22",
  "title" : "Arrival",
  "description" : "In a race to stop the virus - Roger Bart and Roma Maffia guest star."
}]