[{
  "imdbId" : "0052522",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Pilot",
  "description" : "Know what this is about?"
}, {
  "imdbId" : "0052522",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "The Empty Chair",
  "description" : "With Capone in prison, Frank Nitti tries to grab the open top spot in the empire. But Capone's bookkeeper is giving him a run for his money."
}, {
  "imdbId" : "0052522",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Ma Barker and Her Boys",
  "description" : "Ness has tracked down the notorious bank robber Ma Barker, a woman who turned her back on religion in order to lead a life of crime with her sons."
}, {
  "imdbId" : "0052522",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "The Jake Lingle Killing",
  "description" : "A newspaperman is murdered for double-crossing some mobsters. So a reward-seeking ex-con decides to work with Ness and find the killer."
}, {
  "imdbId" : "0052522",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "The George 'Bugs' Moran Story",
  "description" : "Ness tries to get the influential president of a truckers union to stop mobster \"Bugs\" Moran and his crime syndicate from infiltrating the labor unions."
}, {
  "imdbId" : "0052522",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Ain't We Got Fun",
  "description" : "A successful bootlegger seizes control of a nightclub and takes its brash young comic under his wing, promising to make him a star."
}, {
  "imdbId" : "0052522",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Vincent 'Mad Dog' Coll",
  "description" : "A deranged gangster kidnaps the right-hand man of mobster Dutch Schultz, then steals the horse Schultz was planning to bet on in the Kentucky Derby."
}, {
  "imdbId" : "0052522",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Mexican Stake-Out",
  "description" : "Eliot Ness is lured south of the border to retrieve a witness who will help his case. Only it's a set-up...once there, the mobster on trial is planning to have Ness killed."
}, {
  "imdbId" : "0052522",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "The Artichoke King",
  "description" : "A gangster who controls the produce market in New York has a colleague bumped off. But when the hit man he hired gets greedy, he has to get rid of him too."
}, {
  "imdbId" : "0052522",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "The Tri-State Gang",
  "description" : "A notorious gang that hijacks trucks is unstoppable...until one of its members falls for a young French woman who can identify their leader."
}, {
  "imdbId" : "0052522",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "The Dutch Schultz Story",
  "description" : "After Dutch Schultz gets his income tax evasion trial moved to a quiet town, he starts to have a positive effect on its citizens and eventually sways the jury."
}, {
  "imdbId" : "0052522",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "You Can't Pick the Number",
  "description" : "Eliot Ness and the Untouchables set their sights shutting down the numbers racket. The numbers are like a lottery where anyone can place a bet of up to one dollar on a three digit number. The payout for a full dollar bet is $600 so the profit for the mob, who run the racket, is the remaining 40%. Ness wants to shut down that cash flow which can be used for more heinous crimes. They think they may have an in when one of Al Morrissey's collectors is stabbed. Ness pressures Agent Marty Flaherty to make contact with Morrissey, an old friend who once saved his life. Before..."
}, {
  "imdbId" : "0052522",
  "season" : "1",
  "episodeNumber" : "13",
  "title" : "The Underground Railway",
  "description" : "Eliot Ness and the Untouchables pursue bank robber Frank Holloway who has escaped from prison. Holloway murdered an federal agent but was not convicted. Holloway is seeking to retrieve the cache of stolen loot."
}, {
  "imdbId" : "0052522",
  "season" : "1",
  "episodeNumber" : "14",
  "title" : "Syndicate Sanctuary",
  "description" : "With Al Capone out of the way, the mob is looking to relocate its base of operations outside of Chicago in a nearby community. Their first step is to get rid of the incorruptible mayoral candidate, Judge Leon Zabo, who they run down in the street. The Coroner's inquest is a sham and it is obvious that the Chief of Police, who appoints the Coroner, is already in the syndicate's pocket. Ness and his men move into the town intent on shutting the mob down before they even get started but the Untouchables find that they also have to protect the dead Judge's daughter, ..."
}, {
  "imdbId" : "0052522",
  "season" : "1",
  "episodeNumber" : "15",
  "title" : "The Noise of Death",
  "description" : "When Eliot Ness and Agent Martin Flaherty raid a small butcher shop looking for illegal liquor, they find more the cheap booze: they find the body of the store's owner, Arturo Vittorini, in the meat locker. The dead man's wife Barbara accuses the neighborhood Mafia chief, Joe Bucco, of ordering the killing. Bucco denies having anything to do with it - the dead man was his wife's cousin - but is pretty sure his collector, Little Charlie Sebastino, is responsible. He also learns to his shock and dismay that the Mafia hierarchy has pushed him out and Little Charlie has ..."
}, {
  "imdbId" : "0052522",
  "season" : "1",
  "episodeNumber" : "16",
  "title" : "Star Witness",
  "description" : "An accountant with a brilliant mind for numbers agrees to testify against the mob. But keeping him safe before the trial keeps Ness and his men on the run."
}, {
  "imdbId" : "0052522",
  "season" : "1",
  "episodeNumber" : "17",
  "title" : "The St. Louis Story",
  "description" : "The team faces a new kind of criminal when they battle the owner of the swank Jockey Club, a respectable gent who is the boss of the St. Louis underworld."
}, {
  "imdbId" : "0052522",
  "season" : "1",
  "episodeNumber" : "18",
  "title" : "One-Armed Bandits",
  "description" : "A newly released convict is blackmailed into running a slot-machine racket. If he refuses, his daughter will learn of his existence and be scandalized."
}, {
  "imdbId" : "0052522",
  "season" : "1",
  "episodeNumber" : "19",
  "title" : "Little Egypt",
  "description" : "The department's newest agent is able to infiltrate the mob, using carrier pigeons to get information out. That is, until a woman gets him into trouble."
}, {
  "imdbId" : "0052522",
  "season" : "1",
  "episodeNumber" : "20",
  "title" : "The Big Squeeze",
  "description" : "For Ness, a master bank robber proves a worthy opponent. But robbing banks is not a federal offense, so Ness must get him on another charge."
}, {
  "imdbId" : "0052522",
  "season" : "1",
  "episodeNumber" : "21",
  "title" : "The Unhired Assassin: Part 1",
  "description" : "While a crazed derelict in Florida is obsessed with assassinating President Roosevelt, Capone's mob is planning to take over the Chicago World's Fair by killing the mayor."
}, {
  "imdbId" : "0052522",
  "season" : "1",
  "episodeNumber" : "22",
  "title" : "The Unhired Assassin: Part 2",
  "description" : "Although unsuccessful in their first attempt to assassinate Chicago's Mayor, Anton J. Cermak, the Capone mob under the command of Frank Nitti and several other of the imprisoned mobster's lieutenants, have not given up. This time they hire a professional, Fred 'Caddy' Croner, an expert at using a long rifle with a scope who carries his weapon in a golf club bag. They put him on a retainer until Cermak goes out of town and sure enough, they learn that the Mayor will be traveling to Miami to attend a public event in honor of the President-elect, Franklin Delano ..."
}, {
  "imdbId" : "0052522",
  "season" : "1",
  "episodeNumber" : "23",
  "title" : "The White Slavers",
  "description" : "The sadistic head of a prostitution ring tries to get a former madam to help him with his operation. Only she decides to work with Eliot Ness instead."
}, {
  "imdbId" : "0052522",
  "season" : "1",
  "episodeNumber" : "24",
  "title" : "Three Thousand Suspects",
  "description" : "Just as a prisoner is about to turn stool pigeon, he is shot by someone on the inside. So Ness transfers a con from another prison to find the killer."
}, {
  "imdbId" : "0052522",
  "season" : "1",
  "episodeNumber" : "25",
  "title" : "The Doreen Maney Story",
  "description" : "A woman and her boyfriend, dubbed \"The Lovebirds\" by the press, rob an armored truck. When she is caught, Ness uses her as bait to catch her partner."
}, {
  "imdbId" : "0052522",
  "season" : "1",
  "episodeNumber" : "26",
  "title" : "Portrait of a Thief",
  "description" : "The president of a firm that distributes alcohol is connected to the mob and has been swindling his company for years. But then the mob turns on him."
}, {
  "imdbId" : "0052522",
  "season" : "1",
  "episodeNumber" : "27",
  "title" : "The Underworld Bank",
  "description" : "The crime lords have now become money lenders. So when they cut one of their men out of his share of a heist, he comes after them...and so does Eliot Ness."
}, {
  "imdbId" : "0052522",
  "season" : "1",
  "episodeNumber" : "28",
  "title" : "Head of Fire: Feet of Clay",
  "description" : "Special agent Ness is worried about his childhood pal - a big, successful boxing promoter who's mixed up with a gangster Ness can never get convicted."
}, {
  "imdbId" : "0052522",
  "season" : "1",
  "episodeNumber" : "29",
  "title" : "The Frank Nitti Story",
  "description" : "Al Capone's main enforcer, Frank Nitti, has gone into the movie business. He threatens theater owners into paying him protection money...or else!"
}, {
  "imdbId" : "0052522",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "The Rusty Heller Story",
  "description" : "Rusty Heller is a nightclub performer who has her eyes set on a better life for herself which, in her case, means lots more money. She sets her eyes on mobster Charles 'Pop' Felcher who has his own ambitions: with the recent arrest of Al Capone on tax evasion charges, he sees himself taking over as the top mobster in Chicago. When Felcher shows little interest in her, she settles for his lawyer, Archie Grayson. Felcher eventually comes around but Rusty starts to play a dangerous game when she decides to make money off Felcher and the Capone mob by selling both of them..."
}, {
  "imdbId" : "0052522",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "Jack 'Legs' Diamond",
  "description" : "Working in the New York area, Eliot Ness and his men are trying to trace an incoming shipment of narcotics. Some years before, mobster and nightclub owner Jack \"Legs\" Diamond spent time in Europe and he made a deal with a Greek crime family to buy $5 million worth of narcotics. Diamond is flamboyant and loves publicity but his partners, Lucky Luciano and Dutch Schultz, want him to lay low for a while and they send him off to his cabin in the Catskills. When Diamond learns that they have gone ahead with the drug deal without informing him, he assumes they're trying to ..."
}, {
  "imdbId" : "0052522",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "Nicky",
  "description" : "When a small-time hoodlum is apparently killed by Eliot Ness during a raid, the man's teenage son, Nicky Bousso, tries to kill him. Ness realizes that Nicky is no hood and tries to be nice, but the kid is persistent. When ballistics confirm that the man was killed before the raid took place, Nicky thinks Ness is just making it up. Nicky gets a job cleaning cars at his father's former place of work, a taxi company owned by Gus Marco. Unbeknown to Nicky, Marco is a major hoodlum and his father was in fact a hood. He is soon faced with the choice of following in his ..."
}, {
  "imdbId" : "0052522",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "The Waxey Gordon Story",
  "description" : "Waxey Gordon is known as the beer baron of New York and he decides that the time has come to expand his territory. He sets his sights on the New Jersey side of the river and successfully eliminates his three competitors there, including mobster Bugs Donovan. Ness and his men are trying to bring Waxey down and are sure they have located his warehouse but every time they raid the place, the building is completely empty. When they do finally figure out how he is moving his beer, they plan a little surprise for him with the help of the Elizabeth, New Jersey Fire ..."
}, {
  "imdbId" : "0052522",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "The Mark of Cain",
  "description" : "Eliot Ness and his team have been successful in shutting most of the drug trafficking in Chicago. One exception is 'Little' Charlie Sebastino's operation. He has accumulated quite a stash over the years and doesn't need to import new supplies to keep his lucrative operation going. A drug overdose victim puts Ness onto Sebastino's distribution chain but he is puzzled when the gangster stops selling the stuff. Unbeknown to Ness, the Commission, chaired by Joe Genna, has ordered Sebastino to stop selling drugs. Needless to say, 'Little' Charlie hatches his own plan to ..."
}, {
  "imdbId" : "0052522",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "A Seat on the Fence",
  "description" : "Narcotics smuggler Dino Patrone returns to the United States after visiting the old country for several months. He brings his younger sister Carla with him as she plans on studying in the U.S. Little does Dino know that his boss Victor Bardo has ordered his best friend Willie Asher to kill him. Traveling on the train to Chicago, Dino meets an acquaintance, print and radio journalist Loren Hall. Dino soon meets his end and it falls to Hall, who reluctantly agrees to work with Eliot Ness, to help Carla Patrone after she is kidnapped by the mobsters."
}, {
  "imdbId" : "0052522",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "The Purple Gang",
  "description" : "The Purple Gang, led by Eddie Fletcher, specialize in small-time kidnapping focusing on minor mobster that can fetch them a few thousand dollars in a short period of time. They may have bitten off than they can chew when they grab Jan Tornek. He is ostensibly an antique shop owner in business with his brother-in-law Eric Vajda. In fact, he's a messenger for the Capone mob, regularly collecting shipments of narcotics. Ness had been observing Tornek for some time and when he misses picking up a drug delivery, he's soon on to Mrs. Tornek who has already received the ..."
}, {
  "imdbId" : "0052522",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "Kiss of Death Girl",
  "description" : "Having had three boyfriends killed in the last 18 months, Francie West has earned her nickname, the kiss of death girl. She is a blackjack dealer in Phil Corbin's speakeasy and has been dating a minor mobster in Lou Scalese organization named Whitey Barrows. Corbin has plans to move into the big time and with Whitey's help, hijacks four truckloads of liquor belonging to Scalese. Corbin kills Whitey when the job is done and Eliot Ness tries to get Francie to help him out on the case. She's not too keen, initially refusing to accept that her latest boyfriend is dead. ..."
}, {
  "imdbId" : "0052522",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "The Larry Fay Story",
  "description" : "When mobster Larry Fay gets control of the dairy industry, the price goes up and the city is in an uproar. Milk normally sells for 10 cents a quart but has risen to 13 cents with 2 cents going directly into 's Fay's pocket. A commission of inquiry is set up to investigate the matter but Fay only cares about his profit and to the chagrin of at least one of his partners, pushes the price of milk ever higher. Fay owns a nightclub with partner Sally Kansas who isn't aware of Fay's illegal activities. Her much adored younger brother Tommy does and when Fay kills him, Eliot..."
}, {
  "imdbId" : "0052522",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "The Otto Frick Story",
  "description" : "Otto Frick is a drug dealer with a traveling group of distributors. Ness and his men trace his supply chain to a book shop whose owner regularly visits the German Consulate in New York. Ness soon realizes that the Nazis are supplying Frick and that one of its agents, Walter Messlinger, is the point of contact. What Ness doesn't yet realize is that Messlinger wants Frick's experience as a hood to start using Nazi strong-arm tactics against local citizens. He also enlists Frick's right-hand man, Hans Eberhardt, to set up a protection racket against Jewish shopkeepers. ..."
}, {
  "imdbId" : "0052522",
  "season" : "2",
  "episodeNumber" : "11",
  "title" : "The Tommy Karpeles Story",
  "description" : "Following the Hillsdale Express train robbery in which a million dollars was stolen and a mail clerk was killed, 'Tough' Tommy Karpeles is convicted and sentenced to life in prison. Eliot Ness has been tasked by the Post Office to recover the missing million and he begins to think that Karpeles may be innocent. Information from a dying hood puts him on the trail of Karpeles' former associate Arnie 'The Wolf' Mendoza, now a supposedly reformed cinema owner living under the name of Albert Maris. When Mendoza kidnaps Karpeles' daughter Sally to keep her from talking, ..."
}, {
  "imdbId" : "0052522",
  "season" : "2",
  "episodeNumber" : "12",
  "title" : "The Big Train: Part 1",
  "description" : "When Al Capone is convicted of tax evasion, he's sentenced to 11 years and sent to the federal penitentiary in Atlanta. Capone's farewell is something normally reserved for more honest citizens leading Eliot Ness to go to Washington and propose the construction of Alcatraz prison. In Atlanta, Capone has a pretty good thing going, including guards who make life pretty easy for him in exchange for cash. When it becomes apparent that he too will be transferred to the new prison, Capone uses a cell mate's knowledge of the railroad route to plan his escape. In Chicago ..."
}, {
  "imdbId" : "0052522",
  "season" : "2",
  "episodeNumber" : "13",
  "title" : "The Big Train: Part 2",
  "description" : "Having managed to secretly inform his men of the departure date of the train carrying him to Alcatraz, Al Capone continues to work om his escape. The plan is to free Capone when the train stops for 5 minutes in the northern California community of Cloverville. Capone's men arrive the day before the snatch and basically take over the town at gunpoint. Ness and his men are soon on to them however and manage to enter the town. Needless to say, Capone ends up in Alcatraz."
}, {
  "imdbId" : "0052522",
  "season" : "2",
  "episodeNumber" : "14",
  "title" : "The Masterpiece",
  "description" : "When Al Capone is imprisoned for tax evasion, he leaves his operation in the hands of two of his lieutenants: Mayer Wartel is responsible for the speakeasies and Carl Positan is left in charge of the breweries. Wartel however soon ensures that he is left as the only one in charge and is soon dubbed Capone's heir apparent. He's a severe hypochondriac and a chronic worrier so when he takes a dislike to the newspaper articles about him, he personally gets rid of the editor. Wartel had his gun made from scratch and of unique lightweight materials which results in Ness ..."
}, {
  "imdbId" : "0052522",
  "season" : "2",
  "episodeNumber" : "15",
  "title" : "The Organization",
  "description" : "With the imprisonment of Al Capone for tax evasion, Frank Nitti has taken over the operation of the organization but that isn't stopping others from trying to muscle their way in. Arnie Seeger in particular thinks he has the opportunity to create a national crime syndicate and partners with St. Louis mobster Joe Kulak to make it happen. They plan on inviting key mobsters from across the country to a conference in Chicago. Into this mix comes a recently released small-time criminal, Maxie Schram. His wife Roxie now lives with Seeger and Maxie tries to hit her up for ..."
}, {
  "imdbId" : "0052522",
  "season" : "2",
  "episodeNumber" : "16",
  "title" : "The Jamaica Ginger Story",
  "description" : "Kansas City boss Torrez runs a lucrative trade in deadly \"Jamaica Ginger\". When rivals try to move in on his operation, Torrez hires hit-men, but complications arise when one of the killers falls in love."
}, {
  "imdbId" : "0052522",
  "season" : "2",
  "episodeNumber" : "17",
  "title" : "Augie 'The Banker' Ciamino",
  "description" : "Augie 'The Banker' Ciamino is a bootlegger who seems to have developed an almost foolproof way of manufacturing his liquor. He has equipped over a hundred immigrant homes with small stills to actually make the stuff and a unique way of collecting the product. Not everyone in the immigrant community is participating in the illegal liquor-making operation and Eliot Ness visits a night class where adults learn English. His visit is followed by Ciamino's thugs who give the teacher a beating in front of his students. When shopkeeper Renzo Raineri intervenes, he learns that..."
}, {
  "imdbId" : "0052522",
  "season" : "2",
  "episodeNumber" : "18",
  "title" : "The Underground Court",
  "description" : "Mobster Valentine Ferrar thinks he has the perfect way to steal $500,000 of the syndicate's money. When a passenger liner returning from Cuba catches fire off the New Jersey coast, he fakes his death and sends his underling to the Underground Court, the mob's court of law, to tell them he drowned. They are soon on his trail however so when he meets up with a kooky widow, Hannah Wagnall, they set off on what she calls a second honeymoon. What he doesn't realize is that Wagnall has her own plans and that she's gone on these second honeymoons before. Ness and his men, ..."
}, {
  "imdbId" : "0052522",
  "season" : "2",
  "episodeNumber" : "19",
  "title" : "The Nick Moses Story",
  "description" : "When gangster Nick Moses and another Chicago mobster threaten to go to war after Moses poaches customers in the other's territory, Frank Nitti - now the top mobster in Chicago after the recent incarceration of Al Capone for tax evasion - tells them to settle things amicably, or else. Moses pretends to make amends but actually arranges a hit on his rival, one that also leads to a young newspaper boy being shot. When Nitti tells him he's a dead man, Moses tries to make one last deal - in return for sparing his life, he will make sure Eliot Ness is killed. Nitti accepts ..."
}, {
  "imdbId" : "0052522",
  "season" : "2",
  "episodeNumber" : "20",
  "title" : "The Antidote",
  "description" : "For years the Federal government has been trying to find a way to chemically de-nature industrial alcohol, but the mob has always found a way to re-nature the substance. In Chicago, the chief supplier of alcohol to the mob is Wally Baltzer who employs a crew of chemists to ensure a smooth flow of the product. The latest government formula is proving hard to crack and one of Baltzer's chemists, the physically disabled Russell Shield, sees an opportunity to make a name and a small fortune for himself. When his colleague develops the right chemical formula, Shield ..."
}, {
  "imdbId" : "0052522",
  "season" : "2",
  "episodeNumber" : "21",
  "title" : "The Lily Dallas Story",
  "description" : "Lily Dallas is a highly intelligent ex-con who has a history of committing bank robberies. This time she and her husband George 'Blackie' Dallas, who is known for his deft use of a Tommy gun, kidnap a well known and very rich businessman Thomas B. Randall and demand $300,000 ransom. Mrs. Randall follows their instructions and doesn't contact the police until after she has paid the ransom so Ness puts out a rumor that all of the bills have been marked. Blackie however is beginning to chafe under Lily's orders, all the more so as she is having an affair with a member of..."
}, {
  "imdbId" : "0052522",
  "season" : "2",
  "episodeNumber" : "22",
  "title" : "Murder Under Glass",
  "description" : "With the election of Franklin Roosevelt and the end in sight for prohibition, Frank Nitti and the Chicago mob have been shifting from alcohol to narcotics as their primary source of income. When their supply dries up, Nitti travels to New Orleans to meet with their supplier, Emile Bouchard, whose original shipment of drugs was hijacked but is expecting another any day. Nitti warns him that there better not be any foul-ups with this shipment but it soon becomes clear that Bouchard has plans of his own and is out to get a percentage of the mob's total income. Eliot Ness..."
}, {
  "imdbId" : "0052522",
  "season" : "2",
  "episodeNumber" : "23",
  "title" : "Testimony of Evil",
  "description" : "Eliot Ness and the Untouchables are out to convict political boss Brian O'Malley and have two witnesses who will testify that he ordered a murder. O'Malley is an old-time politico who never seeks office himself but controls almost every party official that does. Ness' witnesses are living in a hotel under constant police protection but that doesn't stop O'Malley who manages to use a corrupt cop to kill one of them, George Davas. Ness' only remaining option is to find Davas' girlfriend, Julie Duvall, who he learns was also a witness to O'Malley orders. Time is of the ..."
}, {
  "imdbId" : "0052522",
  "season" : "2",
  "episodeNumber" : "24",
  "title" : "Ring of Terror",
  "description" : "When boxer Joey McGrath dies in the ring, the medical examiner reports no special circumstances and the Press put it down to a tragic accident. A lab technician in the ME's office informs Eliot Ness that the medical report was fixed and McGrath had a high level of morphine in his blood, suggesting he had been drugged before the bout. McGrath's manager Barney Jarreau is a straight arrow who wasn't involved in the fix but with the McGrath incident about to be reviewed, numbers racketeer Rudy Krasna decides to force Jarreau's hand to fix an upcoming championship fight. ..."
}, {
  "imdbId" : "0052522",
  "season" : "2",
  "episodeNumber" : "25",
  "title" : "Mr. Moon",
  "description" : "Melanthos Moon is a San Francisco art and antique dealer who manages to hijack a large supply of the special paper used to print U.S. Currency. He then arranges to spring from Leavenworth prison master counterfeiter Hans Dreiser to engrave the plates to produce the money. Eliot Ness and the Untouchables are soon on to him having followed Moon's henchman Benny Joplin back to his Oakland, California home. With the phony money available, Moon then approaches Chicago mobster Frank Nitti with an offer of $100 million split 50/50 with Nitti distributing the cash. Ness and ..."
}, {
  "imdbId" : "0052522",
  "season" : "2",
  "episodeNumber" : "26",
  "title" : "Death for Sale",
  "description" : "Johnny Lubin has been on the make since he was a young kid. He quit school after grade 3 and by the age of 13 was paying off his truant officer $75 a week to leave him alone. Now 20, he own a string of speakeasies on the waterfront, including opium dens. He soon hooks up with George Dodd a toy manufacturer whose real name is Phil Melnick and is a supposedly reformed mobster. He has $2 million worth of opium to distribute and Lubin thinks he has just the way to get it into the hands of distributors. Lubin's arrogance however pushes him into a deadly game of cat and ..."
}, {
  "imdbId" : "0052522",
  "season" : "2",
  "episodeNumber" : "27",
  "title" : "Stranglehold",
  "description" : "Eliot Ness sets out to bring down Frank Makouris, who controls New York's Fulton Fish Market by intimidation and murder and who is responsible for the price of fish going up nearly 50%. Frank's boss, gangster Joe Kulak, tells Frank to lay low until Ness leaves, but Frank ramps up his terrorizing of the market, until Kulak is forced to throw a low-ranking hood to the feds as a sacrificial lamb in order to take the heat off himself. Unfortunately, it doesn't work out as planned."
}, {
  "imdbId" : "0052522",
  "season" : "2",
  "episodeNumber" : "28",
  "title" : "The Nero Rankin Story",
  "description" : "Although Eliot Ness and the Untouchables managed to destroy the Underground Court, they have yet to make a dent against the Syndicate, which has re-grouped and continues to operate. They elect Nero Rankin to chair the national board of the syndicate, but the choice wasn't unanimous. He's also in poor health and that leads Sylvia Orkins, who loves Rankin and is convinced he will die or be killed, to approach Eliot Ness to do something, anything, to get him out of his new job. Rankin knows he has only about a year to live and that he's an unpopular chairman so he offers..."
}, {
  "imdbId" : "0052522",
  "season" : "2",
  "episodeNumber" : "29",
  "title" : "The Seventh Vote",
  "description" : "After Al Capone is imprisoned for tax evasion, he leaves his Chicago operation in the hands of a governing council. There are two factions however, one headed by Frank Nitti and the other by Jake 'Greasy Thumb' Guzik, and they can't agree on anything. To resolve the deadlock, Capone asks his mentor, known only as Kafka, to return to the U.S.A. and take over the management of his organization. Kafka was deported 11 years previously and now lives in the Orient and Nitti and Guzik hire Alexander Stavro to ensure that Kafka entry is uneventful. Eliot Ness and the ..."
}, {
  "imdbId" : "0052522",
  "season" : "2",
  "episodeNumber" : "30",
  "title" : "The King of Champagne",
  "description" : "After Federal Agents destroy a large shipment of champagne there a void in the market. Bottle manufacturer Edmund Wald decides that perhaps the time has come to start filling the bottles he sells. He teams with a bootleg liquor distributor, Michel Viton, who has the contacts to sell the stuff to. He also gets his cheapskate uncle Barney Loomis, a legitimate restaurant owner, involved by getting him to lend him the up-front money he needs to the the illicit liquor operation underway. Wald is taking all the risk however with both Viton and Loomis making sure their own ..."
}, {
  "imdbId" : "0052522",
  "season" : "2",
  "episodeNumber" : "31",
  "title" : "The Nick Acropolis Story",
  "description" : "Nick Acropolis has created a vast network of bookies and is the king of the numbers racket in the greater Chicago area. His problems start when he discovers that Louis Manzak, his wife's brother and the manager of one his betting parlors, has skimmed $200,000 of the proceeds. Were it not for the family relationship, Nick would have had him killed but rather he gives Louis 48 hours to come with $50,000 as a down payment on what he owes. His sister lends him half of that amount but his attempt to borrow the rest from someone else leads to disaster. The dispute also ..."
}, {
  "imdbId" : "0052522",
  "season" : "2",
  "episodeNumber" : "32",
  "title" : "90-Proof Dame",
  "description" : "Nate Kester is a burlesque theatre operator who decides to branch out into the lucrative brandy business. He is producing his own brandy, of very poor quality, and using a fancy French label to try and pass it off as de Bouverais cognac. He realizes that if his scheme is to work, he will have to ensure that the real stuff is unavailable for comparison to the rot gut he will be marketing. He manages to destroy the principal supplier of the real stuff but Etienne de Bouverais himself comes to Chicago to put a new wholesaler in place. When he kills off de Bouverais he ..."
}, {
  "imdbId" : "0052522",
  "season" : "3",
  "episodeNumber" : "1",
  "title" : "The Troubleshooter",
  "description" : "A new 5 and 10 cent game using punch boards has become very popular and lucrative for the syndicate that controls it. With Eliot Ness and the Untouchables targeting them, receipts are down so they decide to accept New York hood Nate Selko's plan to deal with Ness. Selko's offer of a bribe is rejected by Ness out of hand so he goes to plan B: set Ness up to shoot a man who is apparently unarmed. Ness knows he was fired at first but when no gun is found anywhere at the scene, it becomes front page news and he forced to defend himself both publicly and to the DA"
}, {
  "imdbId" : "0052522",
  "season" : "3",
  "episodeNumber" : "2",
  "title" : "Power Play",
  "description" : "With a public outcry over the level of gang violence in Chicago, the authorities appoint retired lawyer Willard Thornton to the new post of Crime Commissioner. What no one realizes is that he has formed a new syndicate bent on importing and distributing narcotics. When the new cartel's enforcer, Steve 'Country Boy' Parrish, is arrested by Eliot Ness he is soon out on bail thanks to bail bondsman Barney Lubin, a Thornton associate. Parrish knows that Thornton's style is to eliminate any possible risk to his reputation so he is soon on the lam, living in the back room ..."
}, {
  "imdbId" : "0052522",
  "season" : "3",
  "episodeNumber" : "3",
  "title" : "Tunnel of Horrors",
  "description" : "Acting on an anonymous tip, Eliot Ness and his men find themselves at a local carnival keeping an eye on an impending purchase of narcotics. The seller is Alexander Rader, a known drug dealer and the buyer is Arnold Justin on behalf of Frank Nitti. They are scheduled to meet in an electrical room accessible only through the tunnel of horrors tide. Justin is an ex-Chief of Detectives who was always honest when on the force but decided he was fed up putting his life on the line for minimal pay so he quit and now acts as a buyer for the mob. Unfortunately, he also ..."
}, {
  "imdbId" : "0052522",
  "season" : "3",
  "episodeNumber" : "4",
  "title" : "The Genna Brothers",
  "description" : "Within a few short years of their arrival in the USA, the 6 Genna brothers have firmly establish themselves in Chicago's criminal community. Established in Chicago's Little Italy, they provide the Capone empire with illicit liquor that they have produced through a network of home distilleries that may only produce one gallon a day each. They also smuggle illegal aliens into the country and hold the threat of returning them to the old country if they don't do what they're told. Eliot Ness and his men have been trying to break up the Gennas network, but it has proved ..."
}, {
  "imdbId" : "0052522",
  "season" : "3",
  "episodeNumber" : "5",
  "title" : "The Matt Bass Scheme",
  "description" : "Matt Bass is an ex-con and a former member of Al Capone's criminal empire. In prison, a fellow con, engineer Jason Fiddler develops what he thinks is the perfect way to deliver illicit liquor to central Chicago. Once out of jail, Bass approaches his old friend Frank Nitti to sell the idea. Nitti has been hit hard lately by Eliot Ness and the Untouchables who have pretty well shut down most of his distilleries and the speakeasies are starting to close their doors. Nitti tries to solve the delivery problem himself but in the end, agrees to Bass and Fiddler's scheme. ..."
}, {
  "imdbId" : "0052522",
  "season" : "3",
  "episodeNumber" : "6",
  "title" : "Loophole",
  "description" : "Morton Halas is an aggressive and very successful defense attorney who will stop at nothing to get his clients off. Having successfully defended Big Mike Probich he finds himself working for Larry Coombs, another small-time mobster who has ambition to rise to the top. Coombs and his top enforcer Whitey Metz decide to knock off Probich and take over his network. They succeed but things don't go as smoothly as planned and Eliot Ness soon has an eye witness who can identify both of them. Halas has a flair for the dramatic and just as the verdict in the case is about to ..."
}, {
  "imdbId" : "0052522",
  "season" : "3",
  "episodeNumber" : "7",
  "title" : "Jigsaw",
  "description" : "Frank Nitti has a major problem: someone in his organization is leaking information to Eliot Ness and the Untouchables. They've closed down several of his distilleries and several members of the organization are starting to question Nitti's leadership. He decides to seek out someone who use to work for Al Capone, Walter Trager known as the Leaker, who has a knack for finding and closing down leaks in the organization. Trager narrows the possible list of leakers down to two people: Nitti driver Marty Wilger and his own brother-in-law Harry Mailer, a local politician on..."
}, {
  "imdbId" : "0052522",
  "season" : "3",
  "episodeNumber" : "8",
  "title" : "Man Killer",
  "description" : "Eliot Ness and his men are having success shutting down the narcotics trade in Chicago thanks to a series of anonymous telephone tips. Ness manages to trace the call to a phone booth and identify the caller as Nick Dulov, owner of the Windy City cab company. Dulov has stolen Nitti's 15 kilo shipment of heroin and then gives it back to him - with a proposition that they go into the narcotics distribution business together. Dulov's wife, Georgiana Drake, is fed up with their relationship however and having killed her husband tries to convince Nitti to do business with ..."
}, {
  "imdbId" : "0052522",
  "season" : "3",
  "episodeNumber" : "9",
  "title" : "City Without a Name",
  "description" : "After a Federal Agent is gunned down, Eliot Ness and his Untouchables arrive in town to try and solve their colleague's murder. The perpetrator is believed to be Lou Mungo and his precipitous action is exactly the opening Frank Nitti was waiting for so he could move in himself. Nitti hires the smooth talking gambler Sebastian to convince Mungo to hand over his contacts at City Hall and he soon has the information he needs to blackmail Mungo. With Nitti putting pressure on Sebastian to get the deal done, Mungo decides to play hardball. Ness meanwhile is slowly building..."
}, {
  "imdbId" : "0052522",
  "season" : "3",
  "episodeNumber" : "10",
  "title" : "Hammerlock",
  "description" : "Always looking to expand their area of control, the mob is now out to get control of the bakery industry. Eliot Ness is in New York to testify at a trial and the local US Attorney asks him to stay on to help with the problem. Under the control of the Syndicate, Louis 'Lepke' Buchalter tasks Bryan \"Bull\" Hanlon to gain control of the industry by establishing a truckers association to get control of deliveries. Hanlon's inclination is to start with small bakers and slowly move up but under orders, he goes after the largest baker in the industry, Adam Stone. Highly ..."
}, {
  "imdbId" : "0052522",
  "season" : "3",
  "episodeNumber" : "11",
  "title" : "The Canada Run",
  "description" : "Father Francis Gregory thinks nothing short of a miracle has happened when Joe Palakopolous, known as Mr. Pal to his friends, walks into his church. Pal is very generous and provides several hundred dollars to start up and maintain a soup kitchen. He also buys the church a new organ and puts up a brightly lit cross atop the church steeple. What Father Gregory doesn't know is that Pal is a gangster who smuggles in whiskey from Canada and is using this small community as a base of operations. Ness and his men are soon onto Pal when a top brand of Canadian whiskey, ..."
}, {
  "imdbId" : "0052522",
  "season" : "3",
  "episodeNumber" : "12",
  "title" : "Fall Guy",
  "description" : "After mob hit man Frankie Gruder kills a warehouseman - and is almost nabbed by Eliot Ness and his men in the process - he turns to his old friend Julius Vernon to get him out of it. Vernon conspires with Willie Willinsky, who knows practically every crook in town, to find someone to plead guilty to the murder. The fraud works so well that Vernon suggests the three of them form an employment agency of sorts. Anyone who wants a crime committed need only tell them what they want done. Vernon will devise the scheme, Willinsky will find the men to make it happen and ..."
}, {
  "imdbId" : "0052522",
  "season" : "3",
  "episodeNumber" : "13",
  "title" : "The Gang War",
  "description" : "When gangsters invade and shoot up a speakeasy on the outskirts of Chicago, Ness thinks Frank Nitti may be trying to get rid of some of his competition. When one of Nitti's joints is bombed soon after, the authorities are worried that a massive gang war may erupt. The problem for Nitti is that the out-of-town clubs are getting quality booze smuggled in from Canada and its drawing away his well-heeled customers. He learns from one of the roadhouse managers that Parnise Surigao has been importing the liquor but he won't reveal where or how he's doing it. When Nitti ..."
}, {
  "imdbId" : "0052522",
  "season" : "3",
  "episodeNumber" : "14",
  "title" : "Silent Partner",
  "description" : "When Wallace Laughton is killed by Federal Agents, a mysterious man known only as The Partner orders that the agent responsible be eliminated. The Partner is a mysterious man whose identity is known to only a very few. He is reputedly the top man in organized crime. Lee Hobson is the agent responsible for shooting Laughton but when Eliot Ness gets wind of the contract, he claims responsibility and makes a point of telling the Press. Lee is taken aback with Eliot's moves and resents what he sees as his boss taking all the glory. When the contract killers kidnap Lee as ..."
}, {
  "imdbId" : "0052522",
  "season" : "3",
  "episodeNumber" : "15",
  "title" : "The Whitey Steele Story",
  "description" : "In New York on a case, Eliot Ness learns that mobster Joe Kulak is out to get control of the racing wire. The wire provides horse racing results from tracks across the country to betting parlors and bookies. The mob is out to get control of Michael Barrigan's wire service and they've killed Barrigan's two partners to put pressure on him. With information that Gregory Pindar will be running the mob's wire service, Ness travels to San Francisco undercover posing as hoodlum Whitey Steele to see if he can infiltrate the new operation. He gets a job with Pindar and learns ..."
}, {
  "imdbId" : "0052522",
  "season" : "3",
  "episodeNumber" : "16",
  "title" : "The Death Tree",
  "description" : "In the Gypsy quarter of Chicago, drunkenness is taking its toll in fights and killings. The local community elders, known as the Senate, want to bring it to an end but come into conflict with Janos Colescou, owner of much of the illicit liquor distribution in the area. He kills the head of the Senate, Victor Bartok and when the opposition continues, kills his brother Fedor. Throughout, Colescou has revived an old custom of posting his victims name on an old tree in the neighborhood. For Ness and his men, the goal is to try to bring Colescou out into the open and for ..."
}, {
  "imdbId" : "0052522",
  "season" : "3",
  "episodeNumber" : "17",
  "title" : "Takeover",
  "description" : "The demand for real beer goes unabated and Charlie Zenko tries to consolidate his control of the North side of Chicago. He arranges for brew master Franz Koenig to get a visit from Eliot Ness. At his trial however, Koenig is saved when a stranger, Leo Mencken, provides him with the alibi he needs. Soon Koenig and Mencken are partners and are using Mencken's unique way of temporarily masking the re-alcoholization of the beer they produce. Charlie Zenko is none too pleased that his competition is back on the street but has the good sense to check with New York mobster ..."
}, {
  "imdbId" : "0052522",
  "season" : "3",
  "episodeNumber" : "18",
  "title" : "The Stryker Brothers",
  "description" : "Soon after the three Stryker brothers rob a train, killing someone in the process, Eliot Ness and his untouchables are on their trail. They get a warrant and seize the Strykers books and papers hoping to find something incriminating. The dim-witted Benny Striker has kept a piece of correspondence from the train robbery and his brothers decide they need to somehow get rid of that evidence. Benny approaches an old friend Mr. Jaeger, a retired arsonist, to set the Federal building's evidence room on fire and destroy the documents. He succeeds, but Ness uses basic ..."
}, {
  "imdbId" : "0052522",
  "season" : "3",
  "episodeNumber" : "19",
  "title" : "Element of Danger",
  "description" : "Victor Rait has developed a new method for converting opium to heroin and he and his partner Arnold Stegler hope to make a handsome profit. When Rait kills a Chicago policeman, who was actually on loan and working for Eliot Ness, he realizes that they have to clear out of their current location. Just as they are leaving Ness and his men arrives and Rait pretends to be an innocent bystander and witness to the shooting. When Stegler decides to eliminate Rait, Ness decides to use that to get Victor to cooperate."
}, {
  "imdbId" : "0052522",
  "season" : "3",
  "episodeNumber" : "20",
  "title" : "The Maggie Storm Story",
  "description" : "When junkie Benny Rivas is stopped by Eliot Ness and his men, he tells them in his dying breath that the source of his heroin is the 808 Club. Ness knows the club's hostess, Maggie Storm, quite well. She's married to the frequently absent owner and denies any knowledge of drugs being sold on the premises. In fact, she has set up a very clever trading floor where mobsters bid for anything from drugs to counterfeit money. She has a bigger problem however when Louis 'Lepke' Buchalter decides he wants to take over the club and sends his murderous henchman Vince Shirer to ..."
}, {
  "imdbId" : "0052522",
  "season" : "3",
  "episodeNumber" : "21",
  "title" : "Man in the Middle",
  "description" : "Slot machines have become all the rage and William 'Porker' Davis is making a fortune on all of those nickels and dimes. He soon comes under pressure from mobster Joe Bomer who's prepared to let him stay in business provided he gives the players a 70% return on their bets thereby making sure they will always come back. Davis agrees but when Bomer finds out the machines have been doctored to pay out less, Davis is soon on the run. Turns out it's Davis' friend and Bomer employee Benjy Liemer who has been fiddling with the machines and also providing Ness with anonymous ..."
}, {
  "imdbId" : "0052522",
  "season" : "3",
  "episodeNumber" : "22",
  "title" : "Downfall",
  "description" : "Joseph December is a legitimate businessman and the scion of a wealthy family who own the Great Lakes Pacific railroad which, by all accounts, is on its last legs. With Eliot Ness receiving hot tips and managing to intercept liquor being smuggled in from Canada, Al Capone enforcer Pete 'The Persuader' Kalmiski and his underling Allan Sitkin approach December to make a deal. In return for letting them use his railway, December get to keep 20% of the proceeds. The death of a railway track worker however puts Ness and the Untouchables onto the scheme. When a side deal on..."
}, {
  "imdbId" : "0052522",
  "season" : "3",
  "episodeNumber" : "23",
  "title" : "The Case Against Eliot Ness",
  "description" : "The 1933 Chicago World's Fair is about to open, and the three Endicott brothers, who have several franchises at the event, expect to make a killing. But the killing that develops isn't what they had in mind."
}, {
  "imdbId" : "0052522",
  "season" : "3",
  "episodeNumber" : "24",
  "title" : "The Ginnie Littlesmith Story",
  "description" : "A vice ring known as the Group has been hiding their speakeasies and brothels by using free soup kitchens as a front. When white slaver Chez Goshen dies his niece, Ginnie Littlesmith, decides to take possession of the Group's books. She had worked for her uncle and feels it is her inheritance. Enforcer Vic Cassandros tries to seduce the spinsterish Ginnie to get his hands on those books. Eliot Ness wants to get his hands on them as well knowing it would be the end of that racket."
}, {
  "imdbId" : "0052522",
  "season" : "3",
  "episodeNumber" : "25",
  "title" : "The Contract",
  "description" : "When the attempted assassination of small-time hood Smiley Barris, New York mobster Joe Kulak hires cold-blooded assassin Ray Quist to kill him. Ness tries to get Barris to cooperate but he refuses. When a second attempt on Barris goes wrong, Barris calls his Johnny Templar to help him out. Templar runs a gambling boat that goes out to sea beyond the three mile limit and beyond the long arm of the law. Templar hides his friend Barris on board so Joe Kulak turns the tables on both of them. He cancels Quist's contract and gives it to Templar - who knows that anyone who ..."
}, {
  "imdbId" : "0052522",
  "season" : "3",
  "episodeNumber" : "26",
  "title" : "Pressure",
  "description" : "With the end of Prohibition, gangsters have now focused on the drug trade. A New York-based syndicate known as the Big Six, long established in the illegal drug business, visit drug distributor Louis 'The Bear' Madikoff in Chicago who has had his recent shipments to Lucky Luciano in New York picked off by Eliot Ness and his agents. Madikoff is convinced that fellow Chicago drug dealer Mike Pavanos is responsible for feeding Ness with information so he sets out to even the score. It turns out however that Madikoff's son Danny is dating Pavano's daughter Francie. Their ..."
}, {
  "imdbId" : "0052522",
  "season" : "3",
  "episodeNumber" : "27",
  "title" : "Arsenal",
  "description" : "Frank Nitti and Bugs Moran are about to go to war, and to forestall that possibility, Elliot Ness and the Untouchables begin rounding up every machine gun owned by the gangsters' hitmen. To resupply himself, Nitti hires Polish gunsmith Jan Trobek to make a dozen Tommy guns. Unfortunately for Trobek and his wife, Nitti and Moran soon settle their differences, which means that the pair are now witnesses who could turn into liabilities for Nitti."
}, {
  "imdbId" : "0052522",
  "season" : "3",
  "episodeNumber" : "28",
  "title" : "The Monkey Wrench",
  "description" : "The mobsters are fighting among themselves for greater control of the beer market and Frank Nitti thinks he has the perfect solution. He is smuggling German brew masters into the United States and as a result, is making a far superior product than his competitors. This doesn't sit well with the New York mob, particularly Joe Kulic who decides to do something about it. He hires enforcer Karl Hansa, a bit of a madman, to infiltrate Nitti's operation and shut it down. Eliot Ness and the Untouchables are soon on to the whole scheme thanks to information from an attractive..."
}, {
  "imdbId" : "0052522",
  "season" : "4",
  "episodeNumber" : "1",
  "title" : "The Night They Shot Santa Claus",
  "description" : "It's Christmas eve 1930 and Eliot Ness and his men are investigating the murder of a close friend of his, Hap Levinson. The man had been playing Santa Claus at a children's orphanage and had just left when he was gunned down by a passing car. Levinson was the front man in a nightclub-speakeasy and he and Ness had spent many hours together laughing and passing the time of day. As Ness looks into his old friend's background, he learns that he may have had a girlfriend named Rene that he kept in a downtown apartment. It's readily apparent that she's a junkie and what he..."
}, {
  "imdbId" : "0052522",
  "season" : "4",
  "episodeNumber" : "2",
  "title" : "The Cooker in the Sky",
  "description" : "With their breweries being knocked off by the Feds, local mobsters bring in an outsider from New York, Joey Lassiter. Known as the best inside man in the business, he promises them a Ness-proof operation. Caught in the middle is Harry Gordon, the current inside man who now finds himself nothing more than an errand boy. Harry's wife Edna isn't too pleased and starts feeding information to Ness. She eventually convinces Harry to do the same and were it not for their tips, Ness would be completely in the dark. Soon however, Ness and his men find the location of ..."
}, {
  "imdbId" : "0052522",
  "season" : "4",
  "episodeNumber" : "3",
  "title" : "The Chess Game",
  "description" : "Having had major successes in eliminating the illegal trade in champagne, Eliot Ness and the Untouchables suddenly find that the expensive wine is finding its way onto the market again. During one raid, they find that a couple of the bottles are frozen solid and Ness speculates that they may have been shipped in a refrigerated car. They trace the illegal shipment to Ira Bauer, a blind fish and seafood wholesaler. For Bauer, his lack sight is anything but an impediment. He particularly likes to play chess as a way of keeping his mind sharp. He and Ness are soon ..."
}, {
  "imdbId" : "0052522",
  "season" : "4",
  "episodeNumber" : "4",
  "title" : "The Economist",
  "description" : "With the price of illicit liquor bottoming out, Vincent Tunis suggests to his fellow syndicate members that they store their liquor rather than sell it, thereby creating an artificial shortage and pushing up the price. Eliot Ness and his men become aware of what's going on when the syndicate also starts to put small moonshiners out of business. When the only mobster who knows the location of the liquor is killed, Ness and his men try to find the only remaining truck driver from the job before the syndicate does."
}, {
  "imdbId" : "0052522",
  "season" : "4",
  "episodeNumber" : "5",
  "title" : "The Pea",
  "description" : "Herbie Catcher is a small-time nobody who really wants to improve his status in life. He tries to impress those around him, but without success. He's even tried to feed information to Eliot Ness hoping for praise, but he really has nothing to offer. He's a busboy at a posh restaurant run by Max Zenner and he's not very good at it. On the verge of being fired, he claims to have a recently killed employee's book naming names and other activities that have gone on at the restaurant., especially having to do with mobster Martin Rawlings. His demands aren't that great: he ..."
}, {
  "imdbId" : "0052522",
  "season" : "4",
  "episodeNumber" : "6",
  "title" : "Bird in the Hand",
  "description" : "Gangster Arnie Kurtz is moving into Chicago's South Side and Eliot Ness very much wants to nab him, putting a 24 hour watch and tapping his phones. The operation is put in danger however when Kurtz inadvertently becomes part of a public health emergency. Against his better judgment - but at his wife's insistence - he agrees to let her brother Benno Fisk deliver $100,000 to a New York mobster. Unknown to anyone, Benno has contracted Parrot Fever from a recently acquired pet and collapses soon after his arrival. Federal health official frantically try to trace the ..."
}, {
  "imdbId" : "0052522",
  "season" : "4",
  "episodeNumber" : "7",
  "title" : "The Eddie O'Gara Story",
  "description" : "Bugs Moran, hiding out since Al Capone eliminated his gang in the St. Valentine's Day Massacre, is visited by Eddie O'Gara, a man he thought had been killed by rival gangsters several years previously. Although he never cared for O'Gara in the first place, Moran is intrigued when Eddie lays out a plan to put Moran back in charge of the rackets again. Meanwhile, Elliot Ness is looking for Moran and O'Gara, figuring that both will want revenge on the gangsters who are responsible for their plight and that he can use that to destroy the Chicago syndicates permanently."
}, {
  "imdbId" : "0052522",
  "season" : "4",
  "episodeNumber" : "8",
  "title" : "Elegy",
  "description" : "When mobster Charley Radick learns that he has leukemia and only a short time to live, he decides the time has come to visit his daughter, Margaret, now a young woman. When Charley had gone to prison for a 10 year stretch, he had left her with the Wilsons but when he got out, he decided to concentrate on moving up in the rackets and left the girl with them. When he visits the Wilsons however, he's told that Margaret left some three years before. When Eliot Ness learns that Radick is dying, he asks him to come clean and give him the organization's books. Radick makes a..."
}, {
  "imdbId" : "0052522",
  "season" : "4",
  "episodeNumber" : "9",
  "title" : "Come and Kill Me",
  "description" : "After a mobster with valuable information is killed in broad daylight at the racetrack, Eliot Ness and his men try to identify the killer. No one will admit knowing him but by tracing his movements, they find he was a regular visitor to the home of Dexter Lloyd Bayless who lives in a well-to-do suburb of Chicago. Through surveillance, they note that he has regular visitors in the afternoon and Ness decides to break into the house to plant a listening device. Through that, they learn that Bayless is running a very special school out of his home: a school for assassins."
}, {
  "imdbId" : "0052522",
  "season" : "4",
  "episodeNumber" : "10",
  "title" : "A Fist of Five",
  "description" : "Mike Brannon is a tough cop but his two blocks of Chicago are among the safest there are. He has a tendency to be rough with hoodlums and when he beats up one of Tony Lamberto's boys he finds himself on indefinite suspension. Fed up with his corrupt superiors, he decides the time has come for him to make some money so he enlists his four brothers in a plot to kidnap Lamberto and hold him for $150,000 ransom. Unbeknown to anyone, Lamberto had recently approached Eliot Ness with a proposition: he would be prepared to roll up his entire operation and retire if the ..."
}, {
  "imdbId" : "0052522",
  "season" : "4",
  "episodeNumber" : "11",
  "title" : "The Floyd Gibbons Story",
  "description" : "When newspaper man Carlton Edwards is gunned down on the street, the police and his friends initially think it's a case of being in the wrong place at the wrong time. Eliot Ness and his men soon determine that Edwards was the target of a mob hit. His old friend, Floyd Gibbons, now a globe-trotting reporter, happens to be passing through Chicago and decides he's going to find the culprit. Working with Ness, they soon uncover that the hit was related to a series of articles Edwards was planning on the takeover of the scrap metal business by the mob."
}, {
  "imdbId" : "0052522",
  "season" : "4",
  "episodeNumber" : "12",
  "title" : "Doublecross",
  "description" : "Mobster Jake Kuzik is a major liquor supplier in Chicago and he doesn't hesitate to use strong arm tactics to keep his network of distributors and retailers in check. He's been having trouble getting supply lately and he comes under pressure - helped along by Eliot Ness and his men - to find liquor for sale or else. He forms an alliance with an arch-rival, Bugs Moran, to import half a million gallons of whiskey by train and they set up a clever deception to keep Federal agents off the scent."
}, {
  "imdbId" : "0052522",
  "season" : "4",
  "episodeNumber" : "13",
  "title" : "Search for a Dead Man",
  "description" : "When a body if fished out of the river, Lt. Aggie Stewart of the Bureau of Missing Persons is put I charge of the case. After 10 days and having made little headway, the body is buried in a pauper's grave. As is her custom, she attends the funeral to see if anyone shows up. In this case, flowers are sent from a well-known mob-owned business. She manages to trace the woman who sent the flowers. Eliot Ness meanwhile is looking to stop the biggest shipment ever of illegal liquor worth well over $1 million. What they all soon realize is that the two cases are connected."
}, {
  "imdbId" : "0052522",
  "season" : "4",
  "episodeNumber" : "14",
  "title" : "The Speculator",
  "description" : "Leo Stazak is a small time con artist on the periphery of the mob and he decides to con Frank Nitti in a stock scam. Stazak is a fast talker and an expert liar who quickly gains Nitti's confidence. Soon, the big man has entrusted half a million dollars to Stazak who has been printing fake stock certificates. Ness is also on to Stazak's printer and it doesn't take long for Nitti to realize what is going on."
}, {
  "imdbId" : "0052522",
  "season" : "4",
  "episodeNumber" : "15",
  "title" : "The Snowball",
  "description" : "Jack Parker is an up and coming young hustler who wants to become part of Frank Nitti's organization. He thinks there's an untapped market on university and college campuses but Nitti thinks he's just a nickel and dimer and isn't interested. Parker has been making his own booze and selling it through Benny Angel, who hangs around the campus actually selling the stuff to the kids. Parker decides to get Nitti's interest by secretly arranging to sell wood alcohol to students and then convincing Nitti that he can make sure the stuff sold to students is clean. When Benny ..."
}, {
  "imdbId" : "0052522",
  "season" : "4",
  "episodeNumber" : "16",
  "title" : "Jake Dance",
  "description" : "When a large supply of hair tonic is stolen, Ness and the Untouchables are concerned that it may be used as a base for illegal - and deadly - liquor. Soon after, the stuff starts to appear flavored with ginger jake, a popular patent medicine. The result is a permanent neurological disorder that was first seen in a major outbreak in Kansas City. The first victim in Chicago is Mary Kay Spencer, a 17 year old who drank the stuff while out on a date with her boyfriend. Working with public health officials, Ness tries to track down the source of the deadly hooch."
}, {
  "imdbId" : "0052522",
  "season" : "4",
  "episodeNumber" : "17",
  "title" : "Blues for a Gone Goose",
  "description" : "Ray 'Goose' Gander runs a jazz club in Chicago and he's coming under pressure from mobster Lou Cagan to sell booze at the club. Gander is a former musician who is in the business for the love of the music and wants nothing to do with selling the mob's liquor, but he's being backed into a corner. His protg, trumpeter Eddie Moon, urges him to pack it in and go on the road but when Gander refuses, Eddie also talks him out of signing up with Cagan. When Gander is shot, Eddie blames himself for the death of his friend and mentor and he works with Eliot Ness and the ..."
}, {
  "imdbId" : "0052522",
  "season" : "4",
  "episodeNumber" : "18",
  "title" : "Globe of Death",
  "description" : "Frank Nitti decides to import a large amount of heroin - $2 million worth. Eliot Ness is soon onto him and arrests the delivery man, Mr. Yang from Shanghai, but he no longer has the goods and they have no reason to detain him. Ness and one of his men travel to San Francisco to see if they can determine how the goods were smuggled into the country and determine that it entered on a passenger cruiser and was then shipped by air to Chicago enclosed in a large globe. Meanwhile, one of Nitti's fellow gangsters, Larry Bass, has his own plans for the drugs and assembles his ..."
}, {
  "imdbId" : "0052522",
  "season" : "4",
  "episodeNumber" : "19",
  "title" : "An Eye for an Eye",
  "description" : "A father's heartbreak at his son's death leads him to partner with Eliot Ness to bring in a major liquor distributor. Charles Tarasovich knows his son delivered liquor for Sol Girsch and Ness knows it as well, but without a witness who's actually done business with Girsch, there's no chance of getting a conviction. Charles offers to set a trap for Girsch and Ness agrees. Girsch meanwhile has seen his business grow to over 500 distributors and now wants a better deal from those who manufacture the illicit liquor. He also brings in some mobsters from Detroit to make ..."
}, {
  "imdbId" : "0052522",
  "season" : "4",
  "episodeNumber" : "20",
  "title" : "Junk Man",
  "description" : "Mobster Victor Salazar is out to steal a commercial shipment of morphine destined to a Chicago medical facility. Before he can do so however, it's snatched out from under him by one of his henchman, Steve Ballard. With Eliot Ness and his men have been keeping a close eye on Salazar, the drug kingpin desperately tries to find the junk. What he doesn't know is that another of his underlings, Barney Howe is actually Barney Retsick, a Federal narcotics Agent. Retsick and Ness work together to arrest all of the criminals before the narcotics, disguised as children's candy,..."
}, {
  "imdbId" : "0052522",
  "season" : "4",
  "episodeNumber" : "21",
  "title" : "The Man in the Cooler",
  "description" : "Ness arranges parole for convict Al Remp, in order for Remp to obtain information enough to convict his old boss, bootlegger Fat Augie Strom. Remp's wife is not informed about the fact that Remp is actually working for Ness, and begs Ness to put her husband back in jail where she feels he's safe from the temptation of power. As he works his way up in Strom's organization, will Remp be able to resist the idea of going back to his old way of life?"
}, {
  "imdbId" : "0052522",
  "season" : "4",
  "episodeNumber" : "22",
  "title" : "The Butcher's Boy",
  "description" : "A World War 1 veteran runs one of the city's most vicious extortion rackets, tasked to protect Chicago's butcher's from the mob. But a double cross by one of his own gives Ness an opening to trap the thug."
}, {
  "imdbId" : "0052522",
  "season" : "4",
  "episodeNumber" : "23",
  "title" : "The Spoiler",
  "description" : "Johnny Mizo has been on the lam for several years working as a seaman on cargo ships. He left the country after stealing $200,000 from mobster Vince Majesky who has been waiting patiently for his return. On Mizo's arrival in the U.S., Majesky has his hoods waiting for him but they kill the wrong man so both Majesky and Eliot Ness are now on the lookout for him in Chicago. When he committed the original robbery, Mizo's brother was killed but that doesn't stop him from seeking his sister-in-law's help and recruiting his nephew Arnie as he attempts to recover the hidden ..."
}, {
  "imdbId" : "0052522",
  "season" : "4",
  "episodeNumber" : "24",
  "title" : "One Last Killing",
  "description" : "Eliot Ness knows that John \"The Cropper\" Cropsie killed Belle Alpine's husband and that she witnessed it but for reasons of her own, she won't identify him. Cropsie is a small-time hood who wants to get into the big-time and gets a job loan-sharking for Julie Flack. One of his marks tells him that a local company has manufactured 50,000 gallons of industrial alcohol. He manages to steal the precious liquid and tries to sell it to Flack. Ness is onto him quickly and Cropsie has made a serious error in including Belle Alpine's brother-in-law Murray in his plans."
}, {
  "imdbId" : "0052522",
  "season" : "4",
  "episodeNumber" : "25",
  "title" : "The Giant Killer",
  "description" : "A tipoff to Ness leads to the capture of mob boss Ed 'The Duke' Monte, who is then convicted of possession of counterfeit money. However, with the assistance of his loyal henchman Yanos Dalker, Monte escapes from prison and is hidden out. Monte then sends an offer to Ness to turn himself in, but only if Ness reveals to him the name of the person who tipped him off and led to his arrest. Monte's main suspect is his son-in-law Lou Sultan, who was leading his organization during his imprisonment."
}, {
  "imdbId" : "0052522",
  "season" : "4",
  "episodeNumber" : "26",
  "title" : "The Charlie Argos Story",
  "description" : "Prohibition has come to an end and bootlegger Frank \"The King\" Argos has also come to the end of his life. He asks Eliot Ness to become the executor of his estate but Ness declines, for obvious reasons. He's left everything to his son Charlie, who was declared missing in action at the very end of World War I. When his minions find that life The King's money is not very much to their liking, they recruit and train someone to pose as the long lost Charlie. The man they've chosen however seems to know more about Charlie's childhood than they do."
}, {
  "imdbId" : "0052522",
  "season" : "4",
  "episodeNumber" : "27",
  "title" : "The Jazz Man",
  "description" : "When a police captain's son is arrested in a drug sweep, Eliot Ness decides to try and locate the source of the drugs. The pusher was someone known as Peepers but he dies before they can get much information from him. They do manage to trace him to Chicago nightclub owner Sal Rudin and believe the heroin originated in New Orleans. Ness travels to the Big Easy posing as a bass player and meets booking agent Russ Bogan, who is part of the distribution network. He also learns of their unique system of delivering the goods across the country."
}, {
  "imdbId" : "0052522",
  "season" : "4",
  "episodeNumber" : "28",
  "title" : "The Torpedo",
  "description" : "Mobster Victor Kurtz makes peace with his main rival for illegal liquor distribution in Chicago's South Side, Monk Lyselle. All goes well for several months until Eliot Ness and his men begin to intervene. They begin to hijack Kurtz' trucks and he automatically assumes that Lyselle has broken their agreement. Over the several months there was peace, Kurtz' main gunman, Holly Kester, has lost his nerve and Ness focuses on him as a possible way to put both Kurtz and Lyselle out of business."
}, {
  "imdbId" : "0052522",
  "season" : "4",
  "episodeNumber" : "29",
  "title" : "Line of Fire",
  "description" : "When one of Marty Pulaski's dance hall girls is shot by a sniper just outside his nightclub, he automatically assumes that his main rival, Vince Bogan, is responsible. Bogan controls most of the 10 cent dance halls in Chicago, but there has been peace between the two, mostly because of mobster Janos 'Jake' Szabo. Marty loses his temper and kills Bogan which Szabo is willing to forgive, if Bogan really ordered the killing. When a second girl is killed, it becomes obvious that someone else is behind the killing and Marty tries to protect himself and his brother Herbie."
}, {
  "imdbId" : "0052522",
  "season" : "4",
  "episodeNumber" : "30",
  "title" : "A Taste for Pineapple",
  "description" : "When racketeer Danny Mundt decides the time has come to get rid of Eliot Ness, he hires hit man Elroy Daldran. During World War I, Elroy had developed a taste for killing and he saw no reason to stop doing what he liked just because the war was over. His first attempt to get Ness - he tosses a grenade into his passing car - isn't entirely successful. Ness manages to jump out of the car before the grenade explodes but when he regains consciousness, he finds that he is blind. While Mundt is satisfied with the result, Elroy won't be satisfied until the job is completely ..."
}]