[{
  "imdbId" : "7752136",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Africa",
  "description" : "200,000 years ago, a new species, Homo sapiens, appeared on the African landscape. While scientists have long imagined eastern Africa as a real-life Garden of Eden, the latest research suggests humans evolved in many places across the continent at the same time. Now, the DNA of a 19th-century African-American slave reveals that during the early days of our species, our ancestors continued meeting, mating and hybridizing with other human types in Africa--creating ever greater diversity within us."
}, {
  "imdbId" : "7752136",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Asia",
  "description" : "Discover the ancient humans living across Asia when Homo sapiens arrived. Our ancestors mated with them and their genes found a home within our DNA. More than that, they've helped us face down extinction."
}, {
  "imdbId" : "7752136",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Australia",
  "description" : "When humans arrived in Australia, they were, for the first time, truly alone, surrounded by wildly different flora and fauna. How did they survive and populate a continent? There is a close cultural and genetic link between early Australians and modern-day Aborigines; here the ancient and modern story intersect as nowhere else. The secret to this continuity is diversity. Intuitively, early Australians found the right balance between being separate and connected."
}, {
  "imdbId" : "7752136",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Europe",
  "description" : "When Homo sapiens turned up in prehistoric Europe, they ran into the Neanderthals. The two types of human were similar enough-intellectually and culturally-to interbreed. But as more Homo sapiens moved into Europe and the population increased, there was an explosion of art and symbolic thought which overwhelmed the Neanderthals. Ever since, we've had Europe-and the rest of the world-to ourselves."
}, {
  "imdbId" : "7752136",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Americas",
  "description" : "As early humans spread out across the world, their toughest challenge was colonizing the Americas because a huge ice sheet blocked the route. It has long been thought that the first Americans were Clovis people, who arrived 13,000 years ago. But an underwater discovery in Mexico suggests people arrived earlier--coming by boat, not on foot. How closely related were these early Americans to today's Native Americans? It's an emotive issue, involving one of the most controversial fossils in the world, Kennewick Man."
}]