[{
  "imdbId" : "1145500",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Volcano",
  "description" : "Although they are destructive, volcanoes were crucial to the development of life on our planet. Iain's journey takes him to Ethiopia to discover lava lakes, to Iceland to scuba dive between continents, and to New Zealand to sample hot springs. But it's not just a holiday for Dr Stewart: he has a serious point to make."
}, {
  "imdbId" : "1145500",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Atmosphere",
  "description" : "Iain explains the geological paradoxes how our green planet's atmosphere is both destructive and protective, mighty and vulnerable, vital to life's metabolism and altered by it. Its many layers have different functions, notably in climatic processes. Its alteration is crucial to climatic change, both natural cyclical and the man-caused greenhouse effect. As winds, ultimately powered by solar energy, deified in various cultures, it shapes matter trough erosion and moves lots of it, especially rains and dust. It also allows air travel."
}, {
  "imdbId" : "1145500",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Ice",
  "description" : "After explaining how snow, crystallized frozen water, turns into ice, we examine it's major role in shaping the earth's surface. Glaciers exert enormous forces, capable of extreme erosion, and often faster then it appears. The polar caps are entirely ice-covered, even permanently hiding Antarctica's island archipelago and world top 10-lake. Climate change is largely about ice advance or retreat, which also vastly contributes to currents modification."
}, {
  "imdbId" : "1145500",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Oceans",
  "description" : "The oceans cover 3/4 of earth's surface and make it viable. Their brute, eroding, tidal (lunar/solar gravity-powered) surf-force helps physically shape the planet, especially the coast, and powers currents, which are vital for climate in interaction with winds. The oceans' own shape is determined by the tectonic drift of the continents. Their micro-organisms, phytoplankton, are crucial in starting the food-cycle of life trough photo-synthesis and generation of oxygen. Archeological evidence shows how terrible the consequence of major oceanic disturbances can be, which..."
}, {
  "imdbId" : "1145500",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Rare Earth",
  "description" : "Our planet is unique within the solar system. Four-and-a-half billion years ago it had a 'twin' named Theia which was absorbed into the Earth, increasing its gravity and allowing it to form an atmosphere. Iain travels to Meteor Crater in Arizona to explore the atmosphere's role in protecting us from bombardment by meteorites, and finds that life on earth only prospers because it is provided with right amount of heat from the sun."
}]