[{
  "imdbId" : "0121955",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Unaired Pilot",
  "description" : "Cartman wakes up and realizes he was abducted by aliens after hearing it from his friends. He is in major denial at first though, but even Chef is a believer."
}, {
  "imdbId" : "0121955",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Cartman Gets an Anal Probe",
  "description" : "Cartman's dream about being abducted by aliens turns out to have actually happened, and when the aliens take Kyle's brother, all of them must find a way to bring the aliens back and confront them."
}, {
  "imdbId" : "0121955",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Weight Gain 4000",
  "description" : "Kathie Lee Gifford comes to South Park to present an award to Cartman, and Mr. Garrison hopes to use the event to assassinate her."
}, {
  "imdbId" : "0121955",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Volcano",
  "description" : "The kids go hunting with the rather trigger happy Jimbo and Ned. Little do they know that a volcano is on the verge of erupting."
}, {
  "imdbId" : "0121955",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Big Gay Al's Big Gay Boat Ride",
  "description" : "Stan becomes distracted from the upcoming football game because his dog is gay, so he turns to the gayest man in town for advice, Big Gay Al."
}, {
  "imdbId" : "0121955",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "An Elephant Makes Love to a Pig",
  "description" : "Kyle tries to crossbreed an elephant with a pig to win a science contest."
}, {
  "imdbId" : "0121955",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Death",
  "description" : "Grampa wants Stan to kill him, the parents all want to kill the Terrance and Philip show, and Death just wants to kill someone."
}, {
  "imdbId" : "0121955",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Pinkeye",
  "description" : "The living dead beset South Park after a bottle of Worcestershire sauce mixes with embalming fluid at the mortuary; Tina Yothera judged a costume contest."
}, {
  "imdbId" : "0121955",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "Starvin' Marvin",
  "description" : "The boys sponsor a starving Ethiopian child, only to have him show up on their doorstep."
}, {
  "imdbId" : "0121955",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "Mr. Hankey, the Christmas Poo",
  "description" : "The town is forced to remove anything that either has anything to do with Christmas or is offensive in the least bit to anyone. And Kyle tries to convince everyone of the existence of \"Mr. Hankey, the Christmas Poo.\""
}, {
  "imdbId" : "0121955",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "Damien",
  "description" : "The son of Satan called Damien is sent to Earth to find Jesus. Jesus and Satan end up in a fight of good and evil. The only problem is it's the same date as Cartman's birthday."
}, {
  "imdbId" : "0121955",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "Tom's Rhinoplasty",
  "description" : "Stan develops a crush on a substitute teacher, which makes his girlfriend Wendy jealous. Meanwhile, Mr. Garrison has plastic surgery."
}, {
  "imdbId" : "0121955",
  "season" : "1",
  "episodeNumber" : "13",
  "title" : "Mecha-Streisand",
  "description" : "Barbra Streisand comes to South Park after she learns that the boys have discovered a mysterious ancient stone. She hopes to unlock the stone's magical powers and transform herself into a deadly robotic giant."
}, {
  "imdbId" : "0121955",
  "season" : "1",
  "episodeNumber" : "14",
  "title" : "Cartman's Mom Is a Dirty Slut",
  "description" : "Eric Cartman goes on a quest to find out who his father was. But when he learns who his mother slept with matters get complicated... because she slept with everybody in town."
}, {
  "imdbId" : "0121955",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "Terrance and Phillip in Not Without My Anus",
  "description" : "Terrance and Phillip must go to Iran to rescue Terrance's kidnapped daughter. Meanwhile Saddam Hussein takes over Canada."
}, {
  "imdbId" : "0121955",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "Cartman's Mom is Still a Dirty Slut",
  "description" : "The boys get snowed in at the hospital while waiting to learn the identity of Cartman's father. Meanwhile, the townspeople resort to cannibalism when they get snowed in."
}, {
  "imdbId" : "0121955",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "Ike's Wee Wee",
  "description" : "Mr. Mackey is fired from school after losing a marijuana sample in class and winds up becoming a druggie, and Kyle tries to keep his brother Ike from having his bris after he finds out what will take place during the ceremony."
}, {
  "imdbId" : "0121955",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "Chickenlover",
  "description" : "Mr. Barbrady goes back to school after it is discovered that he is illiterate. As he learns to read, a criminal is on the loose molesting all the chickens in South Park."
}, {
  "imdbId" : "0121955",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "Conjoined Fetus Lady",
  "description" : "The people of South Park attempt to raise awareness of the school nurse's disability. Meanwhile, the boys travel to China to compete in a dodge ball championship."
}, {
  "imdbId" : "0121955",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "The Mexican Staring Frog of Southern Sri Lanka",
  "description" : "The kids get revenge on Jimbo and Ned after they fail their report on Vietnam. However, their practical joke sparks a fierce ratings war between \"Jesus and Pals\" and Jimbo and Ned's hunting program."
}, {
  "imdbId" : "0121955",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "City on the Edge of Forever",
  "description" : "As their school bus teeters over the edge of a cliff, the boys recall past memories."
}, {
  "imdbId" : "0121955",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "Summer Sucks",
  "description" : "Summer at South park is not going well: fireworks are banned, and a giant ash snake is ravaging the countryside."
}, {
  "imdbId" : "0121955",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "Chef's Salty Chocolate Balls",
  "description" : "Hollywood big-shots try to turn South Park into another Sundance. However, they wreak havoc on the town's eco-system, which could cause Mr. Hankey to die."
}, {
  "imdbId" : "0121955",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "Chickenpox",
  "description" : "The boys get angry and seek revenge when they discover that their parents orchestrated a sleepover at Kenny's house so that they could all get chickenpox."
}, {
  "imdbId" : "0121955",
  "season" : "2",
  "episodeNumber" : "11",
  "title" : "Roger Ebert Should Lay Off the Fatty Foods",
  "description" : "The boys investigate a mysterious conspiracy centered around the South Park Planetarium. Meanwhile, Cartman auditions for a TV commercial."
}, {
  "imdbId" : "0121955",
  "season" : "2",
  "episodeNumber" : "12",
  "title" : "Clubhouses",
  "description" : "Stan builds a clubhouse so he can play truth or dare with Wendy. Meanwhile, he deals with his parents' unexpected divorce."
}, {
  "imdbId" : "0121955",
  "season" : "2",
  "episodeNumber" : "13",
  "title" : "Cow Days",
  "description" : "All of South Park's cows become mesmerized by the town's new Wooden Cow Memorial. Meanwhile, the kids' plan to win a Terence and Philip doll from a carney at the Cow Days festival becomes complicated and dangerous."
}, {
  "imdbId" : "0121955",
  "season" : "2",
  "episodeNumber" : "14",
  "title" : "Chef Aid",
  "description" : "The boys organize a music festival to raise money when Chef is sued by a record company."
}, {
  "imdbId" : "0121955",
  "season" : "2",
  "episodeNumber" : "15",
  "title" : "Spookyfish",
  "description" : "Stan thinks his new pet fish is evil after it kills two people in his bedroom. Also, the parallel-universe version of Cartman shows up in South Park, and everyone likes him more than the real Cartman."
}, {
  "imdbId" : "0121955",
  "season" : "2",
  "episodeNumber" : "16",
  "title" : "Merry Christmas Charlie Manson!",
  "description" : "Stan, Kyle and Kenny go to Nebraska to spend Christmas with Eric's family. Meanwhile, Charlie Manson escapes from prison with Eric's uncle, and the boys help teach him the true meaning of Christmas."
}, {
  "imdbId" : "0121955",
  "season" : "2",
  "episodeNumber" : "17",
  "title" : "Gnomes",
  "description" : "A school assignment pairs the boys up with Tweek, a neurotic boy who claims that gnomes are stealing his underwear. Meanwhile, Tweek's father fights against a corporation that is stealing his business."
}, {
  "imdbId" : "0121955",
  "season" : "2",
  "episodeNumber" : "18",
  "title" : "Prehistoric Ice Man",
  "description" : "Kyle and Stan fight over what to name a man they found frozen in ice from 1996. Meanwhile, the government attempts to steal the frozen man."
}, {
  "imdbId" : "0121955",
  "season" : "3",
  "episodeNumber" : "1",
  "title" : "Rainforest Shmainforest",
  "description" : "The gang gets lost in the rain forest after going to Costa Rica with a singing tour."
}, {
  "imdbId" : "0121955",
  "season" : "3",
  "episodeNumber" : "2",
  "title" : "Spontaneous Combustion",
  "description" : "Randy Marsh becomes a national hero after he discovers the reason why South Park residents are spontaneously combusting. Meanwhile, Kyle and Stan have a plan to help Kyle's dad get a res-erection."
}, {
  "imdbId" : "0121955",
  "season" : "3",
  "episodeNumber" : "3",
  "title" : "The Succubus",
  "description" : "The boys try to save Chef from a woman who is stealing him from them. Meanwhile, Cartman gets glasses."
}, {
  "imdbId" : "0121955",
  "season" : "3",
  "episodeNumber" : "4",
  "title" : "Jakovasaurs",
  "description" : "A surviving breed of dinosaur is discovered in South Park, but no one but Cartman can stand them."
}, {
  "imdbId" : "0121955",
  "season" : "3",
  "episodeNumber" : "5",
  "title" : "Tweek vs. Craig",
  "description" : "The boys pit two classmates against each other for entertainment. Meanwhile, Kenny takes a home ec class."
}, {
  "imdbId" : "0121955",
  "season" : "3",
  "episodeNumber" : "6",
  "title" : "Sexual Harassment Panda",
  "description" : "South Park Elementary is nearly bankrupt when Cartman sues Stan for sexual harassment."
}, {
  "imdbId" : "0121955",
  "season" : "3",
  "episodeNumber" : "7",
  "title" : "Cat Orgy",
  "description" : "Cartman deals with an abusive babysitter, her boyfriend and a cat in heat when his mother goes to a party."
}, {
  "imdbId" : "0121955",
  "season" : "3",
  "episodeNumber" : "8",
  "title" : "Two Guys Naked in a Hot Tub",
  "description" : "Stan is stuck playing with Butters and Pip at a party. Meanwhile, Randy and Gerald experiment with their sexuality."
}, {
  "imdbId" : "0121955",
  "season" : "3",
  "episodeNumber" : "9",
  "title" : "Jewbilee",
  "description" : "Kenny comes with Kyle to Jewish Camp and almost witnesses the destruction of the Jewish faith."
}, {
  "imdbId" : "0121955",
  "season" : "3",
  "episodeNumber" : "10",
  "title" : "Korn's Groovy Pirate Ghost Mystery",
  "description" : "The rock band Korn visits South Park during Halloween to solve the mystery of the pirate ghosts that are terrifying the town."
}, {
  "imdbId" : "0121955",
  "season" : "3",
  "episodeNumber" : "11",
  "title" : "Chinpokomon",
  "description" : "The kids (But not Kyle) get hooked on a brainwashing violent cartoon from Japan which turns them against the American government."
}, {
  "imdbId" : "0121955",
  "season" : "3",
  "episodeNumber" : "12",
  "title" : "Hooked on Monkey Fonics",
  "description" : "The boys have a hard time relating to two new students who have been home schooled."
}, {
  "imdbId" : "0121955",
  "season" : "3",
  "episodeNumber" : "13",
  "title" : "Starvin' Marvin in Space",
  "description" : "The government tries to hunt down Starvin' Marvin after he steals an alien spaceship."
}, {
  "imdbId" : "0121955",
  "season" : "3",
  "episodeNumber" : "14",
  "title" : "The Red Badge of Gayness",
  "description" : "A drunken Civil War re-enactment leads to an actual Civil War breaking out."
}, {
  "imdbId" : "0121955",
  "season" : "3",
  "episodeNumber" : "15",
  "title" : "Mr. Hankey's Christmas Classics",
  "description" : "Mr. Hankey hosts a collection of Christmas songs sung by South Park characters."
}, {
  "imdbId" : "0121955",
  "season" : "3",
  "episodeNumber" : "16",
  "title" : "Are You There God? It's Me, Jesus",
  "description" : "Stan worries that he is maturing more slowly than his friends. Meanwhile, Jesus feels pressured to perform a miracle at the start of the new millennium."
}, {
  "imdbId" : "0121955",
  "season" : "3",
  "episodeNumber" : "17",
  "title" : "World Wide Recorder Concert",
  "description" : "The boys feud with New Yorkers at a gathering of elementary school kids. Meanwhile, Mr. Garrison confronts his father."
}, {
  "imdbId" : "0121955",
  "season" : "4",
  "episodeNumber" : "1",
  "title" : "The Tooth Fairy's Tats 2000",
  "description" : "The boys enter the world of organized crime when they realize they can make money from the tooth fairy with other children's teeth."
}, {
  "imdbId" : "0121955",
  "season" : "4",
  "episodeNumber" : "2",
  "title" : "Cartman's Silly Hate Crime 2000",
  "description" : "Cartman is sent to juvenile hall after he throws a rock at a black child."
}, {
  "imdbId" : "0121955",
  "season" : "4",
  "episodeNumber" : "3",
  "title" : "Timmy 2000",
  "description" : "A handicapped boys' arrival in class leads to protest. Meanwhile, the boys are diagnosed with ADD and heavily medicated."
}, {
  "imdbId" : "0121955",
  "season" : "4",
  "episodeNumber" : "4",
  "title" : "Quintuplets 2000",
  "description" : "The Marshes adopt a group of Romanian Quintuplets after they are orphaned in South Park. However, soon the Romanian government demands them back. Meanwhile, Kenny develops a talent for singing."
}, {
  "imdbId" : "0121955",
  "season" : "4",
  "episodeNumber" : "5",
  "title" : "Cartman Joins NAMBLA",
  "description" : "Cartman joins NAMBLA, thinking it will introduce him to more mature friends. Meanwhile, Kenny tries to dispose of his unborn baby brother."
}, {
  "imdbId" : "0121955",
  "season" : "4",
  "episodeNumber" : "6",
  "title" : "Cherokee Hair Tampons",
  "description" : "Kyle needs a kidney transplant, and Cartman is the only suitable donor. Meanwhile, Mr. Garrison writes a novel."
}, {
  "imdbId" : "0121955",
  "season" : "4",
  "episodeNumber" : "7",
  "title" : "Chef Goes Nanners",
  "description" : "Chef protests the racist South Park flag."
}, {
  "imdbId" : "0121955",
  "season" : "4",
  "episodeNumber" : "8",
  "title" : "Something You Can Do with Your Finger",
  "description" : "Randy is outraged when Stan and the other boys start a boy band."
}, {
  "imdbId" : "0121955",
  "season" : "4",
  "episodeNumber" : "9",
  "title" : "Do the Handicapped Go to Hell?",
  "description" : "The boys become obsessed with religion after a sermon about hell scares them. Meanwhile, Saddam returns to Hell and tries to dispose of Satan's new boyfriend."
}, {
  "imdbId" : "0121955",
  "season" : "4",
  "episodeNumber" : "10",
  "title" : "Probably",
  "description" : "Cartman becomes an evangelical preacher when the boys break off from their church. Meanwhile, the feud between Saddam and Chris continues."
}, {
  "imdbId" : "0121955",
  "season" : "4",
  "episodeNumber" : "11",
  "title" : "4th Grade",
  "description" : "The boys deal with a strict new teacher and experiment with time travel as Mr. Garrison comes to terms with his sexuality."
}, {
  "imdbId" : "0121955",
  "season" : "4",
  "episodeNumber" : "12",
  "title" : "Trapper Keeper",
  "description" : "Cartman's new trapper keeper threatens to assimilate the town unless Kyle and a robot from the future can stop it."
}, {
  "imdbId" : "0121955",
  "season" : "4",
  "episodeNumber" : "13",
  "title" : "Helen Keller! The Musical",
  "description" : "Cartman goes overboard directing a Thanksgiving production of \"The Miracle Worker.\" Meanwhile, Timmy develops a bond with a runt turkey named Gobbles."
}, {
  "imdbId" : "0121955",
  "season" : "4",
  "episodeNumber" : "14",
  "title" : "Pip",
  "description" : "Pip attends boarding school in an adaptation of \"Great Expectations.\""
}, {
  "imdbId" : "0121955",
  "season" : "4",
  "episodeNumber" : "15",
  "title" : "Fat Camp",
  "description" : "Cartman is outraged when he is sent to fat camp by his mother. Meanwhile, Kenny becomes famous for a \"Jackass\" style TV show."
}, {
  "imdbId" : "0121955",
  "season" : "4",
  "episodeNumber" : "16",
  "title" : "The Wacky Molestation Adventure",
  "description" : "The boys tell the police that their parents molest them and soon there are no adults left in South Park. However, without authority figures, society crumbles."
}, {
  "imdbId" : "0121955",
  "season" : "4",
  "episodeNumber" : "17",
  "title" : "A Very Crappy Christmas",
  "description" : "When everyone in South Park decides to forgo presents and celebrate a non-materialistic holiday season, the boys try to bring the spirit of commercialism back to Christmas by making an animated film."
}, {
  "imdbId" : "0121955",
  "season" : "5",
  "episodeNumber" : "1",
  "title" : "It Hits the Fan",
  "description" : "Society is almost destroyed when a popular television show uses the word \"shit\" on the air."
}, {
  "imdbId" : "0121955",
  "season" : "5",
  "episodeNumber" : "2",
  "title" : "Cripple Fight",
  "description" : "The boys fight to get Big Gay Al reinstated as their scout leader, and Timmy is jealous of the new handicapped kid in town, Jimmy."
}, {
  "imdbId" : "0121955",
  "season" : "5",
  "episodeNumber" : "3",
  "title" : "Super Best Friends",
  "description" : "Stan enlists the help of an elite team of religious leaders including Jesus and Mohammed to help him rescue Kyle from a cult."
}, {
  "imdbId" : "0121955",
  "season" : "5",
  "episodeNumber" : "4",
  "title" : "Scott Tenorman Must Die",
  "description" : "Cartman plans an elaborate revenge when an older boy cons him out of money."
}, {
  "imdbId" : "0121955",
  "season" : "5",
  "episodeNumber" : "5",
  "title" : "Terrance and Phillip: Behind the Blow",
  "description" : "The boys attempt to reunite their idols Terrance & Philip after the Canadian duo has a falling out. Meanwhile, South Park falls under the control of environmentalists."
}, {
  "imdbId" : "0121955",
  "season" : "5",
  "episodeNumber" : "6",
  "title" : "Cartmanland",
  "description" : "Cartman inherits a large sum of money and uses it to purchase his own amusement park. His resulting success causes Kyle to lose faith in God."
}, {
  "imdbId" : "0121955",
  "season" : "5",
  "episodeNumber" : "7",
  "title" : "Proper Condom Use",
  "description" : "Improper sex ed classes lead to the boys declaring war on the girls."
}, {
  "imdbId" : "0121955",
  "season" : "5",
  "episodeNumber" : "8",
  "title" : "Towelie",
  "description" : "The boys try to rescue their new video game system from the hands of a government agency with the help of a talking towel named Towelie."
}, {
  "imdbId" : "0121955",
  "season" : "5",
  "episodeNumber" : "9",
  "title" : "Osama Bin Laden Has Farty Pants",
  "description" : "The boys come face to face with Osama Bin Laden after they are mistakenly shipped to Afghanistan."
}, {
  "imdbId" : "0121955",
  "season" : "5",
  "episodeNumber" : "10",
  "title" : "How to Eat with Your Butt",
  "description" : "Cartman puts a picture of Kenny's butt on a milk carton as a prank, but is disturbed when a couple arrives in South Park claiming it was a picture of their missing son."
}, {
  "imdbId" : "0121955",
  "season" : "5",
  "episodeNumber" : "11",
  "title" : "The Entity",
  "description" : "Kyle's cousin Kyle, a negative Jewish stereotype, comes to town to visit. Meanwhile, Mr. Garrison comes up with an only-slightly more pleasant alternative to airline travel."
}, {
  "imdbId" : "0121955",
  "season" : "5",
  "episodeNumber" : "12",
  "title" : "Here Comes the Neighborhood",
  "description" : "A class war ensues in South Park when it becomes a hot spot for rich celebrities. Meanwhile, Token feels rejected by his friends and goes to live with lions."
}, {
  "imdbId" : "0121955",
  "season" : "5",
  "episodeNumber" : "13",
  "title" : "Kenny Dies",
  "description" : "The boys cope with loss when Kenny is hospitalized with a terminal disease. Cartman attempts to save him by legalizing stem cell research."
}, {
  "imdbId" : "0121955",
  "season" : "5",
  "episodeNumber" : "14",
  "title" : "Butters' Very Own Episode",
  "description" : "Butters' mother snaps and tries to kill her son after the revelation that her husband frequents gay bath houses."
}, {
  "imdbId" : "0121955",
  "season" : "6",
  "episodeNumber" : "1",
  "title" : "Jared Has Aides",
  "description" : "Inspired by a corporate spokesman's phenomenal weight loss, the Boys hatch a plan to get free food from their favorite restaurant by fattening Butters up."
}, {
  "imdbId" : "0121955",
  "season" : "6",
  "episodeNumber" : "2",
  "title" : "Asspen",
  "description" : "The kids and their families take a vacation together in Aspen. However, the parents get stuck in an endless timeshare presentation, and Stan is forced into a showdown with a cocky skier."
}, {
  "imdbId" : "0121955",
  "season" : "6",
  "episodeNumber" : "3",
  "title" : "Freak Strike",
  "description" : "The boys disguise Butters as a mutant to win prizes on The Maury Povich show. They become upset when Butters' prize is a round of putt-putt golf, and so Cartman goes on the show as an out of control teen. The mutant freaks who make a career of visiting TV talk shows go on strike, taking Butters with them."
}, {
  "imdbId" : "0121955",
  "season" : "6",
  "episodeNumber" : "4",
  "title" : "Fun with Veal",
  "description" : "Stan leads the boys in kidnapping all the baby cows from a local ranch after a first hand look at how veal is made turns him into a vegetarian."
}, {
  "imdbId" : "0121955",
  "season" : "6",
  "episodeNumber" : "5",
  "title" : "The New Terrance and Phillip Movie Trailer",
  "description" : "The boys have to sit through an episode of \"Fightin' Round The World\" with Russell Crowe so they can see a preview for the new movie starring Terrence & Philip. However, bad luck forces them to race across town searching for a working TV."
}, {
  "imdbId" : "0121955",
  "season" : "6",
  "episodeNumber" : "6",
  "title" : "Professor Chaos",
  "description" : "After being shunned by his friends, Butters develops a villainous alter ego and sets out to wreak havoc on the town. Meanwhile, the boys search for a new friend."
}, {
  "imdbId" : "0121955",
  "season" : "6",
  "episodeNumber" : "7",
  "title" : "The Simpsons Already Did It",
  "description" : "Professor Chaos struggles to find an evil scheme that hasn't already been done on \"The Simpsons.\" Meanwhile, Cartman accidentally creates life in his aquarium."
}, {
  "imdbId" : "0121955",
  "season" : "6",
  "episodeNumber" : "8",
  "title" : "Red Hot Catholic Love",
  "description" : "Father Maxi travels to the Vatican to confront the growing problem of priests molesting children. Meanwhile, Cartman discovers that it is possible to crap out of your mouth."
}, {
  "imdbId" : "0121955",
  "season" : "6",
  "episodeNumber" : "9",
  "title" : "Free Hat",
  "description" : "The boys start a group to stop a maniacal"
}, {
  "imdbId" : "0121955",
  "season" : "6",
  "episodeNumber" : "10",
  "title" : "Bebe's Boobs Destroy Society",
  "description" : "Bebe's breasts begin to develop, and the boys are at a loss to explain why they are suddenly drawn to her, when they had no interest in her before."
}, {
  "imdbId" : "0121955",
  "season" : "6",
  "episodeNumber" : "11",
  "title" : "Child Abduction Is Not Funny",
  "description" : "Parents in South Park become gripped with fear that their children will be abducted, which leads to them taking more and more extreme measures to ensure their safety, finally culminating in a giant wall being built around the town."
}, {
  "imdbId" : "0121955",
  "season" : "6",
  "episodeNumber" : "12",
  "title" : "A Ladder to Heaven",
  "description" : "The boys try to build a ladder to heaven to retrieve a winning ticket Kenny had before he died. When their efforts are mistaken for an act of childhood innocence, a media circus ensues."
}, {
  "imdbId" : "0121955",
  "season" : "6",
  "episodeNumber" : "13",
  "title" : "The Return of the Fellowship of the Ring to the Two Towers",
  "description" : "The boys set off on a mythical quest to return a copy of the \"The Lord of the Rings\" movie to their local video store, while defending it from sixth graders."
}, {
  "imdbId" : "0121955",
  "season" : "6",
  "episodeNumber" : "14",
  "title" : "The Death Camp of Tolerance",
  "description" : "Mr. Garrison does what he can to get fired for being gay so he can sue the school for millions of dollars. This turns out to be easier said than done because the parents and school staff feel they have to be tolerant no matter what."
}, {
  "imdbId" : "0121955",
  "season" : "6",
  "episodeNumber" : "15",
  "title" : "The Biggest Douche in the Universe",
  "description" : "Stan tries to disprove psychic John Edward after a reading messes with Kyle's mind. Meanwhile, Cartman and Chef travel to Scotland to exorcise Kenny from Cartman's body."
}, {
  "imdbId" : "0121955",
  "season" : "6",
  "episodeNumber" : "16",
  "title" : "My Future Self n' Me",
  "description" : "A freak electric storm causes Stan's future self to return to the present. Stan's future self is an unemployed drug addict, but Stan suspects that it is a hoax."
}, {
  "imdbId" : "0121955",
  "season" : "6",
  "episodeNumber" : "17",
  "title" : "Red Sleigh Down",
  "description" : "When an attempt to bring Christmas to Iraq turns disastrous, the boys head to Iraq with Jesus and Mr. Hankey to save Santa from terrorists."
}, {
  "imdbId" : "0121955",
  "season" : "7",
  "episodeNumber" : "1",
  "title" : "Cancelled",
  "description" : "Chef and the children learn that Earth is actually just a reality show for other planets. When they learn it is to be canceled, the boys travel to a distant planet to plead their case to the network executives."
}, {
  "imdbId" : "0121955",
  "season" : "7",
  "episodeNumber" : "2",
  "title" : "Krazy Kripples",
  "description" : "Jimmy and Timmy land in the middle of a gang war; Stan, Cartman, Kenny and Kyle stay out of the way when stem cell research divides the town."
}, {
  "imdbId" : "0121955",
  "season" : "7",
  "episodeNumber" : "3",
  "title" : "Toilet Paper",
  "description" : "The boys toilet paper their art teacher's house to get revenge for a bad grade. When Kyle's guilty conscience makes him want to confess, Cartman makes an attempt on his life."
}, {
  "imdbId" : "0121955",
  "season" : "7",
  "episodeNumber" : "4",
  "title" : "I'm a Little Bit Country",
  "description" : "The town is divided down the middle on the Iraq war issue. Therefore, Cartman tries to induce a flashback so that he can find out what the Founding Fathers would have to say about the war."
}, {
  "imdbId" : "0121955",
  "season" : "7",
  "episodeNumber" : "5",
  "title" : "Fat Butt and Pancake Head",
  "description" : "Cartman makes a Jennifer Lopez hand doll and turns her into a music star, which draws the furious anger of the real Jennifer Lopez as well as the sexual advances of Ben Affleck."
}, {
  "imdbId" : "0121955",
  "season" : "7",
  "episodeNumber" : "6",
  "title" : "Lil' Crime Stoppers",
  "description" : "After the boys start a Jr. Detective's Club and find a girl's missing doll, they are recruited by the county police department. Their first assignment: to break up a meth lab."
}, {
  "imdbId" : "0121955",
  "season" : "7",
  "episodeNumber" : "7",
  "title" : "Red Man's Greed",
  "description" : "South Park residents are forced out of their homes when an Indian casino takes their land."
}, {
  "imdbId" : "0121955",
  "season" : "7",
  "episodeNumber" : "8",
  "title" : "South Park Is Gay",
  "description" : "Kyle, Mr. Garrison and Mr. Slave travel to New York City to bring an end to the latest \"metrosexual\" fad, and discover that it's actually part of a crab-people conspiracy to take over the planet."
}, {
  "imdbId" : "0121955",
  "season" : "7",
  "episodeNumber" : "9",
  "title" : "Christian Rock Hard",
  "description" : "Cartman, Butters and Token become Christian rock stars so that Cartman can win his bet with Kyle. Meanwhile, Kyle, Stan and Kenny learn the sad consequences of illegally downloading music from the Internet."
}, {
  "imdbId" : "0121955",
  "season" : "7",
  "episodeNumber" : "10",
  "title" : "Grey Dawn",
  "description" : "South Park takes all of the driver's licenses away from its senior citizens, and the AARP responds by launching an armed invasion of the town to defend their rights."
}, {
  "imdbId" : "0121955",
  "season" : "7",
  "episodeNumber" : "11",
  "title" : "Casa Bonita",
  "description" : "When Butters is invited to Kyle's birthday party instead of Cartman, Cartman kidnaps Butters and locks him in a bomb shelter."
}, {
  "imdbId" : "0121955",
  "season" : "7",
  "episodeNumber" : "12",
  "title" : "All About Mormons",
  "description" : "Stan learns about the Mormon religion after a new family moves to South Park from Utah. Caught up in the family-friendly doctrine of the church, Randy declares the Marshes to be Mormon as well."
}, {
  "imdbId" : "0121955",
  "season" : "7",
  "episodeNumber" : "13",
  "title" : "Butt Out",
  "description" : "Rob Reiner comes to town to lead an anti tobacco crusade after the boys briefly take up smoking."
}, {
  "imdbId" : "0121955",
  "season" : "7",
  "episodeNumber" : "14",
  "title" : "Raisins",
  "description" : "Stan becomes inconsolable after Wendy breaks up with him, and Butters has a crush on a sexy waitress at a local restaurant."
}, {
  "imdbId" : "0121955",
  "season" : "7",
  "episodeNumber" : "15",
  "title" : "It's Christmas in Canada",
  "description" : "The boys go to Canada to retrieve Ike, after his birth parents show up in South Park and claim him as their own."
}, {
  "imdbId" : "0121955",
  "season" : "8",
  "episodeNumber" : "1",
  "title" : "Good Times with Weapons",
  "description" : "The boys lie to get ninja weapons from the fair, but must decide whether or not to tell their parents when Butters is injured with a throwing star."
}, {
  "imdbId" : "0121955",
  "season" : "8",
  "episodeNumber" : "2",
  "title" : "Up the Down Steroid",
  "description" : "Jimmy begins using steroids to improve his chances in the special Olympics. Meanwhile, Cartman disguises himself as a handicapped boy so he can enter as well and win the cash prize."
}, {
  "imdbId" : "0121955",
  "season" : "8",
  "episodeNumber" : "3",
  "title" : "The Passion of the Jew",
  "description" : "Cartman leads a campaign against the Jews after seeing \"The Passion Of The Christ.\" Meanwhile, Stan and Kenny try to get their money back from Mel Gibson and discover that he is completely insane."
}, {
  "imdbId" : "0121955",
  "season" : "8",
  "episodeNumber" : "4",
  "title" : "You Got F'd in the A",
  "description" : "A gang of kids from the O.C. challenge Stan do a dance-off. But before the big event, Butters must confront a painful event from his past."
}, {
  "imdbId" : "0121955",
  "season" : "8",
  "episodeNumber" : "5",
  "title" : "AWESOM-O",
  "description" : "Cartman dresses up as a robot from Japan, sent to Butters. He tricks him into believing it and can't give away his identity because he finds out Butters has a video of him dancing to Britney Spears and kissing a Justin Timberlake picture! It gets even more out of hand as the military decide to try to capture 'the robot' to make it a weapon."
}, {
  "imdbId" : "0121955",
  "season" : "8",
  "episodeNumber" : "6",
  "title" : "The Jeffersons",
  "description" : "Michael Jackson moves to South Park but tries to conceal his identity. and local cops try to frame him because he is a rich black man."
}, {
  "imdbId" : "0121955",
  "season" : "8",
  "episodeNumber" : "7",
  "title" : "Goobacks",
  "description" : "When people from a poverty-stricken future travel back in time to find work, South Park residents accuse them of taking their jobs."
}, {
  "imdbId" : "0121955",
  "season" : "8",
  "episodeNumber" : "8",
  "title" : "Douche and Turd",
  "description" : "Stan refuses to vote in the school mascot election because his choices are a giant douche and a turd sandwich. Unfortunately, his views on voting are seen as un-American, and he is ultimately banished from the town."
}, {
  "imdbId" : "0121955",
  "season" : "8",
  "episodeNumber" : "9",
  "title" : "Something Wall-Mart This Way Comes",
  "description" : "When a Wall-Mart built in South Park takes business away from local businesses, the boys go to the company's headquarters to get it destroyed."
}, {
  "imdbId" : "0121955",
  "season" : "8",
  "episodeNumber" : "10",
  "title" : "Pre-School",
  "description" : "A bully who was sent to juvenile hall in a misunderstanding is released, and comes looking for revenge."
}, {
  "imdbId" : "0121955",
  "season" : "8",
  "episodeNumber" : "11",
  "title" : "Quest for Ratings",
  "description" : "The boys begin to exaggerate stories when their student news show falls behind in the ratings."
}, {
  "imdbId" : "0121955",
  "season" : "8",
  "episodeNumber" : "12",
  "title" : "Stupid Spoiled Whore Video Playset",
  "description" : "Mr. Slave fights against Paris Hilton when she becomes a bad influence on the girls in South Park. Meanwhile, Paris offers Butters' parents a huge amount of money if she can keep Butters as a pet."
}, {
  "imdbId" : "0121955",
  "season" : "8",
  "episodeNumber" : "13",
  "title" : "Cartman's Incredible Gift",
  "description" : "Cartman mistakenly believes he is a psychic, and is recruited by the police to help them with investigations."
}, {
  "imdbId" : "0121955",
  "season" : "8",
  "episodeNumber" : "14",
  "title" : "Woodland Critter Christmas",
  "description" : "Stan helps a group of woodland critters by killing a mountain lion, only to discover that he's helping them give birth to the Antichrist."
}, {
  "imdbId" : "0121955",
  "season" : "9",
  "episodeNumber" : "1",
  "title" : "Mr. Garrison's Fancy New Vagina",
  "description" : "Mr. Garrison gets an operation and becomes a woman; Kyle gets surgery to become tall and black so he can play basketball; Gerald decides he wants to be a dolphin."
}, {
  "imdbId" : "0121955",
  "season" : "9",
  "episodeNumber" : "2",
  "title" : "Die Hippie, Die",
  "description" : "Cartman leads the resistance when a mass of hippies accumulates in South Park and starts a music festival."
}, {
  "imdbId" : "0121955",
  "season" : "9",
  "episodeNumber" : "3",
  "title" : "Wing",
  "description" : "The boys start a talent agency and represent a woman named Wing in Hollywood."
}, {
  "imdbId" : "0121955",
  "season" : "9",
  "episodeNumber" : "4",
  "title" : "Best Friends Forever",
  "description" : "Can Cartman and Kenny stay as \"Best Friends Forever\", even when Kenny buys the last PSP in stock?"
}, {
  "imdbId" : "0121955",
  "season" : "9",
  "episodeNumber" : "5",
  "title" : "The Losing Edge",
  "description" : "The boys enlist Kyle's cousin to help them lose in baseball so they won't have to go to the finals. Meanwhile, Randy trains to fight other parents during Stan's games."
}, {
  "imdbId" : "0121955",
  "season" : "9",
  "episodeNumber" : "6",
  "title" : "The Death of Eric Cartman",
  "description" : "When the boys decide to ignore Cartman, he assumes that he is dead, and enlists Butters to help him make up for his past sins."
}, {
  "imdbId" : "0121955",
  "season" : "9",
  "episodeNumber" : "7",
  "title" : "Erection Day",
  "description" : "Jimmy gets his first erection just days before the school talent show."
}, {
  "imdbId" : "0121955",
  "season" : "9",
  "episodeNumber" : "8",
  "title" : "Two Days Before the Day After Tomorrow",
  "description" : "When a dam breaks and floods a nearby town, South Park residents assume it was caused by global warming and barricade themselves in the community center."
}, {
  "imdbId" : "0121955",
  "season" : "9",
  "episodeNumber" : "9",
  "title" : "Marjorine",
  "description" : "Butters fake his own death and disguises himself as a girl so he can infiltrate a sleepover and steal a fortune telling device from the girls. Meanwhile, Butters' father turns to the occult to bring back his son."
}, {
  "imdbId" : "0121955",
  "season" : "9",
  "episodeNumber" : "10",
  "title" : "Follow That Egg",
  "description" : "Ms Garrison realises she still has feelings for Mr Slave. But Mr Slave has moved on and plans to marry his new boyfriend, Big Gay Al as soon as the Governor signs the same sex marriage bill."
}, {
  "imdbId" : "0121955",
  "season" : "9",
  "episodeNumber" : "11",
  "title" : "Ginger Kids",
  "description" : "Cartman leads a vendetta against kids with red hair and freckles, until a prank makes him think he is one of them."
}, {
  "imdbId" : "0121955",
  "season" : "9",
  "episodeNumber" : "12",
  "title" : "Trapped in the Closet",
  "description" : "Several religious leaders recongize Stan as the second coming of L. Ron Hubbard, and a whole soap opera unfolds with the help from a famous R&B sensation."
}, {
  "imdbId" : "0121955",
  "season" : "9",
  "episodeNumber" : "13",
  "title" : "Free Willzyx",
  "description" : "When a prank convinces the boys that a whale in a local aquarium is an alien from the moon, they go to extreme measures to send it home."
}, {
  "imdbId" : "0121955",
  "season" : "9",
  "episodeNumber" : "14",
  "title" : "Bloody Mary",
  "description" : "Randy is forced to go to AA meetings, where he becomes convinced that he has a disease. Desperate, he and Stan go on a pilgrimage to a statue of the virgin Mary that is miraculously bleeding from its ass."
}, {
  "imdbId" : "0121955",
  "season" : "10",
  "episodeNumber" : "1",
  "title" : "The Return of Chef",
  "description" : "After a long hiatus, Chef returns to South Park, but the boys notice that he isn't the same friend he used to be."
}, {
  "imdbId" : "0121955",
  "season" : "10",
  "episodeNumber" : "2",
  "title" : "Smug Alert!",
  "description" : "Stan persuades everyone in town to buy hybrid cars, not realizing the new cars cause a different kind of dangerous emission."
}, {
  "imdbId" : "0121955",
  "season" : "10",
  "episodeNumber" : "3",
  "title" : "Cartoon Wars: Part 1",
  "description" : "The town is in panic when Family Guy angers the Muslim world by attempting to air an image of Mohammed."
}, {
  "imdbId" : "0121955",
  "season" : "10",
  "episodeNumber" : "4",
  "title" : "Cartoon Wars: Part 2",
  "description" : "Cartman finds an unlikely ally in his quest to cancel Family Guy; The people of South Park bury their heads in sand pits to avoid watching the episode."
}, {
  "imdbId" : "0121955",
  "season" : "10",
  "episodeNumber" : "5",
  "title" : "A Million Little Fibers",
  "description" : "Towelie's autobiography, \"A Million Little Fibers\", becomes Oprah Winfrey's official Book of the Month selection and a bestseller... but for how long?"
}, {
  "imdbId" : "0121955",
  "season" : "10",
  "episodeNumber" : "6",
  "title" : "ManBearPig",
  "description" : "Al Gore gets the boys trapped in Cave of the Winds while trying to kill the purported \"Manbearpig\"; Cartman finds treasure that he attempts to steal."
}, {
  "imdbId" : "0121955",
  "season" : "10",
  "episodeNumber" : "7",
  "title" : "Tsst",
  "description" : "Eric's mom turns to Dog Whisperer Cesar Millan as a last resort to turn him to a good little boy, but he may have also turned him into a repressed killer."
}, {
  "imdbId" : "0121955",
  "season" : "10",
  "episodeNumber" : "8",
  "title" : "Make Love, Not Warcraft",
  "description" : "The boys dedicate their lives to defeating a high level player killing other players in World of Warcraft."
}, {
  "imdbId" : "0121955",
  "season" : "10",
  "episodeNumber" : "9",
  "title" : "Mystery of the Urinal Deuce",
  "description" : "Kyle sets out to prove that 9/11 wasn't a government conspiracy, and actually uncovers a government conspiracy to create a conspiracy."
}, {
  "imdbId" : "0121955",
  "season" : "10",
  "episodeNumber" : "10",
  "title" : "Miss Teacher Bangs a Boy",
  "description" : "Kyle discovers that his brother Ike is having a sexual relationship with his kindergarten teacher. The police are reluctant to help, so Kyle is forced to turn to the new school hall monitor for help: Eric \"Dawg\" Cartman."
}, {
  "imdbId" : "0121955",
  "season" : "10",
  "episodeNumber" : "11",
  "title" : "Hell on Earth 2006",
  "description" : "Satan returns to Earth to throw a huge members-only Holloween party in Los Angeles, and the boys keep summoning the ghost of Biggie Smalls--which means that he's going to miss the party."
}, {
  "imdbId" : "0121955",
  "season" : "10",
  "episodeNumber" : "12",
  "title" : "Go God Go",
  "description" : "Cartman tries to cryogenically freeze himself so he doesn't have to wait for the new Nintendo Wii; Ms. Garrison falls for the new Evolution teacher."
}, {
  "imdbId" : "0121955",
  "season" : "10",
  "episodeNumber" : "13",
  "title" : "Go God Go XII",
  "description" : "Cartman is stuck in the future, in the middle of an international civil war between rival Atheist factions. And he STILL can't play Nintendo Wii."
}, {
  "imdbId" : "0121955",
  "season" : "10",
  "episodeNumber" : "14",
  "title" : "Stanley's Cup",
  "description" : "When Stan loses his job as the paperboy, he decides to become the coach of the local Pee Wee Hockey team, just to make some money. Unfortunately, he gets way more than he bargained for."
}, {
  "imdbId" : "0121955",
  "season" : "11",
  "episodeNumber" : "1",
  "title" : "With Apologies to Jesse Jackson",
  "description" : "Stan becomes a social outcast after his father Randy says \"the N-Word\" on national television, but Michael Richards and Mark Furhman come to Randy's rescue."
}, {
  "imdbId" : "0121955",
  "season" : "11",
  "episodeNumber" : "2",
  "title" : "Cartman Sucks",
  "description" : "Cartman takes a photo with Butters' penis in his mouth to prove Butters is gay. He later finds out what the picture really means and freaks out when the photo disappears. Meanwhile, Butters has to go to a special camp to calm his urges."
}, {
  "imdbId" : "0121955",
  "season" : "11",
  "episodeNumber" : "3",
  "title" : "Lice Capades",
  "description" : "A lice outbreak hits Ms. Garrison's class, and at least one parasite is determined to survive after his lice civilization is destroyed."
}, {
  "imdbId" : "0121955",
  "season" : "11",
  "episodeNumber" : "4",
  "title" : "The Snuke",
  "description" : "While trying to find a way to persecute the new Arab kid in his class, Cartman accidentally uncovers an unrelated plot to assassinate Hillary Clinton at a South Park political rally."
}, {
  "imdbId" : "0121955",
  "season" : "11",
  "episodeNumber" : "5",
  "title" : "Fantastic Easter Special",
  "description" : "In a parody of \"The daVinci Code,\" Stan discovers the real reason behind Easter, decorating eggs, and the Easter Bunny."
}, {
  "imdbId" : "0121955",
  "season" : "11",
  "episodeNumber" : "6",
  "title" : "D-Yikes!",
  "description" : "Ms. Garrison's latest date goes so badly that she assigns the class the book report over the weekend, but the boys hire immigrant labor to write it. Meanwhile, Ms. Garrison becomes a lesbian and saves the women's bar from a Persian takeover."
}, {
  "imdbId" : "0121955",
  "season" : "11",
  "episodeNumber" : "7",
  "title" : "Night of the Living Homeless",
  "description" : "One day after Kyle gives $20 to a homeless person, South Park becomes overrun with panhandlers."
}, {
  "imdbId" : "0121955",
  "season" : "11",
  "episodeNumber" : "8",
  "title" : "Le Petit Tourette",
  "description" : "Cartman fakes having Tourette's syndrome so he can say whatever he wants, but faking the condition begins to wear on his mental filter."
}, {
  "imdbId" : "0121955",
  "season" : "11",
  "episodeNumber" : "9",
  "title" : "More Crap",
  "description" : "Randy Marsh sets the world record for the biggest bowel movement, until Bono comes along and challenges it."
}, {
  "imdbId" : "0121955",
  "season" : "11",
  "episodeNumber" : "10",
  "title" : "Imaginationland",
  "description" : "Terrorists attack Imaginationland, in an attempt to take over peoples' imagination; Kyle refuses to follow through with his promise to suck Cartman's balls."
}, {
  "imdbId" : "0121955",
  "season" : "11",
  "episodeNumber" : "11",
  "title" : "Imaginationland: Episode II",
  "description" : "With the help of Stan and Kyle, the military is able to access the portal to Imaginationland; Cartman goes to great lengths to get Kyle to suck his balls after the leprechaun bet."
}, {
  "imdbId" : "0121955",
  "season" : "11",
  "episodeNumber" : "12",
  "title" : "Imaginationland: Episode III",
  "description" : "Stan and Butters engage in battle as they fight the army of evil imaginary forces; Cartman once again goes to great lengths to get Kyle to suck his balls."
}, {
  "imdbId" : "0121955",
  "season" : "11",
  "episodeNumber" : "13",
  "title" : "Guitar Queer-o",
  "description" : "Stan and Kyle become local celebrities after they score 100,000 points on the video game \"Guitar Hero.\" A talent agent signs them to a contract, which ends up ruining their friendship."
}, {
  "imdbId" : "0121955",
  "season" : "11",
  "episodeNumber" : "14",
  "title" : "The List",
  "description" : "The girls in the fourth grade class have made a secret list that rates every boy's looks from cutest to ugliest. When the boys steal the list, they are completely unprepared to deal with the results."
}, {
  "imdbId" : "0121955",
  "season" : "12",
  "episodeNumber" : "1",
  "title" : "Tonsil Trouble",
  "description" : "After Cartman and Kyle are infected with the AIDS virus, they turn to Magic Johnson for assistance in finding a cure."
}, {
  "imdbId" : "0121955",
  "season" : "12",
  "episodeNumber" : "2",
  "title" : "Britney's New Look",
  "description" : "Distraught over the media's nonstop coverage of her, Britney Spears attempts to commit suicide, but survives despite blowing the top half of her head off. Disgusted by this treatment of her, the boys attempt to help, only to learn the secret behind the media's cruel scrutiny of celebrities."
}, {
  "imdbId" : "0121955",
  "season" : "12",
  "episodeNumber" : "3",
  "title" : "Major Boobage",
  "description" : "South Park declares cats illegal after kids start getting high on cat urine. Cartman starts hiding neighborhood cats in his attic to protect them, and Kenny becomes an addict and starts having"
}, {
  "imdbId" : "0121955",
  "season" : "12",
  "episodeNumber" : "4",
  "title" : "Canada on Strike",
  "description" : "Canada goes on strike and demands more money, but nobody takes the strike seriously. However, the boys try to make money for Canada by turning Butters into an Internet video star."
}, {
  "imdbId" : "0121955",
  "season" : "12",
  "episodeNumber" : "5",
  "title" : "Eek, a Penis!",
  "description" : "Cartman is commended for his excellent substitute teaching, so he is brought to the inner city to help the high schoolers. Meanwhile, Ms. Garrison wants to be Mr. Garrison again."
}, {
  "imdbId" : "0121955",
  "season" : "12",
  "episodeNumber" : "6",
  "title" : "Over Logging",
  "description" : "A prolonged Internet service outage hits South Park and most of the rest of the country, and Randy moves the Marsh family to California hoping to find a connection (and Internet porn for himself)."
}, {
  "imdbId" : "0121955",
  "season" : "12",
  "episodeNumber" : "7",
  "title" : "Super Fun Time",
  "description" : "A class field trip to a frontier park turns into a hostage situation when a group of robbers use the park to evade the police, but the park employees won't help resolve the situation because they won't get out of character."
}, {
  "imdbId" : "0121955",
  "season" : "12",
  "episodeNumber" : "8",
  "title" : "The China Probrem",
  "description" : "Cartman and Butters go to P.F. Chang's to try to uncover the Chinese conspiracy to take over the U.S. Stan and Kyle accuse Steven Spielberg and George Lucas of raping Indiana Jones."
}, {
  "imdbId" : "0121955",
  "season" : "12",
  "episodeNumber" : "9",
  "title" : "Breast Cancer Show Ever",
  "description" : "Cartman makes fun of Wendy after she delivers a report on breast cancer. She challenges him to a fight, but he keeps finding ways to get out of it. But he also won't stop making fun of her."
}, {
  "imdbId" : "0121955",
  "season" : "12",
  "episodeNumber" : "10",
  "title" : "Pandemic",
  "description" : "With Craig's help, the boys start up a Peruvian pan flute band to make money. However, they are detained by Homeland Security and sent to Peru to end the \"Pandemic.\" In the pan flute bands' absence, giant guinea pigs invade South Park."
}, {
  "imdbId" : "0121955",
  "season" : "12",
  "episodeNumber" : "11",
  "title" : "Pandemic 2: The Startling",
  "description" : "Craig and the boys are stranded in the Andes Mountains while giant guinea pigs wreak havoc all over the planet. Craig is the only person who can end the terror, but he doesn't care and won't do anything about it."
}, {
  "imdbId" : "0121955",
  "season" : "12",
  "episodeNumber" : "12",
  "title" : "About Last Night...",
  "description" : "While the rest of the nation is distracted by the results of the presidential election, Barack Obama and John McCain set out to complete their true combined objective: a daring \"Ocean's Eleven\" style jewel heist."
}, {
  "imdbId" : "0121955",
  "season" : "12",
  "episodeNumber" : "13",
  "title" : "Elementary School Musical",
  "description" : "The boys try to resist the \"High School Musical\" fad when it hits South Park Elementary, while also trying to convince the school's top singer that he should follow his dream and try out for the basketball team."
}, {
  "imdbId" : "0121955",
  "season" : "12",
  "episodeNumber" : "14",
  "title" : "The Ungroundable",
  "description" : "Butters starts hanging out with the Vampire kids, who are angering the Goth kids at South Park Elementary because everybody is confusing the Vampire kids with them."
}, {
  "imdbId" : "0121955",
  "season" : "13",
  "episodeNumber" : "1",
  "title" : "The Ring",
  "description" : "The boys discover that the Jonas Brothers' purity ring campaign is just part of Disney's plot to get away with marketing sex to pre-teen girls."
}, {
  "imdbId" : "0121955",
  "season" : "13",
  "episodeNumber" : "2",
  "title" : "The Coon",
  "description" : "Cartman tries to become a superhero, only to have another fourth grader steal his thunder by becoming one too and becoming more popular."
}, {
  "imdbId" : "0121955",
  "season" : "13",
  "episodeNumber" : "3",
  "title" : "Margaritaville",
  "description" : "In a parody of the final weeks of Christ's life, South Park goes into hysterics over the failing economy, but Kyle begins preaching that there is no reason for fear. Meanwhile, Stan unsuccessfully tries to return his dad's margarita machine."
}, {
  "imdbId" : "0121955",
  "season" : "13",
  "episodeNumber" : "4",
  "title" : "Eat, Pray, Queef",
  "description" : "The fart-loving males of South Park try to ban vaginal flatulence in Colorado after \"Terrance & Phillip\" is replaced by \"The Queef Sisters.\""
}, {
  "imdbId" : "0121955",
  "season" : "13",
  "episodeNumber" : "5",
  "title" : "Fishsticks",
  "description" : "Jimmy comes up with the perfect joke, but Cartman wants to take half the credit for it. However, Kanye West doesn't get the joke, and vows revenge on the person who came up with it."
}, {
  "imdbId" : "0121955",
  "season" : "13",
  "episodeNumber" : "6",
  "title" : "Pinewood Derby",
  "description" : "Randy and Stan accidentally reach warp speed when Randy illegally soups up Stan's Pinewood Derby racer, which prompts a visit by an alien gangster and the space police trying to track him down."
}, {
  "imdbId" : "0121955",
  "season" : "13",
  "episodeNumber" : "7",
  "title" : "Fatbeard",
  "description" : "Cartman leads a group of schoolmates to Somalia to become pirates."
}, {
  "imdbId" : "0121955",
  "season" : "13",
  "episodeNumber" : "8",
  "title" : "Dead Celebrities",
  "description" : "When Ike is haunted by dead celebrities, Kyle and the boys hire professional ghost hunters to investigate the Broflovski house for paranormal activity."
}, {
  "imdbId" : "0121955",
  "season" : "13",
  "episodeNumber" : "9",
  "title" : "Butters' Bottom Bitch",
  "description" : "Butters starts his own pimping business, while a local police officer takes his undercover prostitution sting a little too far."
}, {
  "imdbId" : "0121955",
  "season" : "13",
  "episodeNumber" : "10",
  "title" : "W.T.F.",
  "description" : "The boys form their own wrestling federation, but seem to be more concerned with theatrics and storylines than the actual sport."
}, {
  "imdbId" : "0121955",
  "season" : "13",
  "episodeNumber" : "11",
  "title" : "Whale Whores",
  "description" : "Stan is upset about the Japanese killing whales and dolphins, so he takes command of the Sea Shepherd on the \"Whale Wars\" reality show and does something about it."
}, {
  "imdbId" : "0121955",
  "season" : "13",
  "episodeNumber" : "12",
  "title" : "The F Word",
  "description" : "The boys try to get the meaning of the word \"fag\" changed from homosexual to motorcycle riders."
}, {
  "imdbId" : "0121955",
  "season" : "13",
  "episodeNumber" : "13",
  "title" : "Dances with Smurfs",
  "description" : "Cartman takes over the morning school announcements and turns it into a personal soapbox against school president Wendy Testaburger."
}, {
  "imdbId" : "0121955",
  "season" : "13",
  "episodeNumber" : "14",
  "title" : "Pee",
  "description" : "When the pee levels reach a critical stage at a local water park, chaos and disaster ensue. However, after the disaster, Cartman remains obsessed with the number of minorities who are \"taking over\" the park."
}, {
  "imdbId" : "0121955",
  "season" : "14",
  "episodeNumber" : "1",
  "title" : "Sexual Healing",
  "description" : "After Tiger Woods comes clean, America becomes obsessed with the \"epidemic\" of rich men having sex with lots of women. As a result, Kyle and Butters are labeled as sex addicts and are placed in treatment."
}, {
  "imdbId" : "0121955",
  "season" : "14",
  "episodeNumber" : "2",
  "title" : "The Tale of Scrotie McBoogerballs",
  "description" : "The boys try to write the most graphic, offensive book ever, and then blame Butters when Stan's mom finds it. But when the book is hailed as a work of literary genius, Butters becomes the \"voice of a generation.\""
}, {
  "imdbId" : "0121955",
  "season" : "14",
  "episodeNumber" : "3",
  "title" : "Medicinal Fried Chicken",
  "description" : "Randy deliberately gets testicular cancer so that he can receive a medicinal marijuana prescription, while Cartman becomes a black market KFC dealer when all of the restaurants are shut down for being unhealthy."
}, {
  "imdbId" : "0121955",
  "season" : "14",
  "episodeNumber" : "4",
  "title" : "You Have 0 Friends",
  "description" : "When attempting to delete his Facebook profile, Stan is sucked into a virtual Facebook world; Kyle befriends a friendless third-grader, with drastic consequences."
}, {
  "imdbId" : "0121955",
  "season" : "14",
  "episodeNumber" : "5",
  "title" : "200",
  "description" : "Tom Cruise gathers other celebrities mocked by South Park and threatens a class action lawsuit unless the town brings Mohammed to them, so that they can obtain his powers not to be ridiculed."
}, {
  "imdbId" : "0121955",
  "season" : "14",
  "episodeNumber" : "6",
  "title" : "201",
  "description" : "As the celebrities and the gingers battle over who gets possession of Mohammed, the Super Best Friends come to Mohammed's rescue. Meanwhile, Cartman may finally discover the \"real\" truth about the identity of his father."
}, {
  "imdbId" : "0121955",
  "season" : "14",
  "episodeNumber" : "7",
  "title" : "Crippled Summer",
  "description" : "The boys stage an intervention for Towelie after he falls off the wagon while working at Timmy and Jimmy's summer camp. At the camp, a jealous camper resorts to dirty tricks to beat Jimmy in a series of competitions."
}, {
  "imdbId" : "0121955",
  "season" : "14",
  "episodeNumber" : "8",
  "title" : "Poor and Stupid",
  "description" : "Cartman wants to be a NASCAR driver when he grows up but believes he's too rich and too smart and that in order to be a NASCAR racer and enjoy it, he has to be poor and stupid. In order to achieve his goal, he enlists the help of Butters, and the feminine hygiene product Vagisil."
}, {
  "imdbId" : "0121955",
  "season" : "14",
  "episodeNumber" : "9",
  "title" : "It's a Jersey Thing",
  "description" : "South Park tries to keep New Jersey from spreading to their town, and they are forced to turn to some of their enemies for help."
}, {
  "imdbId" : "0121955",
  "season" : "14",
  "episodeNumber" : "10",
  "title" : "Insheeption",
  "description" : "Stan and Mr. Mackey suffer a hoarding disorder. In an attempt to find the cause for it, they get trapped in Mr. Mackey's dream."
}, {
  "imdbId" : "0121955",
  "season" : "14",
  "episodeNumber" : "11",
  "title" : "Coon 2: Hindsight",
  "description" : "A new superhero named \"Captain Hindsight\" emerges to help with a new BP oil spill, and The Coon tries to make sure that he joins his union of superheroes."
}, {
  "imdbId" : "0121955",
  "season" : "14",
  "episodeNumber" : "12",
  "title" : "Mysterion Rises",
  "description" : "Mysterion assumes control of South Park's superhero alliance after The Coon is kicked out. Meanwhile, The Coon plots his plan for revenge by conspiring with the enemy, and where is Captain Hindsight when the world needs him?"
}, {
  "imdbId" : "0121955",
  "season" : "14",
  "episodeNumber" : "13",
  "title" : "Coon vs. Coon and Friends",
  "description" : "Cartman and Cthulhu get their revenge on Coon and Friends, while Mysterion continues to try and discover the secret behind his superpower of never being able to die."
}, {
  "imdbId" : "0121955",
  "season" : "14",
  "episodeNumber" : "14",
  "title" : "Crme Frache",
  "description" : "Randy becomes addicted to the Food Network, and Sharon tries to compensate for his lack of attention by turning to the Shape Weight."
}, {
  "imdbId" : "0121955",
  "season" : "15",
  "episodeNumber" : "1",
  "title" : "HUMANCENTiPAD",
  "description" : "After Kyle clicks on the latest iTunes user agreement without reading it, Steve Jobs forces him to be an unwilling participant in his latest project. Meanwhile, Cartman equates his mom not giving him an iPad to sexual abuse."
}, {
  "imdbId" : "0121955",
  "season" : "15",
  "episodeNumber" : "2",
  "title" : "Funnybot",
  "description" : "After Jimmy declares that the Germans are the least funny people in the world in his comedy awards show, they retaliate by creating \"Funnybot\" an automated comedian who is so funny that it puts all other comedians out of work."
}, {
  "imdbId" : "0121955",
  "season" : "15",
  "episodeNumber" : "3",
  "title" : "Royal Pudding",
  "description" : "During the televised Canadian royal wedding, the bride-to-be is kidnapped by an unknown entity. After a call to arms is issued to Canadians, Ike travels to Canada, abandoning his role in Mr. Mackey's kindergarten play about dental hygiene."
}, {
  "imdbId" : "0121955",
  "season" : "15",
  "episodeNumber" : "4",
  "title" : "T.M.I.",
  "description" : "Thinking the school has posted the size of all the kid's penises for the whole school to see, Cartman works all the boys up into tizzy. The principal decides it's time to address Cartman's anger issues by having him take anger management classes. Cartman uses his anger to enrage the class and hold a business hostage. Stan's dad decides to teach the students how to properly measure penis size, using complex mathematical formulas."
}, {
  "imdbId" : "0121955",
  "season" : "15",
  "episodeNumber" : "5",
  "title" : "Crack Baby Athletic Association",
  "description" : "Feeling guilty after watching another commercial about helpless children set to Sarah McLachlan singing, Kyle volunteers and is shocked to find Cartman helping crack babies at the hospital already. Kyle gets drawn into Cartman's despicable plot, thinking he can also help the crack babies."
}, {
  "imdbId" : "0121955",
  "season" : "15",
  "episodeNumber" : "6",
  "title" : "City Sushi",
  "description" : "A new Sushi shop moves into South Park and an Asian turf war is ignited between the \"Japanese\" owner of City Sushi and the \"Chinese\" owner of City Wok."
}, {
  "imdbId" : "0121955",
  "season" : "15",
  "episodeNumber" : "7",
  "title" : "You're Getting Old",
  "description" : "Stan turns ten and suddenly things change and everything seems like crap to him; music, movies, food, and life in general."
}, {
  "imdbId" : "0121955",
  "season" : "15",
  "episodeNumber" : "8",
  "title" : "Ass Burgers",
  "description" : "Stan is diagnosed with Asperger's but soon realizes that the disease isn't real. Meanwhile, Cartman creates a disgusting overnight food sensation."
}, {
  "imdbId" : "0121955",
  "season" : "15",
  "episodeNumber" : "9",
  "title" : "The Last of the Meheecans",
  "description" : "During a game of border patrol vs. Mexicans, where the kids play the two groups, Butters goes missing and eventually winds up in Mexico where he becomes their new leader, Mantequilla. Suddenly legal and illegal alien Mexicans flood back across the border to Mexico for a better life because of the decline of the U.S. economy. Eric joins the U.S. border patrol and squares off against Butters."
}, {
  "imdbId" : "0121955",
  "season" : "15",
  "episodeNumber" : "10",
  "title" : "Bass to Mouth",
  "description" : "Kids at South Park Elementary School become enthralled with a new website called EavesDropper, which updates daily with secrets students don't want to get out. After news of a student crapping his pants leaks, Principal Victoria and staff bribe Eric into finding a way to make the problem go away. Meanwhile Stan and Kyle try to stop the culprit responsible."
}, {
  "imdbId" : "0121955",
  "season" : "15",
  "episodeNumber" : "11",
  "title" : "Broadway Bro Down",
  "description" : "Randy discovers a secret: women give blow jobs after seeing stage musicals because there are hidden subliminal references to blow jobs in the songs and women don't know it. Shelly has a love interest."
}, {
  "imdbId" : "0121955",
  "season" : "15",
  "episodeNumber" : "12",
  "title" : "1%",
  "description" : "Upset that the entire school has to exercise extra hard because one student, Eric, is too fat, the school plots revenge against him. When things dear to Eric start getting destroyed, he goes on a hunt to find out whom is responsible."
}, {
  "imdbId" : "0121955",
  "season" : "15",
  "episodeNumber" : "13",
  "title" : "A History Channel Thanksgiving",
  "description" : "Upon Eric's advice, the boys use The History Channel's special on the first thanksgiving, to write their school report, but Stan has misgivings when the special insists aliens were part of it. A secret organization, a pilgrim from outer space, a stuffing shortage, and war between two worlds hangs in the balance and only the boys are caught in the midst of it all."
}, {
  "imdbId" : "0121955",
  "season" : "15",
  "episodeNumber" : "14",
  "title" : "The Poor Kid",
  "description" : "After Kenny's parents are arrested and he and his siblings are sent to a foster home, Eric searches for who is the new poor kid in South Park and the results are shocking. Mysterion must help his brother and sister and the rest of the foster children get out of the abusive foster home."
}, {
  "imdbId" : "0121955",
  "season" : "16",
  "episodeNumber" : "1",
  "title" : "Reverse Cowgirl",
  "description" : "An unspeakable tragedy occurs when one of the boys leaves the toilet seat up after he uses the bathroom."
}, {
  "imdbId" : "0121955",
  "season" : "16",
  "episodeNumber" : "2",
  "title" : "Cash for Gold",
  "description" : "Cartman launches a gemstones network show and creates a very lucrative business. Stan searches for the real value of a piece of jewelry that was a gift from his Grandpa. Meanwhile, Cartmans lucrative new business preys upon an extremely vulnerable clientele."
}, {
  "imdbId" : "0121955",
  "season" : "16",
  "episodeNumber" : "3",
  "title" : "Faith Hilling",
  "description" : "The boys take part in a new, dangerous photographic meme."
}, {
  "imdbId" : "0121955",
  "season" : "16",
  "episodeNumber" : "4",
  "title" : "Jewpacabra",
  "description" : "Cartman starts convincing people a mystical blood-sucking from Mexico he calls the Jewpacabra, exists and that the kids and folks of South Park are in danger for the upcoming Easter Egg hunt."
}, {
  "imdbId" : "0121955",
  "season" : "16",
  "episodeNumber" : "5",
  "title" : "Butterballs",
  "description" : "As bullying at South Park Elementary becomes more severe, the kids take action against it after seeing Butters beaten up, but Butters has a secret about his tormentor."
}, {
  "imdbId" : "0121955",
  "season" : "16",
  "episodeNumber" : "6",
  "title" : "I Should Have Never Gone Ziplining",
  "description" : "Eric, Stan, Kyle, and Kenny go ziplining but find it's incredibly boring and the fellow ziplining tourists drive them crazy. Now they must do all that they can to escape from the group and get off the mountain back to normal life."
}, {
  "imdbId" : "0121955",
  "season" : "16",
  "episodeNumber" : "7",
  "title" : "Cartman Finds Love",
  "description" : "There's a new girl in school and she's black, so Cartman instantly assumes Token wants her, but when Token doesn't seem interested, Eric sets up an elaborate scheme to put the two together."
}, {
  "imdbId" : "0121955",
  "season" : "16",
  "episodeNumber" : "8",
  "title" : "Sarcastaball",
  "description" : "Angered over the overly sensitive parents in South Park over their kids playing football because of recent news about concussions, Randy invents the game Sarcastaball in order to get people to see how stupid they've been. But when everybody takes it seriously, Randy ends up begrudgingly taking the game national. Butters, the most knowledgeable of the game, becomes the coach for the kids."
}, {
  "imdbId" : "0121955",
  "season" : "16",
  "episodeNumber" : "9",
  "title" : "Raising the Bar",
  "description" : "Cartman finally realizes he is too fat and decides to do something about it, while James Cameron realizes the societal bar has been lowered too low, and goes on a deep sea expedition to find the bar to raise it."
}, {
  "imdbId" : "0121955",
  "season" : "16",
  "episodeNumber" : "10",
  "title" : "Insecurity",
  "description" : "After Ike accidentally sees mom and dad having sex, with Gerald dressed as a UPS man, the kids create a stir leading men in South Park thinking the UPS man is secretly having sex with their wives."
}, {
  "imdbId" : "0121955",
  "season" : "16",
  "episodeNumber" : "11",
  "title" : "Going Native",
  "description" : "Butters starts acting out, yelling, telling people off, and even beating one kid up. Little does Butters know, but he's reached a special age and that there's more going on than he knows, and that he wasn't born in South Park."
}, {
  "imdbId" : "0121955",
  "season" : "16",
  "episodeNumber" : "12",
  "title" : "A Nightmare on Facetime",
  "description" : "The boys are excited to go trick-or-treating, dressed as the Avengers, but Stan is unable to come because Randy has bought a Blockbuster Video franchise location in South Park."
}, {
  "imdbId" : "0121955",
  "season" : "16",
  "episodeNumber" : "13",
  "title" : "A Scause for Applause",
  "description" : "The world is rocked by news that a performance enhancing drug was found in test results from Jesus, used to make his miracles and thus did not die for our sins, and now people across the world become disillusioned, except Stan who refuses to cut his What Would Jesus Do? bracelet off. And in the process Stan inadvertently creates a world wide movement."
}, {
  "imdbId" : "0121955",
  "season" : "16",
  "episodeNumber" : "14",
  "title" : "Obama Wins!",
  "description" : "Cartman has stolen thousands of ballots from swing states in order to assure Obama's re-election all in a bid to get himself a part in the new Star Wars movie now that Disney owns the franchise."
}, {
  "imdbId" : "0121955",
  "season" : "17",
  "episodeNumber" : "1",
  "title" : "Let Go, Let Gov",
  "description" : "Cartman goes to infiltrate the NSA for his personal file, but doesn't like what he finds."
}, {
  "imdbId" : "0121955",
  "season" : "17",
  "episodeNumber" : "2",
  "title" : "Informative Murder Porn",
  "description" : "The children of South Park find out their parents are watching disturbingly violent television shows about sex, murder, and betrayal, otherwise nicknamed \"murder porn\"."
}, {
  "imdbId" : "0121955",
  "season" : "17",
  "episodeNumber" : "3",
  "title" : "World War Zimmerman",
  "description" : "Cartman sees Token as a threat to all humanity."
}, {
  "imdbId" : "0121955",
  "season" : "17",
  "episodeNumber" : "4",
  "title" : "Goth Kids 3: Dawn of the Posers",
  "description" : "The goth kids become worried after one of their members, Henrietta, returns from a camp intended to cure her goth, is an emo. But there is more going on than meets the eye."
}, {
  "imdbId" : "0121955",
  "season" : "17",
  "episodeNumber" : "5",
  "title" : "Taming Strange",
  "description" : "Ike is going through Canadian puberty and it puts a strain of his and Kyle's friendship. The school installs a computer system hooked up to a website called IntelliLink."
}, {
  "imdbId" : "0121955",
  "season" : "17",
  "episodeNumber" : "6",
  "title" : "Ginger Cow",
  "description" : "After Cartman pulls a silly prank where he puts a red wig and red spots on a cow, saying it's a \"ginger cow\", the middle east experiences peace but comes with a price for Kyle."
}, {
  "imdbId" : "0121955",
  "season" : "17",
  "episodeNumber" : "7",
  "title" : "Black Friday",
  "description" : "The children of South Park form two battling contingents to get a PlayStation 4 or an Xbox One during a Black Friday sale. Meanwhile, Randy takes a temp job as a security guard at the mall in order to make a little extra holiday money."
}, {
  "imdbId" : "0121955",
  "season" : "17",
  "episodeNumber" : "8",
  "title" : "A Song of Ass and Fire",
  "description" : "The battle for which gaming console will dominate, PlayStation 4 or Xbox, builds, with both sides of kids and the companies of each game system, vying for the win."
}, {
  "imdbId" : "0121955",
  "season" : "17",
  "episodeNumber" : "9",
  "title" : "Titties and Dragons",
  "description" : "The horror of Black Friday has begun and the battle begins. Forces will join, back stabbing will occur and there will be blood. And big floppy wieners."
}, {
  "imdbId" : "0121955",
  "season" : "17",
  "episodeNumber" : "10",
  "title" : "The Hobbit",
  "description" : "After Butters turns down a fat girl that asks him out, Wendy is upset over Butters' crush on Kim Kardashian because she says Kim is actually a short fat hobbit who uses photo shop to make herself look more attractive."
}, {
  "imdbId" : "0121955",
  "season" : "18",
  "episodeNumber" : "1",
  "title" : "Go Fund Yourself",
  "description" : "The boys use Kickstarter to fund themselves so they can sit on their butts and do absolutely nothing, but when Eric uses the name Washington Redskins, the owner of the Redskins is determined to stop him."
}, {
  "imdbId" : "0121955",
  "season" : "18",
  "episodeNumber" : "2",
  "title" : "Gluten Free Ebola",
  "description" : "Mr.Mackey is now gluten free and everyone is annoyed when he won't quit preaching about how great he feels."
}, {
  "imdbId" : "0121955",
  "season" : "18",
  "episodeNumber" : "3",
  "title" : "The Cissy",
  "description" : "Randy is harboring a giant secret and the pressure is getting to him. Meanwhile, Cartman calls Stan a cissy."
}, {
  "imdbId" : "0121955",
  "season" : "18",
  "episodeNumber" : "4",
  "title" : "Handicar",
  "description" : "Timmy starts a new transportation service to raise money."
}, {
  "imdbId" : "0121955",
  "season" : "18",
  "episodeNumber" : "5",
  "title" : "The Magic Bush",
  "description" : "Cartman and Butters obtain a drone and take it for a spin around the neighborhood."
}, {
  "imdbId" : "0121955",
  "season" : "18",
  "episodeNumber" : "6",
  "title" : "Freemium Isn't Free",
  "description" : "Canada creates a phone app that preys on the addiction of the weak, to help make money to build Canada. When Randy discovers Stan has an addiction, he intervenes."
}, {
  "imdbId" : "0121955",
  "season" : "18",
  "episodeNumber" : "7",
  "title" : "Grounded Vindaloop",
  "description" : "The boys have bought an Oculus Rift virtual reality headset and don't know who is in the real world or stuck in virtual reality."
}, {
  "imdbId" : "0121955",
  "season" : "18",
  "episodeNumber" : "8",
  "title" : "Cock Magic",
  "description" : "The boys visit City Wok - but there's something shady going on."
}, {
  "imdbId" : "0121955",
  "season" : "18",
  "episodeNumber" : "9",
  "title" : "#REHASH",
  "description" : "After Ike refuses to play a new game with Kyle, Kyle thinks the new generation of kids is terrible. Cartman becomes part of this new generation. Meanwhile Randy has drama going on with the music industry."
}, {
  "imdbId" : "0121955",
  "season" : "18",
  "episodeNumber" : "10",
  "title" : "#HappyHolograms",
  "description" : "Kyle teams up with network heads to make a Christmas special to bring the family together, and the holograms are still on the loose."
}, {
  "imdbId" : "0121955",
  "season" : "19",
  "episodeNumber" : "1",
  "title" : "Stunning and Brave",
  "description" : "The boys show their respect for Caitlyn Jenner when a new principal makes them atone for a history of prejudice."
}, {
  "imdbId" : "0121955",
  "season" : "19",
  "episodeNumber" : "2",
  "title" : "Where My Country Gone?",
  "description" : "Garrison decides he wants to build a wall to keep out all the undocumented immigrants."
}, {
  "imdbId" : "0121955",
  "season" : "19",
  "episodeNumber" : "3",
  "title" : "The City Part of Town",
  "description" : "With the town of South Park gentrifying, Kenny decides to get a job at City Wok."
}, {
  "imdbId" : "0121955",
  "season" : "19",
  "episodeNumber" : "4",
  "title" : "You're Not Yelping",
  "description" : "Cartman considers himself the top online restaurant reviewer in South Park."
}, {
  "imdbId" : "0121955",
  "season" : "19",
  "episodeNumber" : "5",
  "title" : "Safe Space",
  "description" : "Cartman is victimised because of his body weight."
}, {
  "imdbId" : "0121955",
  "season" : "19",
  "episodeNumber" : "6",
  "title" : "Tweek x Craig",
  "description" : "The East Asian girls in school are drawing intimate pictures of Tweek and Craig."
}, {
  "imdbId" : "0121955",
  "season" : "19",
  "episodeNumber" : "7",
  "title" : "Naughty Ninjas",
  "description" : "The ever more PC citizens of South Park decide that they no longer need a police force. As the first American town to get rid of their cops, they plan to celebrate their advanced sensibilities with a PC Carnival."
}, {
  "imdbId" : "0121955",
  "season" : "19",
  "episodeNumber" : "8",
  "title" : "Sponsored Content",
  "description" : "PC Principal's ideology is tested when the school newspaper writes about the PC Fraternity. Meanwhile ads slowly consume the Internet news, as Garrison participates in the political debate with Hilary Clinton."
}, {
  "imdbId" : "0121955",
  "season" : "19",
  "episodeNumber" : "9",
  "title" : "Truth and Advertising",
  "description" : "Principal Victoria and Mr. Garrison are back in town trying to stop PC. Meanwhile Jimmy tries to uncover the secret of Leslie."
}, {
  "imdbId" : "0121955",
  "season" : "19",
  "episodeNumber" : "10",
  "title" : "PC Principal Final Justice",
  "description" : "PC Principal travels around the world, destroying gentrifying districts. The town of South Park arms itself just as the gun show comes into town , Jimmy is held captive by Nathan, Kyle protects Leslie and the final showdown will start."
}, {
  "imdbId" : "0121955",
  "season" : "20",
  "episodeNumber" : "1",
  "title" : "Member Berries",
  "description" : "Mr. Garrison is still on the campaign trail, and the National Anthem gets a reboot by an American Icon."
}, {
  "imdbId" : "0121955",
  "season" : "20",
  "episodeNumber" : "2",
  "title" : "Skank Hunt",
  "description" : "The boys decide they have to take down Cartman but meanwhile, Skank Hunt takes his rein of terror global."
}, {
  "imdbId" : "0121955",
  "season" : "20",
  "episodeNumber" : "3",
  "title" : "The Damned",
  "description" : "Skankhunt42 is thrilled with the media attention and continues to troll."
}, {
  "imdbId" : "0121955",
  "season" : "20",
  "episodeNumber" : "4",
  "title" : "Wieners Out",
  "description" : "Butters and the other boys start a retaliatory movement against the girls. Gerald fears for his secret"
}, {
  "imdbId" : "0121955",
  "season" : "20",
  "episodeNumber" : "5",
  "title" : "Douche and a Danish",
  "description" : "The kids get pulled in to the search for the notorious Skankhunt42. Meanwhile, Gerald joins forces with the other trolls to stop Denmark from launching TROLLTRACE.COM."
}, {
  "imdbId" : "0121955",
  "season" : "20",
  "episodeNumber" : "6",
  "title" : "Fort Collins",
  "description" : "An entire city in Colorado gets hacked. Gerald and Cartman may lose everything when their complete history of internet activity becomes public."
}, {
  "imdbId" : "0121955",
  "season" : "20",
  "episodeNumber" : "7",
  "title" : "Oh, Jeez",
  "description" : "PC Principal tries one more time to make peace between the boys and the girls. Meanwhile, Gerald comes face-to-face with the Troll Hunter."
}, {
  "imdbId" : "0121955",
  "season" : "20",
  "episodeNumber" : "8",
  "title" : "Members Only",
  "description" : "Mr. Garrison deals with the aftermath of being elected President. Meanwhile, Gerald attempts to escape the wrath of being captured by Troll Trace and Cartman and Heidi prepare to go to Mars together."
}, {
  "imdbId" : "0121955",
  "season" : "20",
  "episodeNumber" : "9",
  "title" : "Not Funny",
  "description" : "Cartman decides to go to Mars, Mr. Garrison seeks revenge on the people of South Park."
}, {
  "imdbId" : "0121955",
  "season" : "20",
  "episodeNumber" : "10",
  "title" : "The End of Serialization as We Know It",
  "description" : "Stan and Kyle run away with Ike, Cartmans' trip to mars lands him on death row, Mr. Garrison and Randy help the trolls destroy a country."
}, {
  "imdbId" : "0121955",
  "season" : "21",
  "episodeNumber" : "1",
  "title" : "White People Renovating Houses",
  "description" : "Randy comes to grips with what it means to be white in today's society."
}, {
  "imdbId" : "0121955",
  "season" : "21",
  "episodeNumber" : "2",
  "title" : "Put It Down",
  "description" : "Tweek freaks out over bomb threats from North Korea; Cartman threatens to kill himself unless he gets respect."
}, {
  "imdbId" : "0121955",
  "season" : "21",
  "episodeNumber" : "3",
  "title" : "Holiday Special",
  "description" : "Everyone is going crazy as Columbus Day gets canceled and the kids try to bring it back as they would have a free day."
}, {
  "imdbId" : "0121955",
  "season" : "21",
  "episodeNumber" : "4",
  "title" : "Franchise Prequel",
  "description" : "Professor Chaos begins spreading lies about Coon and Friends on Facebook."
}, {
  "imdbId" : "0121955",
  "season" : "21",
  "episodeNumber" : "5",
  "title" : "Hummels & Heroin",
  "description" : "Beloved entertainers are being cut down in their prime due to massive overdoses of opiates, and Stan is about to be exposed as the source."
}, {
  "imdbId" : "0121955",
  "season" : "21",
  "episodeNumber" : "6",
  "title" : "Sons A Witches",
  "description" : "At the annual Halloween get together, a witch casts a spell that terrorizes everyone."
}, {
  "imdbId" : "0121955",
  "season" : "21",
  "episodeNumber" : "7",
  "title" : "Doubling Down",
  "description" : "Kyle is playing with fire when he gets in the middle of Cartman and Heidi's relationship."
}, {
  "imdbId" : "0121955",
  "season" : "21",
  "episodeNumber" : "8",
  "title" : "Moss Piglets",
  "description" : "Jimmy and Timmy's experiment could nab them first prize in the annual science fair."
}, {
  "imdbId" : "0121955",
  "season" : "21",
  "episodeNumber" : "9",
  "title" : "Super Hard PCness",
  "description" : "PC Principal falls in love with the new Vice Principal; Kyle isn't impressed with Terrance and Phillips' new Netflix show."
}, {
  "imdbId" : "0121955",
  "season" : "21",
  "episodeNumber" : "10",
  "title" : "Splatty Tomato",
  "description" : "There are \"stranger things\" going on when the children claim to have seen President Garrison lurking around."
}, {
  "imdbId" : "0121955",
  "season" : "22",
  "episodeNumber" : "1",
  "title" : "Dead Kids",
  "description" : "Randy is desperate to help Sharon get her emotions under control and Cartman unexpectedly fails his math test. Meanwhile a series of school shootings occur at South Park"
}, {
  "imdbId" : "0121955",
  "season" : "22",
  "episodeNumber" : "2",
  "title" : "A Boy and a Priest",
  "description" : "Randy calls Stephen in a panic when he learns that the boys went camping with a Priest."
}, {
  "imdbId" : "0121955",
  "season" : "22",
  "episodeNumber" : "3",
  "title" : "The Problem with a Poo",
  "description" : "Mr. Hankey answers hard questions about his past comments."
}, {
  "imdbId" : "0121955",
  "season" : "22",
  "episodeNumber" : "4",
  "title" : "Tegridy Farms",
  "description" : "Randy moves the family to the country and takes up farming; The vaping craze hits South Park."
}, {
  "imdbId" : "0121955",
  "season" : "22",
  "episodeNumber" : "5",
  "title" : "The Scoots",
  "description" : "A revolution in mobility is changing Halloween for everyone. Chaos erupts as every kid is out to get more candy than they have ever gotten before."
}, {
  "imdbId" : "0121955",
  "season" : "22",
  "episodeNumber" : "6",
  "title" : "Time to Get Cereal",
  "description" : "The South Park citizens are in danger and the boys realize that only"
}, {
  "imdbId" : "0121955",
  "season" : "22",
  "episodeNumber" : "7",
  "title" : "Nobody Got Cereal?",
  "description" : "The boys break out of jail and are on the run from the police and ManBearPig; Satan steps up to help the boys and the rest of South Park."
}, {
  "imdbId" : "0121955",
  "season" : "22",
  "episodeNumber" : "8",
  "title" : "Buddha Box",
  "description" : "Cartman has been diagnosed with anxiety."
}, {
  "imdbId" : "0121955",
  "season" : "22",
  "episodeNumber" : "9",
  "title" : "Unfulfilled",
  "description" : "South Park is chosen to be the home for Amazon's newest Fulfillment Center."
}, {
  "imdbId" : "0121955",
  "season" : "22",
  "episodeNumber" : "10",
  "title" : "Bike Parade",
  "description" : "With the Amazon workers striking, no one is getting their Christmas packages they ordered. On top of that, the boys' chance of winning a bike parade are jeopardized when Kenny decides to resist commercialism alongside the striking workers."
}]