[{
  "imdbId" : "6769208",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "One Ocean",
  "description" : "One Ocean takes us on a journey from the intense heat of the tropics to our planet's frozen poles to reveal new worlds and extraordinary never-before-seen animal behaviours."
}, {
  "imdbId" : "6769208",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "The Deep",
  "description" : "The adventurers in submarine explore the ocean and film everything around them."
}, {
  "imdbId" : "6769208",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Coral Reefs",
  "description" : "Corals build themselves homes of limestone in the warm, clear, shallow seas of the tropics. Their reefs occupy less than one tenth of one per cent of the ocean floor, yet they are home to a quarter of all known marine species."
}, {
  "imdbId" : "6769208",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Big Blue",
  "description" : "The big blue is the world's greatest wilderness, far from shore and many kilometers deep. It's a vast marine desert where there is little to eat and nowhere to hide."
}, {
  "imdbId" : "6769208",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Green Seas",
  "description" : "It's our green seas, not the blue, that bring life to our oceans. Here sunlight powers the growth of enchanted forests of kelp, mangroves and prairies of sea grass. They are the most abundant but fiercely competitive places in the ocean to live."
}, {
  "imdbId" : "6769208",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Coasts",
  "description" : "A fascinating insight into the coastal depths that grace our planet."
}, {
  "imdbId" : "6769208",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Our Blue Planet",
  "description" : "Examining the role of human anthropogenic activity on the oceans. Microplastics and pollution are an increasing problem for the world's seas, threatening the lives of marine life and ultimately impacting on the ecosystem."
}, {
  "imdbId" : "6769208",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Oceans of Wonder",
  "description" : "This extended special takes you on a journey from the equator to the unexplored depths of the ocean, meeting all the best-loved characters from the series."
}]