[{
  "imdbId" : "1190634",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "The Name of the Game",
  "description" : "When a Supe kills the love of his life, A/V salesman Hughie Campbell teams up with Billy Butcher, a vigilante hell-bent on punishing corrupt Supes -- and Hughie's life will never be the same again."
}, {
  "imdbId" : "1190634",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Cherry",
  "description" : "The Boys get themselves a Superhero, Starlight gets payback, Homelander gets naughty, and a Senator gets naughtier."
}, {
  "imdbId" : "1190634",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Get Some",
  "description" : "It's the race of the century. A-Train versus Shockwave, vying for the title of World's Fastest Man. Meanwhile, the Boys are reunited and it feels so good."
}, {
  "imdbId" : "1190634",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "The Female of the Species",
  "description" : "On a very special episode of The Boys... an hour of guts, gutterballs, airplane hijackings, madness, ghosts, and one very intriguing Female. Oh, and lots of heart -- both in the sentimental sense, and in the gory literal sense."
}, {
  "imdbId" : "1190634",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Good for the Soul",
  "description" : "The Boys head to the \"Believe\" Expo to follow a promising lead in their ongoing war against the Supes. There might -- MIGHT -- be a homicidal infant, but you'll have to see for yourself."
}, {
  "imdbId" : "1190634",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "The Innocents",
  "description" : "SUPER IN AMERICA (2019). Vought Studios. Genre: Reality. Starring: Homelander, Queen Maeve, Black Noir, The Deep, A-Train, Starlight, Tara Reid, Billy Zane."
}, {
  "imdbId" : "1190634",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "The Self-Preservation Society",
  "description" : "Never trust a washed-up Supe -- the Boys learn this lesson the hard way. Meanwhile, Homelander digs into his past, Starlight discovers that love hurts, and if you're ever in Sandusky, Ohio and a girl asks if she can touch your gills, say NO."
}, {
  "imdbId" : "1190634",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "You Found Me",
  "description" : "Season Finale Time! Questions answered! Secrets revealed! Conflicts... conflicted! Characters exploded! And so much more!"
}, {
  "imdbId" : "1190634",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "The Big Ride",
  "description" : "With Butcher still missing, Hughie, Mother's Milk, Frenchie, and Kimiko are now fugitives, and Homelander and Vought are more powerful than ever. But just as the Boys are about to leave the country, they are pulled back into the fray."
}, {
  "imdbId" : "1190634",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "Proper Preparation and Planning",
  "description" : "Butcher is back with the Boys, but tensions flare with Hughie. Homelander spends quality time with his new \"family.\" Starlight and Stormfront bond at a press junket and the Boys hunt down a super terrorist with a startling identity."
}, {
  "imdbId" : "1190634",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "Over the Hill with the Swords of a Thousand Men",
  "description" : "The Boys take to the high seas to safeguard their prisoner. Homelander plays house, then pushes Ryan over the edge. Starlight is forced to make an impossible choice. Stormfront reveals her true character."
}, {
  "imdbId" : "1190634",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "Nothing Like It in the World",
  "description" : "Milk, Hughie, and Annie go on a road trip to find Liberty. Frenchie has relationship problems, and Homelander continues to unravel."
}, {
  "imdbId" : "1190634",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "We Gotta Go Now",
  "description" : "Butcher has no more intentions to fight with Supes but Black Noir traced his location and found him: what will he do now? Supes are shooting a film named - #Dawn Of The Seven. Homelander is doing what Stormfront told him to do."
}, {
  "imdbId" : "1190634",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "The Bloody Doors Off",
  "description" : "When The Boys and Starlight follow a lead to Vought's mysterious Sage Grove Center, they find one of Vought's darkest secrets - and someone even darker from their past. Meanwhile Homelander and Stormfront's relationship deepens."
}, {
  "imdbId" : "1190634",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "Butcher, Baker, Candlestick Maker",
  "description" : "To help Victoria Neuman make a case against Vought, Mallory and The Boys look to an unlikely source for answers. Hughie gets terrifying news about Starlight. Meanwhile, Homelander and Stormfront further their master plan for Compound V."
}, {
  "imdbId" : "1190634",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "What I Know",
  "description" : "Becca shows up on Butcher's doorstep and begs for his help. The Boys agree to back Butcher, and together with Starlight, they finally face off against Homelander and Stormfront. But things go very bad, very fast."
}, {
  "imdbId" : "1190634",
  "season" : "3",
  "episodeNumber" : "1",
  "title" : "Payback",
  "description" : "One year following Stormfront's public controversy, Butcher and the Boys now work as contractors for Neuman's Bureau of Superhero Affairs in order to apprehend problematic Supes, with Hughie acting as their liaison."
}, {
  "imdbId" : "1190634",
  "season" : "3",
  "episodeNumber" : "2",
  "title" : "The Only Man in the Sky",
  "description" : "Homelander, America's greatest Supe. Defending our shores from sea to shining sea. Today, America honors him on his birthday. Vought Shopping Network is celebrating by offering an exclusive Homelander Limited Birthday Edition Gold Coin."
}, {
  "imdbId" : "1190634",
  "season" : "3",
  "episodeNumber" : "3",
  "title" : "Barbary Coast",
  "description" : "Tonight at 9/8C on Vought Plus, it's the season finale of #AmericanHero. Three contestants remain, but only TWO will join #TheSeven. Will Starlight choose her old flame Supersonic? Or will someone else be moving into the Seven Tower?"
}, {
  "imdbId" : "1190634",
  "season" : "3",
  "episodeNumber" : "4",
  "title" : "Glorious Five Year Plan",
  "description" : "The Boys search for a mysterious weapon in Russia while things are brewing behind the scenes at Vought. Plenty of trouble, gore and twists to foresee."
}, {
  "imdbId" : "1190634",
  "season" : "3",
  "episodeNumber" : "5",
  "title" : "The Last Time to Look on This World of Lies",
  "description" : "The Boys run into a major obstacle in their mission to stop the Seven and turn their attention to Soldier Boy. Homelander continues to make changes that fit his agenda at Vought International."
}, {
  "imdbId" : "1190634",
  "season" : "3",
  "episodeNumber" : "6",
  "title" : "Herogasm",
  "description" : "You’re invited to the 70th Annual Herogasm! You must present this invitation in order to be admitted! Same rules as always: no cameras, no non-Supe guests unless they sign an NDA and they’re DTF, and no telling any news media! It’s BYOD, but food, alcohol and lube will be provided! And please remember to RSVP so we can get an accurate headcount for the caterer!"
}, {
  "imdbId" : "1190634",
  "season" : "3",
  "episodeNumber" : "7",
  "title" : "Here Comes a Candle to Light You to Bed",
  "description" : "Everything's changing as never expected for the Homelander. Soldier Boy is searching for the other old payback members to slay. Black Noir recollects what has really got him to the current situation."
}, {
  "imdbId" : "1190634",
  "season" : "3",
  "episodeNumber" : "8",
  "title" : "The Instant White-Hot Wild",
  "description" : "Calling all patriots! Let's show Homelander we've got his back and we're not going to let Starlight and her House of Horrors get away with trafficking children and drinking their adrenaline! It's time for real Americans to fight back! Join the Hometeamers and Stormchasers tomorrow at Vought Square! Stand back and stand by!"
}]