[{
  "imdbId" : "1051155",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Secrets of the Sun",
  "description" : "The physical processes driving the energetic dynamics of the Sun and the resulting impact on the earth are examined."
}, {
  "imdbId" : "1051155",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Mars: The Red Planet",
  "description" : "Program recaps the basic knowledge about Mars normally covered in high school."
}, {
  "imdbId" : "1051155",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "The End of the Earth",
  "description" : "A few of the cosmic threats to life on earth reviewed include meteors, gamma ray bursts and, in the distant future, evolution of the sun."
}, {
  "imdbId" : "1051155",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Jupiter: The Giant Planet",
  "description" : "The Universe examines the stormy gas giant Jupiter and its mini-solar system of over 60 moons."
}, {
  "imdbId" : "1051155",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "The Moon",
  "description" : "The unique features of Earth's moon and the processes that shaped it are described. Past theories of the Moon's formation are also presented."
}, {
  "imdbId" : "1051155",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Spaceship Earth",
  "description" : "Take a high performance ride through the formation of the third planet from the Sun, Earth. A survivor of one of the most violent \"neighborhoods\" in the universe, learn how earth was created and discover what creatures hold clues to how life began."
}, {
  "imdbId" : "1051155",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Inner Planets",
  "description" : "Contrasts the radical differences between Earth and the planets Venus and Mercury. Lessons for life on earth are presented."
}, {
  "imdbId" : "1051155",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Saturn",
  "description" : "Program takes a brief look at the dynamics of Saturn's rings before exploring the unique and amazing features of the planet itself, including the curious behavior at the poles, and recent discoveries about Saturn's exotic moons."
}, {
  "imdbId" : "1051155",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "Alien Galaxies",
  "description" : "How the various structural types of galaxies form by merging with smaller galaxies is explained and simulated. The preliminary hints at the importance of dark matter in the process are mentioned."
}, {
  "imdbId" : "1051155",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "Life and Death of a Star",
  "description" : "Gravity plays a crucial role in both the birth and death of stars in this detailed review. Various types of stellar collisions are simulated."
}, {
  "imdbId" : "1051155",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "The Outer Planets",
  "description" : "New discoveries regarding the Outer Planets are creating a fundamental rethinking of our solar system. Uranus is a toxic combination of hydrogen, helium and methane. Scientists speculate that the planet was knocked on its side after colliding with another body. Neptune's largest moon, Triton, is cold and barren, but some scientists speculate that liquid water might exist under Triton's icy surface. If this is proven true, Triton could be the home to one of the biggest discoveries of all time. Cold and inhospitable, Pluto completes one orbit around the solar system ..."
}, {
  "imdbId" : "1051155",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "Most Dangerous Places",
  "description" : "Scientist describe the current understanding of exotic stars; magnetars, black holes and quasars with an obsession about how they would kill you. Galaxy collisions are simulated."
}, {
  "imdbId" : "1051155",
  "season" : "1",
  "episodeNumber" : "13",
  "title" : "Search for E.T.",
  "description" : "In a galaxy filled with a billion stars, in a universe filled with a hundred billion galaxies--are we alone? SETI--the Search for Extraterrestrial Intelligence--is a privately funded project using radio telescopes."
}, {
  "imdbId" : "1051155",
  "season" : "1",
  "episodeNumber" : "14",
  "title" : "Beyond the Big Bang",
  "description" : "The universe began with a massive expansion, billions and billions of years ago, and it continues to expand with every passing second. The idea that the universe, and man's very existence, began with a \"Big Bang\" is no longer a topic of debate among most scientists--it is essentially taken as fact."
}, {
  "imdbId" : "1051155",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "Alien Planets",
  "description" : "Astronomers who search for extrasolar planets were once thought of as crack-pots but are now at the forefront of astronomical research. The various methods used to locate and research these planets and the unexpected diversity of these bodies are described."
}, {
  "imdbId" : "1051155",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "Cosmic Holes",
  "description" : "Black holes, white holes and worm holes are all consistent with Einstein's theory of General Relativity. Of the three, actual evidence exists only for black holes. Their behavior is explained. Scientists speculate on on whether white holes and worm holes exist and how they would behave."
}, {
  "imdbId" : "1051155",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "Mysteries of the Moon",
  "description" : "Various phenomenon observed on earth, both real and perceived, are linked to the moon. Explanations for these phenomenon are presented."
}, {
  "imdbId" : "1051155",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "The Milky Way",
  "description" : "Our home galaxy, the Milky Way, consists of more than stars and planets. The wide variety of other celestial objects that call the Milk Way home are described. And the Milky Way is not alone but has some nearby companions."
}, {
  "imdbId" : "1051155",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "Alien Moons",
  "description" : "The number of known moons of the outer planets have exploded in recent years. Each has it own story to tell regarding its composition, geological activity and origin."
}, {
  "imdbId" : "1051155",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "Dark Matter",
  "description" : "Scientists hunt for dark matter in the strangest of places. They know where it is, what it does and can sort of see it if they look in the right way. They just can't quite figure out what it is or how to get their hands on it even though it's everywhere. But it is well understood compared to dark energy which is an even bigger mystery."
}, {
  "imdbId" : "1051155",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "Astrobiology",
  "description" : "Scientists speculate on how life originated on earth based on the range of conditions where life survives today and the conditions that existed on the early earth. They then look for those conditions, past or present, that may exist on other planets or moons."
}, {
  "imdbId" : "1051155",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "Space Travel",
  "description" : "The many and various hazards to space travel are explained. But solving that problem better propulsion systems are need to travel anywhere beyond the moon. Some possibilities, both realistic and speculative, are described."
}, {
  "imdbId" : "1051155",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "Supernovas",
  "description" : "Although supernovas are associated with the death of stars they also seed the universe with heavy elements that comprise rocky planets like Earth and living creatures. Due to their extraordinary brightness supernovas have a recorded history dating back 2,000 years. Although closely studied for decades their infrequency has permitted only a general understanding of their behavior until very recently. New computer models can model the major details of the explosion while new exploratory techniques reveal many more events including some truly super supernovas."
}, {
  "imdbId" : "1051155",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "Constellations",
  "description" : "In this program the constellations serve as a backdrop for the diversity of stellar objects and for a few very special stars that serve as navigation aids for sailors, seasonal markers for farmers or distance milestones for astronomers."
}, {
  "imdbId" : "1051155",
  "season" : "2",
  "episodeNumber" : "11",
  "title" : "Unexplained Mysteries",
  "description" : "A few of the astronomical mysteries that bother scientists and the progress toward understanding them are described."
}, {
  "imdbId" : "1051155",
  "season" : "2",
  "episodeNumber" : "12",
  "title" : "Cosmic Collisions",
  "description" : "Collisions between relatively minor bodies in the solar system can have far reaching effects. Astronomers are trying to trace meteors that caused mass extinctions back to the event that cause them to cross Earth's path in case they have relatives waiting to pay a visit."
}, {
  "imdbId" : "1051155",
  "season" : "2",
  "episodeNumber" : "13",
  "title" : "Colonizing Space",
  "description" : "Many considerations come to the forefront when planning space travel beyond the moon. Scientists are currently working on overcoming the many challenges and testing their solutions."
}, {
  "imdbId" : "1051155",
  "season" : "2",
  "episodeNumber" : "14",
  "title" : "Nebulas",
  "description" : "They are the crown jewels of the galaxy. Neither stars, planets, moons or asteroids, they are the mysterious clouds of gas we call NEBULAS. Nearly invisible to the naked eye, astronomers use the most sophisticated techniques to tease images of these fascinating phenomena from the dark sky. When revealed in their full glory, they glow, reflect or obscure the galaxy's light."
}, {
  "imdbId" : "1051155",
  "season" : "2",
  "episodeNumber" : "15",
  "title" : "Wildest Weather in the Cosmos",
  "description" : "If a planet has an atmosphere it has weather. And where there is weather there are storms. Our solar system is chock full of them. And the bigger the temperature extreme the bigger the storm. Which makes Earth hurricanes and thunderstorms seem rather uninteresting."
}, {
  "imdbId" : "1051155",
  "season" : "2",
  "episodeNumber" : "16",
  "title" : "Biggest Things in the Universe",
  "description" : "Compared to the largest things in the universe galaxies are trifles compared to super clusters, voids, lyman alpha blobs, and the cosmic web. But even among the smaller objects such as stars and planets, some are mind boggling by human standards."
}, {
  "imdbId" : "1051155",
  "season" : "2",
  "episodeNumber" : "17",
  "title" : "Gravity",
  "description" : "Program presents scientists current understanding of gravity and some of the phenomenon it causes."
}, {
  "imdbId" : "1051155",
  "season" : "2",
  "episodeNumber" : "18",
  "title" : "Cosmic Apocalypse",
  "description" : "Program examines the possible ways the universe could come to an end. The most likely scenario, eternal expansion, is expected to be rather eventful in the long term."
}]