[{
  "imdbId" : "3663490",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "And the Crown of King Arthur",
  "description" : "Someone is killing off potential Librarians and it's up to Flynn Carsen and his new Guardian, Colonel Eve Baird, to save the three that are left."
}, {
  "imdbId" : "3663490",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "And the Sword in the Stone",
  "description" : "The Serpent Brotherhood is trying to return magic to our world. Flynn, Colonel Baird, and the potential Librarians must stop them before it's too late."
}, {
  "imdbId" : "3663490",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "And the Horns of a Dilemma",
  "description" : "The Librarians' first solo mission hits a snag when Baird loses the others in a mysterious Labyrinth that magically exists below the skyscraper of a modern corporation."
}, {
  "imdbId" : "3663490",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "And Santa's Midnight Run",
  "description" : "Santa or at least the Spirit of Santa is kidnapped by the Serpent Brotherhood. The Librarians are tasked by Mrs. Clause to rescue Santa in London."
}, {
  "imdbId" : "3663490",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "And the Apple of Discord",
  "description" : "When the dragons sleeping beneath the earth threaten to awaken and wreak havoc around the world, Flynn returns to help find their hidden treasure."
}, {
  "imdbId" : "3663490",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "And the Fables of Doom",
  "description" : "The Librarians travel to a town where fairy tales are coming to life - and attacking."
}, {
  "imdbId" : "3663490",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "And the Rule of Three",
  "description" : "When a group of competitive high-school students start undercutting each other with witchcraft, the Librarians have to intercede before disaster destroys them all."
}, {
  "imdbId" : "3663490",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "And the Heart of Darkness",
  "description" : "The Librarians encounter the House behind the legend of all haunted houses and set out to destroy it."
}, {
  "imdbId" : "3663490",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "And the City of Light",
  "description" : "A missing-person investigation uncovers what appears to be an alien invasion in a small rural town."
}, {
  "imdbId" : "3663490",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "And the Loom of Fate",
  "description" : "The changing destinies of the Librarians."
}, {
  "imdbId" : "3663490",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "And the Drowned Book",
  "description" : "The Librarians gather after months of being on their own to investigate a mysterious and massive storm over Manhattan."
}, {
  "imdbId" : "3663490",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "And the Broken Staff",
  "description" : "Prospero summons other fictionals to retrieve the parts of his staff."
}, {
  "imdbId" : "3663490",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "And What Lies Beneath the Stones",
  "description" : "The Librarians must come clean and tell the truth after a shape-shifting entity that grows stronger when lies are told is freed."
}, {
  "imdbId" : "3663490",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "And the Cost of Education",
  "description" : "Students start to vanish at a university founded by a mad historian who believed in alternate dimensions."
}, {
  "imdbId" : "3663490",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "And the Hollow Men",
  "description" : "While chasing one of the Library's missing artifacts, Flynn is kidnapped by a mysterious stranger with both amnesia and a collection of all the Library's missing artifacts. Soon all of them are in pursuit of the Staff of Zarathustra before it falls into the hands of Prospero."
}, {
  "imdbId" : "3663490",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "And the Infernal Contract",
  "description" : "An old friend of Baird's is running for Mayor of a small New Hampshire town and finds himself embroiled in a scandal in the form of a missing intern and a literal contract with the Devil. Baird soon finds herself in a battle not only for her own soul, but also for the souls of all the Librarians."
}, {
  "imdbId" : "3663490",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "And the Image of Image",
  "description" : "Mysterious events affecting young and beautiful clubbers lead the Librarians to a certain person in possession of a unique selfie."
}, {
  "imdbId" : "3663490",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "And the Point of Salvation",
  "description" : "The Clipping Book sends the team to a high-tech research facility, where the researchers have been turned into mindless monsters by some bizarre power source in the center's lab. When they disconnect the artifact, however, they find themselves stuck in a time loop."
}, {
  "imdbId" : "3663490",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "And the Happily Ever Afters",
  "description" : "The team members scatter, living ideal versions of their lives. However, they're drawn back together to investigate the appearance of Ariel, a sprite, bound to serve Prospero."
}, {
  "imdbId" : "3663490",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "And the Final Curtain",
  "description" : "Prospero gains renewed magic that creates havoc with the world's technology. Flynn and Baird must travel back to 1611 to battle Prospero and thwart his scheme to recreate a forest utopia."
}, {
  "imdbId" : "3663490",
  "season" : "3",
  "episodeNumber" : "1",
  "title" : "And the Rise of Chaos",
  "description" : "The Egyptian God of Chaos inhabits a human, and tries to release pure evil into the world; the librarians must decipher clues in a science museum."
}, {
  "imdbId" : "3663490",
  "season" : "3",
  "episodeNumber" : "2",
  "title" : "And the Fangs of Death",
  "description" : "Flynn leads the others on a rescue mission, which leads them into a subterranean trap filled with ancient Egyptian werewolves."
}, {
  "imdbId" : "3663490",
  "season" : "3",
  "episodeNumber" : "3",
  "title" : "And the Reunion of Evil",
  "description" : "Two Librarians retrieve a magical object. They take refuge at a lodge where everyone wants the object to further their evil powers. Jenkins, Jones and Baird work through the magic in an attempt to provide a timely rescue."
}, {
  "imdbId" : "3663490",
  "season" : "3",
  "episodeNumber" : "4",
  "title" : "And the Self-Fulfilling Prophecy",
  "description" : "After seeing a vision of her own death at the hands of a supernatural assassin, can Baird cheat fate and stop the deadly prophecy coming true?"
}, {
  "imdbId" : "3663490",
  "season" : "3",
  "episodeNumber" : "5",
  "title" : "And the Tears of a Clown",
  "description" : "The Librarians investigate a mysterious traveling carnival and discover how dangerous their collection of magical artifacts could be."
}, {
  "imdbId" : "3663490",
  "season" : "3",
  "episodeNumber" : "6",
  "title" : "And the Trial of the Triangle",
  "description" : "In order to stop the spread of pure evil, the team must find the Eye of Ra and unravel the mystery of the Bermuda Triangle; Flynn must pass a series of tests."
}, {
  "imdbId" : "3663490",
  "season" : "3",
  "episodeNumber" : "7",
  "title" : "And the Curse of Cindy",
  "description" : "The obnoxious Cindy Kroger has suddenly become super-popular thanks to a magical love potion. The Librarians must stop her before she launches a love missile that would force the whole world to become her fan base."
}, {
  "imdbId" : "3663490",
  "season" : "3",
  "episodeNumber" : "8",
  "title" : "And the Eternal Question",
  "description" : "A man's strange death by exploding into flames send Jake, Cassandra and Ezekiel to a wellness retreat like no other. There they find the key to eternity or at least it seems they do. Meanwhile Carsen and Baird spend much needed time alone."
}, {
  "imdbId" : "3663490",
  "season" : "3",
  "episodeNumber" : "9",
  "title" : "And the Fatal Separation",
  "description" : "When The Monkey King's sacred homeland of Shangri-La is taken over by a ruthless collector of magical artifacts, the balance of the Universe is put in jeopardy, forcing all the Librarians to come together to help save the imperiled land but at a terrible cost."
}, {
  "imdbId" : "3663490",
  "season" : "3",
  "episodeNumber" : "10",
  "title" : "And the Wrath of Chaos",
  "description" : "The library is simultaneously infiltrated by DOSA and Apep; Flynn, Baird, Stone, Cassandra, Ezekiel and Jenkins must put aside their differences to save the library, the world and themselves."
}, {
  "imdbId" : "3663490",
  "season" : "4",
  "episodeNumber" : "1",
  "title" : "And the Dark Secret",
  "description" : "A secret sect of the Vatican Church unearths a map detailing the locations of the four cornerstones of the Library of Alexandria; Flynn and the Librarians work with an unexpected ally to stop them before the stones can be used to destroy the Library."
}, {
  "imdbId" : "3663490",
  "season" : "4",
  "episodeNumber" : "2",
  "title" : "And the Steal of Fortune",
  "description" : "When people begin getting hurt in the unluckiest of ways, the Librarians are led to a casino where the owner appears to possess an artifact capable of stealing people's luck."
}, {
  "imdbId" : "3663490",
  "season" : "4",
  "episodeNumber" : "3",
  "title" : "And the Christmas Thief",
  "description" : "Eve, Flynn and Jenkins go to a party hosted by Santa Claus. In the meantime Santa's Sleigh is left in the care of The Library, it also happens to be All Thanksthieving Day celebrated by thieves all the world over. Ezekiel feels he needs to see his family of thieves to bring his adoptive mother a gift which happens not to be stolen. Once Ezekiel mother finds out that Ezekiel has been leading a double life at the Library one thing leads to another as mother steals the magical world globe to do her own thefts and what ensues has The Libraians try to right what's wrong ..."
}, {
  "imdbId" : "3663490",
  "season" : "4",
  "episodeNumber" : "4",
  "title" : "And the Silver Screen",
  "description" : "When Flynn and Baird are sucked into Baird's favorite classic Film Noir movie, the Librarians are drawn into the world of movie magic - literally - where they'll need to perfect their lassoing skills, sharpshooting, and snappy dialogue if they're going to make it out alive."
}, {
  "imdbId" : "3663490",
  "season" : "4",
  "episodeNumber" : "5",
  "title" : "And the Bleeding Crown",
  "description" : "A Librarian from the past teams up with the Librarians of the present to take down an ancient and powerful enemy let loose in the modern day. When superfan Flynn is met with the prospect of teaming with his Librarian hero Darrington Dare, he could not be more excited, until Darrington leaves the Librarians with this dire warning: There can be only one Librarian - ignore at your own peril."
}, {
  "imdbId" : "3663490",
  "season" : "4",
  "episodeNumber" : "6",
  "title" : "And the Graves of Time",
  "description" : "When Baird goes after Nicole Noone in an attempt to repair her rift with the Library, she ends up joining Nicole in a mission to retrieve a dangerous artifact before it falls into the hands of Russian grave robbers. But can she convince Nicole to forgive the Library and return home with her? Or, will Nicole open Baird's eyes to the dangers of a Guardian dedicating herself, heart and soul, to the Library?"
}, {
  "imdbId" : "3663490",
  "season" : "4",
  "episodeNumber" : "7",
  "title" : "And the Disenchanted Forest",
  "description" : "When dissension threatens the group, Baird takes the Librarians to a charismatic self-help guru's team building camp on the edge of a forest where people have been mysteriously disappearing. Is there a monster in the woods? Or is something more sinister going on? And can the Librarians get their team mojo back in time to defeat it?"
}, {
  "imdbId" : "3663490",
  "season" : "4",
  "episodeNumber" : "8",
  "title" : "And the Hidden Sanctuary",
  "description" : "After Cassandra freezes up during a mission, she decides it's past time to go on a vacation. Searching for her ideal town, she lands on Havenport, the \"Safest Town in America.\" At first blush, it seems just what she needed, but is there always a price to pay for unrealistic peace of mind?"
}, {
  "imdbId" : "3663490",
  "season" : "4",
  "episodeNumber" : "9",
  "title" : "And a Town Called Feud",
  "description" : "When a Civil War reenactment in a town called Feud is plagued by ghosts, the Librarians have to uncover the truth of what really happened there over 100 years ago."
}, {
  "imdbId" : "3663490",
  "season" : "4",
  "episodeNumber" : "10",
  "title" : "And Some Dude Named Jeff",
  "description" : "When Jenkins body-switches with a 28-year-old slacker named Jeff, he must find his way back into the Library to correct the mistake. But he will need a team to do it, and enlists the help of Jeff's hapless Dungeons and Dragons friends. Can they make it in time, before Jeff destroys the Library?"
}, {
  "imdbId" : "3663490",
  "season" : "4",
  "episodeNumber" : "11",
  "title" : "And the Trial of the One",
  "description" : "As tensions between the Librarians escalate over which of them is the most deserving to participate in the tethering ceremony with Baird, the Library steps in and turns each of the Librarians into their most primal selves, and are sent to survive a terrifying alternate reality to determine who is the most worthy."
}, {
  "imdbId" : "3663490",
  "season" : "4",
  "episodeNumber" : "12",
  "title" : "And the Echoes of Memory",
  "description" : "After the world is morphed into a horrible and unrecognizable place - one where the Library never existed - it's up to Baird to bring the Librarians together before this bleak, knowledge-less world becomes the new reality."
}]