[{
  "imdbId" : "0083470",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "License to Steele",
  "description" : "Female PI Laura Holt concocts a mastermind male detective so her failing agency can finally attract sexist clients. One assignment that results is the transport of the world's rarest gems, to hype the debut of a new car. Stalking Laura & the shipment is a mysterious charmer who claims he's a South African government agent. The auto's inventor demands that the fictional agency head, Remington Steele, personally supervise the jewels' arrival, putting Laura on the spot."
}, {
  "imdbId" : "0083470",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Tempered Steele",
  "description" : "An electronics company hires the agency to discover who is stealing their research. After Mr. Steele blows all Ms. Holt's hard work on the case, he has the arrogant new owner install a fifty thousand dollar security system."
}, {
  "imdbId" : "0083470",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Steele Waters Run Deep",
  "description" : "Laura and Remington are hired by three video game creators to find their missing partner, who has apparently disappeared with a large portion of the company's assets and their newest video game."
}, {
  "imdbId" : "0083470",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Signed, Steeled and Delivered",
  "description" : "A mild mannered information retrieval agent who is about to be married, asks the help of the Remington Steele Agency when it appears that the CIA is attempting to kill him."
}, {
  "imdbId" : "0083470",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Thou Shalt Not Steele",
  "description" : "Ms. Holt and Mr. Steele disagree on whither to provide security for a cursed painting. Ms. Holt's interfering mother comes for an annoying visit."
}, {
  "imdbId" : "0083470",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Steele Belted",
  "description" : "Mr. Steele is suspicious of an attorney who he thinks is paying more attention to Ms. Holt than to the client who is implicated in the theft of valuable coins and murder."
}, {
  "imdbId" : "0083470",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Etched in Steele",
  "description" : "Mr. Steele's desire to write a book, over Ms. Holt objection, leads them them to the husband of a sleazy romance novelist who fears that a murder is planned for him."
}, {
  "imdbId" : "0083470",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Your Steele the One for Me",
  "description" : "A traffic accident in the Asian community may be a Yakuza murder."
}, {
  "imdbId" : "0083470",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "In the Steele of the Night",
  "description" : "Laura and Murphy sneak away to a reunion of former colleagues. After Steele discovers that the invitation was also for him, he shows up at the reunion as well. Soon, the reunion's host turns up dead. With old grievances beginning to surface, the guests turn to Steele to solve the crime. Knowing nothing about how to perform an investigation, Steele secretly seeks guidance from Laura during the investigation."
}, {
  "imdbId" : "0083470",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "Steele Trap",
  "description" : "Steele and Laura attend an island party thrown by a wealthy magazine publisher in order to learn why a client recently committed suicide. Soon, the party guests, as well as the host, begin being murdered one by one, until only the leads and the killer remain. At one point, when the situation gets dire, Steele tries to tell Laura more about himself, but Laura dissuades him, telling him that she would prefer not knowing about any crimes he might have committed before assuming the decidedly upstanding role of Remington Steele. The episode ends with Laura, Murphy, and \"Ms..."
}, {
  "imdbId" : "0083470",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "Steeling the Show",
  "description" : "Steele and Laura are hired to track down Veronica Kirk, a former B movie actress from the 1940s. When the actress is located, she informs them that someone is trying to kill her. Initially, all of Kirk's claims are discredited, and it appears that the aging actress is as crazy as Kirk's daughter claims, but as additional clues surface, Steele and Laura realize that someone really is out to get her."
}, {
  "imdbId" : "0083470",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "Steele Flying High",
  "description" : "After Laura presses him into serving as an honorary chairman of a conversation committee devoted to saving the habitat of the bald eagle, Steele stumbles upon the death of the environmental researcher whose report on land area being considered for purchase by Steele's committee is overdue. Believing the death is no accident, Steele, doing his best Bogart impression, and Laura investigate."
}, {
  "imdbId" : "0083470",
  "season" : "1",
  "episodeNumber" : "13",
  "title" : "A Good Night's Steele",
  "description" : "Lab security is compromised, records destroyed, morphine is being stolen and a staff physician is missing. Ms. Holt and Mr. Steele infiltrate a hospital sleep clinic as physician and insomniac to solve the mysteries."
}, {
  "imdbId" : "0083470",
  "season" : "1",
  "episodeNumber" : "14",
  "title" : "Hearts of Steele",
  "description" : "Ms. Holt and Mr. Steele masquerade as battling (and slightly alcoholic) spouses to discover who is attempting to kill their divorce lawyer client."
}, {
  "imdbId" : "0083470",
  "season" : "1",
  "episodeNumber" : "15",
  "title" : "To Stop a Steele",
  "description" : "Ms. Holt is hired (as long as Steele is not involved) by jeweler, Albert Harrod, to locate an stolen flawless 60 carat diamond that had been \"hidden\" among much less expensive items. Mr. Steele is hired (as long the agency is not involved) by jewel thief, Morrie Singer. He was commissioned to burgle the Harrod gem vault, but found it empty. Who has the hot rocks and are the two different cases involving the same jeweler connected?"
}, {
  "imdbId" : "0083470",
  "season" : "1",
  "episodeNumber" : "16",
  "title" : "Steele Crazy After All These Years",
  "description" : "A woman from Mr. Michaels college days seeks help solving the mystery disappearance of a mutual friend. It appears an poltergeist is murdering former members of her 1960's anti-war group."
}, {
  "imdbId" : "0083470",
  "season" : "1",
  "episodeNumber" : "17",
  "title" : "Steele Among the Living",
  "description" : "Remington and Laura set out to find an artist who recently disappeared. During the investigation, they are hounded by second-rate private investigator Leo Blitzman, who plants electronic eavesdropping devices in order to track their every move."
}, {
  "imdbId" : "0083470",
  "season" : "1",
  "episodeNumber" : "18",
  "title" : "Steele in the News",
  "description" : "Steele and Laura investigate the murder of two news team personnel at a local television station."
}, {
  "imdbId" : "0083470",
  "season" : "1",
  "episodeNumber" : "19",
  "title" : "Vintage Steele",
  "description" : "Laura is reunited with a former lover when he seeks the help of Remington Steele investigations after finding a corpse in vat of wine. The investigation eventually leads to a nearby monastery, where Steele and Laura learn the identity of the corpse as well as the identity of the killer."
}, {
  "imdbId" : "0083470",
  "season" : "1",
  "episodeNumber" : "20",
  "title" : "Steele's Gold",
  "description" : "While protecting artifacts of olde California, a murder committed during the exhibits costume party sends Ms. Holt, Mr. Michaels and Mr. Steele on a golden trail to recover the journal of prospector Arnold Dobbs."
}, {
  "imdbId" : "0083470",
  "season" : "1",
  "episodeNumber" : "21",
  "title" : "Sting of Steele",
  "description" : "A murderous casino owner hires the agency to locate a con artist (a man from Mr. Steele's past) who swindled his operation. Ms. Holt's annoying mother is back."
}, {
  "imdbId" : "0083470",
  "season" : "1",
  "episodeNumber" : "22",
  "title" : "Steele in Circulation",
  "description" : "Alfred Hollis thinks that he is helping his new friend, Angelica, by \"borrowing\" $2.3 million slated to be shredded by the Federal Reserve Bank where he works. The money is stolen from him. Mr. Steele stops Alfred from suicide and works with Ms. Holt to recover the money before the bank notices that it is missing."
}, {
  "imdbId" : "0083470",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "Steele Away with Me",
  "description" : "Laura returns to Acapulco after a dying man leaves a tuna stuffed with diamonds and wrapped in an Acapulco newspaper on her doorstep. Steele joins her while trying to avoid a dogged IRS investigator, Mildred Krebs."
}, {
  "imdbId" : "0083470",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "Red Holt Steele",
  "description" : "Someone is trying sabotage R.J. Stonewell's aviation company. She goes to Remington Steele Investigations for help, but R.J.'s mysterious rival is so intent on ruining Stonewell Aircraft, Ms. Holt's home is bombed in an attempt to kill Laura and stop the investigation."
}, {
  "imdbId" : "0083470",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "Altared Steele",
  "description" : "A man who cannot remember his name hires Remington Steele Investigations to find out who he is and why someone may be trying to kill him. Steele and Laura soon discover that their client is leading a double, or rather quintuple life, with five different wives to go along with five different professions. Can Steele and Laura determine which wife is trying to kill their client before it is too late?"
}, {
  "imdbId" : "0083470",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "Steele Framed",
  "description" : "It appears to a panicked Mr. Steele that he has killed an perspective client with Ms. Holt's car. Who was the victim? Who is the creep shadowing Mr.Steele? Why is this happening?"
}, {
  "imdbId" : "0083470",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "A Steele at Any Price",
  "description" : "An investigative reporter has disappeared after making a major purchase from an art auction house. Her news paper colleague asks Remington Steele Investigations to find her."
}, {
  "imdbId" : "0083470",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "Love Among the Steele",
  "description" : "Ms. Holt and Mr. Steele investigate a mystery involving an 1936 Auburn Boattail Speedster, which is said to be \"the key to something of great value\"."
}, {
  "imdbId" : "0083470",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "Scene Steelers",
  "description" : "Two very bad actors accuse each other of attempted murder when a pet parrot dies after tasting a bit of the TV Dinner they were to eat while filming an commercial. It is up to Miss Holt and Mr. Steele to keep the filming on schedule."
}, {
  "imdbId" : "0083470",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "Steele Knuckles and Glass Jaws",
  "description" : "Ms. Holt and Mr. Steele must protect a child from mobster relative."
}, {
  "imdbId" : "0083470",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "My Fair Steele",
  "description" : "A terminally ill tycoon hires the Remington Steele Agency to locate the twin sister of his self centered adopted daughter."
}, {
  "imdbId" : "0083470",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "Steele Threads",
  "description" : "Ms. Holt and Mr. Steele work under cover to expose industrial espionage in the world of high fashion."
}, {
  "imdbId" : "0083470",
  "season" : "2",
  "episodeNumber" : "11",
  "title" : "Steele Eligible",
  "description" : "An Los Angeles magazine lists the five most eligible bachelors, Mr Steele among them. The problem? The men are being murdered. Can Ms. Holt stop the killer?"
}, {
  "imdbId" : "0083470",
  "season" : "2",
  "episodeNumber" : "12",
  "title" : "High Flying Steele",
  "description" : "The Remington Steele Agency becomes involved in solving a circus mystery."
}, {
  "imdbId" : "0083470",
  "season" : "2",
  "episodeNumber" : "13",
  "title" : "Blood Is Thicker Than Steele",
  "description" : "A shady expatriate is promised a clear passage home if he testifies for the U.S. Government against his former employer. The Remington Steele Agency is hired to protect his two children; a hormone driven teen boy and less than angelic girl of nine."
}, {
  "imdbId" : "0083470",
  "season" : "2",
  "episodeNumber" : "14",
  "title" : "Steele Sweet on You",
  "description" : "Ms. Holt's brother-in-law needs her help when his wife suspects him of adultery; then his business partner and assistant are murdered."
}, {
  "imdbId" : "0083470",
  "season" : "2",
  "episodeNumber" : "15",
  "title" : "Elegy in Steele",
  "description" : "21 February 1984, 11 A.M.; the evil Major Descoine returns to menace Ms. Holt and Mr. Steele with his promise that they will die at noon because he blames them for the 1981 suicide of Lily, his love and partner in crime."
}, {
  "imdbId" : "0083470",
  "season" : "2",
  "episodeNumber" : "16",
  "title" : "Small Town Steele",
  "description" : "Ms. Holt and Mr. Steele are hired to investigate the disappearance of of an historian on a research trip to a small town which is hiding a secret for which someone is willing to kill."
}, {
  "imdbId" : "0083470",
  "season" : "2",
  "episodeNumber" : "17",
  "title" : "Molten Steele",
  "description" : "The name and telephone number of a socialite are placed in a swingers magazine, perhaps by her former boy toy, a dishonest auto mechanic. Ms. Holt and Mr. Steele are hired to prove who is behind the classified sex ad and make the harassment stop before her upper class community finds out."
}, {
  "imdbId" : "0083470",
  "season" : "2",
  "episodeNumber" : "18",
  "title" : "Dreams of Steele",
  "description" : "Six Royal Lavulite gems which Ms. Holt and Mr. Steele have been hired to protect are exposed as colored glass."
}, {
  "imdbId" : "0083470",
  "season" : "2",
  "episodeNumber" : "19",
  "title" : "Woman of Steele",
  "description" : "The agency is hired to protect a priceless art collection when a female swindler thought to be dead suddenly appears, throwing Mr. Steele far off center and leaving Ms. Holt to guard the collection and her partner."
}, {
  "imdbId" : "0083470",
  "season" : "2",
  "episodeNumber" : "20",
  "title" : "Hounded Steele",
  "description" : "Mildred freelances as a pet detective, inadvertently involving everyone in a jewel heist."
}, {
  "imdbId" : "0083470",
  "season" : "2",
  "episodeNumber" : "21",
  "title" : "Elementary Steele",
  "description" : "An actress/singer who is being pursued by fictional detectives hires The Remington Steele Agency for protection, leading them into a bizarre \"Magical Mystery Tour\"."
}, {
  "imdbId" : "0083470",
  "season" : "3",
  "episodeNumber" : "1",
  "title" : "Steele at It",
  "description" : "Laura and Remington travel to the French Riviera, where Laura's romantic hopes are dashed as Remington becomes involved with a friend from his mysterious past and is targeted by deadly jewel thieves."
}, {
  "imdbId" : "0083470",
  "season" : "3",
  "episodeNumber" : "2",
  "title" : "Lofty Steele",
  "description" : "Somewhere in Ms. Holt's loft is hidden incriminating evidence for which someone is willing to kill."
}, {
  "imdbId" : "0083470",
  "season" : "3",
  "episodeNumber" : "3",
  "title" : "Maltese Steele",
  "description" : "Laura and Remington search the exotic Mediterranean isle of Malta for a missing corpse and stumble upon an ancient cross, which hides a dangerous secret."
}, {
  "imdbId" : "0083470",
  "season" : "3",
  "episodeNumber" : "4",
  "title" : "Second Base Steele",
  "description" : "A high school baseball team alumnus hires The Remington Steele Agency to find out who is responsible for a series accidents at a sports camp his old team is attending."
}, {
  "imdbId" : "0083470",
  "season" : "3",
  "episodeNumber" : "5",
  "title" : "Blue Blooded Steele",
  "description" : "Daniel Chalmers returns to convince Mr. Steele to go to England and masquerade as heir of the Duke of Rutherford."
}, {
  "imdbId" : "0083470",
  "season" : "3",
  "episodeNumber" : "6",
  "title" : "Steele Your Heart Away",
  "description" : "An amnesiac Steele has no idea why he's in Ireland or why he regained consciousness in a movie theatre beside a murdered man."
}, {
  "imdbId" : "0083470",
  "season" : "3",
  "episodeNumber" : "7",
  "title" : "A Pocketful of Steele",
  "description" : "A sixteen year old pickpocket leads Mr. Steel on a merry chase for photographic evidence against a murderous loan shark banker."
}, {
  "imdbId" : "0083470",
  "season" : "3",
  "episodeNumber" : "8",
  "title" : "Puzzled Steele",
  "description" : "A manipulative millionaire drives a competitive wedge between a suspicious Ms. Holt and a greedy Mr. Steele with a thirty thousand dollars wager that they will not find an English writer missing in Malta within 48 hours."
}, {
  "imdbId" : "0083470",
  "season" : "3",
  "episodeNumber" : "9",
  "title" : "Cast in Steele",
  "description" : "Three actors from Hollywood's golden age call upon the Remington Steele Agency to discover the who is responsible for threatening notes and attacks."
}, {
  "imdbId" : "0083470",
  "season" : "3",
  "episodeNumber" : "10",
  "title" : "Breath of Steele",
  "description" : ""
}, {
  "imdbId" : "0083470",
  "season" : "3",
  "episodeNumber" : "11",
  "title" : "Let's Steele a Plot",
  "description" : "The treasury of a mystery writer's guild is missing one million dollars, drawn out the guild's account by fraudulent checks. The money, donated by a recently deceased writer, was to provide the guild with a new building. Steele and Holt follow the clues uncovering two murders and aiding a senior citizen friend of the deceased writer."
}, {
  "imdbId" : "0083470",
  "season" : "3",
  "episodeNumber" : "12",
  "title" : "Gourmet Steele",
  "description" : "A restaurant critic for an haute cuisine magazine is missing so the desperate publisher hires the Remington Steele Agency."
}, {
  "imdbId" : "0083470",
  "season" : "3",
  "episodeNumber" : "13",
  "title" : "Stronger Than Steele",
  "description" : "A former T.V. actor, obsessed with the super hero he once played (the very one who's virtues Ms. Holt used to create Remington Steele), has been accused of killing the arrogant young producer/director of an upcoming movie in which he will not be playing the hero."
}, {
  "imdbId" : "0083470",
  "season" : "3",
  "episodeNumber" : "14",
  "title" : "Have I Got a Steele for You",
  "description" : "It appears that a man is being swindled out of a half a million dollar nest egg by a doll company scam, so his suspicious wife hires the Remington Steele Agency to expose the fraud."
}, {
  "imdbId" : "0083470",
  "season" : "3",
  "episodeNumber" : "15",
  "title" : "Springtime for Steele",
  "description" : "Rocky Sullivan who is now a singer and her concert is sold out. She invites Steele and Laura. Her managers are not happy about her success. When an accident almost kills her, Steele and Laura try to find out what's going on. They eventually learn that her managers have oversold her and were hoping that she would flop and none of the people who own her would care. Later one of the managers is killed, Steele and Laura try to find out who killed him."
}, {
  "imdbId" : "0083470",
  "season" : "3",
  "episodeNumber" : "16",
  "title" : "Steele in the Family",
  "description" : "Mildred's nephew asks Steele to help him. It seems he and some hookers and invested in a company and the company's CEO is one of their clients. He is killed while with one of them. Now a major deal is about to come down but if his death is ever revealed it could jeopardize the deal so they've been hiding his body. At the same time the hit man is being told by the ones who hired him that unless the public sees him dead killing him is meaningless."
}, {
  "imdbId" : "0083470",
  "season" : "3",
  "episodeNumber" : "17",
  "title" : "Diced Steele",
  "description" : "The agency has been hired by an insurance company to recover some jewels that were stolen. So Steele learns who the thief is and invites him to play poker and hopes to clean him out so that he has to get the jewels to pay Steele. But the man cleans Steele out. So while Mildred follows him, Steele has to explain to the insurance company that he lost the prop money they provided him for the poker game that he told them he would return. Mildred eventually tells them the thief is in Vegas. So Steele and Laura head there too. In the meantime, Norman Keyes the insurance ..."
}, {
  "imdbId" : "0083470",
  "season" : "3",
  "episodeNumber" : "18",
  "title" : "Now You Steele It, Now You Don't",
  "description" : "Ms. Holt is hired by an antique dealer to recover items taken by a kleptomaniac, leading to the death of an importer."
}, {
  "imdbId" : "0083470",
  "season" : "3",
  "episodeNumber" : "19",
  "title" : "Illustrated Steele",
  "description" : "The recent \"accidents\" of an inking artist are following the adventures of a Remington Steele-like comic strip detective on which he has been hired work."
}, {
  "imdbId" : "0083470",
  "season" : "3",
  "episodeNumber" : "20",
  "title" : "Steele in the Chips",
  "description" : "The creator and prototypes of a no calorie chocolate chip cookie are missing. The Remington Steele Agency is hired by three different people to locate them."
}, {
  "imdbId" : "0083470",
  "season" : "3",
  "episodeNumber" : "21",
  "title" : "Steele Trying",
  "description" : "Remington invents a case as a ruse to whisk Laura off to romantic San Francisco, but the trip turns treacherous when they witness a murder."
}, {
  "imdbId" : "0083470",
  "season" : "3",
  "episodeNumber" : "22",
  "title" : "Steele of Approval",
  "description" : "Steele and Laura have been hired by some men who want to run a background check on William Westfield, a man they're considering supporting for Senator. Someone takes a shot at Laura. Horton Earhart, one of their clients, wants them to declare Westfield OK but Laura after getting shot thinks it might have something to do with a brief period of time in Westfield's life that's unaccounted for, wants to continue with the investigation. Laura continues her investigation and is joined by Westfield. Steele tries to track down the shooter."
}, {
  "imdbId" : "0083470",
  "season" : "4",
  "episodeNumber" : "1",
  "title" : "Steele Searching: Part 1",
  "description" : "Laura and Mildred head to the U.K. to look for Mr. Steele who has disappeared looking for his mysterious father. Steele discovers his father may be an Earl - and a modern day Jack the Ripper."
}, {
  "imdbId" : "0083470",
  "season" : "4",
  "episodeNumber" : "2",
  "title" : "Steele Searching: Part 2",
  "description" : "Remington is accidentally confused with a hit man and given the job of assassinating a British royal, who just might be Steele's father."
}, {
  "imdbId" : "0083470",
  "season" : "4",
  "episodeNumber" : "3",
  "title" : "Steele Blushing",
  "description" : "A couple of Feds comes to the office looking for Laura. But she's not there so they tell Steele and Mildred that they're looking for a photographer who took Laura's picture which is now in skin mag which they show them. Mildred decides to play hardball. Later Steele searches for Laura. Steele goes to the photographer's studio and is attacked by a man. The photographer calls the office looking for Laura and Mildred goes to where he is. When Mildred goes there the Feds follow her and pull their guns, Mildred knows they're not Feds so she knocks them and makes off with ..."
}, {
  "imdbId" : "0083470",
  "season" : "4",
  "episodeNumber" : "4",
  "title" : "Grappling Steele",
  "description" : "A professional wrestler hires the Agency to prevent someone from killing him."
}, {
  "imdbId" : "0083470",
  "season" : "4",
  "episodeNumber" : "5",
  "title" : "Forged Steele",
  "description" : "Steele wakes up with a hangover. He then goes to the office and learns that he has been missing for a few days. Later a man goes to the office claiming that he and Steele had a bet which Steele lost and what was at stake is the Agency; which he is now coming to take possession. When Steele doesn't have any recollection of that, the man shows a note that Steele signed. Laura's upset with him. Later Steele goes into the office and discovers that someone burrowed into the office below which is a diamond merchant and made off with several million dollars worth of diamonds..."
}, {
  "imdbId" : "0083470",
  "season" : "4",
  "episodeNumber" : "6",
  "title" : "Corn Fed Steele",
  "description" : "Laura and Steele are approached by some people who want to hire them to locate some missing hogs which are part of a corporation's new product. And when they initially refuse they learn that they're investors in the pigs too because Mildred invested most of the agency's funds in the corporation. And Steele who's in the process of buying something needs some cash fast. So they go to the city where the pigs are being kept. They see that the local farmers are being attacked because the corporation wants to buy their land and accuse them of trying to force them to sell. ..."
}, {
  "imdbId" : "0083470",
  "season" : "4",
  "episodeNumber" : "7",
  "title" : "Premium Steele",
  "description" : "A man hires the Steele Agency to find out why his obituary is in the paper. Remington and Laura soon discover his isn't the only one prematurely declared dead."
}, {
  "imdbId" : "0083470",
  "season" : "4",
  "episodeNumber" : "8",
  "title" : "Coffee, Tea or Steele",
  "description" : "A high-end airline hires the Steele Agency to find out why a dead body was found in an airplane's passenger luggage before the news leaks out and ruins them."
}, {
  "imdbId" : "0083470",
  "season" : "4",
  "episodeNumber" : "9",
  "title" : "Dancer, Prancer, Donner and Steele",
  "description" : "A Christmas party at the office ends up being a hostage situation when some Santas pull a gun. The guests and the Santas are a bit odd."
}, {
  "imdbId" : "0083470",
  "season" : "4",
  "episodeNumber" : "10",
  "title" : "Steele on the Air",
  "description" : "While driving to work Laura witnesses the plane crash of a radio station's traffic reporter. She doesn't believe it was really an accident and launches a murder investigation."
}, {
  "imdbId" : "0083470",
  "season" : "4",
  "episodeNumber" : "11",
  "title" : "Steele, Inc.",
  "description" : "When the body of man is found whose ID says he's Remington Steele, Laura, Steele and Mildred go to the morgue. While Laura and Steele don't recognize the man, Mildred does but doesn't say anything. She leaves and goes to idea man George Edward Mulch. Apparently this is one of his latest ideas. Later Steele and Laura are grabbed and taken to someone who demands why they didn't do the job he was hired to do. Of course they have no idea what they're talking about."
}, {
  "imdbId" : "0083470",
  "season" : "4",
  "episodeNumber" : "12",
  "title" : "Steele Spawning",
  "description" : "The son of a caviar magnate, who bought a lot of caviar to impress his father but when it goes missing he turns to Steele and Laura for help. They are joined by a Russian who is looking for some missing Russian caviar."
}, {
  "imdbId" : "0083470",
  "season" : "4",
  "episodeNumber" : "13",
  "title" : "Suburban Steele",
  "description" : "Laura's sister, who has recently moved to California, frantically calls her claiming there's a dead man in her kitchen. When they arrive there is no body in the kitchen - but there is a dead body in her trash can."
}, {
  "imdbId" : "0083470",
  "season" : "4",
  "episodeNumber" : "14",
  "title" : "Santa Claus Is Coming to Steele",
  "description" : "\"Santa\" who held party guests hostage is out on bail, and tries to get Laura and Steele to decline to testify against him through intimidation."
}, {
  "imdbId" : "0083470",
  "season" : "4",
  "episodeNumber" : "15",
  "title" : "Steele Blue Yonder",
  "description" : "When a man is arrested for speeding in a car he clearly can't afford,his daughter asks Steele and Laura to keep an eye on him cause she fears that he's going mad. But they learn the man is not out of his mind, on the contrary has some kind of scheme cooking."
}, {
  "imdbId" : "0083470",
  "season" : "4",
  "episodeNumber" : "16",
  "title" : "Sensitive Steele",
  "description" : "While working undercover, Laura and Remington pose as a married couple in a marriage encounter group. Solving the case takes second place while they confront their feelings for each other."
}, {
  "imdbId" : "0083470",
  "season" : "4",
  "episodeNumber" : "17",
  "title" : "Steele in the Spotlight",
  "description" : ""
}, {
  "imdbId" : "0083470",
  "season" : "4",
  "episodeNumber" : "18",
  "title" : "Steele at Your Service",
  "description" : ""
}, {
  "imdbId" : "0083470",
  "season" : "4",
  "episodeNumber" : "19",
  "title" : "Steele in the Running",
  "description" : "A man abducts Laura while she's competing in a triathlon, then he dumps her on the roadside."
}, {
  "imdbId" : "0083470",
  "season" : "4",
  "episodeNumber" : "20",
  "title" : "Beg, Borrow or Steele",
  "description" : "Laura and Steele come back from a weekend trip and discover that everyone thinks they have been murdered. The motive is as puzzling as the suspects, which include Mildred, a nun, a loan shark, and five horse jockeys."
}, {
  "imdbId" : "0083470",
  "season" : "4",
  "episodeNumber" : "21",
  "title" : "Steele Alive and Kicking",
  "description" : ""
}, {
  "imdbId" : "0083470",
  "season" : "4",
  "episodeNumber" : "22",
  "title" : "Bonds of Steele",
  "description" : "Steele and Laura are called by a woman who found the body of her boss. They try to keep his body from being discovered till they can find out why he was killed. Steele appears to be jumpy. He leaves to go on an errand and Laura investigates on her own and she has a close call. She goes back to the office upset that Steele left her alone. When he leaves to go another errand, she sees him with Clarissa, the hooker they met on an earlier case."
}, {
  "imdbId" : "0083470",
  "season" : "5",
  "episodeNumber" : "1",
  "title" : "The Steele That Wouldn't Die: Part 1",
  "description" : "While newlyweds Remington and Laura honeymoon in Mexico, they are hounded by their enemy, Norman Keyes, and an archaeologist/immigration agent, who sets his sights on Laura."
}, {
  "imdbId" : "0083470",
  "season" : "5",
  "episodeNumber" : "2",
  "title" : "The Steele That Wouldn't Die: Part 2",
  "description" : "After being arrested for the murder of Norman Keyes, Steele has to sit in jail while Laura and a mysterious stranger try to solve the case. It isn't long before Steele joins them - Mildred organizes a jailbreak."
}, {
  "imdbId" : "0083470",
  "season" : "5",
  "episodeNumber" : "3",
  "title" : "Steele Hanging in There: Part 1",
  "description" : "Upon returning from their 'Honeymoon' Steele and Laura learn that a new INS officer has been assigned to their case, who is a little more by the book. A woman from Steele's past comes back, just as he and Laura are trying to settle in. And Tony also shows up."
}, {
  "imdbId" : "0083470",
  "season" : "5",
  "episodeNumber" : "4",
  "title" : "Steele Hanging in There: Part 2",
  "description" : ""
}, {
  "imdbId" : "0083470",
  "season" : "5",
  "episodeNumber" : "5",
  "title" : "Steeled with a Kiss: Part 1",
  "description" : ""
}, {
  "imdbId" : "0083470",
  "season" : "5",
  "episodeNumber" : "6",
  "title" : "Steeled with a Kiss: Part 2",
  "description" : ""
}]
