[{
  "imdbId" : "2085059",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "The National Anthem",
  "description" : "Prime Minister Michael Callow faces a shocking dilemma when Princess Susannah, a much-loved member of the Royal Family, is kidnapped."
}, {
  "imdbId" : "2085059",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Fifteen Million Merits",
  "description" : "In a world where people's lives consist of riding exercise bikes to gain credits, Bing tries to help a woman get on to a singing competition show."
}, {
  "imdbId" : "2085059",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "The Entire History of You",
  "description" : "In the near future, everyone has access to a memory implant that records everything they do, see and hear - a sort of Sky Plus (Digital Video Recorder) for the brain. You need never forget a face again - but is that always a good thing?"
}, {
  "imdbId" : "2085059",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "Be Right Back",
  "description" : "After learning about a new service that lets people stay in touch with the deceased, a lonely, grieving Martha reconnects with her late lover."
}, {
  "imdbId" : "2085059",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "White Bear",
  "description" : "Victoria wakes up and cannot remember anything about her life. Everyone she encounters refuses to communicate with her, and they all seem to know something she doesn't. But what?"
}, {
  "imdbId" : "2085059",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "The Waldo Moment",
  "description" : "A failed comedian who voices a popular cartoon bear named Waldo finds himself mixing in politics when TV executives want Waldo to run for office."
}, {
  "imdbId" : "2085059",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "White Christmas",
  "description" : "Three interconnected tales of technology run amok during the Christmas season are told by two men at a remote outpost in a frozen wilderness."
}, {
  "imdbId" : "2085059",
  "season" : "3",
  "episodeNumber" : "1",
  "title" : "Nosedive",
  "description" : "A woman desperate to boost her social media score hits the jackpot when she's invited to a swanky wedding, but the trip doesn't go as planned."
}, {
  "imdbId" : "2085059",
  "season" : "3",
  "episodeNumber" : "2",
  "title" : "Playtest",
  "description" : "An American traveler short on cash signs up to test a revolutionary new gaming system, but soon can't tell where the hot game ends and reality begins."
}, {
  "imdbId" : "2085059",
  "season" : "3",
  "episodeNumber" : "3",
  "title" : "Shut Up and Dance",
  "description" : "When withdrawn Kenny stumbles headlong into an online trap, he is quickly forced into an uneasy alliance with shifty Hector, both at the mercy of persons unknown."
}, {
  "imdbId" : "2085059",
  "season" : "3",
  "episodeNumber" : "4",
  "title" : "San Junipero",
  "description" : "In a seaside town in 1987, a shy young woman and an outgoing party girl strike up a powerful bond that seems to defy the laws of space and time."
}, {
  "imdbId" : "2085059",
  "season" : "3",
  "episodeNumber" : "5",
  "title" : "Men Against Fire",
  "description" : "Future soldiers Stripe and Raiman must protect frightened villagers from an infestation of vicious feral mutants."
}, {
  "imdbId" : "2085059",
  "season" : "3",
  "episodeNumber" : "6",
  "title" : "Hated in the Nation",
  "description" : "In near-future London, police detective Karin Parke, and her tech-savvy sidekick Blue, investigate a string of mysterious deaths with a sinister link to social media."
}, {
  "imdbId" : "2085059",
  "season" : "4",
  "episodeNumber" : "1",
  "title" : "USS Callister",
  "description" : "A woman wakes up on a Star Trek-esque ship where the crew praise their all knowing and fearless captain."
}, {
  "imdbId" : "2085059",
  "season" : "4",
  "episodeNumber" : "2",
  "title" : "Arkangel",
  "description" : "After nearly losing her daughter, a mother invests in a new technology that allows her to keep track of her."
}, {
  "imdbId" : "2085059",
  "season" : "4",
  "episodeNumber" : "3",
  "title" : "Crocodile",
  "description" : "A woman interviews various people using a device that allows her to access their memories."
}, {
  "imdbId" : "2085059",
  "season" : "4",
  "episodeNumber" : "4",
  "title" : "Hang the DJ",
  "description" : "Paired up by a dating program that puts an expiration date on all relationships, Frank and Amy soon begin to question the system's logic."
}, {
  "imdbId" : "2085059",
  "season" : "4",
  "episodeNumber" : "5",
  "title" : "Metalhead",
  "description" : "In the post-apocalyptic landscape of the Scottish Moors, a woman attempts to survive the land full of \"dogs\"."
}, {
  "imdbId" : "2085059",
  "season" : "4",
  "episodeNumber" : "6",
  "title" : "Black Museum",
  "description" : "A woman enters the Black Museum, where the proprietor tells his stories relating to the artefacts."
}]