[{
  "imdbId" : "2402207",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Phase Six",
  "description" : "CO CDR Tom Chandler and his crew find themselves in a whole new world when the ship's scientist passenger, Dr. Rachel Scott, reveals that the entire planet is in their hands."
}, {
  "imdbId" : "2402207",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Welcome to Gitmo",
  "description" : "Chandler and his crew head to the U.S. Military base at Guantanamo Bay in hopes of collecting food, medical supplies and fuel replenishments."
}, {
  "imdbId" : "2402207",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Dead Reckoning",
  "description" : "The James faces off against a new foe who demands Chandler hand over Rachel and her research."
}, {
  "imdbId" : "2402207",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "We'll Get There",
  "description" : "Mechanical problems leave the ship with a severe shortage of drinking water."
}, {
  "imdbId" : "2402207",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "El Toro",
  "description" : "With Rachel close to a breakthrough on her vaccine, she, Chandler and XO Slattery lead a small team into the jungles of Nicaragua on a mission to find monkeys for her vaccine trials."
}, {
  "imdbId" : "2402207",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Lockdown",
  "description" : "With monkeys for testing, they work towards a vaccine but with no cure in sight, a serious lack of monkeys and increasingly depressing distress calls, they think about returning to Nicaragua."
}, {
  "imdbId" : "2402207",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "SOS",
  "description" : "After picking up a distress call near Jamaica, Chandler and a small team stage a rescue attempt. But a surprise attack leaves Chandler and Tex stranded at sea."
}, {
  "imdbId" : "2402207",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Two Sailors Walk Into a Bar...",
  "description" : "With Chandler and Tex held prisoner on the Russian ship, it is up to Slattery to devise a plot to free them."
}, {
  "imdbId" : "2402207",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "Trials",
  "description" : "With a potential cure in their grasp, Dr. Scott asks for human volunteer's to test her formula that was successful on a monkey. However, will this be the answer she is looking for, or will it put the volunteers' lives in jeopardy?"
}, {
  "imdbId" : "2402207",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "No Place Like Home",
  "description" : "The crew of the USS Nathan James arrive in Baltimore with the cure expecting a welcoming committee, but what they find is something else entirely."
}, {
  "imdbId" : "2402207",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "Unreal City",
  "description" : "Chandler and his fractured team join forces with an underground resistance in an attempt to defeat Amy Granderson; Rachael tries to help the sick while remaining a prisoner; Sidney and the crew try to regain control of their ship."
}, {
  "imdbId" : "2402207",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "Fight the Ship",
  "description" : "Slattery and the crew of Nathan James are in a race against time to save an injured Dr. Tophet and regain control of their ship."
}, {
  "imdbId" : "2402207",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "It's Not a Rumor",
  "description" : "The ship goes to Norfolk so that the crew can check on their families. And Chandler gives them the opportunity to decide if they want to continue or remain. Something even he is considering."
}, {
  "imdbId" : "2402207",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "Solace",
  "description" : "The crew makes a discovery; Chandler sees an opportunity to add another ship to the fleet."
}, {
  "imdbId" : "2402207",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "Achilles",
  "description" : "Chandler and his crew face off against a nuclear-powered submarine led by British naval officers."
}, {
  "imdbId" : "2402207",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "Long Day's Journey",
  "description" : "Chandler tracks the immunes to Northern Florida; Rachel comes across a secret formula."
}, {
  "imdbId" : "2402207",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "Alone and Unafraid",
  "description" : "Slattery struggles to evade the sub; Chandler and the land team infiltrate the immune compound."
}, {
  "imdbId" : "2402207",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "Safe Zone",
  "description" : "Trying to piece together Dr. Hunter's lost formula, Rachel grapples with the fact Niels, her sworn enemy, is on board Nathan James, while Chandler works to gain intel and reverse the brainwashing Michener suffered at the hands of the Ramseys."
}, {
  "imdbId" : "2402207",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "Uneasy Lies the Head",
  "description" : "Chandler and his team set out to find supplies and materials for Dr. Scott's lab, only to tangle with bounty hunters and the Immunes. Meanwhile, Rachel's effort to find a spreadable cure depends on the scientist who nearly erased mankind."
}, {
  "imdbId" : "2402207",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "Friendly Fire",
  "description" : "Rachel is hard at work on a new, more efficient version of the cure while Alisha decodes a message found on a cell phone recovered from the Immunes on land."
}, {
  "imdbId" : "2402207",
  "season" : "2",
  "episodeNumber" : "11",
  "title" : "Valkyrie",
  "description" : "Sean Ramsey broadcasts a message implicating the Navy in a devastating disaster."
}, {
  "imdbId" : "2402207",
  "season" : "2",
  "episodeNumber" : "12",
  "title" : "Cry Havoc",
  "description" : "The Nathan James is trapped between the sub and the civilian blockades set up by the immune. Chandler sends Dr. Scott off the ship under Slattery's protection."
}, {
  "imdbId" : "2402207",
  "season" : "2",
  "episodeNumber" : "13",
  "title" : "A More Perfect Union",
  "description" : "As small Immune factions continue to fight the cure, CDR Chandler, and his team, put a call out to civilians to meet them at ports all over the United States to receive the cure."
}, {
  "imdbId" : "2402207",
  "season" : "3",
  "episodeNumber" : "1",
  "title" : "The Scott Effect",
  "description" : "Chandler is sent to Asia to probe a possible mutation of the Red Flu. Captain Slattery and his crew deliver a cure to Southeast Asia but they might be heading toward an unforeseen threat."
}, {
  "imdbId" : "2402207",
  "season" : "3",
  "episodeNumber" : "2",
  "title" : "Rising Sun",
  "description" : "Chandler tries to return to his old crew while sharpening attention on a menacing new enemy."
}, {
  "imdbId" : "2402207",
  "season" : "3",
  "episodeNumber" : "3",
  "title" : "Shanzhai",
  "description" : "Chandler scrambles to find answers in an Asian Dodge City. Meanwhile, Slattery seeks the truth about his predicament."
}, {
  "imdbId" : "2402207",
  "season" : "3",
  "episodeNumber" : "4",
  "title" : "Devil May Care",
  "description" : "China's president was given the cure, however he has refused to give it out to the people and countries around his land. Chandler believes he can not trust him at all."
}, {
  "imdbId" : "2402207",
  "season" : "3",
  "episodeNumber" : "5",
  "title" : "Minefield",
  "description" : "Chandler's mission becomes complicated as his position is worsened. President Michener faces pressure from the regional leaders."
}, {
  "imdbId" : "2402207",
  "season" : "3",
  "episodeNumber" : "6",
  "title" : "Dog Day",
  "description" : "Chandler's mission comes to a head as he prepares the final part of his plan. President Michener ponders the fate of his presidency."
}, {
  "imdbId" : "2402207",
  "season" : "3",
  "episodeNumber" : "7",
  "title" : "In the Dark",
  "description" : "The Nathan James must dodge an overwhelming threat. Meanwhile, President Michener is put in a terrible position following a revelation in St. Louis."
}, {
  "imdbId" : "2402207",
  "season" : "3",
  "episodeNumber" : "8",
  "title" : "Sea Change",
  "description" : "America copes with tragedy. Meanwhile, Chandler probes a potential virus mutation."
}, {
  "imdbId" : "2402207",
  "season" : "3",
  "episodeNumber" : "9",
  "title" : "Paradise",
  "description" : "Chandler unearths a lead that could resolve menacing questions. Meanwhile, Kara snoops in the White House."
}, {
  "imdbId" : "2402207",
  "season" : "3",
  "episodeNumber" : "10",
  "title" : "Scuttle",
  "description" : "Chandler faces a tough decision when the White House delivers a bizarre order."
}, {
  "imdbId" : "2402207",
  "season" : "3",
  "episodeNumber" : "11",
  "title" : "Legacy",
  "description" : "A final showdown pits Chandler against his formidable enemy. Elsewhere, Kara joins forces with someone who can help with her mission."
}, {
  "imdbId" : "2402207",
  "season" : "3",
  "episodeNumber" : "12",
  "title" : "Resistance",
  "description" : "Chandler returns to America to find out what has really been happening."
}, {
  "imdbId" : "2402207",
  "season" : "3",
  "episodeNumber" : "13",
  "title" : "Don't Look Back",
  "description" : "The fight for America comes to an end. Chandler faces a challenge that could change his life forever."
}, {
  "imdbId" : "2402207",
  "season" : "4",
  "episodeNumber" : "1",
  "title" : "In Medias Res",
  "description" : "Sixteen months after thwarting the coup in America, Nathan James must face yet another global disaster. The question remains, where in the world is Tom Chandler?"
}, {
  "imdbId" : "2402207",
  "season" : "4",
  "episodeNumber" : "2",
  "title" : "The Pillars of Hercules",
  "description" : "Having lost their only lead, the crew of Nathan James continues their search for an item that could save the world. Chandler immerses himself in a mission for revenge."
}, {
  "imdbId" : "2402207",
  "season" : "4",
  "episodeNumber" : "3",
  "title" : "Bread and Circuses",
  "description" : "Nathan James's crew searches for a precious item leading them to a strange place of opulence and violence where they cross paths with a most unexpected ally."
}, {
  "imdbId" : "2402207",
  "season" : "4",
  "episodeNumber" : "4",
  "title" : "Nostos",
  "description" : "Chandler and his team search for Slattery while evading Giorgio and Omar's men. Slattery begins to hallucinate seeing his family. The Nathan James faces off with a Hydra class Greek Navy vessel."
}, {
  "imdbId" : "2402207",
  "season" : "4",
  "episodeNumber" : "5",
  "title" : "Allegiance",
  "description" : "Nathan James is diverted from their mission when they receive a suspicious distress call from a fishing trawler."
}, {
  "imdbId" : "2402207",
  "season" : "4",
  "episodeNumber" : "6",
  "title" : "Tempest",
  "description" : "With an enormous storm on the horizon, Nathan James must navigate an equally terrifying threat in order to make it to safety."
}, {
  "imdbId" : "2402207",
  "season" : "4",
  "episodeNumber" : "7",
  "title" : "Feast",
  "description" : "While searching for the location of the stolen seeds, the crew of the Nathan James fights off an old enemy to escape with intel that reveals Dr. Vellick's sinister plans for humanity."
}, {
  "imdbId" : "2402207",
  "season" : "4",
  "episodeNumber" : "8",
  "title" : "Lazaretto",
  "description" : "An undercover mission in the land of the dead leads to disturbing revelations about Dr. Vellek's sinister plans."
}, {
  "imdbId" : "2402207",
  "season" : "4",
  "episodeNumber" : "9",
  "title" : "Detect, Deceive, Destroy",
  "description" : "The crew of Nathan James faces a threat that will test the limits of their Naval tactics and strategies."
}, {
  "imdbId" : "2402207",
  "season" : "4",
  "episodeNumber" : "10",
  "title" : "Endgame",
  "description" : "Chandler confronts his enemy and his personal demons in the final showdown, with the fate of humanity on the line."
}]