[{
  "imdbId" : "0054518",
  "season" : "4",
  "episodeNumber" : "1",
  "title" : "The Town of No Return",
  "description" : "Steed and Emma visit a mysterious coastal town where several agents have vanished, and where the locals are not all they seem."
}, {
  "imdbId" : "0054518",
  "season" : "4",
  "episodeNumber" : "2",
  "title" : "The Gravediggers",
  "description" : "Steed & Peel must find out why an early warning radar is failing. Emma joins the staff of The Sir Horace Winslip Hospital for Ailing Railwaymen while Steed has lunch with Sir Horace's aboard his private, indoor train."
}, {
  "imdbId" : "0054518",
  "season" : "4",
  "episodeNumber" : "3",
  "title" : "The Cybernauts",
  "description" : "The Avengers investigate a series of murders of Corporate men, who have all been bidding on a new circuit element. Each one of them seems to have been killed by a powerful Karate blow, so Mrs. Peel visits a Karate Dojo, Steed's inquiries lead him to United Automation, where ex-Ministry scientist Dr. Armstrong is working on an electronic brain, not to mention cybernetic men."
}, {
  "imdbId" : "0054518",
  "season" : "4",
  "episodeNumber" : "4",
  "title" : "Death at Bargain Prices",
  "description" : "When a colleague is found dead in a large London department store Steed and Mrs. Peel go undercover as staff members, exposing a dastardly plot by the wheelchair-bound Horatio Kane to devastate the capital with a huge bomb housed within the store."
}, {
  "imdbId" : "0054518",
  "season" : "4",
  "episodeNumber" : "5",
  "title" : "Castle De'ath",
  "description" : "When an agent in diving gear is found dead in a Scottish loch yet substantially taller than he was whilst he was alive Steed and Mrs. Peel visit a remote castle owned by the feuding De'ath cousins, Ian and Angus, to investigate the sinister goings-on."
}, {
  "imdbId" : "0054518",
  "season" : "4",
  "episodeNumber" : "6",
  "title" : "The Master Minds",
  "description" : "Government minister Sir Clive Todd is wounded as he and other ministers try to steal top secret documents. He has no idea why he did it and hypnosis is suggested. All concerned belonged to a club for people with high I.Q.s called RANSACK, who are about to meet at a school. The Avengers join the club in order to expose the mastermind behind the next heist - the theft of a plane from an R.A.F. base."
}, {
  "imdbId" : "0054518",
  "season" : "4",
  "episodeNumber" : "7",
  "title" : "The Murder Market",
  "description" : "Mr. Steed and Mrs. Peel investigate a murder-for-hire organization fronting as a matchmaking bureau."
}, {
  "imdbId" : "0054518",
  "season" : "4",
  "episodeNumber" : "8",
  "title" : "A Surfeit of H2O",
  "description" : "After a village poacher drowns in the middle of an open field, The Avengers are soon on the trail of a mad scientist able to control the weather."
}, {
  "imdbId" : "0054518",
  "season" : "4",
  "episodeNumber" : "9",
  "title" : "The Hour That Never Was",
  "description" : "On their way to a closing down party at an air base the Avengers' car crashes when they swerve to avoid hitting a dog. The air base proves to be deserted and Steed is knocked out. When he recovers he is back at the car but minus Mrs. Peel and the party, when he gets there, is in full swing. It would seem that he has gone back an hour in time."
}, {
  "imdbId" : "0054518",
  "season" : "4",
  "episodeNumber" : "10",
  "title" : "Dial a Deadly Number",
  "description" : "Company chairmen across the city are dropping dead, apparently through natural causes. Can Steed and Mrs Peel discover who is making a killing?"
}, {
  "imdbId" : "0054518",
  "season" : "4",
  "episodeNumber" : "11",
  "title" : "Man-Eater of Surrey Green",
  "description" : "A man-eating plant from outer space lands in Middle England and takes several top horticulturists as its prisoners in an effort to germinate the Earth. Fortunately for the Earth, Steed just happens to be a herbicidal maniac."
}, {
  "imdbId" : "0054518",
  "season" : "4",
  "episodeNumber" : "12",
  "title" : "Two's a Crowd",
  "description" : "A mysterious Russian called Psev is arriving for a conference at which Steed and Mrs. Peel have been hired to act as the security guards. However, a man called Gordon Webster who is an exact double for Steed turns up and offers his services to Psev's entourage of four people, fooling Mrs. Peel in the process and agreeing to kill Steed. Though he is thwarted it turns out that Psev is also not exactly the man that everybody had expected him to be."
}, {
  "imdbId" : "0054518",
  "season" : "4",
  "episodeNumber" : "13",
  "title" : "Too Many Christmas Trees",
  "description" : "Steed has been having bad dreams involving Christmas trees and a man dressed as Santa Claus. At a party given by publisher and Dickens fan Brandon Storey, two telepathic spies attempt to read Steed's mind and make sense of the dream. However, the dream is echoed exactly by the events of the party, enabling Steed to spot the villains in advance and identify the dangerous Santa."
}, {
  "imdbId" : "0054518",
  "season" : "4",
  "episodeNumber" : "14",
  "title" : "Silent Dust",
  "description" : "When birds begin to fall from branches in flocks, it seems someone is using the banned chemical Silent Dust in the countryside of Cornwall. Steed and Peel soon find out a that a small group of local landowners is planning to use the Dust a to blackmail the country by destroying Dorsett."
}, {
  "imdbId" : "0054518",
  "season" : "4",
  "episodeNumber" : "15",
  "title" : "Room Without a View",
  "description" : "Dr. Wadkin, one of 7 scientist who have disappeared over the last year, suddenly reappears and attacks his Chinese wife. Steed and Peel find out that all of the missing scientist stayed at room 621 of the Chessman hotel before they vanished. Against her will, Emma poses as a receptionist while Steed pretends to be the famous food critic, M. Gourmet."
}, {
  "imdbId" : "0054518",
  "season" : "4",
  "episodeNumber" : "16",
  "title" : "Small Game for Big Hunters",
  "description" : "A man dressed in tropical clothes is found in Hertfortshire with an Kalayan arrow in his back. He has then fallen into a coma, yet there is no poison to be detected. All clues lead to an delusional Colonel living close by in a simulated tropical climate as if he were still serving in Kalaya. While Emma watches over an increasing number of comatose men, 'Major' Steed is invited into the Colonel's officers club with open arms, but is not allowed to leave."
}, {
  "imdbId" : "0054518",
  "season" : "4",
  "episodeNumber" : "17",
  "title" : "The Girl from Auntie",
  "description" : "When Steed returns home early from a holiday, he finds Mrs. Peel replaced by an actress, Georgie Price-Jones. Subsequently everyone involved in the hiring of Georgie is stabbed to death with double-O knitting needles. It seems the real Mrs. Peel has become Lot 17 of 'Art Incorporated', an organization which prides itself on being able to obtain any object for any one as long as the price is right."
}, {
  "imdbId" : "0054518",
  "season" : "4",
  "episodeNumber" : "18",
  "title" : "The Thirteenth Hole",
  "description" : "Steed and Mrs. Peel join an exclusive golf club to catch a government scientist passing secrets to the Iron Curtain."
}, {
  "imdbId" : "0054518",
  "season" : "4",
  "episodeNumber" : "19",
  "title" : "Quick-Quick Slow Death",
  "description" : "When a foreign agent is caught trying to dispose of a body, the investigation leads Steed and Mrs. Peel to a dancing school that's infiltrating the country with enemy spies."
}, {
  "imdbId" : "0054518",
  "season" : "4",
  "episodeNumber" : "20",
  "title" : "The Danger Makers",
  "description" : "Someone is organizing a group of danger craving psychopaths. Steed and Mrs. Peel must stop them before their next caper - stealing the crown jewels."
}, {
  "imdbId" : "0054518",
  "season" : "4",
  "episodeNumber" : "21",
  "title" : "A Touch of Brimstone",
  "description" : "A modern day Hellfire Club, led by libertine John Cleverly Cartney, plans to incite chaos by killing three foreign Prime Ministers."
}, {
  "imdbId" : "0054518",
  "season" : "4",
  "episodeNumber" : "22",
  "title" : "What the Butler Saw",
  "description" : "Steed enrolls in a prestigious Butler school to investigate a leak in Government secrets. Emma attempts to seduce one of the three main suspects, an RAF playboy known to the ladies as Georgie-Porgie."
}, {
  "imdbId" : "0054518",
  "season" : "4",
  "episodeNumber" : "23",
  "title" : "The House That Jack Built",
  "description" : "Mrs. Peel is bequeathed an old house by an uncle Jack, whom she never knew existed. In the event, he did not exist. The house is a former lunatic asylum and it is all a ruse by a vengeful ex-employee of Mrs. Peel's to submit her to mind games which will drive her insane."
}, {
  "imdbId" : "0054518",
  "season" : "4",
  "episodeNumber" : "24",
  "title" : "A Sense of History",
  "description" : "Economist James Broom is shot with an arrow by one of a group dressed as Robin Hood whilst on his way to meet a man opposed to his Utopian vision of a new Europe. The trail leads the Avengers to St. Bode's College, where anarchic students oppose traditional schools of thought. Could one of these have killed Broom? All is revealed at a fancy dress party where everyone is a character from the Robin Hood legend."
}, {
  "imdbId" : "0054518",
  "season" : "4",
  "episodeNumber" : "25",
  "title" : "How to Succeed.... at Murder",
  "description" : "Eleven businessmen and counting have been mysteriously murdered, their affairs taken over by their able secretaries. The smell of perfume lingering over one of the dead bodies leads Mrs Peel to J.J. Hooter, who quickly becomes the next man to snuff it. With secretaries as their only clue, Steeds decides to hire one and Emma to take up the profession."
}, {
  "imdbId" : "0054518",
  "season" : "4",
  "episodeNumber" : "26",
  "title" : "Honey for the Prince",
  "description" : "Two undercover agents are shot at Q.Q.F. Incorporated but one survives long enough to clue in Steed and Peel. So, Steed visits the Quite Quite Fantastic office (where fantasies are made to come true) while Emma looks into B. Bumble's honey shop. They soon surmise that someone is aiming for Prince Ali of Barabia, who is visiting London with his harem of 320 wives."
}, {
  "imdbId" : "0054518",
  "season" : "5",
  "episodeNumber" : "1",
  "title" : "From Venus with Love",
  "description" : "The members of a society that watches Venus are dying one by one from something that turns them completely white, so Steed joins them to flush out the culprit while Peel chases a light that seems related to the killings."
}, {
  "imdbId" : "0054518",
  "season" : "5",
  "episodeNumber" : "2",
  "title" : "The Fear Merchants",
  "description" : "The executives of several ceramics companies are being driven crazy or killed by fear. The trail leads to a consulting company with some unusual techniques for helping their clients beat their competition."
}, {
  "imdbId" : "0054518",
  "season" : "5",
  "episodeNumber" : "3",
  "title" : "Escape in Time",
  "description" : "When a mad miscreant whips up a time machine, it takes The Avengers no time at all to show him the \"era\" of his ways."
}, {
  "imdbId" : "0054518",
  "season" : "5",
  "episodeNumber" : "4",
  "title" : "The See-Through Man",
  "description" : "When an enemy agent purchases a secret \"invisibilty\" formula, it takes the perceptive Avengers to see through his plans. The Avengers deals with the Cold War with an aristocratic detachment."
}, {
  "imdbId" : "0054518",
  "season" : "5",
  "episodeNumber" : "5",
  "title" : "The Bird Who Knew Too Much",
  "description" : "Two spies have obtained information about a secret missile base which they are passing to the other side, via a person known as Captain Caruso, whom the Avengers are charged to locate. In the event the good Captain turns out to be a trained parrot who possesses a photographic memory . . ."
}, {
  "imdbId" : "0054518",
  "season" : "5",
  "episodeNumber" : "6",
  "title" : "The Winged Avenger",
  "description" : "Several businessmen have been killed, the murderer having apparently clawed them to death so that the initial suspect is an author who owns a bird of prey and had a grudge against a victim who ran a publishing house. However, the discovery of a comic called 'The Winged Avenger' featuring a super-hero is found by the latest victim. And could the invention of Professor Poole, boots that allow the wearer to climb walls and scale ceilings, be involved?"
}, {
  "imdbId" : "0054518",
  "season" : "5",
  "episodeNumber" : "7",
  "title" : "The Living Dead",
  "description" : "Five years after a mine disaster, Mrs. Peel and Steed are called upon to investigate the spooky goings-on at the local inn. The ghost of the 16th Duke of Benedict, who was reputedly lost in the mine disaster, has been seen wandering the area and Emma joins SMOG and FOG in a ghost hunt. The Duke's ghost supposedly takes Emma with him to his final resting place in the collapsed mine, but Steed descends into the shaft to rescue her. He finds a secret underground city that is being used to stage an invasion of England; the mine disaster was just a cover-up for the plan. ..."
}, {
  "imdbId" : "0054518",
  "season" : "5",
  "episodeNumber" : "8",
  "title" : "The Hidden Tiger",
  "description" : "What seems to be a man eating tiger on the loose is actually the first step in a plan to take over the whole of England."
}, {
  "imdbId" : "0054518",
  "season" : "5",
  "episodeNumber" : "9",
  "title" : "The Correct Way to Kill",
  "description" : "Somebody is systematically killing off foreign agents and Steed, who is initially implicated, declares a truce and calls on his Russian opposite number, Nutski. Along with Soviet agents Anna and Ivan the Avengers discover SNOB, an exceedingly English gentlemen's club with murderously patriotic members."
}, {
  "imdbId" : "0054518",
  "season" : "5",
  "episodeNumber" : "10",
  "title" : "Never, Never Say Die",
  "description" : "The Avengers \"are needed\" after reports that a motorist has repeatedly run over and supposedly killed the same person. Their investigations lead them to the country and the top secret Neoteric Research Unit, which is run by the appropriately-named Dr. Frank N. Stone, who has made a startlingly life-like robot of himself, so much so that Steed finds it hard to tell the two Stones apart."
}, {
  "imdbId" : "0054518",
  "season" : "5",
  "episodeNumber" : "11",
  "title" : "Epic",
  "description" : "Z.Z. von Schnerk, a mad Teutonic film director of the Erich von Stroheim variety, along with his has-been leading actor and actress, Stewart Kirby and Damita Syn, capture Mrs. Peel in an effort to make a movie about her life and exciting adventures. Unfortunately it is to end with her violent death so Steed has to follow the clues to find her."
}, {
  "imdbId" : "0054518",
  "season" : "5",
  "episodeNumber" : "12",
  "title" : "The Superlative Seven",
  "description" : "Steed is invited to a party on an aeroplane with six other people who include a matador, a cowboy and a circus strong man. As the pilotless , remote-controlled craft takes off, a voice announces that they are bound for a desert island where one of them will be revealed as a super-killer. Mrs. Peel has to work out how to get to her partner as the bodies start to pile up."
}, {
  "imdbId" : "0054518",
  "season" : "5",
  "episodeNumber" : "13",
  "title" : "A Funny Thing Happened on the Way to the Station",
  "description" : "Whilst travelling on an express train on a quest to find a missing agent, Steed and Mrs. Peel get caught up in an assassination attempt on the life of the British Prime Minister on the part of a disgruntled and murderous ticket collector. They are helped in their efforts to foil him by Mr. Crewe, an eccentric owner of an abandoned station."
}, {
  "imdbId" : "0054518",
  "season" : "5",
  "episodeNumber" : "14",
  "title" : "Something Nasty in the Nursery",
  "description" : "Reliable men are reverting to childhood, and blabbing all of their secrets to kindly old \"Nanny Roberts.\""
}, {
  "imdbId" : "0054518",
  "season" : "5",
  "episodeNumber" : "15",
  "title" : "The Joker",
  "description" : "Mrs. Peel is invited to a bridge party at a house on Exmoor but when she arrives she discovers that she has been lured there by a man known as 'The joker'. She had once helped to put him in prison, but he has now escaped and with his two crazy accomplices, subjects Mrs. Peel to a series of lethal tricks and traps as Steed arrives to help her."
}, {
  "imdbId" : "0054518",
  "season" : "5",
  "episodeNumber" : "16",
  "title" : "Who's Who???",
  "description" : "Mad scientist Dr. Krelmar is working on a machine that allows two people to swap minds and enemy agents Basil and Lola intend to use it with the Avengers to get them to destroy their network. Basil exchanges personalities with Steed but Mrs. Peel is suspicious that the man who looks like her partner is acting out of character and has to persuade the real Steed what is going on."
}, {
  "imdbId" : "0054518",
  "season" : "6",
  "episodeNumber" : "1",
  "title" : "Return of the Cybernauts",
  "description" : "Paul Beresford, the brother of Clement Armstrong, the creator of the Cybernauts, blames Steed and Mrs. Peel for his brother's death at the cold hands of his own creations. Aided by Armstrong's assistant Benson, he abducts several scientists who are blackmailed into producing a new batch of Cybernauts. Whilst he is the perfect gentleman towards Mrs. Peel, his aim is to turn her and Steed into human robots."
}, {
  "imdbId" : "0054518",
  "season" : "6",
  "episodeNumber" : "2",
  "title" : "Death's Door",
  "description" : "Sir Andrew Boyd, the British delegate at a European peace conference has a dream in which he is run over and killed by a car. The dream comes true. The Avengers are charged with the safety of his successor, Lord Melford. He too is beginning to have bad dreams, involving a sinister man who turns out to be a member of the Eastern bloc. There is a plot afoot to derail the conference and Steed and Mrs. Peel intend to foil it."
}, {
  "imdbId" : "0054518",
  "season" : "6",
  "episodeNumber" : "3",
  "title" : "The £50,000 Breakfast",
  "description" : "The Avengers go to the dogs as their only lead when $50,000 of stolen diamonds is found in a dead man's stomach. Mismatched Borzoi hairs lead Steed and Emma to a pet cemetery where they take the bite out of the villain's bark."
}, {
  "imdbId" : "0054518",
  "season" : "6",
  "episodeNumber" : "4",
  "title" : "Dead Man's Treasure",
  "description" : "The hunt for a murdered courier's despatch leads Steed and Emma to a deadly car race with a \"shocking\" surprise at the finish line. It takes The Avengers to flag down the murderers and apply the brakes to their plans."
}, {
  "imdbId" : "0054518",
  "season" : "6",
  "episodeNumber" : "5",
  "title" : "You Have Just Been Murdered",
  "description" : "Steed and Mrs. Peel stop a clever blackmailing scheme targeting millionaires."
}, {
  "imdbId" : "0054518",
  "season" : "6",
  "episodeNumber" : "6",
  "title" : "The Positive Negative Man",
  "description" : "A scientist is killed by having been hurled through and embedded in a wall. This is the latest death of a person engaged in the government's Project 90, whose documents can also not be found. When the Avengers investigate they discover a bizarre means of murder whereby the killer can carry an electrical charge to the victim without being electrocuted themselves."
}, {
  "imdbId" : "0054518",
  "season" : "6",
  "episodeNumber" : "7",
  "title" : "Murdersville",
  "description" : "When Mrs. Peel's friend Major Croft goes missing she traces him to the picture postcard village of Little Storping. Unfortunately the entire population are assassins for hire who lure their victims to the village, kill them and then claim that they have never been there. Croft has been killed, along with his valet to prevent them from exposing the sinister secret and Mrs. Peel is next on the hit list unless Steed can save her. Fortunately, she manages to put in a phone call to her 'husband.'"
}, {
  "imdbId" : "0054518",
  "season" : "6",
  "episodeNumber" : "8",
  "title" : "Mission... Highly Improbable",
  "description" : "A car carrying two Ministry officials, enroute to investigate the budget overruns on Professor Rushton's latest project, vanishes under escort. Steed goes to investigate, and discovers the hard way where the money has gone; to build a device capable of shrinking anything to a fraction of its normal size. While Rushton has great science- and industry-oriented plans for the device, his assistant Chivers has plans of his own... to make a profit, and dispose of anyone in his way. Steed, inches tall, manages to telephone Emma with a warning, but she is captured by a ..."
}, {
  "imdbId" : "0054518",
  "season" : "7",
  "episodeNumber" : "1",
  "title" : "The Forget-Me-Knot",
  "description" : "Steed's colleague Sean Mortimer comes to see him in a very confused state. He knows there is a traitor in the organization but he has been drugged to put him in an amnesiac state and he can remember little else. Mrs. Peel investigates but she too falls prey to the drug as she and Sean are abducted by bikers. It is down to trainee agent 69, Tara King, to whom Steed is introduced by spymaster 'Mother' to help him save the day. Finally Miss King becomes his new partner as Mrs. Peel's missing husband reappears and she goes off to join him."
}]
