[{
  "imdbId" : "0066626",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Meet the Bunkers",
  "description" : "In the series' premiere, Mike and Gloria plan a surprise party to celebrate Archie and Edith's 22nd anniversary. But it quickly turns into a shouting match between conservative Archie and the liberal \"Meathead\" on virtually every topic."
}, {
  "imdbId" : "0066626",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Writing the President",
  "description" : "Archie learns that Mike has written to President Nixon to criticize his policies. So Archie takes pen in hand and writes his own letter of praise."
}, {
  "imdbId" : "0066626",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Archie's Aching Back",
  "description" : "Archie is involved in a minor, non-injury car accident, then finds out that Lionel Jefferson's family used an insurance settlement to open a dry-cleaning business. He gets an idea ... and a sudden aching back."
}, {
  "imdbId" : "0066626",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Archie Gives Blood",
  "description" : "Archie and Mike donate blood, sparking heated discussions on race, modern medicine, and God's will."
}, {
  "imdbId" : "0066626",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Judging Books by Covers",
  "description" : "Archie is irritated at Mike's offbeat friend, who dresses and behaves in a way that leads him to mistakenly conclude he is a homosexual. But Archie soon learns that one of his best friends is gay."
}, {
  "imdbId" : "0066626",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Gloria Has a Belly Full",
  "description" : "Gloria announces she is pregnant which worries Archie and Mike."
}, {
  "imdbId" : "0066626",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Mike's Hippie Friends Come to Visit",
  "description" : "Mike invites his unmarried hippie friends to spend the night in the Bunker's living room, over Archie's strong objections."
}, {
  "imdbId" : "0066626",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Lionel Moves Into the Neighborhood",
  "description" : "Archie and several neighbors learn that a black family is moving into the neighborhood, unaware that it is the Jeffersons. Lionel finds out about the effort to purchase the Jeffersons' new house and gets Archie to reveal his plans."
}, {
  "imdbId" : "0066626",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "Edith Has Jury Duty",
  "description" : "Edith is the lone holdout in a high-profile murder case, in which the prosecution's case seems clear-cut. Archie whines because Edith has been sequestered for the duration and refuses to help himself around the house."
}, {
  "imdbId" : "0066626",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "Archie Is Worried About His Job",
  "description" : "Archie can't sleep because he's worried about possible layoffs at the loading dock where he works."
}, {
  "imdbId" : "0066626",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "Gloria Discovers Women's Lib",
  "description" : "Gloria reads up on women's liberation and then tells Mike that she should be an equal partner in their marriage. Mike doesn't agree and Gloria storms out of the house."
}, {
  "imdbId" : "0066626",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "Success Story",
  "description" : "Archie's old buddy, Eddie Frazier, has amassed a fortune in the used car trade. However, Eddie's quest for money comes at a huge price: his estranged family wants nothing to do with him."
}, {
  "imdbId" : "0066626",
  "season" : "1",
  "episodeNumber" : "13",
  "title" : "The First and Last Supper",
  "description" : "Edith invites Henry and Louise Jefferson over for dinner, ruining Archie's plans to go to a Mets game. Before dinner, Archie and Henry start a debate over racial matters."
}, {
  "imdbId" : "0066626",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "The Saga of Cousin Oscar",
  "description" : "Archie's freeloading cousin, Oscar, dies in the guest room. Archie and Mike host an impromptu wake in their home, as they ponder whether to hold a funeral service or simply dispose of Oscar's body."
}, {
  "imdbId" : "0066626",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "Gloria Poses in the Nude",
  "description" : "An artist friend of the Stivics wants to paint a portrait of Gloria in her birthday suit, prompting a debate over the morality of nude art."
}, {
  "imdbId" : "0066626",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "Archie in the Lock-Up",
  "description" : "Mike and Lionel decide to become part of an anti-war protest, but it isn't until they leave that Gloria gets the news that the situation is turning violent. She and Edith urge Archie to go down to the protest and bring him home. Mike comes home frazzled but unharmed, but Archie ends up in the slammer surrounded by commies, hippies and drop-outs. Mike secures his release because the police captain is Polish, but Archie doesn't know that and offends the captain, leaving him to stay in jail a little longer."
}, {
  "imdbId" : "0066626",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "Edith Writes a Song",
  "description" : "Edith writes a poem and gets a letter from a company that wants to turn it into a song for only $30. Archie buys a \"dog alarm\" and a gun to protect the house all for only $60. The family gets into an argument over which is more important and Archie agrees to give the gun back. That night two burglars, who have just robbed a jewelry store, break into the house and hold the Bunkers hostage until the heat is off. At one point, the thief threatens to take off with the $30 but Edith talks him out of it by offering to sing the song. After hearing her sing, they decide that ..."
}, {
  "imdbId" : "0066626",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "Flashback: Mike Meets Archie",
  "description" : "On their first anniversary, Mike and Gloria reminisce (in flashback) the first time Gloria brought the Meathead home to meet the man that would become his father-in-law."
}, {
  "imdbId" : "0066626",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "The Election Story",
  "description" : "Archie and Mike argue over who's the best candidate in a local election."
}, {
  "imdbId" : "0066626",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "Edith's Accident",
  "description" : "Edith's shopping cart gets away from her, resulting in a minor paint scratch. Out of the cart pops a can of \"mmmm-mmmm\" (cling peaches) in heavy syrup, causing a dent in the hood. Edith leaves a note on the car and the owner comes by to collect the damages."
}, {
  "imdbId" : "0066626",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "The Blockbuster",
  "description" : "A corrupt real estate agent encourages Archie to sell his home for more than its market value."
}, {
  "imdbId" : "0066626",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "Mike's Problem",
  "description" : "Mike's anxiety over his upcoming college exams causes him to temporarily become sexually impotent."
}, {
  "imdbId" : "0066626",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "The Insurance Is Canceled",
  "description" : "At the same time Archie is told to lay off part of his crew at work, he gets a notice informing him that his homeowner's insurance has been canceled."
}, {
  "imdbId" : "0066626",
  "season" : "2",
  "episodeNumber" : "11",
  "title" : "The Man in the Street",
  "description" : "Archie is eager to watch his \"man-in-the-street\" interview on \"The CBS Evening News\" with Walter Cronkite, but can't find a working television set."
}, {
  "imdbId" : "0066626",
  "season" : "2",
  "episodeNumber" : "12",
  "title" : "Cousin Maude's Visit",
  "description" : "Edith's liberal cousin, Maude Findlay, arrives to help in caring for a flu-ridden Archie and Mike."
}, {
  "imdbId" : "0066626",
  "season" : "2",
  "episodeNumber" : "13",
  "title" : "Christmas Day at the Bunkers'",
  "description" : "Archie is depressed at Christmas because his boss canceled his holiday bonus (purportedly for screwing up a work order) and he doesn't know how to break the news to his family."
}, {
  "imdbId" : "0066626",
  "season" : "2",
  "episodeNumber" : "14",
  "title" : "The Elevator Story",
  "description" : "Archie is a passenger in an elevator that stalls between floors, and reacts predictably to his fellow passengers: A black businessman, a scatterbrained secretary and a Puerto Rican man and his very pregnant wife, who goes into labor."
}, {
  "imdbId" : "0066626",
  "season" : "2",
  "episodeNumber" : "15",
  "title" : "Edith's Problem",
  "description" : "Edith's irritability as of late may be a sign of her going through menopause. Archie is frustrated when he finds out she can't possibly have her \"change of life\" in 30 seconds."
}, {
  "imdbId" : "0066626",
  "season" : "2",
  "episodeNumber" : "16",
  "title" : "Archie and the F.B.I.",
  "description" : "A visiting FBI agent's investigation puts Archie's longtime friendship with an old war buddy in jeopardy."
}, {
  "imdbId" : "0066626",
  "season" : "2",
  "episodeNumber" : "17",
  "title" : "Mike's Mysterious Son",
  "description" : "Mike's ex-girlfriend contends that he fathered her 4-year-old son. Mike strongly denies he ever became serious with her, but furious Gloria and irate Archie aren't interested in his side of the story."
}, {
  "imdbId" : "0066626",
  "season" : "2",
  "episodeNumber" : "18",
  "title" : "Archie Sees a Mugging",
  "description" : "Archie doesn't want to appear in court as a witness when he sees a mugging. When finally approached by a detective, he claims gangsters were responsible."
}, {
  "imdbId" : "0066626",
  "season" : "2",
  "episodeNumber" : "19",
  "title" : "Archie and Edith Alone",
  "description" : "When Mike and Gloria are gone, Archie and Edith get a chance to share quality time at home alone."
}, {
  "imdbId" : "0066626",
  "season" : "2",
  "episodeNumber" : "20",
  "title" : "Edith Gets a Mink",
  "description" : "Edith's wealthy cousin gives her a mink as a present."
}, {
  "imdbId" : "0066626",
  "season" : "2",
  "episodeNumber" : "21",
  "title" : "Sammy's Visit",
  "description" : "The classic tale about the time Sammy Davis Jr. stopped by to visit the Bunkers. It begins with a briefcase he left in Archie's cab ... and ends with the kiss of infamy."
}, {
  "imdbId" : "0066626",
  "season" : "2",
  "episodeNumber" : "22",
  "title" : "Edith the Judge",
  "description" : "Edith tries to mediate a grievance after Archie is accused of breaking a coin-operated washing machine at the Laundromat. Will her efforts succeed before the matter proceeds to small-claims court?"
}, {
  "imdbId" : "0066626",
  "season" : "2",
  "episodeNumber" : "23",
  "title" : "Archie Is Jealous",
  "description" : "Archie frets over the man with whom Edith shared something special before they met."
}, {
  "imdbId" : "0066626",
  "season" : "2",
  "episodeNumber" : "24",
  "title" : "Maude",
  "description" : "Archie and Edith travel to upstate New York to attend Carol Findlay's wedding."
}, {
  "imdbId" : "0066626",
  "season" : "3",
  "episodeNumber" : "1",
  "title" : "Archie and the Editorial",
  "description" : "Archie is invited to give a \"man-on-the street\" editorial on television, where he speaks against gun control. He then meets two people who saw the editorial ... who promptly rob him at gunpoint."
}, {
  "imdbId" : "0066626",
  "season" : "3",
  "episodeNumber" : "2",
  "title" : "Archie's Fraud",
  "description" : "Archie fails to report the extra income he made by driving Munson's taxicab, and is audited by the IRS."
}, {
  "imdbId" : "0066626",
  "season" : "3",
  "episodeNumber" : "3",
  "title" : "The Threat",
  "description" : "The Bunkers' house guest is the new, much younger wife of a war buddy. Archie, who can't take his eyes off of her, believes that she made a pass at him, and Edith overhears him telling Gloria and Mike so."
}, {
  "imdbId" : "0066626",
  "season" : "3",
  "episodeNumber" : "4",
  "title" : "Gloria and the Riddle",
  "description" : "Gloria's riddle, where the punchline is about women doctors, exposes sexist attitudes held by Archie and Mike about professions once predominantly held by men."
}, {
  "imdbId" : "0066626",
  "season" : "3",
  "episodeNumber" : "5",
  "title" : "Lionel Steps Out",
  "description" : "Archie goes berserk when he discovers that his visiting niece has been seeing Lionel, whose own family is just as unhappy about it."
}, {
  "imdbId" : "0066626",
  "season" : "3",
  "episodeNumber" : "6",
  "title" : "Edith Flips Her Wig",
  "description" : "Edith worries she may be a kleptomaniac when she absent-mindedly shoplifts from a department store and is subsequently arrested."
}, {
  "imdbId" : "0066626",
  "season" : "3",
  "episodeNumber" : "7",
  "title" : "The Bunkers and the Swingers",
  "description" : "Edith answers a magazine personal ad from a couple seeking new friends ... unaware that they engage in a swinging lifestyle."
}, {
  "imdbId" : "0066626",
  "season" : "3",
  "episodeNumber" : "8",
  "title" : "Mike Comes Into Money",
  "description" : "Mike donates his $275 inheritance to George McGovern's presidential campaign against an apoplectic Archie's express wishes that the money be used for room and board."
}, {
  "imdbId" : "0066626",
  "season" : "3",
  "episodeNumber" : "9",
  "title" : "Flashback - Mike and Gloria's Wedding: Part 1",
  "description" : "On the Stivics' second anniversary, the family reminisces about how Archie and Mike's Uncle Cashmir conflicted while planning Mike and Gloria's wedding."
}, {
  "imdbId" : "0066626",
  "season" : "3",
  "episodeNumber" : "10",
  "title" : "Flashback - Mike and Gloria's Wedding: Part 2",
  "description" : "The family continue to reminisce about the Stivics' wedding, recalling how Archie and Uncle Cashmir resolved their differences, only for Mike and Gloria to debate whether to allow a minister or a judge to give the vows."
}, {
  "imdbId" : "0066626",
  "season" : "3",
  "episodeNumber" : "11",
  "title" : "Mike's Appendix",
  "description" : "Mike needs emergency surgery to remove his appendix, but is uncomfortable with the idea of a female surgeon doing the operation."
}, {
  "imdbId" : "0066626",
  "season" : "3",
  "episodeNumber" : "12",
  "title" : "Edith's Winning Ticket",
  "description" : "Archie inquires Edith about four lottery tickets, purchased several months prior, that she had forgotten about. Upon finding out one is a winner, Archie shows a sudden interest in keeping them, despite Edith insisting the tickets actually belong to Louise Jefferson. Archie, reminding Edith she paid for the tickets with her own money, says otherwise."
}, {
  "imdbId" : "0066626",
  "season" : "3",
  "episodeNumber" : "13",
  "title" : "Archie and the Bowling Team",
  "description" : "Archie and a black man vie for the last spot on a bowling team."
}, {
  "imdbId" : "0066626",
  "season" : "3",
  "episodeNumber" : "14",
  "title" : "The Locket",
  "description" : "When Edith loses her heirloom necklace, Archie wants to report it missing so he can collect the insurance money and buy a color television. He then runs into problems when an agent comes over to verify the claim."
}, {
  "imdbId" : "0066626",
  "season" : "3",
  "episodeNumber" : "15",
  "title" : "Archie in the Hospital",
  "description" : "Hospital patient Archie strikes up a quick friendship with his roommate ... unaware that he is black."
}, {
  "imdbId" : "0066626",
  "season" : "3",
  "episodeNumber" : "16",
  "title" : "Oh Say Can You See",
  "description" : "\"Live like you were young\" - that's the advice from Archie's old friend."
}, {
  "imdbId" : "0066626",
  "season" : "3",
  "episodeNumber" : "17",
  "title" : "Archie Goes Too Far",
  "description" : "Archie snoops through Mike and Gloria's room, sparking a debate over privacy and prompting everyone - Edith included - to storm out of the house."
}, {
  "imdbId" : "0066626",
  "season" : "3",
  "episodeNumber" : "18",
  "title" : "Class Reunion",
  "description" : "Edith reunites with her high school boyfriend during her class reunion, prompting Archie to worry about whether his wife will rekindle the romance."
}, {
  "imdbId" : "0066626",
  "season" : "3",
  "episodeNumber" : "19",
  "title" : "The Hot Watch",
  "description" : "Mike worries that Archie may have unwittingly purchased a stolen watch. Matters become complicated when the watch is broken and Archie must find a repairman who will fix it and abstain from asking questions."
}, {
  "imdbId" : "0066626",
  "season" : "3",
  "episodeNumber" : "20",
  "title" : "Archie Is Branded",
  "description" : "Archie thinks a swastika painted on his door may be juvenile pranksters, but Mike is concerned that the Bunkers' home may have been mistaken for the residence of a Jewish radical."
}, {
  "imdbId" : "0066626",
  "season" : "3",
  "episodeNumber" : "21",
  "title" : "Everybody Tells the Truth",
  "description" : "All about how the time a repairman and his black apprentice came over to fix the Bunkers' refrigerator. Mike and Archie exchange wildly inaccurate versions about what happened, but Edith knows the real story."
}, {
  "imdbId" : "0066626",
  "season" : "3",
  "episodeNumber" : "22",
  "title" : "Archie Learns His Lesson",
  "description" : "Archie sneaks out at night ... and it isn't to go bowling (as he claims). Rather, he's been working on the sly to get his GED."
}, {
  "imdbId" : "0066626",
  "season" : "3",
  "episodeNumber" : "23",
  "title" : "Gloria the Victim",
  "description" : "Gloria comes home shaken up and wearing clothes borrowed from a friend. She won't tell Mike what is wrong, but eventually she relents and tells her mother that she was walking by a construction site when a man pulled her behind a fence and tried to rape her. She passed out and he ran away. The question then becomes whether to report it or not. Edith convinces her by telling her how, when she was a teenager, a man tried to attack her in the same fashion. Gloria decides to tell the police and they send a detective over who advises her that testifying to the crime can be..."
}, {
  "imdbId" : "0066626",
  "season" : "3",
  "episodeNumber" : "24",
  "title" : "The Battle of the Month",
  "description" : "Gloria finally loses patience with Archie's oft-demeaning treatment of Edith ... and Edith's willingness to take his verbal assaults with a grain of salt."
}, {
  "imdbId" : "0066626",
  "season" : "4",
  "episodeNumber" : "1",
  "title" : "We're Having a Heat Wave",
  "description" : "When a house in the neighborhood is put up for sale, Archie starts a petition to keep ethnic groups out. Henry Jefferson joins the effort when a Hispanic couple show interest. All this happens during a stifling heat wave in New York City."
}, {
  "imdbId" : "0066626",
  "season" : "4",
  "episodeNumber" : "2",
  "title" : "We're Still Having a Heat Wave",
  "description" : "Frank and Irene Lorenzo, an eccentric Italian couple, settle into the house next door, irritating Archie to no end."
}, {
  "imdbId" : "0066626",
  "season" : "4",
  "episodeNumber" : "3",
  "title" : "Edith Finds an Old Man",
  "description" : "Edith brings home an elderly man who ran away from the nursing home where he is a resident. Archie complains about the situation while Edith tries to contact the man's family."
}, {
  "imdbId" : "0066626",
  "season" : "4",
  "episodeNumber" : "4",
  "title" : "Archie and the Kiss",
  "description" : "Archie hits the roof when Gloria brings home a sculpture of Rodin's \"The Kiss,\" insisting it is pornography."
}, {
  "imdbId" : "0066626",
  "season" : "4",
  "episodeNumber" : "5",
  "title" : "Archie the Gambler",
  "description" : "Archie showers the family with expensive gifts, then is pressed to explain. Archie finally admits he's been betting on the horses, something he vowed he'd given up 20 years earlier."
}, {
  "imdbId" : "0066626",
  "season" : "4",
  "episodeNumber" : "6",
  "title" : "Henry's Farewell",
  "description" : "Louise is planning a farewell party for Henry who is moving away to start his own business. The problem is that she can't get George to attend because he won't set foot in a white man's house. So, through a mangle of miscommunication, she manages to get Edith to agree to host the party at her house. Of course, during the party Archie has to give his full opinion of the proceedings and of Henry's new venture. George reluctantly arrives to give his brother a farewell toast."
}, {
  "imdbId" : "0066626",
  "season" : "4",
  "episodeNumber" : "7",
  "title" : "Archie and the Computer",
  "description" : "An early satire on computers: A mix up on a rebate results in Edith inheriting a fortune in quarters from a prune company; Archie is (mistakenly) declared dead."
}, {
  "imdbId" : "0066626",
  "season" : "4",
  "episodeNumber" : "8",
  "title" : "The Games Bunkers Play",
  "description" : "Mike refuses to accept constructive criticism during a group therapy board game."
}, {
  "imdbId" : "0066626",
  "season" : "4",
  "episodeNumber" : "9",
  "title" : "Edith's Conversion",
  "description" : "When Irene Lorenzo invites Edith to attend Catholic Mass with her, Archie begins to get suspicious that Edith will soon be converting to Catholicism."
}, {
  "imdbId" : "0066626",
  "season" : "4",
  "episodeNumber" : "10",
  "title" : "Archie in the Cellar",
  "description" : "When the rest of the family is away for the weekend, Archie accidentally locks himself in the basement, and has only a tape recorder and a bottle of vodka to keep him entertained."
}, {
  "imdbId" : "0066626",
  "season" : "4",
  "episodeNumber" : "11",
  "title" : "Black Is the Color of My True Love's Wig",
  "description" : "Gloria buys a black wig and when she models it for Mike, he gets really turned on. But what happens when she takes off the wig leads to a huge fight about their sex life."
}, {
  "imdbId" : "0066626",
  "season" : "4",
  "episodeNumber" : "12",
  "title" : "Second Honeymoon",
  "description" : "Archie and Edith try to rekindle their romance by traveling to Atlantic City for their 25th anniversary."
}, {
  "imdbId" : "0066626",
  "season" : "4",
  "episodeNumber" : "13",
  "title" : "The Taxi Caper",
  "description" : "Archie is robbed while driving Munson's cab, and finds himself at odds with a corrupt politician who doesn't want him to report the crime."
}, {
  "imdbId" : "0066626",
  "season" : "4",
  "episodeNumber" : "14",
  "title" : "Archie Is Cursed",
  "description" : "When Archie boasts that men are superior to women in every way in sports, Irene sets out to prove him wrong ... by challenging him to a game of pool at Kelsey's Bar."
}, {
  "imdbId" : "0066626",
  "season" : "4",
  "episodeNumber" : "15",
  "title" : "Edith's Christmas Story",
  "description" : "On Christmas Day, Edith tells Gloria that she has found a lump in her breast and worries that she may have cancer."
}, {
  "imdbId" : "0066626",
  "season" : "4",
  "episodeNumber" : "16",
  "title" : "Mike and Gloria Mix It Up",
  "description" : "The Stivics quarrel over sex roles in their marriage when Mike complains that Gloria has become the aggressor as of late."
}, {
  "imdbId" : "0066626",
  "season" : "4",
  "episodeNumber" : "17",
  "title" : "Archie Feels Left Out",
  "description" : "Archie's family and friends throw a surprise party for his 50th birthday, but Archie insists that he's only 49, and is upset to find out he's older than he thinks."
}, {
  "imdbId" : "0066626",
  "season" : "4",
  "episodeNumber" : "18",
  "title" : "Et Tu, Archie?",
  "description" : "Archie learns his old friend is unemployed and engaged in an all-out effort to find a job ... any job, even if it means a job at the loading dock."
}, {
  "imdbId" : "0066626",
  "season" : "4",
  "episodeNumber" : "19",
  "title" : "Gloria's Boyfriend",
  "description" : "Archie learns that the mentally disabled have some real abilities, not to mention savvy, when he causes Gloria's friend, a stock boy at Ferguson's Market, to lose his job. The young man then finds himself another job."
}, {
  "imdbId" : "0066626",
  "season" : "4",
  "episodeNumber" : "20",
  "title" : "Lionel's Engagement",
  "description" : "The Bunkers, Stivics and Jeffersons attend Lionel's engagement party. His fiancée is a young woman whose father is white and mother is black, much to the chagrin of Archie and (especially) George."
}, {
  "imdbId" : "0066626",
  "season" : "4",
  "episodeNumber" : "21",
  "title" : "Archie Eats and Runs",
  "description" : "Archie learns that the canned mushrooms he just ate may have been part of a product recall because of reports of food poisoning. Mike urges Archie to investigate, but Archie decides he's sick and needs hospital treatment."
}, {
  "imdbId" : "0066626",
  "season" : "4",
  "episodeNumber" : "22",
  "title" : "Gloria Sings the Blues",
  "description" : "Gloria's bout with depression takes its toll on the family."
}, {
  "imdbId" : "0066626",
  "season" : "4",
  "episodeNumber" : "23",
  "title" : "Pay the Twenty Dollars",
  "description" : "George Jefferson storms into the house, demanding Archie to explain why he paid him using a counterfeit $20 bill."
}, {
  "imdbId" : "0066626",
  "season" : "4",
  "episodeNumber" : "24",
  "title" : "Mike's Graduation",
  "description" : "Mike graduates from college, an occasion that to Archie means Mike will soon be moving out of the house."
}, {
  "imdbId" : "0066626",
  "season" : "5",
  "episodeNumber" : "1",
  "title" : "The Bunkers and Inflation: Part 1",
  "description" : "Archie's union calls a strike, leaving the family to begin adjusting to not having a steady income."
}, {
  "imdbId" : "0066626",
  "season" : "5",
  "episodeNumber" : "2",
  "title" : "The Bunkers and Inflation: Part 2",
  "description" : "The strike continues to drag and Archie is left to sit home and complain. The household budget, meanwhile, begins to take a beating with the high cost of meat and gasoline. Finally, Louise Jefferson offers the family some stew. Archie doesn't want to accept charity, but Edith persuades him to take the helping hand."
}, {
  "imdbId" : "0066626",
  "season" : "5",
  "episodeNumber" : "3",
  "title" : "The Bunkers and Inflation: Part 3",
  "description" : "Three weeks into the strike, there seems to be no progress between Archie's union and company representatives; in fact, negotiations on both sides seem to be getting worse. With Mike's tutoring jobs only bringing in very little money, Edith decides the Bunkers need some real income, and does so by getting a cashier's job at Jefferson Cleaners."
}, {
  "imdbId" : "0066626",
  "season" : "5",
  "episodeNumber" : "4",
  "title" : "The Bunkers and Inflation: Part 4",
  "description" : "Archie's union finally negotiates a contract with his company that the workers ratify. When Mike finds out the terms - a flat pay rate for the next three years - he tells Archie that his union should have turned down the offer and started to fight for a cost-of-living escalator, especially with the onset of sky-high inflation. Archie, however, is just glad the strike has ended."
}, {
  "imdbId" : "0066626",
  "season" : "5",
  "episodeNumber" : "5",
  "title" : "Lionel the Live-In",
  "description" : "Lionel and George get into a huge late-night fight over Jenny and her mixed-race parents, prompting Lionel to spend the night at the Bunkers. Louise pressures her stubborn husband to apologize, and finds an unexpected ally in Archie, but only because he wants Lionel out of his hair."
}, {
  "imdbId" : "0066626",
  "season" : "5",
  "episodeNumber" : "6",
  "title" : "Archie's Helping Hand",
  "description" : "Archie persuades his boss to hire Irene as a bookkeeper. While she'd undoubtedly do a good job in that job, the boss thinks she'd do even better as a forklift operator. It isn't long before Archie finds himself working alongside Irene!"
}, {
  "imdbId" : "0066626",
  "season" : "5",
  "episodeNumber" : "7",
  "title" : "Gloria's Shock",
  "description" : "Four years into the Stivic marriage, Mike and Gloria still have no children. That's just fine by Mike, and his wishes cause yet another argument between him and Gloria."
}, {
  "imdbId" : "0066626",
  "season" : "5",
  "episodeNumber" : "8",
  "title" : "Where's Archie?",
  "description" : "Archie mysteriously disappears while traveling to a union convention in Buffalo, leaving Edith fraught with worry."
}, {
  "imdbId" : "0066626",
  "season" : "5",
  "episodeNumber" : "9",
  "title" : "Archie Is Missing",
  "description" : "After fearing the worst when Archie fails to contact the family for 48 hours, Edith, Mike and Gloria begin speculating about his whereabouts."
}, {
  "imdbId" : "0066626",
  "season" : "5",
  "episodeNumber" : "10",
  "title" : "The Longest Kiss",
  "description" : "The family is relieved to learn that Archie is safe and sound - he had been sidetracked at a podiatrist's convention. But Archie's reaction is priceless when he arrives home to find plenty of wackiness going on - hula hoops, ballroom dancing, and Mike trying to make good on Gloria's dare that they hold a kiss for hours and hours."
}, {
  "imdbId" : "0066626",
  "season" : "5",
  "episodeNumber" : "11",
  "title" : "Archie and the Miracle",
  "description" : "Archie narrowly escapes a potentially deadly accident at the dock, prompting him to see the light. But can he deal with the demands of Christianity, especially after he is asked to drive a church bus on the same day he was looking forward to going to a New York Jets game?"
}, {
  "imdbId" : "0066626",
  "season" : "5",
  "episodeNumber" : "12",
  "title" : "George and Archie Make a Deal",
  "description" : "Archie becomes suspicious when political office-seeker George is suddenly very nice to him."
}, {
  "imdbId" : "0066626",
  "season" : "5",
  "episodeNumber" : "13",
  "title" : "Archie's Contract",
  "description" : "A man comes by the house claiming that The Bunker's have a problem with heat loss in their home. He bars up the basement, and has Archie sign a contract for aluminum siding that he says he will get for free despite the fact that their house is brick. Edith reads the fine print and finds out that it will cost them $2000 no matter what happens. Archie is too stubborn to listen to Edith's good advice and signs the contract anyway. After the man leaves, Irene comes by to tell them that the man is scam artist who inspected their house with a light meter and a lot of phony ..."
}, {
  "imdbId" : "0066626",
  "season" : "5",
  "episodeNumber" : "14",
  "title" : "Mike's Friend",
  "description" : "Mike's college friend Stu comes to the house to play chess. However, Mike's intellectual conversation leaves Gloria feeling inferior."
}, {
  "imdbId" : "0066626",
  "season" : "5",
  "episodeNumber" : "15",
  "title" : "The Best of All in the Family",
  "description" : "A special one-hour retrospective, celebrating the 100th episode of the groundbreaking sitcom. Host Henry Fonda narrates and shares clips from the series' most memorable episodes up to this point in the series."
}, {
  "imdbId" : "0066626",
  "season" : "5",
  "episodeNumber" : "16",
  "title" : "Prisoner in the House",
  "description" : "Archie can't help but feel uncomfortable - and uneasy - when a plumber's apprentice is a convict on a work furlough from prison."
}, {
  "imdbId" : "0066626",
  "season" : "5",
  "episodeNumber" : "17",
  "title" : "The Jeffersons Move on Up",
  "description" : "The pilot episode for"
}, {
  "imdbId" : "0066626",
  "season" : "5",
  "episodeNumber" : "18",
  "title" : "All's Fair",
  "description" : "Mike and Gloria are dumbfounded by Edith's continual submissiveness to Archie. Gloria finally decides it's time to give her mother a long-overdue lesson in how to become more assertive in her marriage."
}, {
  "imdbId" : "0066626",
  "season" : "5",
  "episodeNumber" : "19",
  "title" : "Amelia's Divorce",
  "description" : "The Bunkers are shocked when the seemingly happy marriage of Edith's favorite cousin is anything but."
}, {
  "imdbId" : "0066626",
  "season" : "5",
  "episodeNumber" : "20",
  "title" : "Everybody Does It",
  "description" : "Archie's sense of morality is questioned when he borrows tools and equipment from work in order to complete a home repair project."
}, {
  "imdbId" : "0066626",
  "season" : "5",
  "episodeNumber" : "21",
  "title" : "Archie and the Quiz",
  "description" : "Out of curiosity, Archie takes a magazine test about his health habits. When he scores the test, he learns he might die at age 57. Rather than take the test for what it is worth (or heed the advice of the accompanying article), Archie fumes about his apparent fate."
}, {
  "imdbId" : "0066626",
  "season" : "5",
  "episodeNumber" : "22",
  "title" : "Edith's Friend",
  "description" : "Edith attends a wedding in her hometown of Scranton and runs into her childhood sweetheart, who is interested in rekindling the old romance"
}, {
  "imdbId" : "0066626",
  "season" : "5",
  "episodeNumber" : "23",
  "title" : "No Smoking",
  "description" : "A contest between Archie and Mike, to see who can abstain from his favorite indulgence (Archie's being smoking cigars, Mike's eating everything in sight) becomes a battle of wills. Who will win this 48-hour contest?"
}, {
  "imdbId" : "0066626",
  "season" : "5",
  "episodeNumber" : "24",
  "title" : "Mike Makes His Move",
  "description" : "Mike accepts a job, which pleases Archie because it means that Mike and Gloria will be moving. Finding a new home proves difficult. George Jefferson schemes to rent his old house next door to them cheap, just to annoy Archie."
}, {
  "imdbId" : "0066626",
  "season" : "6",
  "episodeNumber" : "1",
  "title" : "The Very Moving Day",
  "description" : "With the Jeffersons' old house now ready for the Stivics to move in, Mike and Gloria look forward to some peace and quiet. Then Gloria has some really wonderful news - she's pregnant."
}, {
  "imdbId" : "0066626",
  "season" : "6",
  "episodeNumber" : "2",
  "title" : "Alone at Last",
  "description" : "The day has come that Mike and Gloria are moving into their new home and Archie is practically pushing them out the door. Archie is being so obnoxious that Mike finally reaches a boiling point until he declares his independence and calls Archie a fathead. He and Gloria spend the night in their new home without electricity, plumbing or heat. Archie is overjoyed that the meathead is suffering but Edith's motherly instinct force her to intercede, she walks out and intends to suffer right along with the kids. Archie is all to happy to take care of himself but while making..."
}, {
  "imdbId" : "0066626",
  "season" : "6",
  "episodeNumber" : "3",
  "title" : "Archie the Donor",
  "description" : "Archie will do anything to get a promotion at the loading dock. So, he agrees to help Mr. Sanders with his latest charity, unaware that it involves something that goes against his morals - organ donation."
}, {
  "imdbId" : "0066626",
  "season" : "6",
  "episodeNumber" : "4",
  "title" : "Archie the Hero",
  "description" : "While driving Munson's cab, Archie saves the life of a beautiful woman who becomes unconscious. Uh, was that a woman? Sorry, that was no woman, thanks to female impersonator Beverly LaSalle's convincing act."
}, {
  "imdbId" : "0066626",
  "season" : "6",
  "episodeNumber" : "5",
  "title" : "Mike's Pains",
  "description" : "Mike - along with everyone else - debate where he should be when Gloria is in the delivery room giving birth to their baby."
}, {
  "imdbId" : "0066626",
  "season" : "6",
  "episodeNumber" : "6",
  "title" : "Chain Letter",
  "description" : "Archie rips up a chain letter, thinking it to be nothing more than baloney. Then a whole bunch of accidents happen. Coincidence or did Archie really set off the string of mishaps?"
}, {
  "imdbId" : "0066626",
  "season" : "6",
  "episodeNumber" : "7",
  "title" : "Mike Faces Life",
  "description" : "When Gloria gets her paycheck in the mail, it is good news and bad news. The good news is that the check is more than she expected. The bad news is that the check also comes enclosed with a pink slip. Determined to find out why she has been fired, she and Mike pay a visit to the boss Mr. Crenshaw. Mike becomes angry and demands to know why Gloria was let go. Crenshaw secretly records the parts of their conversation that makes Mike look like he is threatening him, but turns it off to confesses that he fired Gloria because she is pregnant, stating that she looks like ..."
}, {
  "imdbId" : "0066626",
  "season" : "6",
  "episodeNumber" : "8",
  "title" : "Edith Breaks Out",
  "description" : "Archie is unhappy with Edith doing volunteer work at The Sunshine home for seniors and he demands she quit."
}, {
  "imdbId" : "0066626",
  "season" : "6",
  "episodeNumber" : "9",
  "title" : "Grandpa Blues",
  "description" : "Archie's company physical is fast approaching, and he needs to remain calm for an entire weekend for the blood pressure test. Of course, a variety of situations arise that test Archie's ability to keep an even temper."
}, {
  "imdbId" : "0066626",
  "season" : "6",
  "episodeNumber" : "10",
  "title" : "Gloria Suspects Mike",
  "description" : "Gloria, now in her seventh month, is feeling unattractive. Added to that is the fact that Mike is tutoring an attractive young woman in Economics and suspects that something else might be going on. That night, when Mike goes to tutor the woman, they both become mutually attracted to one another leading to a kiss. Meanwhile, Archie gets an idea to trap Mike in a confession. Knowing that he can't hold his wine, Archie decides to try and liquor him up as a truth drug. They both get drunk and right before Mike confesses, Archie passes out, missing the part where he ..."
}, {
  "imdbId" : "0066626",
  "season" : "6",
  "episodeNumber" : "11",
  "title" : "The Little Atheist",
  "description" : "Archie and Mike argue over the religious upbringing of baby Joey during a Thanksgiving Day dinner."
}, {
  "imdbId" : "0066626",
  "season" : "6",
  "episodeNumber" : "12",
  "title" : "Archie's Civil Rights",
  "description" : "A mugger tries to attack Archie in his cab ... but this time, Archie strikes back with some pepper spray. So why is Archie the one facing criminal charges?"
}, {
  "imdbId" : "0066626",
  "season" : "6",
  "episodeNumber" : "13",
  "title" : "Gloria Is Nervous",
  "description" : "Worried when her baby is nine days overdue, Gloria snaps at Mike. Mike tries to be nice to his wife, but then he forgets that her baby shower is scheduled on a day when he has plans."
}, {
  "imdbId" : "0066626",
  "season" : "6",
  "episodeNumber" : "14",
  "title" : "Birth of the Baby: Part 1",
  "description" : "Archie is a nervous wreck because he wants to back out of the annual minstrel show at the lodge, which he has successfully avoided for several years. Lodge brothers Barney Hefner and Ed Bradley blackmail him by asserting that if Archie doesn't go on with the show, he will be kicked out of the lodge and lose all the benefits therein. Meanwhile, Mike and Gloria try to have a nice dinner at an Italian restaurant to take their minds off the fact that she is a week overdue. When Gloria admits that she is having contractions, which she didn't want to admit because she ..."
}, {
  "imdbId" : "0066626",
  "season" : "6",
  "episodeNumber" : "15",
  "title" : "Birth of the Baby: Part 2",
  "description" : "Archie is forced to show up at the hospital for the birth of his grandchild in black face, When his lodge brothers refused to give him their cold cream because he left, He and Edith are surprised to discover that Mike and Gloria haven't arrived - first they that Gloria was stuck in a phone booth at the restaurant and then they found themselves stuck in traffic. All is well, they get to the hospital, Gloria has the baby and Archie manages to borrow cold cream from a terrified elderly woman. The lodge brothers show up and tell him that they understand and that it would ..."
}, {
  "imdbId" : "0066626",
  "season" : "6",
  "episodeNumber" : "16",
  "title" : "New Year's Wedding",
  "description" : "In the wake of the birth of little Joey, Gloria and Michael are at odds with one another over communication issues. Gloria is upset because Michael keeps making big and little decisions without consulting her despite the fact that their marriage is suppose to be an equal partnership. The crux of their argument is over plans for their friends who are getting married before the year ends. Problems with the arrangements cause them to lose their original location and so it is suggested that they have it in the Stivic's living room. Mike comes to understand why Gloria is ..."
}, {
  "imdbId" : "0066626",
  "season" : "6",
  "episodeNumber" : "17",
  "title" : "Archie the Babysitter",
  "description" : "Archie babysits little Joey with the help of his friends during their poker game."
}, {
  "imdbId" : "0066626",
  "season" : "6",
  "episodeNumber" : "18",
  "title" : "Archie Finds a Friend",
  "description" : "Archie has ulterior motives when he befriends a Jewish watchmaker, who has a sure-fire invention that the world has been waiting for."
}, {
  "imdbId" : "0066626",
  "season" : "6",
  "episodeNumber" : "19",
  "title" : "Mike's Move",
  "description" : "Mike's support of hiring quotas faces a stern test when he is passed over for a promotion to a less-qualified black man. Mike confronts the hiring manager, but his big mouth gets him in trouble again."
}, {
  "imdbId" : "0066626",
  "season" : "6",
  "episodeNumber" : "20",
  "title" : "Archie's Weighty Problem",
  "description" : "Archie is told by his doctor to go on a diet, or else he'll suffer serious health problems. He rejects the efforts of Edith, Mike and Gloria to stick with the diet, but Justin Quigley may provide the inspiration Archie needs."
}, {
  "imdbId" : "0066626",
  "season" : "6",
  "episodeNumber" : "21",
  "title" : "Love by Appointment",
  "description" : "With a lot of demands on Mike and Gloria's time - Joey needs a lot of care, and both of them working - the Stivics begin wondering when...or if they'll ever have time for each other."
}, {
  "imdbId" : "0066626",
  "season" : "6",
  "episodeNumber" : "22",
  "title" : "Joey's Baptism",
  "description" : "Archie is determined to baptize Joey, especially over Mike's express wishes against it. When Edith begins refusing to allow Archie to be with Joey alone (knowing what will happen), Archie begins getting very sneaky."
}, {
  "imdbId" : "0066626",
  "season" : "6",
  "episodeNumber" : "23",
  "title" : "Gloria and Mike's House Guests",
  "description" : "Mike finds out that Archie baptized Joey without his consent, prompting another argument between the agnostic and so-called Christian. The argument begins to simmer ... until the Bunkers' furnace breaks down."
}, {
  "imdbId" : "0066626",
  "season" : "6",
  "episodeNumber" : "24",
  "title" : "Edith's Night Out",
  "description" : "Edith takes matters into her own hands when Archie continually refuses to treat his wife to one night out on the town. An evening at Kelsey's Bar shows Archie that Edith is no social wallflower."
}, {
  "imdbId" : "0066626",
  "season" : "7",
  "episodeNumber" : "1",
  "title" : "Archie's Brief Encounter: Parts 1 & 2",
  "description" : "Archie finds himself in a compromising situation with an attractive waitress after Edith ignores his amorous advances and dashes off to the Sunshine Home."
}, {
  "imdbId" : "0066626",
  "season" : "7",
  "episodeNumber" : "2",
  "title" : "Archie's Brief Encounter: Parts 1 & 2",
  "description" : "Archie finds himself in a compromising situation with an attractive waitress after Edith ignores his amorous advances and dashes off to the Sunshine Home. Janis Paige guest stars as Denise, the attractive waitress whose flirtations with Archie lead him to trouble on the home front."
}, {
  "imdbId" : "0066626",
  "season" : "7",
  "episodeNumber" : "3",
  "title" : "Archie's Brief Encounter: Part 3",
  "description" : "Episode #137 - And estranged Archie and Edith are determined to prove to each other that they are perfectly content going their separate ways, in the conclusion of a three-part presentation. The going gets tough for a while when the Bunkers continue to resist Mike and Gloria's efforts to reconcile them."
}, {
  "imdbId" : "0066626",
  "season" : "7",
  "episodeNumber" : "4",
  "title" : "The Unemployment Story: Part 1",
  "description" : "The family is getting ready to celebrate Mike's good fortune, he's been published. It happens just at the wrong moment, because Archie has just been laid off due to the recall of a government contract. At the unemployment office, he finds nothing but bureaucracy and frustration, especially with the information he won't get much of a check due to his job moonlighting in Munson's cab. At home, Edith makes it worse trying to make him feel better by trying to sing him to sleep."
}, {
  "imdbId" : "0066626",
  "season" : "7",
  "episodeNumber" : "5",
  "title" : "The Unemployment Story: Part 2",
  "description" : "Archie continues to have problems with finances and with finding another job. At the grocery store, he stresses himself about Edith's spending habits and tries to save money even if it means denting cans to save two cents. Gloria informs him that he has an interview for a job as a custodian, and at the interview he finds out that he is only being offered the job because of his lack of education. He gets the job over a man who is highly educated but has been out of work for three years. The man is so distraught that he climbs out onto the ledge of the building and ..."
}, {
  "imdbId" : "0066626",
  "season" : "7",
  "episodeNumber" : "6",
  "title" : "Archie's Operation: Part 1",
  "description" : "Archie goes into the hospital and has a verbal run-in with a Puerto Rican nurse and gets a blood transfusion from a black doctor."
}, {
  "imdbId" : "0066626",
  "season" : "7",
  "episodeNumber" : "7",
  "title" : "Archie's Operation: Part 2",
  "description" : "Archie goes into the hospital and has a verbal run-in with a Puerto Rican nurse and gets a blood transfusion from a black doctor."
}, {
  "imdbId" : "0066626",
  "season" : "7",
  "episodeNumber" : "8",
  "title" : "Beverly Rides Again",
  "description" : "Archie is tired of being the butt of Pinky Peterson's practical jokes and sets out to get revenge by fixing Pinky up on a date with Beverly Lasalle."
}, {
  "imdbId" : "0066626",
  "season" : "7",
  "episodeNumber" : "9",
  "title" : "Teresa Moves In",
  "description" : "The outspoken Puerto Rican nurse that Archie met at the time of his operation moves into Mike and Gloria's old room."
}, {
  "imdbId" : "0066626",
  "season" : "7",
  "episodeNumber" : "10",
  "title" : "Mike and Gloria's Will",
  "description" : "When Mike and Gloria are preparing their will, they have problems with having Archie and Edith as guardians for little Joey."
}, {
  "imdbId" : "0066626",
  "season" : "7",
  "episodeNumber" : "11",
  "title" : "Mr. Edith Bunker",
  "description" : "Edith saves a man's life and becomes a local celebrity much to Archie's annoyance."
}, {
  "imdbId" : "0066626",
  "season" : "7",
  "episodeNumber" : "12",
  "title" : "Archie's Secret Passion",
  "description" : "Edith invites a couple of high school friends over for dinner, unaware that Archie had a brief fling with the wife back in their high school days."
}, {
  "imdbId" : "0066626",
  "season" : "7",
  "episodeNumber" : "13",
  "title" : "The Baby Contest",
  "description" : "Despite the objections of Mike and Gloria, Archie enters his grandson in a beautiful baby contest."
}, {
  "imdbId" : "0066626",
  "season" : "7",
  "episodeNumber" : "14",
  "title" : "Gloria's False Alarm",
  "description" : "Gloria wants Mike to have a vasectomy when she thinks she might be pregnant."
}, {
  "imdbId" : "0066626",
  "season" : "7",
  "episodeNumber" : "15",
  "title" : "The Draft Dodger",
  "description" : "The Bunkers invite Archie's buddy Pinky Peterson to Christmas dinner. Then Mike's old friend David Brewster drops by unexpectedly, which worries Mike because David's a draft dodger wanted by the FBI and he's been living in Canada. When Pinky arrives, Archie reminds the family not to move the conversation toward his son Steven since he's still in shock over his tragic death in Vietnam. During dinner Archie keeps quizzing David about why he lives in Canada. David is so put out that he admits that he is a draft dodger, which incites furious rage from Archie. He assumes ..."
}, {
  "imdbId" : "0066626",
  "season" : "7",
  "episodeNumber" : "16",
  "title" : "The Boarder Patrol",
  "description" : "Episode #150 - The Bunker's unexpected return from a weekend trip puts Edith in a precarious situation when she discovers that Teresa has her boyfriend in her bedroom. Edith and the embarrassed Teresa agree that the only course of action is to try to sneak out the visitor before Archie finds out."
}, {
  "imdbId" : "0066626",
  "season" : "7",
  "episodeNumber" : "17",
  "title" : "Archie's Chair",
  "description" : "After Mike accidentally breaks Archie's chair he has it repaired, however it mistakenly gets thrown out and ends up in an art exhibit."
}, {
  "imdbId" : "0066626",
  "season" : "7",
  "episodeNumber" : "18",
  "title" : "Mike Goes Skiing",
  "description" : "Against his wife's wishes Mike goes skiing with his buddies."
}, {
  "imdbId" : "0066626",
  "season" : "7",
  "episodeNumber" : "19",
  "title" : "Stretch Cunningham, Goodbye",
  "description" : "Archie is shocked when his coworker Stretch has died after cavorting with a young woman. Asked to give the eulogy, he enlists Mike's help, requesting Bible references. But the biggest shock comes at the funeral."
}, {
  "imdbId" : "0066626",
  "season" : "7",
  "episodeNumber" : "20",
  "title" : "The Joys of Sex",
  "description" : "Mike and Gloria help advise the Bunkers on their sex life after they find Edith reading a sex manual."
}, {
  "imdbId" : "0066626",
  "season" : "7",
  "episodeNumber" : "21",
  "title" : "Mike the Pacifist",
  "description" : "Mike gets very upset when he defends Gloria on the subway since he never once in his life advocated violence."
}, {
  "imdbId" : "0066626",
  "season" : "7",
  "episodeNumber" : "22",
  "title" : "Fire",
  "description" : "A bathroom fire drives the Bunkers from the house in the middle of the night. Later Archie expects a handsome insurance check."
}, {
  "imdbId" : "0066626",
  "season" : "7",
  "episodeNumber" : "23",
  "title" : "Mike and Gloria Split",
  "description" : "Mike and Gloria have an argument after a Scrabble game about Mike always being right and that she never did get to go to college as Mike had promised. Mike also ends up with Archie as a roommate for one night."
}, {
  "imdbId" : "0066626",
  "season" : "7",
  "episodeNumber" : "24",
  "title" : "Archie the Liberal",
  "description" : "To change the public perception of their lodge Archie proposes that they let in a black Jewish fellow from his work."
}, {
  "imdbId" : "0066626",
  "season" : "7",
  "episodeNumber" : "25",
  "title" : "Archie's Dog Day Afternoon",
  "description" : "Archie starts another battle when he goes one-on-one with a neighborhood dog."
}, {
  "imdbId" : "0066626",
  "season" : "8",
  "episodeNumber" : "1",
  "title" : "Archie Gets the Business",
  "description" : "Archie buys Kelsey's Bar, but has to forge Edith's signature to get the money."
}, {
  "imdbId" : "0066626",
  "season" : "8",
  "episodeNumber" : "2",
  "title" : "Archie Gets the Business",
  "description" : "Mike has to soothe Edith's feelings after she learns that Archie forged her signature to buy the bar."
}, {
  "imdbId" : "0066626",
  "season" : "8",
  "episodeNumber" : "3",
  "title" : "Cousin Liz",
  "description" : "After Edith's cousin Liz dies her female roommate admits to Edith that they were lovers."
}, {
  "imdbId" : "0066626",
  "season" : "8",
  "episodeNumber" : "4",
  "title" : "Edith's 50th Birthday",
  "description" : "Archie, Mike and Gloria plan a surprise party for Edith to celebrate her 50th birthday. But an unwelcome visitor to the Bunker's home - while Edith is home alone - has a much different surprise in mind for the Bunker matriarch."
}, {
  "imdbId" : "0066626",
  "season" : "8",
  "episodeNumber" : "5",
  "title" : "Edith's 50th Birthday",
  "description" : "Edith encounters a life-threatening rapist on her 50th birthday."
}, {
  "imdbId" : "0066626",
  "season" : "8",
  "episodeNumber" : "6",
  "title" : "Unequal Partners",
  "description" : "Archie has to delay his fishing trip when Edith has an anniversary party for a couple from the Sunshine Home."
}, {
  "imdbId" : "0066626",
  "season" : "8",
  "episodeNumber" : "7",
  "title" : "Archie's Grand Opening",
  "description" : "Harry the bartender quits after Archie keeps bossing him around. Edith and the Stivics end up helping out during the grand opening of Archie's Place."
}, {
  "imdbId" : "0066626",
  "season" : "8",
  "episodeNumber" : "8",
  "title" : "Archie's Bitter Pill",
  "description" : "Slow business at the saloon depresses Archie, so well-meaning Hank Pivnik gives him some pills to help him cheer up. But Archie takes too many and the family fears for his health."
}, {
  "imdbId" : "0066626",
  "season" : "8",
  "episodeNumber" : "9",
  "title" : "Archie's Road Back",
  "description" : "Depressed Archie confines himself to bed indefinitely, so the family tries to get Harry the bartender to become Archie's partner and invest in Archie's Place."
}, {
  "imdbId" : "0066626",
  "season" : "8",
  "episodeNumber" : "10",
  "title" : "Archie and the KKK: Part 1",
  "description" : "A power outage and reports of looting in the city prompt Mike to write a letter to the editor about how greedy governments do the same in the name of free enterprise. At the bar, Archie vents his frustrations about how Mike always argues his point and doesn't see things his way. Two men - who have been listening in - approach Archie and suggest that he come to a meeting of the Kweens Kouncil of Krusaders (a chapter of the Klu Klux Klan), where they will come up with a more severe way of \"teaching\" Mike a lesson."
}, {
  "imdbId" : "0066626",
  "season" : "8",
  "episodeNumber" : "11",
  "title" : "Archie and the KKK: Part 2",
  "description" : "Archie learns that Gordie and Mitch - the two men he met earlier at his bar - plan to burn a cross on the Stivic's lawn and must come up with a way to stop them. When Archie tries to persuade Mike to write a new letter to the editor (recanting his previous stance on free enterprise), he lets slip that he had spoken with known Klu Klux Klan members. Mike is outraged and tells Archie to go away, but Archie is still determined to stop the cross burning - even if it means he will be the KKK's next target."
}, {
  "imdbId" : "0066626",
  "season" : "8",
  "episodeNumber" : "12",
  "title" : "Mike and Gloria Meet",
  "description" : "A flashback episode of when Mike and Gloria first came together by mutual friends at the Bunker home while Archie and Edith are out. Initially their differences lead to much tension until they discover a shared love for old style dancing."
}, {
  "imdbId" : "0066626",
  "season" : "8",
  "episodeNumber" : "13",
  "title" : "Edith's Crisis of Faith: Part 1",
  "description" : "Edith's faith is severely shaken when their friend Beverly, the female impersonator, is murdered at Christmastime."
}, {
  "imdbId" : "0066626",
  "season" : "8",
  "episodeNumber" : "14",
  "title" : "Edith's Crisis of Faith: Part 2",
  "description" : "Mike recovers from the injuries he sustained in the mugging. But the Christmas Day gift exchange is still strained due to Edith's depression, so the family rallies around her."
}, {
  "imdbId" : "0066626",
  "season" : "8",
  "episodeNumber" : "15",
  "title" : "The Commercial",
  "description" : "Honest Edith just can't lie during a detergent commercial."
}, {
  "imdbId" : "0066626",
  "season" : "8",
  "episodeNumber" : "16",
  "title" : "Super Bowl Sunday",
  "description" : "On Superbowl Sunday, Archie's Place is robbed."
}, {
  "imdbId" : "0066626",
  "season" : "8",
  "episodeNumber" : "17",
  "title" : "Aunt Iola's Visit",
  "description" : "Archie will not allow Edith's aunt to move in after she was rejected by the rest of her family."
}, {
  "imdbId" : "0066626",
  "season" : "8",
  "episodeNumber" : "18",
  "title" : "Love Comes to the Butcher",
  "description" : "The butcher falls in love with Edith."
}, {
  "imdbId" : "0066626",
  "season" : "8",
  "episodeNumber" : "19",
  "title" : "Two's a Crowd",
  "description" : "Mike and Archie get locked together in the storage room at Archie's Place and have a long talk."
}, {
  "imdbId" : "0066626",
  "season" : "8",
  "episodeNumber" : "20",
  "title" : "Stalemates",
  "description" : "Even a Pocono weekend doesn't seem to spark the romance in the Stivic's marriage."
}, {
  "imdbId" : "0066626",
  "season" : "8",
  "episodeNumber" : "21",
  "title" : "The Brother",
  "description" : "Before an operation, Archie's brother tries to smooth over differences that occurred long ago."
}, {
  "imdbId" : "0066626",
  "season" : "8",
  "episodeNumber" : "22",
  "title" : "Mike's New Job",
  "description" : "Mike accepts a job on the west coast and the Stivics prepare to move."
}, {
  "imdbId" : "0066626",
  "season" : "8",
  "episodeNumber" : "23",
  "title" : "The Dinner Guest",
  "description" : "Mike and Gloria can't make the special dinner that Edith prepared for the departing Stivics."
}, {
  "imdbId" : "0066626",
  "season" : "8",
  "episodeNumber" : "24",
  "title" : "The Stivics Go West",
  "description" : "Saying goodbye to Mike and Gloria proves traumatic for the Bunkers. Before they leave for their new life in California, Mike and Gloria share some long-hidden feelings, confused tears, and much, much more with Archie and Edith."
}, {
  "imdbId" : "0066626",
  "season" : "9",
  "episodeNumber" : "1",
  "title" : "Little Miss Bunker",
  "description" : "Edith's cousin leaves his nine year old daughter Stephanie with the Bunkers."
}, {
  "imdbId" : "0066626",
  "season" : "9",
  "episodeNumber" : "2",
  "title" : "End in Sight",
  "description" : "Archie slips into a bout of depression when he finds out from his insurance company's physical that a spot appeared on the X-Ray on his liver. Despite the fact that the doctor isn't sure what the spot is, Archie is convinced that the end is near. His first response is to be nice to Edith, and his second is to retire to his bedroom to wait out the inevitable."
}, {
  "imdbId" : "0066626",
  "season" : "9",
  "episodeNumber" : "3",
  "title" : "Reunion on Hauser Street",
  "description" : "Edith and Archie try and get their friends Barney and Blanche back together."
}, {
  "imdbId" : "0066626",
  "season" : "9",
  "episodeNumber" : "4",
  "title" : "What'll We Do with Stephanie?",
  "description" : "After her father fails to return for Stephanie, the Bunkers decide to raise her themselves."
}, {
  "imdbId" : "0066626",
  "season" : "9",
  "episodeNumber" : "5",
  "title" : "Edith's Final Respects",
  "description" : "Edith goes to the funeral of her Aunt Rose and is the only mourner. She has a long talk with her aunt."
}, {
  "imdbId" : "0066626",
  "season" : "9",
  "episodeNumber" : "6",
  "title" : "Weekend in the Country",
  "description" : "During a weekend in a fishing cabin, a disagreement over a Monopoly game has the men and women sleeping in separate bedrooms."
}, {
  "imdbId" : "0066626",
  "season" : "9",
  "episodeNumber" : "7",
  "title" : "Archie's Other Wife",
  "description" : "At a convention Archie awakens next to a black woman who claims that they were married."
}, {
  "imdbId" : "0066626",
  "season" : "9",
  "episodeNumber" : "8",
  "title" : "Edith Versus the Bank",
  "description" : "No one will loan Edith money to buy a new television because she has no job and is just a housewife."
}, {
  "imdbId" : "0066626",
  "season" : "9",
  "episodeNumber" : "9",
  "title" : "Return of the Waitress",
  "description" : "Archie is caught between sympathy and self-preservation when the \"other woman\" from his past really needs his help. Her name is Denise and she's the attractive waitress who was the other half of an evening that Archie - and Edith - will always remember."
}, {
  "imdbId" : "0066626",
  "season" : "9",
  "episodeNumber" : "10",
  "title" : "Bogus Bills",
  "description" : "Edith is arrested for passing counterfeit money that she got from Archie at the bar."
}, {
  "imdbId" : "0066626",
  "season" : "9",
  "episodeNumber" : "11",
  "title" : "The Bunkers Go West",
  "description" : "The Bunkers plan to go to California to visit the Stivics after they cancel their Christmas trip to New York."
}, {
  "imdbId" : "0066626",
  "season" : "9",
  "episodeNumber" : "12",
  "title" : "California, Here We Are",
  "description" : "When the Bunkers visit the Stivics in California, Mike and Gloria are hiding the fact that they have separated."
}, {
  "imdbId" : "0066626",
  "season" : "9",
  "episodeNumber" : "13",
  "title" : "A Night at the PTA",
  "description" : "Edith can't sing at the PTA meeting because she has laryngitis."
}, {
  "imdbId" : "0066626",
  "season" : "9",
  "episodeNumber" : "14",
  "title" : "A Girl Like Edith",
  "description" : "The butcher returns with his fiancee who is the spitting image of Edith who he still seems to have feelings for."
}, {
  "imdbId" : "0066626",
  "season" : "9",
  "episodeNumber" : "15",
  "title" : "The Appendectomy",
  "description" : "On her tenth birthday Stephanie is rushed to the hospital with appendicitis."
}, {
  "imdbId" : "0066626",
  "season" : "9",
  "episodeNumber" : "16",
  "title" : "Stephanie and the Crime Wave",
  "description" : "Stephanie has been stealing from school and from the Bunkers."
}, {
  "imdbId" : "0066626",
  "season" : "9",
  "episodeNumber" : "17",
  "title" : "Barney the Gold Digger",
  "description" : "Barney is distraught after Blanche finally leaves him so Archie tries a bit of matchmaking himself."
}, {
  "imdbId" : "0066626",
  "season" : "9",
  "episodeNumber" : "18",
  "title" : "The Return of Archie's Brother",
  "description" : "Archie's brother shows up with an eighteen year old wife."
}, {
  "imdbId" : "0066626",
  "season" : "9",
  "episodeNumber" : "19",
  "title" : "Stephanie's Conversion",
  "description" : "The Reverand Chong visits Edith to tell her that Stephanie is Jewish. Archie wants her to convert, but Edith backs Stephanie's decision."
}, {
  "imdbId" : "0066626",
  "season" : "9",
  "episodeNumber" : "20",
  "title" : "Edith Gets Fired",
  "description" : "Edith is dismissed when she honors a patient's wishes and lets her die in peace."
}, {
  "imdbId" : "0066626",
  "season" : "9",
  "episodeNumber" : "21",
  "title" : "\"All in the Family\" Retrospective",
  "description" : "Producer/Developer Norman Lear hosts a 90 minute retrospective on the long-running comedy with classic footage from past episodes."
}, {
  "imdbId" : "0066626",
  "season" : "9",
  "episodeNumber" : "22",
  "title" : "The Family Next Door",
  "description" : "Louise Jefferson shows up and asks Edith to help her find a buyer for their house next door. At first Archie is excited... until he sees Edith's choice for new neighbors."
}, {
  "imdbId" : "0066626",
  "season" : "9",
  "episodeNumber" : "23",
  "title" : "The Return of Stephanie's Father",
  "description" : "Archie's fighting instincts are aroused when Stephanie's derelict father returns and uses blackmail to try an get his daughter back. Edith panics at the thought of losing Stephanie, and does her best to help Archie with a plan."
}, {
  "imdbId" : "0066626",
  "season" : "9",
  "episodeNumber" : "24",
  "title" : "Too Good Edith",
  "description" : "Archie keeps a sick Edith so busy cooking for his big St. Patrick's Day party, that she doesn't get the chance to tell him that \"hard work is hazardous to her health.\" When Archie finds out the truth about Edith's illness, he takes steps to make sure she will never \"forget\" to tell him again."
}]