[{
  "imdbId" : "0485301",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Everything Changes",
  "description" : "Police Constable Gwen Cooper comes across the mysterious organization known as Torchwood. While investigating their world, she finds technology and methods she never imagined."
}, {
  "imdbId" : "0485301",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Day One",
  "description" : "Torchwood must stop a sex addicted alien as it leaves a trail of gruesome deaths in its wake."
}, {
  "imdbId" : "0485301",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Ghost Machine",
  "description" : "After Gwen Cooper recovers an alien device from Sean Harris, the device seemingly takes her back in time to the 1940s where she sees a young boy, alone on a railway platform. Soon after, Owen has a similar experience only this time he is under a bridge in the early 1960s where a young woman is raped and murdered. They trace both the boy and the murderer and learn that the boy was well taken care of. As for the murderer, the case remains unsolved, something that outrages Owen."
}, {
  "imdbId" : "0485301",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Cyberwoman",
  "description" : "There's a dark secret in the basement of the Hub. Even Jack is unaware of it, but Ianto knows. And he'll go to any lengths, sacrifice anything and anyone, to protect what's down there."
}, {
  "imdbId" : "0485301",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Small Worlds",
  "description" : "Jasmine is a withdrawn but intelligent child whose new 'friends' exploit her suppressed anger, and while investigating this, Jack encounters elemental enemies from his past that are determined to harm those closest to him."
}, {
  "imdbId" : "0485301",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Countrycide",
  "description" : "In the countryside north of Cardiff, the Torchwood team investigates the disappearance of 17 people in the last few months. No bodies have been found and the police haven't a clue as to what may have happened to them. They set up camp in a field but when their SUV is stolen and then parked in a small village just a few miles away, they realize they're being lured into a trap. In the village, they find the remains of several inhabitants - stripped of flesh and organs - and one terrified survivor who promptly shoots Gwen with a shotgun. With Ianto and Tosh taken ..."
}, {
  "imdbId" : "0485301",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Greeks Bearing Gifts",
  "description" : "The team is asked to analyze a recently discovered 18th century corpse with a hole in its chest. Meanwhile, a mysterious charismatic woman seduces Tosh and gives her an alien pendant that allows its wearer to read other people's minds."
}, {
  "imdbId" : "0485301",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "They Keep Killing Suzie",
  "description" : "Torchwood is called into a murder investigation when a suburban couple are found in their beds with their throats slit and TORCHWOOD written on the wall in their blood. Gwen convinces them to use the gauntlet to reanimate the victims to see if they can get the identity of the killer. They have little success but when they learn that their former colleague Suzie Costello had a connection to the victims, they decide to revive her. Normally, the dead can only be revived for a minute or two at most but in Suzie's case, she seems to have been reanimated permanently. When ..."
}, {
  "imdbId" : "0485301",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "Random Shoes",
  "description" : "The invisible spirit of a hit-and-run victim tries to convince Gwen to locate the 'alien' who might have been responsible for his death."
}, {
  "imdbId" : "0485301",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "Out of Time",
  "description" : "When a passenger plane from 1953 arrives in Cardiff in 2007 due to the Rift, the Torchwood team try to help three temporal immigrants adapt a new life in the city."
}, {
  "imdbId" : "0485301",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "Combat",
  "description" : "The team discovers a ring who are kidnapping Weevils - wild alien creatures that have come through the Rift and are hiding on Earth - which leads Owen down a dark path to confront the future of his own existence."
}, {
  "imdbId" : "0485301",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "Captain Jack Harkness",
  "description" : "Jack and Tosh investigate when there are reports of music coming out of nowhere in an abandoned dance hall. While in the building, a temporal shift puts them in back in 1941 but they soon realize can't get back to their own time, at least not without Tosh sending those in the present day the necessary equations to make it happen. While at the dance hall, Jack runs into someone he knows, an American RAF pilot by the name of Jack Harkness. In the present day Owen, Ianto and Gwen are working to get them back. Owen wants to open the rift and try to get Diane Holmes back ..."
}, {
  "imdbId" : "0485301",
  "season" : "1",
  "episodeNumber" : "13",
  "title" : "End of Days",
  "description" : "The Rift is splintering - strange phenomena like UFOs and ancient soldiers are falling through time into various places around the world. These events resemble those in the prophecy of the arrival of Abaddon, the Great Devourer, who will lead the world into shadow and bring about the End of Days..."
}, {
  "imdbId" : "0485301",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "Kiss Kiss, Bang Bang",
  "description" : "A conflicted Torchwood team is surprised to see Captain Jack suddenly return to their lives, and though he tries to come back as if nothing had happened, Jack soon finds that some things have changed since his disappearance. There's little time for explanations, though, as a mysterious stranger from Jack's past steps through the rift, and he's on a mission that only the Torchwood team can help him finish. But it becomes quickly clear that Captain John Hart is not all he claims to be, and as usual, Captain Jack Harkness has some secrets of his own."
}, {
  "imdbId" : "0485301",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "Sleeper",
  "description" : "When a burglary turns into a slaughter, Torchwood suspect alien involvement. Who is Beth, and can she be as innocent as she seems? However, when the investigation escalates into a city-wide assault, Captain Jack realises that the whole planet is in danger."
}, {
  "imdbId" : "0485301",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "To the Last Man",
  "description" : "Every year since 1918, the team wakes Tommy from cryogenic sleep, because one day they will need his help. But they don't know which year, or for what. All indications are sealed in a box that will only open at the right moment."
}, {
  "imdbId" : "0485301",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "Meat",
  "description" : "Conflicts abound when a truck owned by Rhys's trucking company is investigated by Torchwood... and Rhys is there to see it. The meat it carries is tainted, or is it even meat at all? Rhys does a little investigating of his own, and might have something to contribute to the team this time around. But he's no longer sure who he can trust anymore. And can Gwen and the team trust him?"
}, {
  "imdbId" : "0485301",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "Adam",
  "description" : "Adam, an alien in the guise of a personable young man, is a 'memory manipulator' who implants false memories into the Torchwood team, leading them to believe he is an old friend. Gwen is induced to forget Rhys and Jack recalls painful memories of his brother before he exposes Adam. The team take tablets to restore their memories, in the process 'killing' Adam, who fades away."
}, {
  "imdbId" : "0485301",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "Reset",
  "description" : "Jack persuades Martha Jones to go undercover at the Pharm, a sinister research facility, which is experimenting in the drug 'Reset', releasing alien parasites into the body to 'reset' it and cure disease. She is exposed by the Pharm's head, Dr. Copley and injected with Reset before the Torchwood team ride to her rescue."
}, {
  "imdbId" : "0485301",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "Dead Man Walking",
  "description" : "Jack acquires the other Resurrection Glove to bring Owen momentarily back from the dead. However, Owen does not become fully dead again - even though his body is physically dead, some unknown force keeps him reanimated. And he's becoming less human..."
}, {
  "imdbId" : "0485301",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "A Day in the Death",
  "description" : "Owen's been dead for three days and finds it unbearable. He meets a woman contemplating jumping off a roof and reveals that there is nothing after death. He then tells the woman how he ended up coming to the roof."
}, {
  "imdbId" : "0485301",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "Something Borrowed",
  "description" : "Friday night: Gwen's late for her own hen party. This is because she's been chasing a man-eating shape-shifter, which bites her before Jack shoots it. Saturday morning: Wedding day. Gwen wakes up heavily pregnant."
}, {
  "imdbId" : "0485301",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "From Out of the Rain",
  "description" : "An old movie theatre, The Electro, has been restored and is opening as a museum. Ianto used to go there as a child and invites Owen and Gwen to the opening. Jack hears faint music, like pipe organ, at Torchwood. Then the movie projector somehow plays a different film than the one on the reel. Ianto sees Jack in the movie, in a traveling show. Then the projector stops. Two characters from the movie disappear into the night..."
}, {
  "imdbId" : "0485301",
  "season" : "2",
  "episodeNumber" : "11",
  "title" : "Adrift",
  "description" : "When a local teenager disappears, Gwen is drawn into an investigation that reveals a darker side of Torchwood. Hundreds of people have disappeared without trace, but why is Jack obstructing attempts to find them? The answer seems to lie in the rift, and as Gwen follows the trail she makes a shocking discovery."
}, {
  "imdbId" : "0485301",
  "season" : "2",
  "episodeNumber" : "12",
  "title" : "Fragments",
  "description" : "As the team is trapped in the rubble of a building, their paths to joining Torchwood are revealed."
}, {
  "imdbId" : "0485301",
  "season" : "2",
  "episodeNumber" : "13",
  "title" : "Exit Wounds",
  "description" : "When the villainous Captain John Hart returns to abduct Captain Jack Harkness whilst unleashing a wave of destruction and terror upon an unsuspecting Cardiff, it's up to Gwen, Ianto, Owen and Tosh to save the day. Meanwhile, Captain Jack Harkness is forced to face some demons from his past."
}, {
  "imdbId" : "0485301",
  "season" : "3",
  "episodeNumber" : "1",
  "title" : "Children of Earth: Day One",
  "description" : "An alien race known as the \"456\" demand 10% of the Earth's children to be handed over. The chemicals within Earth children brings pleasure to the 456, and the children going to hooked up to them as recreational drugs to make them \"feel good\". Consequently Torchwood team are forced to fight against the British government and their attempts to concede to the aliens' demands, to prevent any of Earth's children from being handed over."
}, {
  "imdbId" : "0485301",
  "season" : "3",
  "episodeNumber" : "2",
  "title" : "Children of Earth: Day Two",
  "description" : "The bomb explodes, blowing up Torchwood. Gwen escapes and goes on the run with husband Rhys, with an army detachment under tough female Captain Johnson in pursuit. Dekker gives Frobisher cryptic written plans for a mysterious edifice the aliens - the 456 - want building though not even the P.M. knows what it is. Lois, Frobisher's new temp, accidentally finds secret information on Torchwood in her computer and is curious but Frobisher tells her Jack was the terrorist who caused the explosion.Gwen and Rhys hide in a lorry bound for London, where she discloses her ..."
}, {
  "imdbId" : "0485301",
  "season" : "3",
  "episodeNumber" : "3",
  "title" : "Children of Earth: Day Three",
  "description" : "The team hide out in a former Torchwood holding facility, stealing to survive. Gwen meets with Lois, giving her a laptop and special contact lenses to report back to her. Gwen also has Clem, arrested for an affray, released and safe with the team. Ms. Johnson locates and captures Alice and her son after Alice has tried to ring Jack, soon after which children state that 'We' have arrived and a pillar of fire turns into green ooze as the alien leader communes with Frobisher, watched by the Torchwood team,thanks to Lois. Everything is bound up with the events of 1965,as ..."
}, {
  "imdbId" : "0485301",
  "season" : "3",
  "episodeNumber" : "4",
  "title" : "Children of Earth: Day Four",
  "description" : "Jack is forced to confess how he helped broker a deal in 1965 when the 456 aliens offered an antidote against a deadly universal flu virus in exchange for twelve children who would 'live forever.' Clem and the team watch via Lois's laptop as the aliens tell Frobisher they will 'wipe out the human species' if their request is not met, and a camera reveals the apparently zombic Scots victims, said by the aliens to be unharmed. Frobisher rejects Jack's offer of help in return for Alice and her son's release. He attends a Cabinet meeting which agrees that the Cabinet's ..."
}, {
  "imdbId" : "0485301",
  "season" : "3",
  "episodeNumber" : "5",
  "title" : "Children of Earth: Day Five",
  "description" : "With little choice now but to give in to their demands, the British authorities begin to round up the children under the pretense of giving them inoculations. Panic begins to set in as parents begin to wonder what is happening to their children. Captain Jack is released as are his daughter and grandson and he tries to find a way fight the 456. Gwen and her husband return home to tell Ianto's sister what has happened but they arrive to find a house full of children, whom they try to save from the arriving soldiers. With Fobisher no longer available, Col. Oduya becomes ..."
}, {
  "imdbId" : "0485301",
  "season" : "4",
  "episodeNumber" : "1",
  "title" : "Miracle Day: The New World",
  "description" : "In an American prison child killer Oswald Danes is given a lethal injection but fails to die. CIA agent Rex Matheson is one of several severely injured hospital patients who should be dead but survive. The phenomenon is worldwide and the press dub it Miracle Day,when noone dies. Rex's colleague Esther Drummond attempts to contact the long disbanded Torchwood and is visited by Jack as a result. The pair survive an attack by a bomber - after Jack - whilst the bomber,though blown to bits,goes on breathing. Gwen and Rhys Williams are living in seclusion in Wales with ..."
}, {
  "imdbId" : "0485301",
  "season" : "4",
  "episodeNumber" : "2",
  "title" : "Miracle Day: Rendition",
  "description" : "Rex brings back Jack and Gwen to Washington. At the CIA office Esther realizes that the rendition is being sabotaged from within the organization. On the flight home Rex unexpectedly needs help from Dr. Juarez to get the team safely on the ground. In the meantime the medical community tries to cope with the new reality of non-death."
}, {
  "imdbId" : "0485301",
  "season" : "4",
  "episodeNumber" : "3",
  "title" : "Miracle Day: Dead of Night",
  "description" : "Rex forces his boss Friedkin to confess that, in setting him up, he was obeying orders from a mysterious source. By confiscating his phone Rex's investigations lead to an empty warehouse belonging to Phi-Corp, a global pharmaceutical firm, containing vast amounts of pain killers. Rex's wound reopens and he seeks medical help - and more - from Vera Juarez, who has been invited by Jilly Kitzinger to attend a Phi-Corp meeting. Vera takes Gwen and they hear the announcement that all pain-killers will legally be dispensed without prescriptions in future. This is endorsed ..."
}, {
  "imdbId" : "0485301",
  "season" : "4",
  "episodeNumber" : "4",
  "title" : "Miracle Day: Escape to LA",
  "description" : "The quartet escape to Los Angeles and attempt to enter the Phi Corp headquarters but they have been followed,by a man who claims to know Jack from long ago and believes he holds the key to Miracle Day,though he is killed by Rex. A right wing housewife Ellis Hartley Monroe achieves fame with her Dead Is Dead campaign,which involves herding the sick into ghetto hospitals. Danes,sensing that he will be eclipsed by her celebrity,publicly opposes it to general acclaim. However Gwen learns that her father is to be put into one of these 'overflow camps' for the sick,back in ..."
}, {
  "imdbId" : "0485301",
  "season" : "4",
  "episodeNumber" : "5",
  "title" : "Miracle Day: The Categories of Life",
  "description" : "Dr. Juarez joins the new Torchwood after category guidelines are released for patient care. Esther and Rex go undercover to find out what is happening to Category 1 patients being sent to 'Modules' at overflow centers. Meanwhile, Gwen flies back to Wales to remove her father from an overflow center. Dr. Juarez manages to use her credentials to enter an overflow center as an inspector while Jack attempts to convince Oswald Danes to expose Phicorp."
}, {
  "imdbId" : "0485301",
  "season" : "4",
  "episodeNumber" : "6",
  "title" : "Miracle Day: The Middle Men",
  "description" : "Jack confronts Stuart Owens, PhiCorp's chief executive, who admits that he is as ignorant as everybody else as to the reason for Miracle Day. All he can tell Jack is that the answer should be in a cryptic document, the Blessing, which originated in Italy. Rex learns that the California overflow camp incinerates the 'undesirable' sick - illegal immigrants, criminals - and Vera. Rex and Esther are caught by Maloney but are saved by Maloney's appalled aide, Ralph, who shoots his boss and helps them escape. Gwen springs her father from Cowbridge but on return to America ..."
}, {
  "imdbId" : "0485301",
  "season" : "4",
  "episodeNumber" : "7",
  "title" : "Miracle Day: Immortal Sins",
  "description" : "In Ellis Island, New York in 1927, Jack meets a young Italian immigrant Angelo Colasanto. They become lovers and boot-leggers, working for a gangster. Together they uncover a plot to kill Franklin Roosevelt though Angelo is puzzled by Jack's immortality, following a shoot-out. As a result he is coerced into an unsuccessful attempt on Jack's life. In the present, Gwen is taking Jack, her prisoner, back to Wales when they are attacked but saved by Esther and Rex. They are then summoned to meet Angelo."
}, {
  "imdbId" : "0485301",
  "season" : "4",
  "episodeNumber" : "8",
  "title" : "Miracle Day: End of the Road",
  "description" : "The team is taken to see Olivia Colisanto, in whose house her grandfather, Angelo, ancient and comatose, lies on a life support machine. She explains that in 1928 three mobster families, named Ablemarch, Costerdane and Frines, tapped Jack's blood to gain immortality - the Blessing. Those families have now disappeared but seem to hold the key to Miracle Day. Angelo dies, baffling new CIA boss Shapiro, who deports Gwen. Jack finds a link between Angelo's death and a plate containing a mysterious force field under his floor. He gets Esther to take it and him to safety ..."
}, {
  "imdbId" : "0485301",
  "season" : "4",
  "episodeNumber" : "9",
  "title" : "Miracle Day: The Gathering",
  "description" : "Whilst the CIA look in vain for traces of the three families, Esther somehow gets Jack to Scotland,from where they join Gwen and her family in Wales - as,rather surprisingly - does Oswald Danes,claiming he wants to be helpful. He has stolen Jilly Kitzinger's computer,which shows her to be going to Shanghai. After the police have raided Gwen's house and taken her father she sets out with Oswald and Jack to Shanghai,where Jilly is meeting a woman called Mother Colasanto. Esther and Rex pursue a lead in South America."
}, {
  "imdbId" : "0485301",
  "season" : "4",
  "episodeNumber" : "10",
  "title" : "Miracle Day: The Blood Line",
  "description" : "An underground bloodline flows from Buenos Aires in South America to Shanghai, where Mother Colisanto shows Jilly that she is planning to blow up her hide-out whilst the Blessing maintains its immortality. In Buenos Aires an explosion kills Rex and Esther's army escort, as they become aware of a CIA mole whom they allow to believe they are dead. They are nonetheless caught and taken to the South American lair of the Mother's cousin, where the other half of the Blessing is kept. Gwen, Oswald and Jack infiltrate the Shanghai hideaway where they learn how the families, ..."
}]