[{
  "imdbId" : "1494191",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Chapter 1: World War Two",
  "description" : "The Untold History of the United States examines World War II. It offers special attention to the Spanish Civil War, Roosevelt's desire to enter the war on the side of the allies, the strategic Japanese decisions that lead up to Pearl Harbor Attack, and the often overlooked role that the Soviet Union had in winning the war."
}, {
  "imdbId" : "1494191",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Chapter 2: Roosevelt, Truman and Wallace",
  "description" : "The Untold History of the United States examines the end of and the period immediately after World War II. It looks at Stalin's efforts to seize control of Poland and Eastern Europe, Democratic part bosses efforts to drop Henry Wallace from the 1944 presidential ticket, and British efforts to maintain their colonial holdings after the war."
}, {
  "imdbId" : "1494191",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Chapter 3: The Bomb",
  "description" : "This chapter examines the end of the II World War mainly the events leading to the drop of the atomic bombs and the surrender of Japan. Focuses on the Truman period of American history and the frequently forgotten Henry A. Wallace."
}, {
  "imdbId" : "1494191",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Chapter 4: The Cold War 1945-1950",
  "description" : "Who started the Cold War? In a month-by-month analysis, the initial aggressors are less apparent. Yet, the relationship between the Soviets and the West are none-the-less solidified with Churchill's Iron Curtain speech. The US enters the 'Red Scare' and creates The House Un-American Activities Committee in an attempt to place the 'right' ideology as a bedrock for US culture. The rise of Joseph McCarthy, with the aid of the FBI, turns into a near witch hunt for Communists in America."
}, {
  "imdbId" : "1494191",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Chapter 5: The 50s - Eisenhower, the Bomb & the Third World",
  "description" : "Documentary by Oliver Stone. E.5: Eisenhower and the CIA played a great part in the shaping of the world in the 1950's;the development of the Cold war and the nerve-wrecking battle against communism, driven on by the U.S."
}, {
  "imdbId" : "1494191",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Chapter 6: JFK - To the Brink",
  "description" : "Know what this is about?"
}, {
  "imdbId" : "1494191",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Chapter 7: Johnson, Nixon & Vietnam: Reversal of Fortune",
  "description" : "The hellish nature of the Vietnam War causes the American public to see the limits of modern military power, when faced with thick jungles and guerrilla style warfare. Richard Nixon's administration shows it's true methods and causes deep introspection in the American political atmosphere."
}, {
  "imdbId" : "1494191",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Chapter 8: Reagan, Gorbachev & Third World - Rise of the Right",
  "description" : "With the replacement of Ronald Reagan after Carter, the relationship between Mikhail Gorbachev and Ronald Reagan offers new attempts at peace as the Berlin wall crashes down. Fears surface as Iranian students occupy the US embassy in Tehran and the event turns into The Iran hostage crisis."
}, {
  "imdbId" : "1494191",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "Chapter 9: Bush & Clinton - Squandered Peace and New World Order",
  "description" : "The US invasion of Panama canal brings about a failed chance at peace after the end of the Cold War. How far is the George W. Bush administration willing to go to establish security? A new prospect of 'endless war' in Iraq and Afghanistan causes a shift in America's status with the world."
}, {
  "imdbId" : "1494191",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "Chapter 10: Bush & Obama - Age of Terror",
  "description" : "Know what this is about?"
}, {
  "imdbId" : "1494191",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "Prologue: Chapter A - World War I, the Russian Revolution & Woodrow Wilson",
  "description" : "Know what this is about?"
}, {
  "imdbId" : "1494191",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "Prologue: Chapter B - 1920-1940, Franklin D.Roosevelt, Adolf Hitler and Joseph Stalin",
  "description" : "Know what this is about?"
}]
