[{
  "imdbId" : "0805666",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Pilot",
  "description" : "An arrogant big-shot defense attorney is guilt-ridden after the client he just helped get off commits another murder, so he decides to become a prosecutor."
}, {
  "imdbId" : "0805666",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "LAPD Blue",
  "description" : "Stark prosecutes a drug dealer accused of killing an undercover police officer. However, the defense attorney in the case once worked for Stark's old law firm but was fired."
}, {
  "imdbId" : "0805666",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Dr. Feelbad",
  "description" : "The office prosecutes a prominent doctor accused of killing his wife. However, the case rides on the testimony of his young son, who may be afraid to tell the truth and convict his dad."
}, {
  "imdbId" : "0805666",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Russo",
  "description" : "When the prosecutors' evidence in a murder trial is ruled inadmissible, they are forced to turn to the testimony of an unscrupulous private investigator--a man who has an uneasy past with Stark from his days as a defense attorney."
}, {
  "imdbId" : "0805666",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "In the Grasp",
  "description" : "A rape case against three star college football players is in jeopardy of falling apart when the victim admits that she had consensual sex with one of them on the same day as the incident."
}, {
  "imdbId" : "0805666",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Fashion Police",
  "description" : "The office is told to go after a sweat shop owner after an electrical fire kills four people. But since Martin feels so strongly about the case, they instead go after the clothing manufacturer that hired him."
}, {
  "imdbId" : "0805666",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Déjà Vu All Over Again",
  "description" : "Stark wants to try a suspect in a child murder for a similar murder from 15 years ago. He lost the original case as a defense attorney, and has always believed his original client was innocent."
}, {
  "imdbId" : "0805666",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Love Triangle",
  "description" : "The office prosecutes a white teenage girl for the hit-and-run death of an African American girl who was involved with her boyfriend."
}, {
  "imdbId" : "0805666",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "Dial M for Monica",
  "description" : "Stark prosecutes an expensive Hollywood madam for ordering a hit on one of her former prostitutes, and she responds by releasing a book of her clients which includes his name."
}, {
  "imdbId" : "0805666",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "Sins of the Mother",
  "description" : "An L.A. socialite goes on trial for killing an ex-con, and Stark's investigation reveals some shocking information about the woman's past and true identity."
}, {
  "imdbId" : "0805666",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "The Wrath of Khan",
  "description" : "Stark and Devlin butt heads with the Feds over jurisdiction of an arms dealer's case, but with cops dead and hostages, Stark takes matters into his own hands."
}, {
  "imdbId" : "0805666",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "Wayne's World",
  "description" : "Shark goes up against a serial killer, but the conviction may not be as easy as he thinks and may put his daughter in danger."
}, {
  "imdbId" : "0805666",
  "season" : "1",
  "episodeNumber" : "13",
  "title" : "Teacher's Pet",
  "description" : "Stark tries to get back on his feet after losing his first case as a prosecutor by going after a prep school art teacher who may have been having inappropriate relations with the son of a murder victim."
}, {
  "imdbId" : "0805666",
  "season" : "1",
  "episodeNumber" : "14",
  "title" : "Starlet Fever",
  "description" : "A teen actress is killed after another car runs hers off the road, and her agent/legal guardian becomes the prime murder suspect."
}, {
  "imdbId" : "0805666",
  "season" : "1",
  "episodeNumber" : "15",
  "title" : "Here Comes the Judge",
  "description" : "Stark takes on a judge accused of murdering his wife, but he has an adversarial history with Stark and a secret to hide from the investigation."
}, {
  "imdbId" : "0805666",
  "season" : "1",
  "episodeNumber" : "16",
  "title" : "Blind Trust",
  "description" : "A good friend of Sebastian asks him a huge favor when an intern from his company is found dead."
}, {
  "imdbId" : "0805666",
  "season" : "1",
  "episodeNumber" : "17",
  "title" : "Backfire",
  "description" : "The DA's office investigates a police shooting involving a drug dealer. The case could potentially set off a racial powder keg, and Stark suspects a cover-up when the police officers involved keep changing their stories."
}, {
  "imdbId" : "0805666",
  "season" : "1",
  "episodeNumber" : "18",
  "title" : "Trial by Fire",
  "description" : "When Stark and Raina are taken hostage in the midst of a death-penalty trial, even his smoothest moves are countered by a criminal who seems to have more influence over the kidnapper than he does."
}, {
  "imdbId" : "0805666",
  "season" : "1",
  "episodeNumber" : "19",
  "title" : "Porn Free",
  "description" : "Stark has to prosecute the owner of a women's shelter accused of killing an unscrupulous, despicable porn producer. Based on the evidence, Stark works on the theory that the two men may have been in business together."
}, {
  "imdbId" : "0805666",
  "season" : "1",
  "episodeNumber" : "20",
  "title" : "Fall from Grace",
  "description" : "Stark goes up against an old protégée when he prosecutes two mob-types for the murder of a university professor, and she seems to have the inside scoop when it comes to the goings-on in the DA's office."
}, {
  "imdbId" : "0805666",
  "season" : "1",
  "episodeNumber" : "21",
  "title" : "Strange Bedfellows",
  "description" : "Stark goes after a single man who may have abducted a young boy who has been living with him for several years. But the boy doesn't want to be back with his parents, and there may be signs of abuse."
}, {
  "imdbId" : "0805666",
  "season" : "1",
  "episodeNumber" : "22",
  "title" : "Wayne's World 2: Revenge of the Shark",
  "description" : "Stark gets a second opportunity to prosecute Wayne Callison for murder, but his stubborn determination to get a conviction no matter what gets him forcibly removed from the case."
}]