[{
  "imdbId" : "0057798",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Eleven Days to Zero",
  "description" : "In exactly eleven days there will be a terrible polar earthquake. The resulting tidal wave could destroy civilization. The Seaview is dispatched for damage control. Certain enemy forces also go there to upset the Seaview's mission."
}, {
  "imdbId" : "0057798",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "The City Beneath the Sea",
  "description" : "A research vessel vanishes during a routine mission near an island off Greece. Another ship is sent to investigate, and also disappears without a trace. Now the Seaview pays a visit. They find nothing, but a local fisherman claims to know of a 'city beneath the sea'."
}, {
  "imdbId" : "0057798",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "The Fear-Makers",
  "description" : "The Seaview continues the secret underwater explorations that another sub was on when it mysteriously disappeared."
}, {
  "imdbId" : "0057798",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "The Mist of Silence",
  "description" : "The Seaview arrives at an ocean rendezvous to pick up a Latin-American president, but the ship it meets is empty."
}, {
  "imdbId" : "0057798",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "The Price of Doom",
  "description" : "A scientist on a research facility in Antarctica discovers a new form of sea plankton that turns monstrously large and aggressive if exposed to heat. After the scientist mysteriously disappears, the Seaview is sent in to investigate."
}, {
  "imdbId" : "0057798",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "The Sky Is Falling",
  "description" : "A U. F. O. has been spotted flying around the United States, terrifying people and violating every airspace regulation in the book. It falls into the sea, which, after another ship is destroyed investigating it, the Seaview is ordered to check it out."
}, {
  "imdbId" : "0057798",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Turn Back the Clock",
  "description" : "Nine months ago a diving bell was lost with four men aboard during an Antarctic expedition. One man, Jason Kemp, is found alive. He is suffering from amnesia and can't remember anything after the dive. Nelson thinks he may be suffering from shock as he rambles on about a tropical land filled with monsters. Kemp and Carol Denning, an underwater photographer and the daughter of one of the missing men, joins the Seaview and returns to the place where the bell was lost. Their bell suffers the same fate and Nelson, Crane, Kemp and Carol Denning somehow find themselves ..."
}, {
  "imdbId" : "0057798",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "The Village of Guilt",
  "description" : "In the Fjords of a small Norwegian fishing village a small boat manned by three drunken fishermen is attacked by what appears to be a giant sea monster. When Admiral Nelson hears of this he is fascinated by it and takes the Seaview to the Norway to investigate and interview the one survivor. The villagers are not happy to see them and reluctant to talk and answer questions. Someone is so desperate to keep their silence that the survivor is murdered before he could talk. With no one willing to talk Nelson is preparing to leave when they discover evidence of giant sea ..."
}, {
  "imdbId" : "0057798",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "Hot Line",
  "description" : "The Soviets have launched a rocket carrying a new satellite to be placed in orbit around the Earth. Everything is proceeding normally when they lose control of the rocket and their power to abort it. The rocket with its nuclear pile will fall back to Earth and splashdown near the San Franciscan coast. The Seaview is ordered to pick up two Russian missile experts and find the rocket and disarm the nuclear pile before detonation."
}, {
  "imdbId" : "0057798",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "Submarine Sunk Here",
  "description" : "Chip Morton and Curley Jones are in New London making repairs on the diving bell's guidance system. At the same time a skirmish in the control room of the Seaview sails directly into a derelict mine field. The sub becomes entangled and attempts to free it send it to the bottom. With their air running out the diving bell is their only hope."
}, {
  "imdbId" : "0057798",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "The Magnus Beam",
  "description" : "Seaview is called on to investigate the mysterious crashes of several U-2 spy planes. They discover the cause is a magnetic beam of immense power. Then they discover that the beam is powerful enough to seize all the metal objects aboard Seaview herself, and begin dragging her relentlessly to her destruction. The only chance is to briefly neutralize the magnetic force and send a small party out to sabotage the ray at the source. The extremely well-guarded source..."
}, {
  "imdbId" : "0057798",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "No Way Out",
  "description" : "A very important Soviet official is defecting to the USA with his daughter. They are scheduled to be picked up in Indonesia by the Seaview. On the last leg of their escape, the official is wounded and the daughter is captured. With the official recovering in the sick bay, the Seaview now must either leave the daughter behind or make a rescue attempt. Time is running out, and dangerous agents are snooping around everywhere."
}, {
  "imdbId" : "0057798",
  "season" : "1",
  "episodeNumber" : "13",
  "title" : "The Blizzard Makers",
  "description" : "Winter in summer? Snow has struck the United States as far south as Florida, and Nelson knows why: somehow, the Gulf Stream has shifted east, permitting colder temperatures. Climatologist Dr. Melton can confirm Nelson's theory, so Nelson tries to persuade him to board the Seaview. But the sinister Cregar can't allow Nelson to uncover the truth, so he has Melton kidnapped and brainwashed - to kill Nelson! Nelson must evade attempts on his life while discovering why the Gulf Stream shifted position and figuring out what to do about it."
}, {
  "imdbId" : "0057798",
  "season" : "1",
  "episodeNumber" : "14",
  "title" : "The Ghost of Moby Dick",
  "description" : "Whale specialist Walter Bryce has taken his family to sea in pursuit of the largest living creature ever to exist, an immense whale twice the size of the previously known largest creature to exist! He wants metabolic data, including heart rate; to get it, he harpoons the whale with a special sensor. The enraged animal destroys the Bryce boat, killing Walter's son Jimmy and crippling Walter. After recovering, Walter seeks out Nelson and Seaview to continue his research - but does he have an ulterior motive?"
}, {
  "imdbId" : "0057798",
  "season" : "1",
  "episodeNumber" : "15",
  "title" : "Long Live the King",
  "description" : "The assassination of a king means Prince Ang receives an early promotion. The new king is just a boy, and has a lot to learn about ruling. In fact, he has a lot to learn about everything. He has advisers, but one of them may be trying to kill him, to finish off the royal line. Nelson and Seaview must get the prince back home so he may take the throne and prevent a coup from leaving an unfriendly government in power. Fortunately, a mysterious sailor, Old John, appears along their way and helps the young prince. But exactly who is Old John?"
}, {
  "imdbId" : "0057798",
  "season" : "1",
  "episodeNumber" : "16",
  "title" : "Hail to the Chief",
  "description" : "President Henry McNeil has fallen and seriously injured his head. That imperils an upcoming peace conference; even a whiff of the president's incapacity may doom it, as he is the one man who can hold it together. Everything depends on a delicate operation to relieve the swelling in his brain. To keep that operation a secret, the Navy co-opts the Seaview. But enemies of the conference have learned of the president's ill health, and manage to smuggle an agent aboard Seaview with orders to kill McNeil!"
}, {
  "imdbId" : "0057798",
  "season" : "1",
  "episodeNumber" : "17",
  "title" : "The Last Battle",
  "description" : "Admiral Nelson is kidnapped by a group of Nazis trying to re-establish the Reich after WW2. They want Nelson to be in charge of their underwater projects."
}, {
  "imdbId" : "0057798",
  "season" : "1",
  "episodeNumber" : "18",
  "title" : "Mutiny",
  "description" : "Admiral Nelson is aboard a new submarine when it is destroyed by a giant jellyfish. Nelson and the first officer are the only survivors. The two men begin a desperate battle for survival while being presumed lost at sea by the navy."
}, {
  "imdbId" : "0057798",
  "season" : "1",
  "episodeNumber" : "19",
  "title" : "Doomsday",
  "description" : "The Seaview is on exercises when a series of signals are received indicating the USA is at war and they are to prepare for launch of all missiles."
}, {
  "imdbId" : "0057798",
  "season" : "1",
  "episodeNumber" : "20",
  "title" : "The Invaders",
  "description" : "An undersea earthquake exhumes hundreds of strange metallic capsules, and a powerful humanoid creature who could destroy mankind is restored to life after millions of years in suspended animation."
}, {
  "imdbId" : "0057798",
  "season" : "1",
  "episodeNumber" : "21",
  "title" : "The Indestructible Man",
  "description" : "The Seaview is tasked with recovering a returned deep space probe. On board the probe is a robot as sophisticated as a man, and capable of experiencing everything a human can."
}, {
  "imdbId" : "0057798",
  "season" : "1",
  "episodeNumber" : "22",
  "title" : "The Buccaneer",
  "description" : "The Seaview is seized by a man calling himself the \"Buccaneer. As audacious as his plan is, it is only a small piece in a much larger plan."
}, {
  "imdbId" : "0057798",
  "season" : "1",
  "episodeNumber" : "23",
  "title" : "The Human Computer",
  "description" : "The Seaview is selected to be converted to a totally automatic ship controlled by a central computer. The mission goes well till Capt. Crane, the only person aboard the sub, realizes he may not be as alone as he thought."
}, {
  "imdbId" : "0057798",
  "season" : "1",
  "episodeNumber" : "24",
  "title" : "The Saboteur",
  "description" : "Crane is brainwashed to sabotage an important national defense mission which is being monitored by the national intelligence agency."
}, {
  "imdbId" : "0057798",
  "season" : "1",
  "episodeNumber" : "25",
  "title" : "Cradle of the Deep",
  "description" : "The Seaview is sent on a mission that will take into to some of the most dangerous waters in the world for submarines. Adding to the tension one of the officers lost an elder brother on a similar mission years before."
}, {
  "imdbId" : "0057798",
  "season" : "1",
  "episodeNumber" : "26",
  "title" : "The Amphibians",
  "description" : "Admiral Nelson becomes involved in a project to develop an amphibian adaption for man. He encounters conflict with the two chief scientists, rather than being cautious, both scientist want to rush ahead with research. Nelson worries what the emotional toll of the experiments may be."
}, {
  "imdbId" : "0057798",
  "season" : "1",
  "episodeNumber" : "27",
  "title" : "The Exile",
  "description" : "A Soviet leader, with some very valuable information, wants to defect to the US. The Seaview is sent to pick him up, but Nelson must first evaluate the information before deciding if the mission worth the risk."
}, {
  "imdbId" : "0057798",
  "season" : "1",
  "episodeNumber" : "28",
  "title" : "The Creature",
  "description" : "When a missile is destroyed by apparent ultrasonic sound, the Seaview investigates with Adams, the mentally unstable launch commander, on board and finds an giant manta ray source which along with Adams' actions pose a threat to safety."
}, {
  "imdbId" : "0057798",
  "season" : "1",
  "episodeNumber" : "29",
  "title" : "The Enemies",
  "description" : "The Seaview is sent to investigate the wreck of the submarine Angler. They uncover evidence of strange behavior minutes before the loss, and Nelson sees this change in behavior as the secret to unlocking what happened to the Angler."
}, {
  "imdbId" : "0057798",
  "season" : "1",
  "episodeNumber" : "30",
  "title" : "The Secret of the Loch",
  "description" : "Nelson is to meet a scientist working on a secret project at Loch Ness. When he arrives he discovers the scientist is dead. A series of strange events leads Nelson to believe there may be a way for a submarine to enter the Loch."
}, {
  "imdbId" : "0057798",
  "season" : "1",
  "episodeNumber" : "31",
  "title" : "The Condemned",
  "description" : "This episode involves the testing of a new air mixture that will allow a submarine to go to the \"bottom of the sea\" literally! A brash, news hogging, admiral and his aide, along with his assistant all successfully make the first tests in a diving bell. Then it is time for the Seaview to follow suit. Only then does the real fun begin!"
}, {
  "imdbId" : "0057798",
  "season" : "1",
  "episodeNumber" : "32",
  "title" : "The Traitor",
  "description" : "Admiral Nelson is deeply concerned when he hears his sister has been kidnapped. He soon discovers she was not the real target and he is being placed in a position to have to go against everything he ever stood for."
}, {
  "imdbId" : "0057798",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "Jonah and the Whale",
  "description" : "Admiral Nelson and a Soviet scientist are in a diving bell when the vessel is swallowed by a giant whale. With only 90 minutes of oxygen, Captain Crane, Kowalski, and Riley swim into the whale's mouth to attempt a harrowing rescue."
}, {
  "imdbId" : "0057798",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "Time Bomb",
  "description" : "The Chinese have developed a way to turn a human body into an intense bomb. They intend to infiltrate the Soviet Union and create a diplomatic incident that will draw the US and Soviets in nuclear annihilation."
}, {
  "imdbId" : "0057798",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "...And Five of Us Are Left",
  "description" : "A message is received from a US sub presumed sunk in the last months of WW2. The Seaview is sent to try and locate a cave that is mentioned in the message and to try and rescue the 5 men believed to be still alive."
}, {
  "imdbId" : "0057798",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "The Cyborg",
  "description" : "Captain Crane is in Venice to meet a secret agent when she is killed. It is believed she had knowledge of a new secret Soviet weapon, and how to combat it. Crane's mission is made more complex when he is accused of the agents death."
}, {
  "imdbId" : "0057798",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "Escape from Venice",
  "description" : "Captain Crane is in Venice to meet a secret agent when she is killed. It is believed she had knowledge of a new secret Soviet weapon, and how to combat it. Crane's mission is made more complex when he is accused of the agents death."
}, {
  "imdbId" : "0057798",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "The Left-Handed Man",
  "description" : "Admiral Nelson is contacted by a strange man claiming to be from the Office Of Naval Intelligence. He gives Nelson a cryptic message that Penfield is not to be allowed to become Secretary of the Navy."
}, {
  "imdbId" : "0057798",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "The Deadliest Game",
  "description" : "The President of the United States is visiting a new underwater installation when a power interruption freezes all communication. To complicate the situation they discover there is some sort of beam weapon stopping any of the safety over-ride mechanisms from activating."
}, {
  "imdbId" : "0057798",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "Leviathan",
  "description" : "A research team are taking measurements of an underwater eruption. They discover a fissure that appears to lead all the way to the Earth's core. While the discovery is exciting, what exists in that fissure could lead to deadly consequences."
}, {
  "imdbId" : "0057798",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "The Peacemaker",
  "description" : "Nelson and the Seaview witness the detonation of a new bomb developed by the Chinese. No bigger than a milk carton it creates a blast 70 miles across. An American scientist who had defected to the other side steals it for plans of his own."
}, {
  "imdbId" : "0057798",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "The Silent Saboteurs",
  "description" : "A manned probe is returning to Earth when it is suddenly caught in the grip of a strange force and destroyed. Investigations point to a secret Chinese installation being responsible. Capt Crane is tasked with locating the base and destroying it."
}, {
  "imdbId" : "0057798",
  "season" : "2",
  "episodeNumber" : "11",
  "title" : "The X Factor",
  "description" : "Word comes through that Dr Liscomb has been kidnapped by a foreign agent posing as a toy importer. Liscomb has cracked the secret of the X factor, a new ingredient and everyone wants it."
}, {
  "imdbId" : "0057798",
  "season" : "2",
  "episodeNumber" : "12",
  "title" : "The Machines Strike Back",
  "description" : "Admiral Nelson is under pressure when a drone sub system he pioneered malfunctions and fires three missiles at New York City. The race is on to establish what went wrong and how to stop it happening again."
}, {
  "imdbId" : "0057798",
  "season" : "2",
  "episodeNumber" : "13",
  "title" : "The Monster from Outer Space",
  "description" : "In 1978, the first space probe to Saturn returns and the Seaview is sent to retrieve it. Despite their stringent decontamination procedures an alien life form survives and, once inside, begins to take over the ship."
}, {
  "imdbId" : "0057798",
  "season" : "2",
  "episodeNumber" : "14",
  "title" : "Terror on Dinosaur Island",
  "description" : "Admiral Nelson and Chief Starkey are marooned on an island with prehistoric creatures. The Seaview is trying to rescue them but they have an undersea monster of their own to contend with."
}, {
  "imdbId" : "0057798",
  "season" : "2",
  "episodeNumber" : "15",
  "title" : "Killers of the Deep",
  "description" : "By air Nelson and Crane pursue a mysterious submarine stealing nuclear missiles. Their craft is shot down and Crane is captured. Nelson, recovered by a Navy destroyer, is bent on destroying the sub, not realizing Crane is on board."
}, {
  "imdbId" : "0057798",
  "season" : "2",
  "episodeNumber" : "16",
  "title" : "Deadly Creature Below!",
  "description" : "The Seaview rescues two men apparently lost at sea. They are actually escaped prisoners who try to take over the Seaview. The situation is complicated by the presence of a giant sea monster attacking the ship."
}, {
  "imdbId" : "0057798",
  "season" : "2",
  "episodeNumber" : "17",
  "title" : "The Phantom Strikes",
  "description" : "The Seaview finds a sunken German U-boat while mapping the ocean floor. Sunk during WWI in the north Atlantic, it is now somehow in the south Pacific. Its captain boards the Seaview with Capt. Crane as his prey."
}, {
  "imdbId" : "0057798",
  "season" : "2",
  "episodeNumber" : "18",
  "title" : "The Sky's on Fire",
  "description" : "A meteor storm ignites atmospheric gases in the southern hemisphere. Adm. Nelson believes one of the Seaview's missiles can extinguish it but someone on board is secretly trying to stop him."
}, {
  "imdbId" : "0057798",
  "season" : "2",
  "episodeNumber" : "19",
  "title" : "Graveyard of Fear",
  "description" : "The Seaview is returning to the location of a sunken ship to recover its secret cargo. There are a number of other sunken ships in the area, and the thing responsible for all of them soon threatens the Seaview."
}, {
  "imdbId" : "0057798",
  "season" : "2",
  "episodeNumber" : "20",
  "title" : "The Shape of Doom",
  "description" : "The construction of an undersea canal is about to start with the Seaview tasked with placing the first charge, a 50 megaton nuclear bomb. But as it is being lowered an enormous whale swallows it and swims off."
}, {
  "imdbId" : "0057798",
  "season" : "2",
  "episodeNumber" : "21",
  "title" : "Dead Men's Doubloons",
  "description" : "While operating over the remains of a sunken 16th century pirate ship, the Seaview encounters a reincarnation of its dead captain."
}, {
  "imdbId" : "0057798",
  "season" : "2",
  "episodeNumber" : "22",
  "title" : "The Death Ship",
  "description" : "Everyone but Nelson and Crane are removed from the Seaview and replaced by 8 civilians to test new equipment. One of them is a foreign agent who wants to kill everyone on board and use the ship to provoke an incident and start a war."
}, {
  "imdbId" : "0057798",
  "season" : "2",
  "episodeNumber" : "23",
  "title" : "The Monster's Web",
  "description" : "A test submarine carrying a load of experimental fuel is disabled and lying on the ocean floor. The Seaview is sent to recover the volatile fuel canisters but an enormous underwater spider threatens to destroy them."
}, {
  "imdbId" : "0057798",
  "season" : "2",
  "episodeNumber" : "24",
  "title" : "The Menfish",
  "description" : "While Adm. Nelson is away, Capt. Crane tries to prevent Dr. Borgman from implanting human DNA into marine animals to create a new type of undersea creature."
}, {
  "imdbId" : "0057798",
  "season" : "2",
  "episodeNumber" : "25",
  "title" : "The Mechanical Man",
  "description" : "While assisting an undersea drilling operation, Capt. Crane and the Seaview become locked in a life-and-death struggle with an android, powered by a new source of limitless energy, Subterranium 116."
}, {
  "imdbId" : "0057798",
  "season" : "2",
  "episodeNumber" : "26",
  "title" : "The Return of the Phantom",
  "description" : "Captain Krueger returns and once again wants Captain Crane's body. He threatens to kill everyone on the Seaview if Admiral Nelson doesn't shoot Crane and deliver his body to him."
}, {
  "imdbId" : "0057798",
  "season" : "3",
  "episodeNumber" : "1",
  "title" : "Monster from the Inferno",
  "description" : "A strange intelligent organism is found at the bottom of the ocean. Once brought on Seaview the real threat the creature represents is realized. Suddenly every life on board the Seaview is in danger."
}, {
  "imdbId" : "0057798",
  "season" : "3",
  "episodeNumber" : "2",
  "title" : "Werewolf",
  "description" : "Scientists on a tropical island are measuring the radioactivity of a volcano when they are attacked by a wolf. Prof. Hollis shows signs of lycanthropy and threatens everyone on board, especially Admiral Nelson, whom he has infected."
}, {
  "imdbId" : "0057798",
  "season" : "3",
  "episodeNumber" : "3",
  "title" : "The Day the World Ended",
  "description" : "After the arrival of a newly elected U.S. Senator to inspect Admiral Nelson's new weapon, strange things begin to happen, culminating with the realization that everyone outside of the Seaview appears to have disappeared from the Earth."
}, {
  "imdbId" : "0057798",
  "season" : "3",
  "episodeNumber" : "4",
  "title" : "Night of Terror",
  "description" : "The Seaview's diving bell is driven by a tsunami onto a tropical island where a mysterious mist causes the survivors to see imaginary people and creatures."
}, {
  "imdbId" : "0057798",
  "season" : "3",
  "episodeNumber" : "5",
  "title" : "The Terrible Toys",
  "description" : "An old man, adrift at sea, is rescued along with a sack of toys by the Seaview. The toys take on a life of their own and begin to sabotage the ship. The toys appear to be connected to an alien space ship lying on the ocean floor."
}, {
  "imdbId" : "0057798",
  "season" : "3",
  "episodeNumber" : "6",
  "title" : "Day of Evil",
  "description" : "An alien being, capable of impersonating any member of the crew, gets on board the Seaview. He plans to use the Seaview's missiles to start a nuclear war and thereby make the Earth ready for conquest."
}, {
  "imdbId" : "0057798",
  "season" : "3",
  "episodeNumber" : "7",
  "title" : "Deadly Waters",
  "description" : "An emergency mission leads the Seaview to rescue Kowalski's brother Stan. Once on board, Stan's refusal to help anyone else threatens the sub's survival after it sinks to the ocean floor, a thousand feet below it's crush limit."
}, {
  "imdbId" : "0057798",
  "season" : "3",
  "episodeNumber" : "8",
  "title" : "Thing from Inner Space",
  "description" : "A controversial filmmaker's crew is killed by a creature on a remote island. The Seaview goes to investigate the incident. One of the crewmen has a special interest in the mission as his father was one of the victims."
}, {
  "imdbId" : "0057798",
  "season" : "3",
  "episodeNumber" : "9",
  "title" : "The Death Watch",
  "description" : "Admiral Nelson wanders the Seaview and finds it abandoned except for Captain Crain and Chief Sharkey. He has no memory of what happened before or what the strange sounds over the intercom mean. Capt. Crane is also trying to kill him."
}, {
  "imdbId" : "0057798",
  "season" : "3",
  "episodeNumber" : "10",
  "title" : "Deadly Invasion",
  "description" : "Space aliens led by an entity which takes the form of a deceased WW2 officer acquaintance of Nelson's invade the Seaview, intending to reactivate an underwater atomic base to acquire its energy."
}, {
  "imdbId" : "0057798",
  "season" : "3",
  "episodeNumber" : "11",
  "title" : "The Haunted Submarine",
  "description" : "Strange sounds and events begin to be reported on board the sub. While still coming to grips with the crews edginess, the Seaview encounters a strange 17th century warship that fires on the sub."
}, {
  "imdbId" : "0057798",
  "season" : "3",
  "episodeNumber" : "12",
  "title" : "The Plant Man",
  "description" : "A scientist in an underwater sea lab has created a new form of plant life. His twin brother, who can control him telepathically, is on his way there via the Seaview, with plans of using the new plant creatures for his own sinister purposes."
}, {
  "imdbId" : "0057798",
  "season" : "3",
  "episodeNumber" : "13",
  "title" : "The Lost Bomb",
  "description" : "An unfriendly government shoots down a cargo plane carrying a new top secret bomb. The race is on to retrieve the bomb and avoid detection from the enemy before the bomb can be accidentally exploded."
}, {
  "imdbId" : "0057798",
  "season" : "3",
  "episodeNumber" : "14",
  "title" : "The Brand of the Beast",
  "description" : "While racing to the aid of a ship the Seaview suffers a critical engine failure. While doing repairs Admiral Nelson suffers a critical dose of radiation which affects him in a most unexpected way."
}, {
  "imdbId" : "0057798",
  "season" : "3",
  "episodeNumber" : "15",
  "title" : "The Creature",
  "description" : "While on a routine scientific expedition Capt Crane encounters a strange hybrid seaweed humanoid creature. Crane is captured by the creature and the crew of Seaview launch a desperate attempt to rescue Crane before his air runs out."
}, {
  "imdbId" : "0057798",
  "season" : "3",
  "episodeNumber" : "16",
  "title" : "Death from the Past",
  "description" : "The Seaview encounters a strange structure on the sea floor. Investigating they discover a German submarine from WW2. Surviving Germans on-board think the war is still being fought. And they have weapons on-board of unimaginable destructive power."
}, {
  "imdbId" : "0057798",
  "season" : "3",
  "episodeNumber" : "17",
  "title" : "The Heat Monster",
  "description" : "A Norwegian scientific installation makes contact with an alien intelligence. The Seaview goes to investigate and ends up in a life and death struggle after the alien invades the sub."
}, {
  "imdbId" : "0057798",
  "season" : "3",
  "episodeNumber" : "18",
  "title" : "The Fossil Men",
  "description" : "While on routine patrol the Seaview begins to hear strange noises coming from an undersea canyon. Investigating they discover the source of the noise and the power behind the destruction of a British fleet in the area 200 years before."
}, {
  "imdbId" : "0057798",
  "season" : "3",
  "episodeNumber" : "19",
  "title" : "The Mermaid",
  "description" : "Captain Crane discovers and captures a real mermaid. Everyone is interested in what the specimen might reveal until its mate turns up looking for revenge."
}, {
  "imdbId" : "0057798",
  "season" : "3",
  "episodeNumber" : "20",
  "title" : "The Mummy",
  "description" : "The Seaview is tasked with transporting a Mummy from New York for special secret testing. It becomes apparent very quickly not all is as it should seem, and soon a terrible threat is unleashed on the crew of Seaview."
}, {
  "imdbId" : "0057798",
  "season" : "3",
  "episodeNumber" : "21",
  "title" : "Shadowman",
  "description" : "The Seaview is tasked with attempting a space probe launch from sea. To avoid interference a skeleton crew is manning the ship. While en route the ship encounters a strange object that unleashes a threat that could destroy Seaview and all on board"
}, {
  "imdbId" : "0057798",
  "season" : "3",
  "episodeNumber" : "22",
  "title" : "No Escape from Death",
  "description" : "While on patrol the Seaview is attacked and badly damaged by an unknown submarine. As the crew frantically work to save the vessel and themselves an even greater menace appears."
}, {
  "imdbId" : "0057798",
  "season" : "3",
  "episodeNumber" : "23",
  "title" : "Doomsday Island",
  "description" : "The Seaview is following up reports of a strange island being sighted when it discovers a strange egg on the ocean floor. Everyone is puzzled and excited by the find until it hatches on board."
}, {
  "imdbId" : "0057798",
  "season" : "3",
  "episodeNumber" : "24",
  "title" : "The Wax Men",
  "description" : "The Seaview is tasked with moving a series of crates supposed to contain statues dating from the time of Atlantis. Something far more sinister is in the crates and Capt Crane is the only one in a position to save the ship."
}, {
  "imdbId" : "0057798",
  "season" : "3",
  "episodeNumber" : "25",
  "title" : "Deadly Cloud",
  "description" : "The Seaview investigates a strange cloud that seems to be the source of immense destruction around the world. The world has only 24 hours to live unless Seaview can crack the secret."
}, {
  "imdbId" : "0057798",
  "season" : "3",
  "episodeNumber" : "26",
  "title" : "Destroy Seaview!",
  "description" : "Crane and the Admiral are on a mission to secure a new element that could be used to control the world. While exploring an undersea cave events occur that leave the admiral as the only survivor of the expedition and a changed man."
}, {
  "imdbId" : "0057798",
  "season" : "4",
  "episodeNumber" : "1",
  "title" : "Fires of Death",
  "description" : "The Seaview is sent to stop an active volcano from erupting and causing a catastrophe. Accompanying them is Dr. Turner who's suppose to help them. But it turns out he has a different plan and that is to make the volcano erupt so he can acquire something that will make him immortal."
}, {
  "imdbId" : "0057798",
  "season" : "4",
  "episodeNumber" : "2",
  "title" : "The Deadly Dolls",
  "description" : "A puppeteer comes on board to entertain the crew. But it is later revealed that his puppets are alive and they plan to take over the sub. That's when they replace the crew members with duplicates. Only Nelson and Crane are left to try and stop them."
}, {
  "imdbId" : "0057798",
  "season" : "4",
  "episodeNumber" : "3",
  "title" : "Cave of the Dead",
  "description" : "When four capital ships vanish, Admiral Nelson and Commander Van Wyck are sent to investigate. They find an island where Nelson removes a dagger from a skeleton which happens to be the captain of the Amsterdammer, the Flying Dutchman, and is then cursed. Van Wyck is in reality the first mate who killed the Captain. His plan is to kill Nelson with the dagger so that he can be free and Nelson will take his place."
}, {
  "imdbId" : "0057798",
  "season" : "4",
  "episodeNumber" : "4",
  "title" : "Journey with Fear",
  "description" : "Aliens from the planet Centaur bring a capsule containing Commander Morton to Venus. They want to keep earth from invading their planet and kidnap Captain Crane in an attempt to bring the Seaview to their planet."
}, {
  "imdbId" : "0057798",
  "season" : "4",
  "episodeNumber" : "5",
  "title" : "Sealed Orders",
  "description" : "When a top secret Neutron Bomb begins leaking radiation, Seaview crew men begin disappearing and those who haven't begin seeing things. The Seaview is racing the clock to fire or disarm the missile before it explodes."
}, {
  "imdbId" : "0057798",
  "season" : "4",
  "episodeNumber" : "6",
  "title" : "Man of Many Faces",
  "description" : "Admiral Nelson and Captain Crane are shocked to see a scientist shot to death during a live televised news conference viewed from the Nelson Institute. Especially shocking is that the killer appears to be Admiral Nelson. Both Nelson and Crane are eventually able to overcome efforts to stop them from boarding the Seaview. The submarine races to stop an earth-threatening project set in motion by the radical scientist, who may not really be dead after all. In the meantime, a very dangerous master of disguise causes mayhem and confusion as he tries to stop the Seaview ..."
}, {
  "imdbId" : "0057798",
  "season" : "4",
  "episodeNumber" : "7",
  "title" : "Fatal Cargo",
  "description" : "A scientist friend of Nelson has developed a device to control a rare white ape. The scientist's jealous assistant causes the beast to kill the scientist and the ape runs wild after being brought aboard Seaview causing destruction."
}, {
  "imdbId" : "0057798",
  "season" : "4",
  "episodeNumber" : "8",
  "title" : "Time Lock",
  "description" : "A man named Alpha from 2823 sends 2 Collectors to bring Nelson to his time to add the Admiral to his collection of military officers. Chief Sharkey goes to the future to help while the Collectors wreak havoc on the Seaview."
}, {
  "imdbId" : "0057798",
  "season" : "4",
  "episodeNumber" : "9",
  "title" : "Rescue",
  "description" : "Captain Crane is attacked in the Flying Sub while looking for a mysterious sub pen. The Seaview's rescue attempts are hampered by a by a spy pretending to be one of the crew men."
}, {
  "imdbId" : "0057798",
  "season" : "4",
  "episodeNumber" : "10",
  "title" : "Terror",
  "description" : "An alien plant takes over Admiral Nelson in a plan to turn the Seaview into a giant greenhouse where it can take over the world."
}, {
  "imdbId" : "0057798",
  "season" : "4",
  "episodeNumber" : "11",
  "title" : "A Time to Die",
  "description" : "The crew of the Seaview encounter Mr. Pem who can control time. Pem sends Nelson back in time to force the Admiral to let Pem use the reactor to power his device."
}, {
  "imdbId" : "0057798",
  "season" : "4",
  "episodeNumber" : "12",
  "title" : "Blow Up",
  "description" : "While trying to stop a leaking nuclear missile, Nelson undergoes a personality change which endangers not only the Seaview, but the 11th Fleet."
}, {
  "imdbId" : "0057798",
  "season" : "4",
  "episodeNumber" : "13",
  "title" : "Deadly Amphibians",
  "description" : "While trying to find the cause of some underwater pressure blasts, the Seaview encounters a race of Amphibians and Kowalski is transformed into one of them."
}, {
  "imdbId" : "0057798",
  "season" : "4",
  "episodeNumber" : "14",
  "title" : "The Return of Blackbeard",
  "description" : "The original Blackbeard takes over some of the Seaview crew including Kowalski to blow up a ship carrying King Solomon's Golden Throne. The remaining crew try to find a way to disable Blackbeard's power source."
}, {
  "imdbId" : "0057798",
  "season" : "4",
  "episodeNumber" : "15",
  "title" : "Terrible Leprechaun",
  "description" : "The Seaview is sent to stop a warhead on the ocean floor from detonating. But a leprechaun wants it to go off. So he tries to stop them. But his good twin brother tries to help them stop him."
}, {
  "imdbId" : "0057798",
  "season" : "4",
  "episodeNumber" : "16",
  "title" : "The Lobster Man",
  "description" : "A lobster man arrives in a space craft claiming to be a friend but in reality he wants one of the nuclear rods to cause an explosion thus paving the way for an invasion."
}, {
  "imdbId" : "0057798",
  "season" : "4",
  "episodeNumber" : "17",
  "title" : "Nightmare",
  "description" : "Crane receives a Mayday from the Seaview and finds no one on board except a UFO expert. The crew re-appears and announces they are going to fire nuclear missiles at Washington D.C."
}, {
  "imdbId" : "0057798",
  "season" : "4",
  "episodeNumber" : "18",
  "title" : "The Abominable Snowman",
  "description" : "The Seaview rescues two scientist from a climate control project at the South Pole but something else is on the ship on a killing spree. The Seaview has to shut down the project before the world's climates change."
}, {
  "imdbId" : "0057798",
  "season" : "4",
  "episodeNumber" : "19",
  "title" : "Secret of the Deep",
  "description" : "The Seaview and an intelligence expert who is more than he seems, try to find a group that is blackmailing the world's nations for gold bullion. The submarine encounters gigantic creatures during their search."
}, {
  "imdbId" : "0057798",
  "season" : "4",
  "episodeNumber" : "20",
  "title" : "Man-Beast",
  "description" : "When Crane tests a new atmosphere to deal with extreme pressures, he turns into a Man Beast. Nelson races the clock to find a cure for Crane."
}, {
  "imdbId" : "0057798",
  "season" : "4",
  "episodeNumber" : "21",
  "title" : "Savage Jungle",
  "description" : "The Seaview investigates why part of the Italian coast has become overrun with jungle growth. Meanwhile new crewman Keeler has 3 miniature silver faced men grow to human size and causes jungle growth to spawn all through the submarine."
}, {
  "imdbId" : "0057798",
  "season" : "4",
  "episodeNumber" : "22",
  "title" : "Flaming Ice",
  "description" : "Investigating why the world's oceans are rising, the Seaview finds a race of Frost Men at the Polar Cap who are increasing the temperature and they want the submarines' reactor to help them leave the earth."
}, {
  "imdbId" : "0057798",
  "season" : "4",
  "episodeNumber" : "23",
  "title" : "Attack!",
  "description" : "While investigating the destruction of the fleet by a flying saucer, Nelson and Kowalski are captured by aliens. One of the aliens offers help to the Seaview crew to stop his people."
}, {
  "imdbId" : "0057798",
  "season" : "4",
  "episodeNumber" : "24",
  "title" : "Edge of Doom",
  "description" : "Nelson is told the Seaview could be destroyed while carrying a top secret defense weapon but he has to determine if Captain Crane is an impostor."
}, {
  "imdbId" : "0057798",
  "season" : "4",
  "episodeNumber" : "25",
  "title" : "The Death Clock",
  "description" : "Corpsman Mallory's 4th Dimension Machine causes Captain Crane to kill Admiral Nelson, but did he really? A hunted Crane tries to prevent the event from happening."
}, {
  "imdbId" : "0057798",
  "season" : "4",
  "episodeNumber" : "26",
  "title" : "No Way Back",
  "description" : "Mr.Pem returns to help Admiral Nelson prevent the Seaview from exploding. Pem transports the submarine to 1780 where they encounter General Benedict Arnold and Major Andre."
}]