[{
  "imdbId" : "2172103",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Captain",
  "description" : "Captain Marcus Chaplin is commander of the USS Colorado, a ballistic missile submarine. He has a good crew and all are quite good at their jobs. They receive an order to launch two missiles - the target is Pakistan - but they've received the order over a low security radio band and when he requests confirmation, Chaplin is relieved of command. His XO Sam Kendal also requests confirmation and soon after, the Colorado is fired upon - by a U.S. destroyer. Chaplin realizes they are in very deep and heads to a nearby island for safety. The locals aren't too keen with the ..."
}, {
  "imdbId" : "2172103",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Blue on Blue",
  "description" : "A fleet of U.S. warships approaches the 200 mile perimeter Capt. Chaplin has declared but he also activates the prototype Perseus system which makes the sub virtually invisible. On the island, about one-quarter of the crew are refusing to report for duty. But that isn't their only problem. When a airplane approaches the island they suspect teams of special forces may now be on the island. From the brig, Chief Prosser is making his own plans and encouraging disloyalty among the enlisted sailors. In Washington XO Sam Kendal's wife is under pressure to talk to her ..."
}, {
  "imdbId" : "2172103",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Eight Bells",
  "description" : "The crew is growing restless and some are refusing to take orders. Chief Prosser and the Captain come to an accommodation however and they agree to work together. The Captain wants to find his three missing crewmen and asks Julian Serrat for his help. There is a price to be paid however and one that he finds difficult to meet leading to a death. In Washington, Admiral Arthur Shepard wants to find out how and why the order to the Colorado went over the Antarctic network. He turns to Kylie Sinclair to get the answers for him. She is despondent however that the ..."
}, {
  "imdbId" : "2172103",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Voluntold",
  "description" : "Morale is not good and some of the crew are starting to have second thoughts about the current command structure. The Captain's solution is quite straightforward - give the crew the choice of staying with the boat or not. The exec isn't so sure that's very practical. When one of the sailor's is caught taking a shot at the Captain, the sailor claims he's acting under orders - and it turns out individual messages have been sent by the Defense Department to sailors telling them they can do so. The Captain is defiant and isn't going to back down even after some try to ..."
}, {
  "imdbId" : "2172103",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Skeleton Crew",
  "description" : "As Marcus (Andre Braugher) and Sam (Scott Speedman) negotiate with the Secretary of Defense, Grace (Daisy Betts) leads the Colorado on a risky mission to repair the island's damaged sonar defenses."
}, {
  "imdbId" : "2172103",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Another Fine Navy Day",
  "description" : "A commando raid that contaminates the island's drinking water sends Marcus (Andre Braugher) and a skeleton crew out to sea to protect the sub, while Sam (Scott Speedman) struggles with drug-induced hallucinations as he tries to fend off the attack."
}, {
  "imdbId" : "2172103",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Nuke It Out",
  "description" : "As Marcus (Andre Braugher) and Sam (Scott Speedman) hunt for the traitor in their ranks who stole their nuclear launch key, Prosser (Robert Patrick) disobeys orders and starts a small war he can't control. Meanwhile Grace and James must work together to defuse a dangerous situation, while back in D.C. Christine is indicted as Sam's co-conspirator."
}, {
  "imdbId" : "2172103",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Big Chicken Dinner",
  "description" : "\"Big Chicken Dinner\" - Marcus brings the members of the Colorado and the islanders all together to celebrate their two cultures -- a feast in the spirit of Thanksgiving. But the good times suddenly turn bad the next morning when an essential crew member is accused of a serious crime. Grace handles the man's defense and she's tasked with finding out the truth."
}, {
  "imdbId" : "2172103",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "Cinderella Liberty",
  "description" : "Marcus (Andre Braugher) must consider launching a nuclear missile on Indian troops moving into Pakistan in order to stop the slaughter of his crew's family members as they approach the island."
}, {
  "imdbId" : "2172103",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "Blue Water",
  "description" : "Sam and James go to Manila to find Christine. James approaches a former SEAL who lives there for help. A Chinese envoy arrives and offers to provide Marcus with supplies. Prosser who's been nursing his injury and has become addicted to pain meds, returns. And Marcus is forced to resort an unusual tactic to discipline the men."
}, {
  "imdbId" : "2172103",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "Damn the Torpedoes",
  "description" : "As a coup is hatched in Washington, D.C., Marcus (Andre Braugher) accepts the Chinese government's offer of assistance, placing the United States at odds with the rival superpower and the USS Colorado on a collision course with a Navy destroyer."
}, {
  "imdbId" : "2172103",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "The Pointy End of the Spear",
  "description" : "Kylie works with Admiral Shepard trying to bring down the president using evidence of what really happened in Pakistan. This affords Marcus the opportunity to surrender the Colorado, if all goes according to plan. Ernie Hudson guest stars as Speaker of the House Conrad Buell. He meets with a small group of Washington heavyweights to discuss an unthinkable development, while Kylie's video information helps persuade him to participate in a highly risky and treasonous maneuver."
}, {
  "imdbId" : "2172103",
  "season" : "1",
  "episodeNumber" : "13",
  "title" : "Controlled Flight Into Terrain",
  "description" : "In the season finale, a violent battle for control erupts on the submarine, which leaves the Colorado vulnerable to capture by a third party - one with an exploitative plan. The question becomes: can Marcus and Sam take control of the sub before it's too late?"
}]