[{
  "imdbId" : "0058816",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "So Long Patrick Henry",
  "description" : "Robinson and Scott travel to Hong Kong. Their assignment; persuade an American Olympic athlete who defected to Red China to return to the U.S."
}, {
  "imdbId" : "0058816",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "A Cup of Kindness",
  "description" : "Russ Conley, a former instructor of Kelly's, shows up in Hong Kong. He delivers a message from 'the department' to Kelly and Scott."
}, {
  "imdbId" : "0058816",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Carry Me Back to Old Tsing-Tao",
  "description" : "Robinson and Scott must negotiate a deal with an aged Chinese criminal mastermind while fending off his 3 money-hungry sons-in-law."
}, {
  "imdbId" : "0058816",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Chrysanthemum",
  "description" : "While tracking a drugs for weapons smuggling deal Kelly and Scotty encounter the mysterious Blue Dragon society which makes sorting out the bad guys from the good anyone's guess."
}, {
  "imdbId" : "0058816",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Dragon's Teeth",
  "description" : "While tracking a drugs-for-weapons smuggling deal, Kelly and Scotty encounter the mysterious Blue Dragon society, which makes sorting out the bad guys from the good anyone's guess."
}, {
  "imdbId" : "0058816",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "The Loser",
  "description" : "After Kelly and Scotty capture some heroin, the mobster wants it back, and to make certain he gets it returned, he's got a very valuable item to exchange; Scotty, who's being kept as a hostage in the dressing room of the beautiful drug addicted singer (Ms Eartha Kitt), who's working for the mobster."
}, {
  "imdbId" : "0058816",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Danny Was a Million Laughs",
  "description" : "Kelly and Scotty must keep an obnoxious drug smuggler alive until his escort arrives to extradite him to the States to testify."
}, {
  "imdbId" : "0058816",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "The Time of the Knife",
  "description" : "Scotty and Kelly are assigned to investigate the death of an American agent in a fiery car crash and more important, the whereabouts of the secret documents he was carrying. Word on the street is the documents were destroyed in the fire but now one really believes that, including the bad guys who are happy to trade cash or bullets to acquire them."
}, {
  "imdbId" : "0058816",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "No Exchange on Damaged Merchandise",
  "description" : "Scotty and Kelly search for an escaped prisoner, a Chinese agent scheduled for exchange with an American held by the Chinese."
}, {
  "imdbId" : "0058816",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "Tatia",
  "description" : "Does an association with three, make that four, murdered agents make a woman an enemy assassin? Scotty thinks so. Kelly doesn't. But Kelly's in love."
}, {
  "imdbId" : "0058816",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "Weight of the World",
  "description" : "An inexperienced agent works with Scotty and Kelly, as they attempt to prevent an enemy faction from releasing a new plague."
}, {
  "imdbId" : "0058816",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "Three Hours on a Sunday Night",
  "description" : "Scott and Kelly must ecover a roll of microfilm stolen from an Army courier. Unfortunately its in the hands of a crime lord. To get it back Kelly has to meet the gangster's price; in cash or blood."
}, {
  "imdbId" : "0058816",
  "season" : "1",
  "episodeNumber" : "13",
  "title" : "Tigers of Heaven",
  "description" : "A small group of fanatical, anti-American neo-samurai called the Tigers of Heaven target friends of Kelly."
}, {
  "imdbId" : "0058816",
  "season" : "1",
  "episodeNumber" : "14",
  "title" : "Affair in T'Sien Cha",
  "description" : "Whilst in Hong Kong, and not currently on assignment, Kelly narrowly escapes a sniper's bullet while playing a tennis. He and Alexander Scott, are actually a pair of U.S. agents, Shortly thereafter, they're told to find a freight train which disappeared between China and Hong Kong. The train was supposedly only carrying building materials. It turns out, but, there was a passenger who's of great interest to China."
}, {
  "imdbId" : "0058816",
  "season" : "1",
  "episodeNumber" : "15",
  "title" : "The Tiger",
  "description" : "Kelly's sent on a suicide mission to spring a trap before a world renowned humanitarian blunders into it to rescue his daughter."
}, {
  "imdbId" : "0058816",
  "season" : "1",
  "episodeNumber" : "16",
  "title" : "The Barter",
  "description" : "Plans go awry when Kelly and Scotty are in Tokyo to help a Russian professor defect."
}, {
  "imdbId" : "0058816",
  "season" : "1",
  "episodeNumber" : "17",
  "title" : "Always Say Goodbye",
  "description" : "Kelly takes the blame for all manner of indiscretions to spare the reputation of a diplomat."
}, {
  "imdbId" : "0058816",
  "season" : "1",
  "episodeNumber" : "18",
  "title" : "Court of the Lion",
  "description" : "Scotty and Kelly combat a ruthless gang of smugglers who have co-opted an entire fishing village into their scheme. Although totally unarmed, with a little help from the villagers they might have a chance."
}, {
  "imdbId" : "0058816",
  "season" : "1",
  "episodeNumber" : "19",
  "title" : "Turkish Delight",
  "description" : "Alexander Scott, traveling undercover in Mexico as Dr. Smithfield, is abducted along with three other agronomists that an amiable freelance spy is planning to sell to a foreign power. Kelly teams up with a taxi driver to track down his kidnapped comrade."
}, {
  "imdbId" : "0058816",
  "season" : "1",
  "episodeNumber" : "20",
  "title" : "Bet Me a Dollar",
  "description" : "Scotty sportingly bets Kelly a dollar that he is capable of tracking down his friend anywhere in Mexico within a week. But the hide n' seek game becomes desperately urgent after Scott learns Kelly has unknowingly been infected with anthrax that will kill him if not treated within 24 hours."
}, {
  "imdbId" : "0058816",
  "season" : "1",
  "episodeNumber" : "21",
  "title" : "Return to Glory",
  "description" : "A question over a five-dollar expense account item for 'glass pants' for Scotty's mother leads to the boys recounting for Miss Clavell the whole story of their assignment to General Ortiz, democratic leader of an island republic ousted in a revolution and now living in exile in Taxco, Mexico. The general is seeking the United States' assistance in waging a counter-revolution, but Ortiz's wife is suspiciously resistant to allowing Kelly and Scott meet the general. Why the cover-up?"
}, {
  "imdbId" : "0058816",
  "season" : "1",
  "episodeNumber" : "22",
  "title" : "The Conquest of Maude Murdock",
  "description" : "Kelly and Scotty are assigned to kidnap a government official to detect shortcomings in her security detail, but Maude Murdock, a brash and scrappy Oklahoma woman, doesn't kidnap easily."
}, {
  "imdbId" : "0058816",
  "season" : "1",
  "episodeNumber" : "23",
  "title" : "A Day Called 4 Jaguar",
  "description" : "Kelly's girlfriend insists she was rescued by the Aztec god Quetzalcoatl. Kelly and Scott's investigation of her claim soon dovetails with their assignment to locate a Soviet Air Force pilot thought to be defecting."
}, {
  "imdbId" : "0058816",
  "season" : "1",
  "episodeNumber" : "24",
  "title" : "Crusade to Limbo",
  "description" : "Robinson and Scott must go undercover in a group of famous American personalities dedicated to overthrowing the government of a country friendly to the United States."
}, {
  "imdbId" : "0058816",
  "season" : "1",
  "episodeNumber" : "25",
  "title" : "My Mother, the Spy",
  "description" : "Robinson and Scott are assigned to bring in a female American agent who fled after killing an enemy agent."
}, {
  "imdbId" : "0058816",
  "season" : "1",
  "episodeNumber" : "26",
  "title" : "There Was a Little Girl",
  "description" : "Robinson and Scott are assigned to chaperone the spoilt teenage daughter of a powerful advisor to the President. Things go seriously wrong when she gets mixed-up in a drug smuggling ring."
}, {
  "imdbId" : "0058816",
  "season" : "1",
  "episodeNumber" : "27",
  "title" : "It's All Done with Mirrors",
  "description" : "Sinister Soviet scientist Dr. Karolyi kidnaps Kelly and brainwashes him into believing Scott is a traitor who must be killed."
}, {
  "imdbId" : "0058816",
  "season" : "1",
  "episodeNumber" : "28",
  "title" : "One Thousand Fine",
  "description" : "Greed, jealousy, and treachery await when Robinson and Scott are ordered to find a lost gold shipment in the Mexican jungle."
}, {
  "imdbId" : "0058816",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "So Coldly Sweet",
  "description" : "Kelly and Scotty are assigned to beautiful Palm Springs to vet an attractive defector with some truly interesting secrets. But in a cold war game where there are newer final winners nor losers, who's playing who?"
}, {
  "imdbId" : "0058816",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "Lori",
  "description" : "Members of an elite nuclear test detection team have died violent deaths one by one. When the fifth team member is killed right before Scotty's and Kelly's eyes, they are assigned to protect the sole surviving member and find the killer. The prime suspect is the seventh man who washed out of the team and happens to be a friend of Scotty. Scotty tries to reach him though his sister, a singer performing in Las Vegas. But gaining her cooperation will require more than persuasion. It will require a carefully conceived trap."
}, {
  "imdbId" : "0058816",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "Sophia",
  "description" : "On holiday in Italy, Kelly and Scotty happens upon a girl Scotty had sponsored. Now grown, she's preparing to marry. Scotty can handle enemy agents, but his foster daughter, her fiancé; and the Italian traffic court are entirely different matters."
}, {
  "imdbId" : "0058816",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "Vendetta",
  "description" : "A local family in Italy kidnaps Kelly with the intention of holding court over him for the death of their favorite son in the Korean War. Once again Scotty's investigation and recovery skills prove lacking in his efforts to rescue Kelly. Maybe he'll have more luck as his lawyer."
}, {
  "imdbId" : "0058816",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "A Gift from Alexander",
  "description" : "In Venice, Kelly and Scott try to obtain a manuscript from a beautiful Soviet agent."
}, {
  "imdbId" : "0058816",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "Trial by Treehouse",
  "description" : "Kelly and Alexander are tasked with apprehending the mastermind of a scheme to turn city-wide power outages into a marketable commodity. 2 complications; Alexander has little confidence in his aide and cover identity, an agent with little field experience posing with her son as his wife, and his only link to the schemer's a psychopath."
}, {
  "imdbId" : "0058816",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "Sparrowhawk",
  "description" : "Alexander and Kelly receive the unenviable assignment of guarding a spoiled, teenage king."
}, {
  "imdbId" : "0058816",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "Will the Real Good Guys Please Stand Up?",
  "description" : "Kelly and Alexander are abducted and impersonated by two enemy agents. Their intent; to get close to a defense contractor, kidnap his daughter and force him to turn over secret weapons designs. As Kelly's and Alexander's escape attempts continue to go awry one wonders if they are up to rescuing the fair maiden."
}, {
  "imdbId" : "0058816",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "Bridge of Spies",
  "description" : "A beautiful tour guide, a handsome tennis pro and the romantic city of Venice would make for an intimate friendship if the tour guide didn't like to slip knives between men's ribs."
}, {
  "imdbId" : "0058816",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "One of Our Bombs Is Missing",
  "description" : "Kelly and Alexander are sent to a little town in Italy to recover the payload from a nuclear armed aircraft that crashed nearby. They soon find that the towns folk found the plane rather useful. A few people even thought the bomb might come in handy."
}, {
  "imdbId" : "0058816",
  "season" : "2",
  "episodeNumber" : "11",
  "title" : "To Florence with Love: Part 1",
  "description" : "An incompetent thief pursues a beautiful woman returning a priceless painting to Florence. Kelly and Alexander are assigned to provide clandestine security. Of course when a beautiful woman is involved Kelly is not one to hide in the shadows."
}, {
  "imdbId" : "0058816",
  "season" : "2",
  "episodeNumber" : "12",
  "title" : "To Florence with Love: Part 2",
  "description" : "With the help of Kelly and Alexander, the Da Vinci Madonna was delivered to its new home in Florence. But the previous owner reports it as a forgery. Now they've to track down the thieves, recover the painting then steal the forgery and replace it with the real painting."
}, {
  "imdbId" : "0058816",
  "season" : "2",
  "episodeNumber" : "13",
  "title" : "Lisa",
  "description" : "A mail-order bride serves as a cover for some unlikely thrives who are smuggling a mysterious suitcase."
}, {
  "imdbId" : "0058816",
  "season" : "2",
  "episodeNumber" : "14",
  "title" : "Little Boy Lost",
  "description" : "In order to gain attention from his father, a 13 year old boy steals a prototype and runs away with it."
}, {
  "imdbId" : "0058816",
  "season" : "2",
  "episodeNumber" : "15",
  "title" : "Father Abraham",
  "description" : "Some heroes are motivated by duty. Others just want to impress their father. Whatever the reason, Alex and Kelly receive one of their dirtiest assignments; to train a young rocket scientist to resist torture and then to rescue him when he's captured."
}, {
  "imdbId" : "0058816",
  "season" : "2",
  "episodeNumber" : "16",
  "title" : "Rome... Take Away Three",
  "description" : "The death of a fellow agent lands Scotty and Kelly the task of locating the blackmailer who drove the man to suicide and 'deactivating' him."
}, {
  "imdbId" : "0058816",
  "season" : "2",
  "episodeNumber" : "17",
  "title" : "Tonia",
  "description" : "Scotty's assignment; to engage in a torrid romance with a headstrong Italian woman who's in the grips of a leftist leader who has plans for Scott and Kelly."
}, {
  "imdbId" : "0058816",
  "season" : "2",
  "episodeNumber" : "18",
  "title" : "Child Out of Time",
  "description" : "Kelly and Alexander's assigned to find a list of Nazi war criminals before the war criminals find it. But they discover there's nothing written."
}, {
  "imdbId" : "0058816",
  "season" : "2",
  "episodeNumber" : "19",
  "title" : "The Trouble with Temple",
  "description" : "In Europe, Kelly and Scott investigate an actor who's a reputed enemy agent. The actor dominates his mistress, Temple. As Kelly gets to know Temple, Scott's captured and interrogated. When Temple discovers the truth, her life and Scott's are imperiled."
}, {
  "imdbId" : "0058816",
  "season" : "2",
  "episodeNumber" : "20",
  "title" : "The War Lord",
  "description" : "When the daughter of a powerful British arms producer is kidnapped, Kelly, who naturally had a romantic relationship with her, immediately suspects a hoax. When her father insists on paying the ransom and rescuing her, whether she wants to be rescued or not, Alexander and Kelly get the job. However, the fading warlord who is holding her is privy to all their plans and turns out to be as philosophical as he is ruthless making him most unpredictable."
}, {
  "imdbId" : "0058816",
  "season" : "2",
  "episodeNumber" : "21",
  "title" : "A Room with a Rack",
  "description" : "Recovering from his torture at the hands of enemy agents, Kelly travels with Scotty to Spain's Costa del Sol for a recuperative holiday. There, he's pleased to meet old friend Lindy but reminders of his recent ordeal seem to lend credence to a psychologist's judgment he's no longer the man he was."
}, {
  "imdbId" : "0058816",
  "season" : "2",
  "episodeNumber" : "22",
  "title" : "Mainly on the Plains",
  "description" : "Boris Karloff portrays a well-meaning scientist who behaves suspiciously like Miguel de Cervantes's literary creation, Don Quixote."
}, {
  "imdbId" : "0058816",
  "season" : "2",
  "episodeNumber" : "23",
  "title" : "Get Thee to a Nunnery",
  "description" : "On holiday,Scotty and Kelly bump into one of their not-so-fond acquaintances; a British agent they've found thoroughly untrustworthy., Orders are to find out what he's up to. It has something to do with rescuing an art lover who refuses to disclose a secret he seems to consider worth dying for."
}, {
  "imdbId" : "0058816",
  "season" : "2",
  "episodeNumber" : "24",
  "title" : "Blackout",
  "description" : "Kelly wakes up with with a dead Russian ballerina in his bed and no memory of how she got there, Russian intelligence presumes Kelly, and will report him to the Spanish police unless he and Scotty can prove the murder was committed by someone else, in less than 24hrs."
}, {
  "imdbId" : "0058816",
  "season" : "2",
  "episodeNumber" : "25",
  "title" : "Magic Mirror",
  "description" : "Kelly's love seems to be 2-timing him and the United States with a deposed dictator negotiating with the Soviets to put missile bases in his country when he returns to power."
}, {
  "imdbId" : "0058816",
  "season" : "2",
  "episodeNumber" : "26",
  "title" : "Night Train to Madrid",
  "description" : "The guys must protect an obnoxious American comic on a goodwill tour of Europe from an enemy agent assigned to kill and discredit him."
}, {
  "imdbId" : "0058816",
  "season" : "2",
  "episodeNumber" : "27",
  "title" : "Casanova from Canarsie",
  "description" : "Herbie's a man who used to be a filing clerk privy to many of America's nuclear secrets. But he resigned and is now being courted by a beautiful enemy agent. The best way Kelly and Scotty can keep him out harm's way is knocking him out. Repeatedly. series of concussions."
}, {
  "imdbId" : "0058816",
  "season" : "2",
  "episodeNumber" : "28",
  "title" : "Cops and Robbers",
  "description" : "A childhood friend of Alexander's is holding his mother and sister hostage to obtain a capsule of microfilm Alex is transporting."
}, {
  "imdbId" : "0058816",
  "season" : "3",
  "episodeNumber" : "1",
  "title" : "Let's Kill Karlovassi",
  "description" : "Kelly and Scott are sent to a seaside vacation spot to kill undercover spy, Karlovassi. But after meeting him, they develop a friendship with him."
}, {
  "imdbId" : "0058816",
  "season" : "3",
  "episodeNumber" : "2",
  "title" : "The Beautiful Children",
  "description" : "Over the years, 10 thousand children have been kidnapped from a northern province in Greece to be taken through the Iron Curtain. They're brought up in state orphanages, brainwashed, and trained as agents to be later re-infiltrated back into Greece and used against their country. Robinson and Scott's assignment is to rescue a friendly agent involved with disrupting the child-smuggling, but whom is now trapped behind the Iron Curtain."
}, {
  "imdbId" : "0058816",
  "season" : "3",
  "episodeNumber" : "3",
  "title" : "Laya",
  "description" : "Scott's ordered to get close to an African woman who has access to important intelligence about arm shipments to her country - and then 'destroy' her. But he's faced with an attack of conscience once he begins to develop feelings for her."
}, {
  "imdbId" : "0058816",
  "season" : "3",
  "episodeNumber" : "4",
  "title" : "The Medarra Block",
  "description" : "To thwart a coup, Robinson and Scott must decipher the inscription on a wooden block given to them by a dying Moroccan."
}, {
  "imdbId" : "0058816",
  "season" : "3",
  "episodeNumber" : "5",
  "title" : "Philotimo",
  "description" : "A child violin virtuoso begs Kelly and Scotty to smuggle him out of communist Bulgaria so that he can live with his sister in Greece. Against better judgment they help the boy and get a nasty surprise for their trouble."
}, {
  "imdbId" : "0058816",
  "season" : "3",
  "episodeNumber" : "6",
  "title" : "The Honorable Assassins",
  "description" : "The partners take a man and his daughter across the Moroccan desert to escape bandits."
}, {
  "imdbId" : "0058816",
  "season" : "3",
  "episodeNumber" : "7",
  "title" : "Now You See Her, Now You Don't",
  "description" : "Scott and Robinson search the Greek islands for a vacationing Los Alamos mathematician."
}, {
  "imdbId" : "0058816",
  "season" : "3",
  "episodeNumber" : "8",
  "title" : "Red Sash of Courage",
  "description" : "Saboteurs hide out in a small Greek village with Kelly and Scott hot on their trail. Kelly's entanglement with the town mayor's daughter adds to their difficult predicament."
}, {
  "imdbId" : "0058816",
  "season" : "3",
  "episodeNumber" : "9",
  "title" : "The Seventh Captain",
  "description" : "Robinson and Scott are on assignment in the Greek isles. The enemy agent they're trailing ducks into a small tavern and disappears into thin air."
}, {
  "imdbId" : "0058816",
  "season" : "3",
  "episodeNumber" : "10",
  "title" : "Apollo",
  "description" : "A failed trap enables enemy agents to blow up a NASA test site."
}, {
  "imdbId" : "0058816",
  "season" : "3",
  "episodeNumber" : "11",
  "title" : "Oedipus at Colonus",
  "description" : "Seeking the only man who can lead a Moroccan revolt, the partners are captured by a political leader."
}, {
  "imdbId" : "0058816",
  "season" : "3",
  "episodeNumber" : "12",
  "title" : "The Lotus Eater",
  "description" : "Ten days after Kelly has missed an important meeting held in Athens, Scotty finds him lazing on a quiet Greek isle. Kelly tells Scotty he's net a woman and has quit the spy business."
}, {
  "imdbId" : "0058816",
  "season" : "3",
  "episodeNumber" : "13",
  "title" : "An American Empress",
  "description" : "While in a toy shop in Chinatown, San Francisco Kelly and Scott meet an attractive Chinese young woman named Mai Lin. Kelly is immediately attracted to her and strikes up a conversation. While showing her the sights they find it strange that she says she is from San Francisco yet has no knowledge of the most obvious San Franciscan sights...Alcatraz, Golden Gate Bridge, etc. The mystery gets deeper when they are assaulted and she is stolen away. Their investigation leads them to an ancient Chinese cult who have plans for Mai Lin."
}, {
  "imdbId" : "0058816",
  "season" : "3",
  "episodeNumber" : "14",
  "title" : "Home to Judgment",
  "description" : "Kelly and Scott are on the run from an armed group. They've learned the identities of some of the biggest saboteurs in America, who depend on their anonymity. Kelly and Scott seek refuge at a farm which Kelly remembers from his childhood; Kelly's aunt and uncle, and now they're all marked for death."
}, {
  "imdbId" : "0058816",
  "season" : "3",
  "episodeNumber" : "15",
  "title" : "Anyplace I Hang Myself Is Home",
  "description" : "In one of the final episodes of the series, Scott and Robinson relive how they first met, in a series of flashbacks. Back in present-day San Francisco, Scott has been hospitalized after a failed suicide attempt. He is recalling for the psychiatrist, Dr. Akivic, how he and Robinson collided, literally and figuratively, in their first days of training for the CIA. Later, the doctor interviews Robinson who recalls the same series of events from his point of view. Each of them tells of working on a training exercise with a third agent, Wally. They broke into headquarters and discovered something in Dr. Akivic's office that none of them has the capacity to remember. Back in present day, the sight of the statue of Rodin's 'The Thinker' triggers some disturbing memories and some radical responses."
}, {
  "imdbId" : "0058816",
  "season" : "3",
  "episodeNumber" : "16",
  "title" : "Tag, You're It",
  "description" : "In San Francisco, Kelly and Scotty are on temporary duty at 'the department's' training school. One of the trainees is a mole for the Soviets. After he kills another trainee, he gets permission to stalk Kelly and Scotty. The veteran agents end up accused and are on the run -- for real."
}, {
  "imdbId" : "0058816",
  "season" : "3",
  "episodeNumber" : "17",
  "title" : "A Few Miles West of Nowhere",
  "description" : "Scott and Robinson investigate the death of an agent in a town where an atomic plant is to be constructed."
}, {
  "imdbId" : "0058816",
  "season" : "3",
  "episodeNumber" : "18",
  "title" : "This Guy Smith",
  "description" : "Posing as fishermen, the duo is suspected in two deaths while pursuing an enemy agent wanted for murder."
}, {
  "imdbId" : "0058816",
  "season" : "3",
  "episodeNumber" : "19",
  "title" : "Turnabout for Traitors",
  "description" : "Robinson disappears to clear himself of treason charges."
}, {
  "imdbId" : "0058816",
  "season" : "3",
  "episodeNumber" : "20",
  "title" : "Happy Birthday Everybody",
  "description" : "While sightseeing in a Mexican town Scott and Robinson think they see someone familiar. When they approach him he gets the drop on them and gets away. After checking they find out that Frank Hunter a convicted mental patient judged incurable and sentenced to life has escaped. Hunter is a demolitions expert who has sworn revenge against Tom Matthews, the agent who apprehended him. Matthews has retired and lives with his family in Mexico. Robinson and Scott are assigned to find Hunter and stop him before he can hurt Matthews and his family."
}, {
  "imdbId" : "0058816",
  "season" : "3",
  "episodeNumber" : "21",
  "title" : "Shana",
  "description" : "Robinson and Scott are on assignment at a beach side resort in Spain tracking down stolen rocket fuel. When their contact man is found murdered the boys are warned off by a beautiful woman. When they search his room they find a portrait of the woman. Using the name of the artist they track her down and discover she has the fuel and is going to trade it for her brother's freedom who is being held behind the Iron Curtain."
}, {
  "imdbId" : "0058816",
  "season" : "3",
  "episodeNumber" : "22",
  "title" : "The Name of the Game",
  "description" : "Ordered by their superiors to check security on a general forced into retirement before the visit of a VIP, Kelly and Scott are thrown into a game where they'ree the game being hunted."
}, {
  "imdbId" : "0058816",
  "season" : "3",
  "episodeNumber" : "23",
  "title" : "Suitable for Framing",
  "description" : "Kelly and Scott are to be killed after they are used to test the authenticity of the appearance of a man who has surgically been altered to replace a senator that is to be murdered so the man as the senator can assassinate the president."
}, {
  "imdbId" : "0058816",
  "season" : "3",
  "episodeNumber" : "24",
  "title" : "The Spy Business",
  "description" : "A series of leaks during the extraction of a defecting Soviet casts suspicion on an agency friend of Kelly's. Kelly and Scott join the debriefing team to discover which of the agents is the traitor."
}, {
  "imdbId" : "0058816",
  "season" : "3",
  "episodeNumber" : "25",
  "title" : "Carmelita Is One of Us",
  "description" : "In Guadalajara, after the torture and death of a contact, Kelly and Scott take possession of an infant, Carmelita, and go on the run to escape a gang in a black car who are convinced that the infant is of great value."
}, {
  "imdbId" : "0058816",
  "season" : "3",
  "episodeNumber" : "26",
  "title" : "Pinwheel",
  "description" : "In Acapulco, Kelly and Scott unenthusiastically team with an agent with who's less than stellar history in order to stop the transfer of important information."
}]
