[{
  "imdbId" : "3032476",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Uno",
  "description" : "Struggling public defender Jimmy McGill constructs an elaborate yet questionable plan for winning back a pair of wealthy, potential clients."
}, {
  "imdbId" : "3032476",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Mijo",
  "description" : "With his latest scam gone horribly wrong, Jimmy finds himself face to face with violent criminals, and is forced to talk his way out of a life-threatening situation."
}, {
  "imdbId" : "3032476",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Nacho",
  "description" : "Jimmy must prove that Nacho is innocent when he is wrongly suspected of kidnapping."
}, {
  "imdbId" : "3032476",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Hero",
  "description" : "Jimmy makes a bold move against Hamlin in an effort to attract potential clients."
}, {
  "imdbId" : "3032476",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Alpine Shepherd Boy",
  "description" : "After a strange encounter with the police, Chuck ends up in the hospital. Jimmy meets up with a series of unruly clients."
}, {
  "imdbId" : "3032476",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Five-O",
  "description" : "Mike's days as a police officer in Philadelphia catch up to him when he's questioned about a tragic event from his past."
}, {
  "imdbId" : "3032476",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Bingo",
  "description" : "The Kettlemans seek Jimmy as their lawyer after turning down an offer from HHM, going as far as attempting to blackmail him."
}, {
  "imdbId" : "3032476",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "RICO",
  "description" : "Jimmy discovers the Sandpiper Retirement Home has been scamming his elderly clients, and prepares to take legal action."
}, {
  "imdbId" : "3032476",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "Pimento",
  "description" : "Chuck wants to transfer the Sandpiper case to HHM much to Jimmy's dismay. Mike gets a job offer working as a bodyguard."
}, {
  "imdbId" : "3032476",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "Marco",
  "description" : "Jimmy seizes an opportunity to reconnect with an old friend; Chuck adjusts to a new way of life."
}, {
  "imdbId" : "3032476",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "Switch",
  "description" : "Jimmy decides to quit the law after turning down a job at Davis & Main. Mike breaks ties with a former associate."
}, {
  "imdbId" : "3032476",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "Cobbler",
  "description" : "While Mike attempts to track down Pryce's stolen baseball cards, Jimmy must defend him when the police call him in for further questioning."
}, {
  "imdbId" : "3032476",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "Amarillo",
  "description" : "Jimmy struggles with client outreach and decides to shoot a TV commercial for Davis & Main. Mike begins an investigation."
}, {
  "imdbId" : "3032476",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "Gloves Off",
  "description" : "Jimmy and Kim face the repercussions of the TV commercial. Mike makes a deal with Nacho in regards to his newest job offer."
}, {
  "imdbId" : "3032476",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "Rebecca",
  "description" : "Jimmy chafes under his restrictive work environment; Kim goes to extremes to dig herself from a bottomless hole at HHM."
}, {
  "imdbId" : "3032476",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "Bali Ha'i",
  "description" : "Jimmy finds comfort in familiarity; Kim receives a life-changing proposal; when he is threatened, Mike finds himself pushed to the limit."
}, {
  "imdbId" : "3032476",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "Inflatable",
  "description" : "When Mike's hand is forced, he can no longer hide his frustration; Mike and Jimmy work together to keep the peace."
}, {
  "imdbId" : "3032476",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "Fifi",
  "description" : "Mike aims to settle the score with an enemy; an unexpected opportunity presents itself to Jimmy."
}, {
  "imdbId" : "3032476",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "Nailed",
  "description" : "Mike takes a methodical approach to his mission; someone questions Chuck's capabilities; Jimmy faces a personal dilemma."
}, {
  "imdbId" : "3032476",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "Klick",
  "description" : "Jimmy must make a hard choice; Mike takes control of matters; Hamlin delivers shocking news."
}, {
  "imdbId" : "3032476",
  "season" : "3",
  "episodeNumber" : "1",
  "title" : "Mabel",
  "description" : "As Chuck plots his next move, another lie comes back to haunt Jimmy. A rattled Mike tries to find out who's been tracking his movements - and how."
}, {
  "imdbId" : "3032476",
  "season" : "3",
  "episodeNumber" : "2",
  "title" : "Witness",
  "description" : "Jimmy and Kim hire an assistant; Mike seeks out a mysterious acquaintance; and Chuck uses the law to gain an advantage over Jimmy."
}, {
  "imdbId" : "3032476",
  "season" : "3",
  "episodeNumber" : "3",
  "title" : "Sunk Costs",
  "description" : "Jimmy decides to represent a new client, much to Kim's dismay. Meanwhile, Mike meets a formidable ally who presents him an enticing offer."
}, {
  "imdbId" : "3032476",
  "season" : "3",
  "episodeNumber" : "4",
  "title" : "Sabrosito",
  "description" : "Jimmy calls in a favor from Mike. Meanwhile, new complications disrupt the Salamancas' business; and Chuck and Jimmy struggle to compromise."
}, {
  "imdbId" : "3032476",
  "season" : "3",
  "episodeNumber" : "5",
  "title" : "Chicanery",
  "description" : "Kim and Jimmy face off with an adversary. Jimmy looks to Chuck's past to secure his future. Jimmy loses an ally and gains another."
}, {
  "imdbId" : "3032476",
  "season" : "3",
  "episodeNumber" : "6",
  "title" : "Off Brand",
  "description" : "Jimmy embarks on a new endeavor. Chuck pushes himself to the limit. Nacho finds himself ensnared in a power struggle."
}, {
  "imdbId" : "3032476",
  "season" : "3",
  "episodeNumber" : "7",
  "title" : "Expenses",
  "description" : "Jimmy tries to settle his debts. Nacho reunites with an old acquaintance. Mike helps Stacey with a project and makes a meaningful connection."
}, {
  "imdbId" : "3032476",
  "season" : "3",
  "episodeNumber" : "8",
  "title" : "Slip",
  "description" : "Jimmy is pushed to desperate measures. Nacho picks up a skill and Mike explores an alliance. Kim stands up to Hamlin."
}, {
  "imdbId" : "3032476",
  "season" : "3",
  "episodeNumber" : "9",
  "title" : "Fall",
  "description" : "Jimmy visits an old friend and takes up a new pastime; Chuck and Hamlin spar over the future of the firm; and Kim faces challenges at work."
}, {
  "imdbId" : "3032476",
  "season" : "3",
  "episodeNumber" : "10",
  "title" : "Lantern",
  "description" : "Kim resolves to take some time off from work, while Jimmy does his best to make amends; Nacho takes a major gamble with his future; Hamlin applies pressure on Chuck to finally make a decision."
}, {
  "imdbId" : "3032476",
  "season" : "4",
  "episodeNumber" : "1",
  "title" : "Smoke",
  "description" : "Jimmy struggles to cope with Chuck's tragic incidence. Mike ponders his role at Madrigal. Howard makes a startling confession."
}, {
  "imdbId" : "3032476",
  "season" : "4",
  "episodeNumber" : "2",
  "title" : "Breathe",
  "description" : "Jimmy seeks new employment. Gus navigates the fallout from Hector's collapse. Kim endeavors to support Jimmy in the wake of Chuck's death."
}, {
  "imdbId" : "3032476",
  "season" : "4",
  "episodeNumber" : "3",
  "title" : "Something Beautiful",
  "description" : "Jimmy puts a risky plan into motion; as alliances shift, Nacho finds himself in the crosshairs; Kim contemplates her future."
}, {
  "imdbId" : "3032476",
  "season" : "4",
  "episodeNumber" : "4",
  "title" : "Talk",
  "description" : "A restless Jimmy embarks on a new endeavor while Mike burns bridges; Kim pursues her bliss; Nacho tries to survive a turf war."
}, {
  "imdbId" : "3032476",
  "season" : "4",
  "episodeNumber" : "5",
  "title" : "Quite a Ride",
  "description" : "Jimmy identifies a new market for his talents; Mike vets a potential partnership; Kim drives a hard bargain."
}, {
  "imdbId" : "3032476",
  "season" : "4",
  "episodeNumber" : "6",
  "title" : "Piñata",
  "description" : "While Jimmy daydreams about reconstituting Wexler-McGill, Kim sets out to secure her own future; Mike puts a plan into motion for Gus."
}, {
  "imdbId" : "3032476",
  "season" : "4",
  "episodeNumber" : "7",
  "title" : "Something Stupid",
  "description" : "Jimmy runs into a problem as he expands his business that only Kim can solve. Gus gets involved in Hector's medical care. Mike has to deal with a setback."
}, {
  "imdbId" : "3032476",
  "season" : "4",
  "episodeNumber" : "8",
  "title" : "Coushatta",
  "description" : "Jimmy goes to great lengths to right a wrong, as Kim pulls out all the stops for a case; Mike lets his team blow off steam; Nacho receives a visitor."
}, {
  "imdbId" : "3032476",
  "season" : "4",
  "episodeNumber" : "9",
  "title" : "Wiedersehen",
  "description" : "Jimmy and Kim unburden themselves, risking their relationship in the process; Nacho is forced to make the rounds with Lalo; Mike has cause to worry."
}, {
  "imdbId" : "3032476",
  "season" : "4",
  "episodeNumber" : "10",
  "title" : "Winner",
  "description" : "Jimmy turns the page on his reputation; Lalo tracks a loose end in Gus's operation; Mike is forced to make a difficult decision."
}]