[{
  "imdbId" : "0108700",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Our Game",
  "description" : "The first episode in this documentary series covers the origins of baseball in the mid-19th century to the beginnings of the 20th century. Contrary to popular myth, Abner Doubleday did not sit down one afternoon in 1839 and write down the rules of baseball. The game evolved over many years and had its origins in cricket, rounders and town ball. The first game of baseball as we know took place in 1846 at Elysian Fields in New Jersey, just across the river from Manhattan when the New York Knickerbockers played a game. The Civil War had a major impact making it a ..."
}, {
  "imdbId" : "0108700",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Something Like a War",
  "description" : "This second episode in the series covers the years 1900-10. The new century was a time of great change in the United States and around the world. Baseball was in decline generally but the creation of the American League by Bam Johnson in 1896 presents the first real competition to the older and well-established National League. The new league was an immediate success and established themselves in cities that had been abandoned by the National League. The National League owners did their best to obstruct the upstarts but in the end had to admit that their play was on a..."
}, {
  "imdbId" : "0108700",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "The Faith of Fifty Million People",
  "description" : "The third episode of the series covers the period 1910-20. In this decade, the game went from it's zenith in popularity to the depths of betrayal and fan disillusionment. Ty Cobb dominated the game but was hated by virtually everyone in baseball, including his own teammates. He was racist and brutal, once beating up a handicapped fan who was heckling him. After another similar incident, American League President Bam Johnson suspended him indefinitely. He also became baseball's richest player thanks to a wise investment in a company called Coca Cola. The first Latin ..."
}, {
  "imdbId" : "0108700",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "A National Heirloom",
  "description" : "Baseball in the 1920's can be described in two words: Babe Ruth. George Herman \"Babe\" Ruth dominated the game in almost every respect. An accomplished pitcher, he was also the greatest batter the game had seen up to that time eventually moving to the outfield so he could play every day. Ruth spent most of his youth in a reformatory, his parents having had him declared incorrigible. He shone in the school's baseball team and was signed by the minor league Baltimore Orioles but was soon sold to the Boston Red Sox. It was a black day when they traded him to the New York ..."
}, {
  "imdbId" : "0108700",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Shadow Ball",
  "description" : "In the period 1930-40, the Depression had a major impact on the game of baseball. Many teams were nearing bankruptcy with attendance dwindling and fan interest at its lowest ebb. The owners introduced many innovations in an attempt to revive interest and attendance including the All Star game. Night games were introduced in 1935 and the Hall of Fame opened in Cooperstown in 1939 on the mythical 100th anniversary of creation of the game. The sport still provided its heroes however. Babe Ruth was larger than life and in 1930 signed an $80,000 a year contract; his ..."
}, {
  "imdbId" : "0108700",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "The National Pastime",
  "description" : "The 1940s was a decade of huge change in America and in baseball. In the 1941 season, Ted Williams of the Boston Red Sox hit .406 and Joe DiMaggio had his record-setting 56 game hitting streak. The Brooklyn Dodgers went from being perennial losers to actually winning the NL pennant. With the belated entry of the US into World War II many veterans enlisted, including Bob Feller, Ted Williams Hank Greenberg and Joe DiMaggio. In all, 340 major leaguers and over 3000 minor leaguers enlisted. With women entering the workforce in record numbers, it seemed only natural that ..."
}, {
  "imdbId" : "0108700",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "The Capital of Baseball",
  "description" : "The episode covers the 1950s and deals with several key events and issues: the dominance of the Yankees, the continuing integration of the game and the move to the West Coast of the Dodgers and Giants. The Yankees dominate baseball in the 1950s, winning 9 American League pennants and the World Series 5 times. For their rivals, particularly the Brooklyn Dodgers, every season proved to be a case of 'wait until next year'. The Dodgers year finally came in 1955 but with dwindling attendance, both the Dodgers and the NY Giants announce a few years later that they are ..."
}, {
  "imdbId" : "0108700",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "A Whole New Ballgame",
  "description" : "The 1960s are a turbulent decade for America. There are race riots, anti-war protests, hippies, Woodstock. It is also a turbulent decade for baseball, as one by one its \"sacred\" institutions fall."
}, {
  "imdbId" : "0108700",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "Home",
  "description" : "America and the world are seeing more changes then at any time in history. And so is baseball."
}, {
  "imdbId" : "0108700",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "The Tenth Inning: Top of the Tenth",
  "description" : "This latest entry covers the period from the early 1990's onward. Labor relations deteriorated badly in the early part of that decade leading to the players strike in August 1994. The Montreal Expos were the best team in baseball at the time but when a Federal judge blocked the owners from unilaterally imposing a contract (which would have let them use replacement players) it quickly came to an end and the players returned to work under the old contract. Attendance dropped after that but the game recovered quickly with the heroics of Cal Ripkin Jr. By the end of 1990'..."
}, {
  "imdbId" : "0108700",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "The Tenth Inning: Bottom of the Tenth",
  "description" : "As the new millenium dawns, Baseball is more popular and profitable than ever, but suspicions and revelations about performance enhancing drugs keep surfacing, calling the integrity of the game itself into question."
}]