[{
  "imdbId" : "0436992",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Rose",
  "description" : "When ordinary shop-worker Rose Tyler meets a mysterious stranger called the Doctor she is drawn into his strange and dangerous world; her life will never be the same again."
}, {
  "imdbId" : "0436992",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "The End of the World",
  "description" : "The Doctor takes Rose to the year 5 billion to witness the destruction of the Earth."
}, {
  "imdbId" : "0436992",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "The Unquiet Dead",
  "description" : "The Doctor has great expectations for his latest adventure when he and Rose join forces with Charles Dickens to investigate a mysterious plague of zombies."
}, {
  "imdbId" : "0436992",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Aliens of London",
  "description" : "The Doctor returns Rose to her own time - well, sort of - but her family reunion is ruined when a spaceship crashes in the middle of London. What is the origin of the spaceship, and where has the Prime Minister gone in this time of crisis?"
}, {
  "imdbId" : "0436992",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "World War Three",
  "description" : "The Slitheen have infiltrated Parliament and have the Doctor and his friends trapped as the Doctor works to prevent them from starting World War Three."
}, {
  "imdbId" : "0436992",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Dalek",
  "description" : "The TARDIS is drawn to an alien museum deep below the Utah desert, where a ruthless billionaire keeps prisoner the last of the Doctor's most fearsome enemies."
}, {
  "imdbId" : "0436992",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "The Long Game",
  "description" : "In the year 200,000 the Doctor discovers that a satellite with a dark secret is controlling humanity and slowing its development."
}, {
  "imdbId" : "0436992",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Father's Day",
  "description" : "Rose asks The Doctor to take her to 1987, on the day her father was killed."
}, {
  "imdbId" : "0436992",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "The Empty Child",
  "description" : "When a spaceship crashes in the middle of the London Blitz the Doctor, Rose and the enigmatic Captain Jack Harkness find themselves investigating a plague of physical injuries and a little boy in a gas mask."
}, {
  "imdbId" : "0436992",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "The Doctor Dances",
  "description" : "The gas mask zombies are on the rise as the plague spreads across war-torn London."
}, {
  "imdbId" : "0436992",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "Boom Town",
  "description" : "Stopping off in present-day Cardiff to recharge the TARDIS, The Doctor, Rose and Jack meet up with Mickey and encounter an old foe in the midst of hatching a scheme that could destroy the entire planet."
}, {
  "imdbId" : "0436992",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "Bad Wolf",
  "description" : "The Doctor, Rose and Jack are separated and forced to compete in twisted and deadly games on the Game Station."
}, {
  "imdbId" : "0436992",
  "season" : "1",
  "episodeNumber" : "13",
  "title" : "The Parting of the Ways",
  "description" : "As the Dalek fleet begin their attack on the Earth, the Doctor and his allies make one final stand."
}, {
  "imdbId" : "0436992",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "The Christmas Invasion",
  "description" : "It's Christmas Eve, but this is to be a far from silent night - the cruel Sycorax have come to Earth to enslave mankind and, as ever, only The Doctor can stop them. Unfortunately, he's lying in a coma in Jackie's home..."
}, {
  "imdbId" : "0436992",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "New Earth",
  "description" : "The Doctor and Rose arrive on New Earth and meet old friends and enemies in a hospital which can cure every disease. But the cures come at a terrible cost."
}, {
  "imdbId" : "0436992",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "Tooth and Claw",
  "description" : "The Doctor and Rose are transported to 19th Century Scotland, where they meet Queen Victoria, and try to protect her from a ravenous werewolf and a band of assassinating warrior-monks"
}, {
  "imdbId" : "0436992",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "School Reunion",
  "description" : "The Krillitanes - aliens with a mix-and-match physiology - are trying to crack the 'God-Maker', a paradigm to give them ultimate power. They are using children as a computer, and only the Doctor and Rose, re-united with Sarah Jane Smith and K9 can prevent them from becoming masters of time and space."
}, {
  "imdbId" : "0436992",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "The Girl in the Fireplace",
  "description" : "The Doctor, Mickey and Rose land on a spaceship in the 51st century only to find 18th century Versailles on board, the time of Madame De Pompadour! To find out what's going on the Doctor must enter Versailles and save Madame De Popmpadour but it turns into an emotional roller coaster for the Doctor."
}, {
  "imdbId" : "0436992",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "Rise of the Cybermen",
  "description" : "The TARDIS crash lands in London on a parallel world, where Rose's dad is still alive, people are disappearing off the streets and one of the Doctor's deadliest enemies is about to be reborn."
}, {
  "imdbId" : "0436992",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "The Age of Steel",
  "description" : "The Cybermen take control of London as the population is enslaved and the Doctor and his friends become fugitives."
}, {
  "imdbId" : "0436992",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "The Idiot's Lantern",
  "description" : "As the coronation of Elizabeth II nears, the streets of London live in fear. Faceless people are stolen from their homes in the night and something evil is lurking in the television."
}, {
  "imdbId" : "0436992",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "The Impossible Planet",
  "description" : "When the Doctor and Rose become stranded on a planet orbiting a black hole, they find a human expedition crew and their servants, the Ood, being terrorised by the Devil."
}, {
  "imdbId" : "0436992",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "The Satan Pit",
  "description" : "The Doctor risks his life to investigate the pit and is forced to make a terrible decision, while Rose and the crew fend for their lives against the Legion of the Beast."
}, {
  "imdbId" : "0436992",
  "season" : "2",
  "episodeNumber" : "11",
  "title" : "Love & Monsters",
  "description" : "Elton Pope is an ordinary man intrigued by the world of the Doctor. When he and fellow enthusiasts - L.I.N.D.A. - meet the mysterious Victor Kennedy, their lives will never be the same again."
}, {
  "imdbId" : "0436992",
  "season" : "2",
  "episodeNumber" : "12",
  "title" : "Fear Her",
  "description" : "When children vanish into thin air in 2012 London, the Doctor and Rose find the answers in a seemingly ordinary household and a girl whose drawings can come to life."
}, {
  "imdbId" : "0436992",
  "season" : "2",
  "episodeNumber" : "13",
  "title" : "Army of Ghosts",
  "description" : "When ghosts of loved ones appear all over the world the Doctor traces the phenomena to the Torchwood Tower, where some old friends and enemies are waiting."
}, {
  "imdbId" : "0436992",
  "season" : "2",
  "episodeNumber" : "14",
  "title" : "Doomsday",
  "description" : "Earth becomes a battleground for the Daleks and the Cybermen. With the whole planet at stake and the Genesis Ark activated, how much will the Doctor sacrifice in order to end the war?"
}, {
  "imdbId" : "0436992",
  "season" : "3",
  "episodeNumber" : "1",
  "title" : "The Runaway Bride",
  "description" : "The Doctor is baffled when a young woman is transported to the TARDIS on her wedding day, and attempts to find out how she is connected to an alien plot to destroy Earth."
}, {
  "imdbId" : "0436992",
  "season" : "3",
  "episodeNumber" : "2",
  "title" : "Smith and Jones",
  "description" : "When the hospital she works at is transported to the moon, medical student Martha Jones joins forces with The Doctor to hunt down an alien fugitive before the oxygen runs out."
}, {
  "imdbId" : "0436992",
  "season" : "3",
  "episodeNumber" : "3",
  "title" : "The Shakespeare Code",
  "description" : "The Doctor takes Martha to London in 1599, where William Shakespeare's new play is being used by three witches in an evil plan."
}, {
  "imdbId" : "0436992",
  "season" : "3",
  "episodeNumber" : "4",
  "title" : "Gridlock",
  "description" : "The Doctor takes Martha to New Earth, where she is kidnapped by two carjackers and taken to an underground Motorway, where the remainder of humanity on the planet live in perpetual gridlock."
}, {
  "imdbId" : "0436992",
  "season" : "3",
  "episodeNumber" : "5",
  "title" : "Daleks in Manhattan",
  "description" : "The Doctor and Martha travel to New York in 1930, where people have been mysteriously vanishing from the streets, and an old enemy resurfaces."
}, {
  "imdbId" : "0436992",
  "season" : "3",
  "episodeNumber" : "6",
  "title" : "Evolution of the Daleks",
  "description" : "Concluding part to Daleks in Manhattan. In 1930s New York, the Daleks' plan is in full force. Faced with the cyborgs' most evil and dangerous scheme yet, will the Doctor and Martha be able to defeat their greatest opponents?"
}, {
  "imdbId" : "0436992",
  "season" : "3",
  "episodeNumber" : "7",
  "title" : "The Lazarus Experiment",
  "description" : "The famous Dr Lazarus has appeared to discover the secret of eternal youth - but do his experiments hide a sinister secret?"
}, {
  "imdbId" : "0436992",
  "season" : "3",
  "episodeNumber" : "8",
  "title" : "42",
  "description" : "On a spaceship headed straight for the centre of the sun, the Doctor only has 42 minutes to save Martha and the ship's crew from an inevitable doom."
}, {
  "imdbId" : "0436992",
  "season" : "3",
  "episodeNumber" : "9",
  "title" : "Human Nature",
  "description" : "In 1913, Martha watches in jealousy from afar as The Doctor learns what it is to be human and to fall in love with the local school nurse, Joan Redfern."
}, {
  "imdbId" : "0436992",
  "season" : "3",
  "episodeNumber" : "10",
  "title" : "The Family of Blood",
  "description" : "The Doctor must deal with the repercussions of his decision to become human, as The Family Of Blood unveil themselves..."
}, {
  "imdbId" : "0436992",
  "season" : "3",
  "episodeNumber" : "11",
  "title" : "Blink",
  "description" : "Sally Sparrow receives a cryptic message from the Doctor about a mysterious new enemy species that is after the TARDIS."
}, {
  "imdbId" : "0436992",
  "season" : "3",
  "episodeNumber" : "12",
  "title" : "Utopia",
  "description" : "Soon after bumping into old friend Jack Harkness, Martha and The Doctor head off to Malcassairo, a distant planet where an old professor will do anything he can to keep his people alive..."
}, {
  "imdbId" : "0436992",
  "season" : "3",
  "episodeNumber" : "13",
  "title" : "The Sound of Drums",
  "description" : "The Doctor, Martha and Jack return to the 21st Century eighteen months after the Doctor and Martha left. They find they've missed the election, and the new Prime Minister, Harold Saxon, is someone they've met before by another name."
}, {
  "imdbId" : "0436992",
  "season" : "3",
  "episodeNumber" : "14",
  "title" : "Last of the Time Lords",
  "description" : "It's been a year since The Master unleashed the mysterious Toclafane onto Earth. With the human race and The Doctor enslaved under The Master's control, Martha Jones is the only person that can help stop the evil Time Lord."
}, {
  "imdbId" : "0436992",
  "season" : "4",
  "episodeNumber" : "1",
  "title" : "Voyage of the Damned",
  "description" : "A spacecraft set on an apocalyptic collision course with Earth, a host of killer robot angels and an evil severed headed mastermind - it's just another Christmas for the Doctor... 2007 Christmas special guest starring Kylie Minogue."
}, {
  "imdbId" : "0436992",
  "season" : "4",
  "episodeNumber" : "2",
  "title" : "Partners in Crime",
  "description" : "With a new weight-loss pill tested in London by Adipose Industries, The Doctor goes to investigate the sinister truth behind the product, only to find out that his old friend Donna Noble is investigating as well."
}, {
  "imdbId" : "0436992",
  "season" : "4",
  "episodeNumber" : "3",
  "title" : "The Fires of Pompeii",
  "description" : "Instead of Rome, The Doctor and Donna Noble end up visiting Pompeii in AD 79, on the eve of the catastrophic eruption of Mount Vesuvius. Before anyone even knew it was actually a volcano, the entire city is doomed for destruction."
}, {
  "imdbId" : "0436992",
  "season" : "4",
  "episodeNumber" : "4",
  "title" : "Planet of the Ood",
  "description" : "Finding themselves on the Ood-Sphere planet in the 42nd century, The Doctor and Donna discover the truth over the Ood's willingness to serve humankind."
}, {
  "imdbId" : "0436992",
  "season" : "4",
  "episodeNumber" : "5",
  "title" : "The Sontaran Stratagem",
  "description" : "UNIT's newest recruit Martha Jones enlists The Doctor's help to investigate kid genius Luke Rattigan and his ATMOS system that is used in every car on Earth."
}, {
  "imdbId" : "0436992",
  "season" : "4",
  "episodeNumber" : "6",
  "title" : "The Poison Sky",
  "description" : "With planet Earth choking under the poison sky, the Doctor must stop the Sontarans' threat to the planet."
}, {
  "imdbId" : "0436992",
  "season" : "4",
  "episodeNumber" : "7",
  "title" : "The Doctor's Daughter",
  "description" : "Caught in the middle of a war between the Humans and the Hath in the planet Messaline, the Doctor finds himself once again a father."
}, {
  "imdbId" : "0436992",
  "season" : "4",
  "episodeNumber" : "8",
  "title" : "The Unicorn and the Wasp",
  "description" : "With a 1926 dinner party turning into a murder mystery, The Doctor and Donna Noble get the chance to meet Agatha Christie on the eve of her well-known 9-days disappearance."
}, {
  "imdbId" : "0436992",
  "season" : "4",
  "episodeNumber" : "9",
  "title" : "Silence in the Library",
  "description" : "The Doctor and Donna join a group of archaeologists at a 51st century library. What caused the library to become abandoned? What are the Nodes? And what links the library to one little girl? All they have is one warning - count the shadows."
}, {
  "imdbId" : "0436992",
  "season" : "4",
  "episodeNumber" : "10",
  "title" : "Forest of the Dead",
  "description" : "With the library darkening, the Doctor takes on the Vashta Nerada while figuring out what links River Song to his future. Meanwhile, Donna finds out the mystery of Dr. Moon and the Girl."
}, {
  "imdbId" : "0436992",
  "season" : "4",
  "episodeNumber" : "11",
  "title" : "Midnight",
  "description" : "As part of a well-deserved holiday, the Doctor takes a tour on a planet called Midnight. Little does he know that something is knocking on the walls, although the planet shouldn't be inhabited. Soon the passengers begin to panic when one of them is possessed."
}, {
  "imdbId" : "0436992",
  "season" : "4",
  "episodeNumber" : "12",
  "title" : "Turn Left",
  "description" : "What would happen if Donna never met the Doctor? How would Earth handle the Racnoss, the falling Titanic or the Sontarans? Aided by a familiar blonde time traveler, Donna corrects the alternate time line from happening."
}, {
  "imdbId" : "0436992",
  "season" : "4",
  "episodeNumber" : "13",
  "title" : "The Stolen Earth",
  "description" : "The return of an old enemy leaves Earth along with 26 other planets stolen from their places. As the Doctor and Donna look for the whereabouts of Earth, former companions of the Doctor assemble a resistance against the new Dalek Empire."
}, {
  "imdbId" : "0436992",
  "season" : "4",
  "episodeNumber" : "14",
  "title" : "Journey's End",
  "description" : "In the wake of Davros' threat to destroy the existence of the Universe itself, the Doctor's companions unite to stop the Dalek empire. Which one will die by the prophecies and what will the fate be for the Doctor?"
}, {
  "imdbId" : "0436992",
  "season" : "5",
  "episodeNumber" : "1",
  "title" : "The Eleventh Hour",
  "description" : "With his TARDIS in ruins, the newly-regenerated Doctor with the help of Amy Pond must save the world in less than twenty minutes from galactic policemen known as the Atraxi."
}, {
  "imdbId" : "0436992",
  "season" : "5",
  "episodeNumber" : "2",
  "title" : "The Beast Below",
  "description" : "The Doctor takes Amy to the future inside Starship UK, which contains in addition to British explorers, an intimidating race known as the Smilers."
}, {
  "imdbId" : "0436992",
  "season" : "5",
  "episodeNumber" : "3",
  "title" : "Victory of the Daleks",
  "description" : "The TARDIS takes The Doctor and Amy to war-torn Britain in the middle of World War Two. Not only do they meet Winston Churchill himself, but the Doctor comes face to face once again with his greatest enemy of all."
}, {
  "imdbId" : "0436992",
  "season" : "5",
  "episodeNumber" : "4",
  "title" : "The Time of Angels",
  "description" : "The Doctor and Amy emerge from the TARDIS to find the wreck of the Byzantium spaceship. Down below the Weeping Angels are stirring, but the Doctor has someone else to contend with; none other than the mysterious Professor River Song."
}, {
  "imdbId" : "0436992",
  "season" : "5",
  "episodeNumber" : "5",
  "title" : "Flesh and Stone",
  "description" : "The Doctor, Amy, Dr. Song and the remaining soldiers manage to escape from the crashed ship and into the forest. The Angels attempt to create a rift in time and space much as the Doctor had found in Amy's room when they first met. Amy meanwhile is counting down from 10 minutes and the Doctor has determined that an Angel has taken over her mind."
}, {
  "imdbId" : "0436992",
  "season" : "5",
  "episodeNumber" : "6",
  "title" : "The Vampires of Venice",
  "description" : "The Doctor and Amy cross swords in more ways than one with a horde of blood-sucking vampires in 16th century Venice."
}, {
  "imdbId" : "0436992",
  "season" : "5",
  "episodeNumber" : "7",
  "title" : "Amy's Choice",
  "description" : "Five years after finally leaving the TARDIS Amy and Rory now married, live in the quiet little village of Leadworth. But everything is not what it would seem."
}, {
  "imdbId" : "0436992",
  "season" : "5",
  "episodeNumber" : "8",
  "title" : "The Hungry Earth",
  "description" : "When a drill drills to deep into the earth, something that had been hibernating beneath the earth's crust is woken, and it's hungry for revenge."
}, {
  "imdbId" : "0436992",
  "season" : "5",
  "episodeNumber" : "9",
  "title" : "Cold Blood",
  "description" : "The Silurians are awake, and Angry. The Silurians are preparing for war, A war that could decide who gets to live on earth, The Silurians or-the humans.."
}, {
  "imdbId" : "0436992",
  "season" : "5",
  "episodeNumber" : "10",
  "title" : "Vincent and the Doctor",
  "description" : "The Doctor and Amy travel back in time to meet Vincent Van Gogh and face an invisible monster that only the painter can see."
}, {
  "imdbId" : "0436992",
  "season" : "5",
  "episodeNumber" : "11",
  "title" : "The Lodger",
  "description" : "After the TARDIS teleports without him, the doctor tries to find out what is stopping it from landing and traces it to a seemingly ordinary, two story house."
}, {
  "imdbId" : "0436992",
  "season" : "5",
  "episodeNumber" : "12",
  "title" : "The Pandorica Opens",
  "description" : "River Song returns to deliver The Doctor a serious warning from his allies: the mythical Pandorica, said to contain the most feared creature in the entire Universe, is opening."
}, {
  "imdbId" : "0436992",
  "season" : "5",
  "episodeNumber" : "13",
  "title" : "The Big Bang",
  "description" : "The Pandorica opened, silence fell, and now planet Earth is left alone in the universe. Jumping through time, the doctor must figure out a way to bring back those who never were and save his friends from the collapse of reality."
}, {
  "imdbId" : "0436992",
  "season" : "6",
  "episodeNumber" : "1",
  "title" : "A Christmas Carol",
  "description" : "on Christmas eve, The doctor travels into the past of a bitter old man who has the power to save Amy and Rory but doesn't want to save them, so that he doesn't grow up to be mean and bitter."
}, {
  "imdbId" : "0436992",
  "season" : "6",
  "episodeNumber" : "2",
  "title" : "The Impossible Astronaut",
  "description" : "The Doctor, Amy, Rory and River Song are reunited in the Utah desert."
}, {
  "imdbId" : "0436992",
  "season" : "6",
  "episodeNumber" : "3",
  "title" : "Day of the Moon",
  "description" : "The Doctor and his allies mount a rebellion against invaders who have been controlling humanity from the very beginning."
}, {
  "imdbId" : "0436992",
  "season" : "6",
  "episodeNumber" : "4",
  "title" : "The Curse of the Black Spot",
  "description" : "The Doctor, Amy and Rory find themselves aboard a marooned pirate ship whose crew is being picked off one by one by a beautiful - and deadly - Siren."
}, {
  "imdbId" : "0436992",
  "season" : "6",
  "episodeNumber" : "5",
  "title" : "The Doctor's Wife",
  "description" : "The Doctor is lured to a sentient asteroid outside of the Universe by a Time Lord distress signal and soon realises his TARDIS is in grave danger."
}, {
  "imdbId" : "0436992",
  "season" : "6",
  "episodeNumber" : "6",
  "title" : "The Rebel Flesh",
  "description" : "A solar tsunami sends the TARDIS crew to an acid mining factory in the 22nd century, where a small team of workers come under attack from their doppelgangers."
}, {
  "imdbId" : "0436992",
  "season" : "6",
  "episodeNumber" : "7",
  "title" : "The Almost People",
  "description" : "The gangers and humans battle for their lives as the factory crumbles and the Doctor tries to keep the peace - can everyone make it off the island alive?"
}, {
  "imdbId" : "0436992",
  "season" : "6",
  "episodeNumber" : "8",
  "title" : "A Good Man Goes to War",
  "description" : "A member of The Doctor's team has been abducted and he will call in every favor and maybe even go to war to get them back."
}, {
  "imdbId" : "0436992",
  "season" : "6",
  "episodeNumber" : "9",
  "title" : "Let's Kill Hitler",
  "description" : "The search for Melody Pond brings the Doctor and his friends to Berlin in 1938, face-to-face with Adolf Hitler, River Song and a justice-serving, shapeshifting robot."
}, {
  "imdbId" : "0436992",
  "season" : "6",
  "episodeNumber" : "10",
  "title" : "Night Terrors",
  "description" : "Receiving a powerful distress call from a terrified little boy, the Doctor and his friends soon find that the monsters in his cupboard are real - and deadly."
}, {
  "imdbId" : "0436992",
  "season" : "6",
  "episodeNumber" : "11",
  "title" : "The Girl Who Waited",
  "description" : "Amy is trapped in a quarantine facility where time moves faster than in reality, while the Doctor is confined to the TARDIS. Can Rory save his wife in time?"
}, {
  "imdbId" : "0436992",
  "season" : "6",
  "episodeNumber" : "12",
  "title" : "The God Complex",
  "description" : "The Doctor, Amy and Rory become trapped in a hotel of horrors unable to escape and unable to find the TARDIS. The Doctor must save as many people as he can taking many twists and seeing his own worst fear."
}, {
  "imdbId" : "0436992",
  "season" : "6",
  "episodeNumber" : "13",
  "title" : "Closing Time",
  "description" : "The Doctor makes one last stop before his death to see an old friend. But people are disappearing, there are reports of a silver rat and metal men are lurking in the shadows."
}, {
  "imdbId" : "0436992",
  "season" : "6",
  "episodeNumber" : "14",
  "title" : "The Wedding of River Song",
  "description" : "April 22nd, 2011; 5:02pm. Having finally accepted his fate the Doctor travels to Lake Silencio for his final day. But one woman refuses to let time take its course."
}, {
  "imdbId" : "0436992",
  "season" : "7",
  "episodeNumber" : "1",
  "title" : "The Doctor, the Widow and the Wardrobe",
  "description" : "It's Christmas Eve, 1938, when Madge Arwell comes to the aid of an injured Spaceman Angel as she cycles home. He promises to repay her kindness - all she has to do is make a wish. Three years later, a devastated Madge escapes war-torn London with her two children for a dilapidated house in Dorset. She is crippled with grief at the news her husband has been lost over the channel, but determined to give Lily and Cyril the best Christmas ever. The Arwells are surprised to be greeted by a madcap caretaker whose mysterious Christmas gift leads them into a magical wintry ..."
}, {
  "imdbId" : "0436992",
  "season" : "7",
  "episodeNumber" : "2",
  "title" : "Asylum of the Daleks",
  "description" : "Amy, Rory and the Doctor are reunited when they are kidnapped by the Daleks, who send them on a mission to destroy the most horrifying place in the universe- the asylum of the Daleks."
}, {
  "imdbId" : "0436992",
  "season" : "7",
  "episodeNumber" : "3",
  "title" : "Dinosaurs on a Spaceship",
  "description" : "The doctor gathers some of his old friends to help him investigate an unmanned spaceship on a crash course to earth that when it collides, will destroy it, they soon discover the ship's precious and dangerous cargo- dinosaurs."
}, {
  "imdbId" : "0436992",
  "season" : "7",
  "episodeNumber" : "4",
  "title" : "A Town Called Mercy",
  "description" : "The Doctor gets a Stetson (and a gun), and finds himself the reluctant Sheriff of a Western town under siege by a relentless cyborg who goes by the name of The Gunslinger. But who is he and what does he want?"
}, {
  "imdbId" : "0436992",
  "season" : "7",
  "episodeNumber" : "5",
  "title" : "The Power of Three",
  "description" : "Earth is suddenly visited by millions of small black cubes of unknown origin. The Doctor joins Amy, Rory and Rory's father, Brian, to help discover what these cubes bring for humanity."
}, {
  "imdbId" : "0436992",
  "season" : "7",
  "episodeNumber" : "6",
  "title" : "The Angels Take Manhattan",
  "description" : "After Rory has an encounter with a weeping angel, the doctor and Amy travel to 1930's New York to save him, but they soon discover that the weeping angels have taken over Manhattan, and soon, maybe, the world."
}, {
  "imdbId" : "0436992",
  "season" : "7",
  "episodeNumber" : "7",
  "title" : "The Snowmen",
  "description" : "London, 1892. Snow is evolving, turning into icy monstrosities, but this is no concern for the Doctor whose given up trying to save the universe, leaving it to a clever young governess named Clara to save the day."
}, {
  "imdbId" : "0436992",
  "season" : "7",
  "episodeNumber" : "8",
  "title" : "The Bells of Saint John",
  "description" : "The doctor finds Clara in present day, where they work together to solve the mystery of people disappearing which as it turns out, has a sinister link to WiFi."
}, {
  "imdbId" : "0436992",
  "season" : "7",
  "episodeNumber" : "9",
  "title" : "The Rings of Akhaten",
  "description" : "The doctor takes Clara to the rings of Akheten, A partly destroyed planet, where a religious ceremony is about to be carried out, but a darkness is stirring, a hungry darkness that could consume the rings of Akhetan and the universe."
}, {
  "imdbId" : "0436992",
  "season" : "7",
  "episodeNumber" : "10",
  "title" : "Cold War",
  "description" : "The doctor and Clara find themselves on a Russian cold war submarine that is falling to the bottom of the ocean because of an attack by a rogue Martian warrior, that 's still aboard."
}, {
  "imdbId" : "0436992",
  "season" : "7",
  "episodeNumber" : "11",
  "title" : "Hide",
  "description" : "The Doctor and Clara arrive at a supposedly haunted mansion where they find a ghost hunter and a psychic who are on the search for a legendary ghost known as 'the witch of the well'"
}, {
  "imdbId" : "0436992",
  "season" : "7",
  "episodeNumber" : "12",
  "title" : "Journey to the Centre of the TARDIS",
  "description" : "After the TARDIS is caught accidentally by an outer space trash collector, Clara is trapped deep inside of it where she finds herself on a journey through the doctor's past and her future."
}, {
  "imdbId" : "0436992",
  "season" : "7",
  "episodeNumber" : "13",
  "title" : "The Crimson Horror",
  "description" : "When they find a picture of the Doctor in a recently dead man's eye, it's up to Madame Vastra, Jenny and Strax to save The Doctor and find out what sinister secrets are going on at Sweetsville, Yorkshire."
}, {
  "imdbId" : "0436992",
  "season" : "7",
  "episodeNumber" : "14",
  "title" : "Nightmare in Silver",
  "description" : "the doctor takes Clara and the children she babysits to a rundown amusement park in space where Cybermen are hiding, and ready to invade the most precious place in the universe, The Doctor's mind."
}, {
  "imdbId" : "0436992",
  "season" : "7",
  "episodeNumber" : "15",
  "title" : "The Name of the Doctor",
  "description" : "The Doctor's friends are being kidnapped, which leads him to the fields of Trenzalore, where his greatest secret will be revealed and Clara's mystery will be solved."
}, {
  "imdbId" : "0436992",
  "season" : "8",
  "episodeNumber" : "1",
  "title" : "The Time of the Doctor",
  "description" : "The Doctor's worst enemies, The Daleks, The Cybermen, The Angels and The Silence, return, as the doctor's eleventh life comes to a close, and his twelfth life begins."
}, {
  "imdbId" : "0436992",
  "season" : "8",
  "episodeNumber" : "2",
  "title" : "Deep Breath",
  "description" : "When the newly-regenerated doctor arrives in Victorian London, he finds a dinosaur rampant in the Thames and a spate of deadly spontaneous combustions."
}, {
  "imdbId" : "0436992",
  "season" : "8",
  "episodeNumber" : "3",
  "title" : "Into the Dalek",
  "description" : "a rebel ship, surrounded by Daleks, the crew's only hope? The Doctor and Clara, who are on a mission, a mission that will send them deep inside the heart of the most dangerous place on earth- The Inside, of a Dalek."
}, {
  "imdbId" : "0436992",
  "season" : "8",
  "episodeNumber" : "4",
  "title" : "Robot of Sherwood",
  "description" : "In Sherwood Forest, the Doctor uncovers a sinister alien plot and forms an alliance with Robin Hood. With Nottingham at stake, the Doctor must decide who is real and who is fake."
}, {
  "imdbId" : "0436992",
  "season" : "8",
  "episodeNumber" : "5",
  "title" : "Listen",
  "description" : "When ghosts of past and future crowd into their lives, The Doctor and Clara are thrown into an adventure that takes them to the very end of the universe."
}, {
  "imdbId" : "0436992",
  "season" : "8",
  "episodeNumber" : "6",
  "title" : "Time Heist",
  "description" : "The Doctor and Clara wake up in a room with two other people, unable to remember how they got there. As it turns out Someone known as the Architect has employed them to Break into the Universe's most secure bank."
}, {
  "imdbId" : "0436992",
  "season" : "8",
  "episodeNumber" : "7",
  "title" : "The Caretaker",
  "description" : "The terrifying Skovox Blitzer is ready to destroy all humanity - but worse, and any second now, Danny Pink and the Doctor are going to meet."
}, {
  "imdbId" : "0436992",
  "season" : "8",
  "episodeNumber" : "8",
  "title" : "Kill the Moon",
  "description" : "In the near future, the Doctor and Clara find themselves on a space shuttle making a suicide mission to the Moon. Crash-landing on the lunar surface they find the most terrible things."
}, {
  "imdbId" : "0436992",
  "season" : "8",
  "episodeNumber" : "9",
  "title" : "Mummy on the Orient Express",
  "description" : "On the most beautiful train in history, speeding amongst the stars of the future, a deadly and immortal creature is stalking the passengers."
}, {
  "imdbId" : "0436992",
  "season" : "8",
  "episodeNumber" : "10",
  "title" : "Flatline",
  "description" : "A problem happens with the Tardis, trapping the Doctor inside and leaving Clara to fend for herself against a two dimensional enemy."
}, {
  "imdbId" : "0436992",
  "season" : "8",
  "episodeNumber" : "11",
  "title" : "In the Forest of the Night",
  "description" : "One morning in London, and every city and town in the world, the human race wakes up to the most surprising invasion yet: the trees have moved back in. Everywhere, in every land, a forest has grown and taken back the Earth."
}, {
  "imdbId" : "0436992",
  "season" : "8",
  "episodeNumber" : "12",
  "title" : "Dark Water",
  "description" : "In the mysterious world of the Nethersphere, plans have been drawn. Old friends and old enemies manoeuvre around the Doctor, and an impossible choice is looming over him."
}, {
  "imdbId" : "0436992",
  "season" : "8",
  "episodeNumber" : "13",
  "title" : "Death in Heaven",
  "description" : "With Cybermen on the streets of London, old friends unite against old enemies and the Doctor takes to the air in a startling new role. As the Doctor faces his greatest challenge, sacrifices must be made before the day is won."
}, {
  "imdbId" : "0436992",
  "season" : "9",
  "episodeNumber" : "1",
  "title" : "Last Christmas",
  "description" : "The Doctor and Clara face their Last Christmas. Trapped on an Arctic base, under attack from terrifying creatures, who are you going to call? Santa Claus!"
}, {
  "imdbId" : "0436992",
  "season" : "9",
  "episodeNumber" : "2",
  "title" : "The Magician's Apprentice",
  "description" : "When the skies of Earth are frozen by a mysterious alien force, Clara needs her friend, the Doctor. But where is he and what is he hiding from?"
}, {
  "imdbId" : "0436992",
  "season" : "9",
  "episodeNumber" : "3",
  "title" : "The Witch's Familiar",
  "description" : "Trapped and alone in a terrifying Dalek city, the Doctor is at the heart of an evil Empire; no sonic, no TARDIS, nobody to help. With his greatest temptation before him, can the Doctor resist? And will there be mercy?"
}, {
  "imdbId" : "0436992",
  "season" : "9",
  "episodeNumber" : "4",
  "title" : "Under the Lake",
  "description" : "The Doctor and Clara find themselves on a underwater station where the crew live in fear of deadly ghosts which have taken over the station."
}, {
  "imdbId" : "0436992",
  "season" : "9",
  "episodeNumber" : "5",
  "title" : "Before the Flood",
  "description" : "In a town that never was, the Doctor and his friends are being stalked by a mysterious figure. With the past and future in the balance, can the Doctor stop the evil Fisher King? And more importantly, who composed Beethoven's 5th."
}, {
  "imdbId" : "0436992",
  "season" : "9",
  "episodeNumber" : "6",
  "title" : "The Girl Who Died",
  "description" : "In a Viking village, a girl named Ashildr is about to make a desperate mistake. The Mire are the deadliest mercenaries in the galaxy, famed for showing no mercy and Ashildr has just declared war on them. The Doctor and Clara have 12 hours to turn a peaceful village into strong fighters, ready for the deadly Mire."
}, {
  "imdbId" : "0436992",
  "season" : "9",
  "episodeNumber" : "7",
  "title" : "The Woman Who Lived",
  "description" : "England, 1651. A deadly highwayman known only as 'The Knightmare' plagues the dark streets of London, his fire-breathing accomplice by his side. There's something clearly more than human here, and that includes the loot as much as the outlaws. Who are these creatures, and are they enemies to be fought, or friends who might possibly save the Doctor from certain doom on the gallows?"
}, {
  "imdbId" : "0436992",
  "season" : "9",
  "episodeNumber" : "8",
  "title" : "The Zygon Invasion",
  "description" : "Zygons, a shape-shifting alien race, and humans live in peace together on earth, but a group of rogue zygons threaten the peace between humans and zygons."
}, {
  "imdbId" : "0436992",
  "season" : "9",
  "episodeNumber" : "9",
  "title" : "The Zygon Inversion",
  "description" : "With the Zygons invading England, and UNIT neutralized, the Doctor stands alone to stop the Zygons from taking over the entire planet. But how can he stop the Zygons? And how can he save his friends?"
}, {
  "imdbId" : "0436992",
  "season" : "9",
  "episodeNumber" : "10",
  "title" : "Sleep No More",
  "description" : "Vision recovered from the wreckage of Le Verrier Space Station shows how the Doctor and Clara became entangled in a rescue mission. As the footage plays out, a horrifying secret is uncovered."
}, {
  "imdbId" : "0436992",
  "season" : "9",
  "episodeNumber" : "11",
  "title" : "Face the Raven",
  "description" : "The Doctor and Clara are called back to Earth when Rigsy discovers a strange tattoo on the back of his neck that appears to be counting down to zero. Their investigation leads them to a hidden street in the middle of London, the discovery that Rigsy has been issued a death sentence, and one of them facing the choice of having to make the ultimate sacrifice; to face the Raven!"
}, {
  "imdbId" : "0436992",
  "season" : "9",
  "episodeNumber" : "12",
  "title" : "Heaven Sent",
  "description" : "Trapped in a world unlike any other he has seen, the Doctor faces the greatest challenge of his many lives. One final test. And he must face it alone..."
}, {
  "imdbId" : "0436992",
  "season" : "9",
  "episodeNumber" : "13",
  "title" : "Hell Bent",
  "description" : "If you took everything from him, betrayed him, trapped him, and broke both his hearts... how far might the Doctor go? Returning to Gallifrey, the Doctor faces the Time Lords in a struggle that will take him to the end of time itself. Who is the Hybrid? And what is the Doctor's confession?"
}, {
  "imdbId" : "0436992",
  "season" : "9",
  "episodeNumber" : "14",
  "title" : "The Husbands of River Song",
  "description" : "When a crashed spaceship calls upon the Doctor for help, he finds himself recruited into River Song's squad and hurled into a chase across the galaxy."
}, {
  "imdbId" : "0436992",
  "season" : "10",
  "episodeNumber" : "1",
  "title" : "The Return of Doctor Mysterio",
  "description" : "In New York, with brain-swapping aliens poised to attack, the Doctor and Nardole link up with an investigative reporter and a mysterious masked superhero known only as the Ghost. Can the Doctor save Manhattan? And what will be revealed when we see behind the mask?"
}, {
  "imdbId" : "0436992",
  "season" : "10",
  "episodeNumber" : "2",
  "title" : "The Pilot",
  "description" : "The Doctor and Nardole team up with a university student to take down a sinister life-mimicking alien."
}, {
  "imdbId" : "0436992",
  "season" : "10",
  "episodeNumber" : "3",
  "title" : "Smile",
  "description" : "The Doctor brings Bill to a future human colony, where cute EmojiBots work as willing servants and make sure everybody's happy, but if they're not happy ,they're harvested, so Bill and The Doctor better smile, or else."
}, {
  "imdbId" : "0436992",
  "season" : "10",
  "episodeNumber" : "4",
  "title" : "Thin Ice",
  "description" : "The Doctor and Bill visit London during the last of the River Thames frost fairs in February 1814. They soon discover that there is something under the ice which is causing people to disappear."
}, {
  "imdbId" : "0436992",
  "season" : "10",
  "episodeNumber" : "5",
  "title" : "Knock Knock",
  "description" : "Bill is moving in with some friends and they've found the perfect house rented by the landlord. The wind blows, the floorboards creak and the Doctor thinks something is very wrong."
}, {
  "imdbId" : "0436992",
  "season" : "10",
  "episodeNumber" : "6",
  "title" : "Oxygen",
  "description" : "When the Doctor, Bill and Nardole become trapped on a space station without oxygen, they discover the spacesuits are trying to kill them."
}, {
  "imdbId" : "0436992",
  "season" : "10",
  "episodeNumber" : "7",
  "title" : "Extremis",
  "description" : "The Doctor is called by the Vatican to solve the mystery of a text called the Veritas, that when someone reads it dies soon after. But something is dwelling in the Vatican, and doesn't want the Veritas to be read."
}, {
  "imdbId" : "0436992",
  "season" : "10",
  "episodeNumber" : "8",
  "title" : "The Pyramid at the End of the World",
  "description" : "A 5,000-year-old pyramid appears overnight, baffling everyone including the Doctor."
}, {
  "imdbId" : "0436992",
  "season" : "10",
  "episodeNumber" : "9",
  "title" : "The Lie of the Land",
  "description" : "Earth is invaded and Bill is living alone in occupied Britain. The Doctor appears to be on the side of the enemy, flooding the airwaves with fake news. Bill and Nardole embark on a deadly mission to rescue the Doctor and lead the resistance against the new regime, whatever the cost."
}, {
  "imdbId" : "0436992",
  "season" : "10",
  "episodeNumber" : "10",
  "title" : "Empress of Mars",
  "description" : "The Doctor, Bill and Nardole discover a tomb of the Queen of the Ice Warriors on Mars in 1881."
}, {
  "imdbId" : "0436992",
  "season" : "10",
  "episodeNumber" : "11",
  "title" : "The Eaters of Light",
  "description" : "A long time ago, the Roman legion of the ninth vanished into the mists of Scotland. Bill has a theory about what happened, and the Doctor has a time machine. But when they arrive in ancient Aberdeenshire, what they find is a far greater threat than any army. In a cairn, on a hillside, is a doorway leading to the end of the world."
}, {
  "imdbId" : "0436992",
  "season" : "10",
  "episodeNumber" : "12",
  "title" : "World Enough and Time",
  "description" : "Trapped on a giant spaceship, caught in the event horizon of a black hole, he witnesses the death of someone he is pledged to protect. Are events already out of control?"
}, {
  "imdbId" : "0436992",
  "season" : "10",
  "episodeNumber" : "13",
  "title" : "The Doctor Falls",
  "description" : "The Doctor makes a final stand against an army of Cybermen to protect a tiny band of humans from destruction."
}]