[{
  "imdbId" : "0061277",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "The Name Is Mannix",
  "description" : "In the series debut, individualist private detective Joe Mannix is working at a corporate agency. Company rules dictate only one piece of paper on a desk at a time; Mannix's desk is cluttered. Despite Mannix's disdain for the rules, the head of the agency, Lew Wickersham also knows Mannix \"is my best man.\" Mannix is sent to investigate a missing person's case. The client is a retired mobster, who first tests Mannix. The detective is told the missing person, the mobster's daughter, is kidnapped. Mannix will encounter much treachery before learning the true facts of the..."
}, {
  "imdbId" : "0061277",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Skid Marks on a Dry Run",
  "description" : "A potential candidate for governor, a successful businessman employs Intertect to probe his background. His rationale: he wants to see if the detective agency can turn up any dirt that could be used by political opponents. If Intertect can't find any, he reasons his political opponents wouldn't be able to do so, either. Mannix follows his own leads while his Intertect colleagues probe the obvious. As Mannix's investigation progresses, people he has interviewed turn up dead. It turns out the candidate is part of the Syndicate and even sits on its council. Now, Mannix ..."
}, {
  "imdbId" : "0061277",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Nothing Ever Works Twice",
  "description" : "Mannix reluctantly agrees to pursue a divorce case -- the woman involved is an old flame of his. The detective ends up being framed for murder."
}, {
  "imdbId" : "0061277",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "The Many Deaths of Saint Christopher",
  "description" : "A group of businessmen approach Intertect. They say they want to approach a former colleague and offer him $1 million for a new formula. Mannix is suspicious the clients aren't telling the truth. He befriends the daughter of the man the businessmen want to approach and she falls for him. Mannix keeps digging and discovers the clients are really Nazi hunters. Or are they really Nazis? Mannix must find the answer and save the life of the daughter."
}, {
  "imdbId" : "0061277",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Make It Like It Never Happened",
  "description" : "A little girl wishes to \"rent a detective\" to prove that her father, who is on Death Row, is innocent. Mannix takes the case, working on his own time, and will have to do without Intertect's help. Mannix romances the mistress of a reclusive rich man at whose estate the murder took place. The detective must cope with a web of deceit to find out what really happened."
}, {
  "imdbId" : "0061277",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "The Cost of a Vacation",
  "description" : "A model spots a Latin man she met on a vacation but he flees. She hires a former boyfriend, Joe Mannix, to track down the man. But the case quickly becomes more complicated. It turns out the Latin man is an assassin. The lives of both Mannix and his client are now endangered."
}, {
  "imdbId" : "0061277",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Warning: Live Blueberries",
  "description" : "Mannix is hired by an old friend to find his college-age daughter, who is living in a commune. Mannix soon discovers the commune has secrets that can be deadly to discover. One college basketball player has already died. And why is a hoodlum so interested in what transpires at the commune?"
}, {
  "imdbId" : "0061277",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Beyond the Shadow of a Dream",
  "description" : "A 26-year-old woman, worth $10 million, hires Intertect to do a background check on her boyfriend. It turns out the woman has spent 10 years in a mental hospital and seems on the verge of cracking up. Mannix suspects something more sinister. The woman is surrounded by shady characters. The detective concludes one of them seeks to drive her back to the mental hospital."
}, {
  "imdbId" : "0061277",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "Huntdown",
  "description" : "Mannix, on the mend after a gunshot has one foot in a cast, is given a routine assignment by Intertect boss Lew Wickersham: get the signature of a man named Amos Silo on a legal document. The detective takes a bus to a small town but finds a chilly reception whenever he inquires about the man or his ranch. The town is hiding something. As Mannix digs deeper, he discovers dead cattle are part of the mystery. The question is whether he'll survive to find out the rest."
}, {
  "imdbId" : "0061277",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "Coffin for a Clown",
  "description" : "Mannix is working on a child custody case that should be routine. It isn't. It begins with Mannix barely saving the life of the boy who is the subject of the custody fight. As Mannix's investigation continues, it becomes clear the boy's father is the target of killers, including one attempt by using explosives. Yet, the father isn't rich. Mannix must figure out the motive before the boy and father are harmed."
}, {
  "imdbId" : "0061277",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "A Catalogue of Sins",
  "description" : "A burglar steals notebooks from a psychiatrist but double crosses an accomplice and takes the notebooks for himself. One of the patients hires Mannix and Intertect after being blackmailed. Mannix's client is a movie studio art director who has a secret in his past. The trail turns deadly. The burglar and a companion turn up dead and Intertect boss Lew Wickersham is wounded."
}, {
  "imdbId" : "0061277",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "Turn Every Stone",
  "description" : "A crusading newspaper editor is preparing an explosive expose of a state legislator. But a man who supposedly had the documentation has fled just as the story went to press. The editor hires Intertect, which sends Mannix to work on the case. Mannix and Intertect boss Wickersham come to doubt whether the legislator is corrupt. But somebody is responsible for a trail of bodies and Mannix is determined to find out who."
}, {
  "imdbId" : "0061277",
  "season" : "1",
  "episodeNumber" : "13",
  "title" : "Run, Sheep, Run",
  "description" : "Intertect is retained by the police department to help transport a woman informant to safety. At least that's the story Mannix is told by a police inspector. But the case proves more complicated -- and very deadly. The informant turns out to be an undercover policewoman and Mannix is really a decoy. The policewoman is killed and Mannix remains the target of crooked cops."
}, {
  "imdbId" : "0061277",
  "season" : "1",
  "episodeNumber" : "14",
  "title" : "Then the Drink Takes the Man",
  "description" : "Mannix infiltrates an alcohol-rehabilitation center in Mexico. His client is a young woman who fears her father is being swindled. Intertect has devised a cover identity so that Mannix poses as an alcoholic who has been committed there by an Intertect operative posing as his wife. Mannix discovers a confidence man is also posing as a patient. In the middle of the case, another patient turns up dead and Mannix finds out there have been several unsolved murders nearby. If Mannix isn't careful, he could be the next victim."
}, {
  "imdbId" : "0061277",
  "season" : "1",
  "episodeNumber" : "15",
  "title" : "Falling Star",
  "description" : "Vain, arrogant, fading movie star Anne Marion calls a press conference to announce plans for an autobiography. Then, a bomb goes off. The actress hires Intertect and, after a look at available operatives, decides Mannix is her man. The assumption was the bomb was a publicity stunt. Mannix visits one of Anne's ex-husbands, who performs special effects work. The bomb was supposed to be a dud. Mannix is convinced that someone wants to do the actress harm. She has three suspicious ex-husbands, one of whom is an arrogant hothead, the other who employs shady and violent ..."
}, {
  "imdbId" : "0061277",
  "season" : "1",
  "episodeNumber" : "16",
  "title" : "License to Kill - Limit Three People",
  "description" : "Three people are brutally murdered. The evidence points to David Tate. When a potential client approaches Intertect about trying to prove Tate innocent, Mannix agrees to take the case. The private detective finds himself caught in between the police and whoever is framing Tate."
}, {
  "imdbId" : "0061277",
  "season" : "1",
  "episodeNumber" : "17",
  "title" : "Deadfall: Part 1",
  "description" : "An Intertect security chief apparently has been killed while driving. At almost the same time, an explosion at an Intertect client has killed a technician and destroyed a new laser device. Mannix suddenly is thrust into the case while Intertect chief Wickersham begins acting erratically, the side effect of medication for an infection. Mannix concludes that the Intertect security man may have sold out, along with somebody at the client. Mannix later finds that the Intertect security man is still alive. Mannix, though, isn't having an easy time. The Intertect chief's ..."
}, {
  "imdbId" : "0061277",
  "season" : "1",
  "episodeNumber" : "18",
  "title" : "Deadfall: Part 2",
  "description" : "A doctor for Intertect arrives and treats Mannix's injuries. The physician also informs Mannix that Lew Wickersham has been taking steroids prescribed to treat an infection. That's why Wickersham's behavior has been erratic. Mannix and Wickersham separately probe the conspiracy that has left three people dead. If they aren't careful, the death toll will rise again."
}, {
  "imdbId" : "0061277",
  "season" : "1",
  "episodeNumber" : "19",
  "title" : "You Can Get Killed Out There",
  "description" : "Mannix quits Intertect after Wickersham agrees to accept a case from suspected gang boss Aram Karmalis. Striking out on his own, Mannix agrees to help a young woman. But it turns out that Mannix is now working a different angle of the same case."
}, {
  "imdbId" : "0061277",
  "season" : "1",
  "episodeNumber" : "20",
  "title" : "Another Final Exit",
  "description" : "Down on his luck Bernie Farmer is married to Rose, who's the sister of a mobster. When the criminal is about to be paroled, Bernie decides to open a box the mobster had entrusted to him. But the box is empty. Mannix and Intertect boss Wickersham, against their better judgment, opt to help Bernie find what was in the box. Mannix sets himself up as a target, letting people think he has the box and its contents. The detective will endure multiple beatings as he tries to solve the case."
}, {
  "imdbId" : "0061277",
  "season" : "1",
  "episodeNumber" : "21",
  "title" : "Eight to Five, It's a Miracle",
  "description" : "Mannix is hired to investigate a supposed miracle that has occurred on land owned by a mobster. When a man turns up dead and the mobster's thugs beat on Mannix, the miracle's legitimacy seems highly doubtful. But the motives for faking the miracle are murky, at best. The mobster doesn't stand to gain financially. But Mannix is determined to find the truth."
}, {
  "imdbId" : "0061277",
  "season" : "1",
  "episodeNumber" : "22",
  "title" : "Delayed Action",
  "description" : "A man named Spinelli shows up severely injured at a hospital emergency room, asking for Mannix. The detective arrives. He's never seen Spinelli before in his life. From this odd beginning, Mannix will be beaten, suspended by Intertect and shot at with a spear gun as he tries to solve a mystery extending back more than 20 years."
}, {
  "imdbId" : "0061277",
  "season" : "1",
  "episodeNumber" : "23",
  "title" : "To Kill a Writer",
  "description" : "A mystery writer finds a suicide note in his home -- supposedly written by himself. The author specializes in stories that are based on actual cases and he's working on a new novel taken from an unsolved murder. Mannix tries to protect the author, but the writer insists on trying to work on the case. This complicates things greatly for Mannix. In addition, Mannix must deal with a collection of shady characters as he tries to find the would-be killer."
}, {
  "imdbId" : "0061277",
  "season" : "1",
  "episodeNumber" : "24",
  "title" : "The Girl in the Frame",
  "description" : "Wealthy art collector Calvin Norris, while visiting an artist friend, sees a woman modeling for a sculptor in the studio across the alley. Norris is shocked. The woman looks exactly like the subject of a Renoir painting he owns. He tries to get to the woman but she is gone before he can get to the sculptor's studio. Norris hires Mannix and Intertect to track the woman down. Norris is more interested in her than the possibility his painting is a forgery. Mannix, relying more on legwork than Intertect's computers, finds the woman, who, it turns out is really an artist ..."
}, {
  "imdbId" : "0061277",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "The Silent Cry",
  "description" : "Mannix has finally quit the detective agency for good and is out on his own. The second season begins when Mannix encounters a deaf woman who has witnesses a criminal talking at a pay telephone, discussing a kidnapping. She has made out certain key words because of her ability to read lips. Mannix gets her to remember enough of the conversation so that he can proceed in his investigation. The detective finds a rich man who says his wife has been kidnapped. It turns out the rich man has really hired the criminal to kill his wife and make it look like a kidnapping - and..."
}, {
  "imdbId" : "0061277",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "Comes Up Rose",
  "description" : "Charlie Anderson, a former policeman who once saved Joe Mannix's life, hires the detective when his wife has run off. The wife is somebody else Charlie met while a policeman - a one-time prostitute who went straight. Charlie now is a security guard at a air cargo facility. One test run has gone badly, thanks to Charlie being suspicious of hoods. Mannix, after being beaten by hoods, learns in the hospital that Charlie and his wife are together again and that he's off the case. Mannix is determined to find the truth."
}, {
  "imdbId" : "0061277",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "Pressure Point",
  "description" : "Joey, a young man who helped Mannix out on a previous case, shows up in the detective's apartment, injured from a beating. Mannix hides Joey and gets a call out to the police just before the apartment is overrun by hoods. Mannix is beaten and when he wakes up, Joey is gone. As the detective follows the trail, an organized front tries to buy Mannix off with a trip to Hong Kong on a supposed case. It turns out that the target of all this is a judge, whose daughter is in love with Joey. The syndicate wants to pressure the judge to move the site of a trial for an ..."
}, {
  "imdbId" : "0061277",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "To the Swiftest, Death",
  "description" : "Mannix has taken up a new hobby, amateur auto racing. While participating in a race, another racer is killed when his car seems to lose control and goes over an embankment. The widow of the dead racer contacts Mannix, wanting him to investigate, believing the death was a homicide. As Mannix proceeds, it's clear federal authorities have much more interest in what seems like a routine case."
}, {
  "imdbId" : "0061277",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "End of the Rainbow",
  "description" : "A recently paroled ex-con is killed by a hit-and-run driver. The man had a matchbook with Mannix's phone number in it. Mannix tries to find out why the ex-con was killed. As his investigation, proceeds, Mannix discovers a plot -- and the detective may be its next victim."
}, {
  "imdbId" : "0061277",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "A Copy of Murder",
  "description" : "An author, preparing a book about a well-publicized murder case in a small California city, is killed when his yacht blows up. The author's publisher hires Mannix to find the book's last chapter, which is said to solve the murder case. Mannix encounters a hostile police chief who wants to chase him off and an oil-company executive wanting to buy him off. Mannix refuses the bribe and endures a beating but remains committed to finding the missing chapter."
}, {
  "imdbId" : "0061277",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "Edge of the Knife",
  "description" : "Mannix is hired by successful heart surgeon Cameron McKenzie, whose young son was apparently kidnapped by someone who looked exactly like the doctor, driving a car that also looked exactly like the doctor's car. Mannix agrees to look into the kidnapping if the police will be notified once Mannix runs into a dead end. But then Dr. McKenzie confesses something he has held back: the kidnappers don't want a ransom -- they want McKenzie to let one of his patients die in exchange for the boy's life."
}, {
  "imdbId" : "0061277",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "Who Will Dig the Graves?",
  "description" : "Mannix is hired by a secretive multi-millionaire to find his ex-wife. At least that's what he has been told when he takes the job. The ex-wife, a prominent singer, supposedly committed suicide but has been seen since her supposed death. As Mannix pursues the trail, it becomes clear he hasn't been given the entire story. The lives of Mannix and the ex-wife may soon come to an end unless the detective solves the mystery."
}, {
  "imdbId" : "0061277",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "The Need of a Friend",
  "description" : "Mannix seeks to help a man released from prison after seven years. The detective helped send him to prison. This occurred when Mannix was on his first case and, as he remarks, \"I was green\" then. After the man's release, people start dying at his former employer. Mannix must probe two possibilities: whether the man was framed seven years or ago or whether he is seeking revenge now."
}, {
  "imdbId" : "0061277",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "Night Out of Time",
  "description" : "A young man named Clifton Ross (Matt Hulswit), the son of an aircraft magnate (David Brian), awakens after a night of drinking to find a bandage on his hand, blood on his shirt, and fragmentary memories of a fight with his girlfriend Doreen (Janaire). Ross learns that Doreen never came home the night before, and fears that his memories suggest that their evening together ended violently. Ross decides to hire Mannix to reconstruct the previous 24 hours of his life."
}, {
  "imdbId" : "0061277",
  "season" : "2",
  "episodeNumber" : "11",
  "title" : "A View of Nowhere",
  "description" : "Mannix is traveling to Santa Barbara by helicopter when he sees a woman apparently being strangled on a penthouse terrace. When Mannix and the police investigate, however, they are assured by the occupants of the penthouse apartment that nothing has happened. Mannix refuses to accept this and launches his own investigation."
}, {
  "imdbId" : "0061277",
  "season" : "2",
  "episodeNumber" : "12",
  "title" : "Fear I to Fall",
  "description" : "Mannix is brought to a small town in New Mexico on a ruse, and then subpoenaed to testify as an expert witness for the prosecution in a murder trial. After his testimony, the woman representing the defendant announces she wants to resign as defense counsel. Mannix decides that instead of returning to Los Angeles, he'll remain to aid the defense, encouraging the defendant's attorney to stick with the case while he tries to dig up new information that could free her client."
}, {
  "imdbId" : "0061277",
  "season" : "2",
  "episodeNumber" : "13",
  "title" : "Deathrun",
  "description" : "A jeweler whose shop is located near Mannix' detective agency is murdered, and in the crowd outside the murder scene, Mannix runs into Bill Chase, a buddy from his days in the Korean War. Chase tells Mannix he's in trouble and asks Mannix to visit the small mountain town where he serves as a fire ranger so he can tell Mannix about his situation. Within a short time of his arrival in the town, however, Mannix finds a deepening mystery, as he's shot at, injured falling down a hill, and learns that the woman who claims to be Chase's wife is a completely different woman."
}, {
  "imdbId" : "0061277",
  "season" : "2",
  "episodeNumber" : "14",
  "title" : "A Pittance of Faith",
  "description" : "A woman enters an apartment, is attacked and then thrown over a balcony to her death. The police conclude it is suicide, thanks in part to a phony suicide note. Friends of the woman's family hire Mannix to prove it's really a murder case so the woman can be buried in accordance with her faith. Despite his own doubts, Mannix becomes convinced it is a murder case. Yet the woman's father doesn't want the detective to pursue the case and then his clients abruptly terminate his services. Mannix, however, is determined to pursue the case."
}, {
  "imdbId" : "0061277",
  "season" : "2",
  "episodeNumber" : "15",
  "title" : "Only Giants Can Play",
  "description" : "A tennis pro tries to blackmail a candidate for governor, and is found dead in a remote area. His wife hires Mannix to investigate the man's death. Mannix travels to the state where the man died, and becomes embroiled in the political back-and-forth involving the candidate who was the target of the blackmail and his staff, as well as the activities of the candidate's opponents -- while also dealing with an oily woman who owns a chain of newspapers."
}, {
  "imdbId" : "0061277",
  "season" : "2",
  "episodeNumber" : "16",
  "title" : "Shadow of a Man",
  "description" : "Mannix narrowly avoids being shot by a businessman who appears to be a solid citizen. The attacker claims this is due to dreams he is having based on his Korean War experiences. The businessman later freaks out when police approach his house. Mannix has begun to talk him down when the businessman is shot from outside. But the police didn't fire. Mannix continues his investigation and a student at UCLA, the daughter of a company the businessman knew in Korea, is the detective's main lead to finding the truth."
}, {
  "imdbId" : "0061277",
  "season" : "2",
  "episodeNumber" : "17",
  "title" : "The Girl Who Came in with the Tide",
  "description" : "A young woman's body washes ashore as the episode opens, and Mannix later recognizes her as the former consort of a slippery attorney who once had Mannix' private investigator license suspended. Mannix suspects the attorney of having killed the woman, of committing another murder, and of staging the attempted suicide of someone who confesses to committing the two other two deaths, even though there is scant evidence to support his theories."
}, {
  "imdbId" : "0061277",
  "season" : "2",
  "episodeNumber" : "18",
  "title" : "Death in a Minor Key",
  "description" : "Peggy has been dating a black musician named Gabe Johnson. While they are at a jazz club, he and a man in the audience both recognize one another, and Gabe flees, without Peggy and without his prized cornet. Peggy turns to Joe Mannix and asks him to investigate Gabe's disappearance. Mannix learns that Gabe's real name is Gabe Dillon, and that the man in the club who recognized him (and whom Gabe recognized) was the police chief from the southern town where Gabe escaped while serving a ten-year prison term for burglary, attempted murder, and hit and run. Mannix ..."
}, {
  "imdbId" : "0061277",
  "season" : "2",
  "episodeNumber" : "19",
  "title" : "End Game",
  "description" : "Mannix gets an urgent call from the police. Lt. Art Malcolm, Mannix's friend who also served with the detective during the Korean War, is being held hostage in an abandoned building. The police are unable to enter the structure, which is filled with explosive booby traps. The man behind Malcom's abduction served in the same outfit as Mannix and Malcom. The man was left behind when a group of G.I.'s escaped from a Korean prison camp. He has been revenging himself on the escapees and now only Mannix and Malcom are left alive."
}, {
  "imdbId" : "0061277",
  "season" : "2",
  "episodeNumber" : "20",
  "title" : "All Around the Money Tree",
  "description" : "Roger Bard, an Englishman who rents an office in the same complex as Joe Mannix, comes to work one day where he is first confronted by a man named Rhodes, whom he locks in a closet. Bard realizes that his office is being watched by three other men, whom he flees by escaping out a back window. Bard briefly climbs into the window in Mannix' office, where he gives Mannix his keys and asks Mannix to free Rhodes, before driving off with the three men in pursuit. Mannix discovers that Bard's office is an elaborate front, with no files or other paperwork of any kind. Then a ..."
}, {
  "imdbId" : "0061277",
  "season" : "2",
  "episodeNumber" : "21",
  "title" : "Odds Against Donald Jordan",
  "description" : "Mannix is hired to find Donald Jordan, a missing compulsive gambler. Mannix gets differing stories from Jordan's sister, wife and business partner. Then, he finds Jordan, who claims not to be in trouble. However, Jordan is being pursued by loan sharks. The detective not only seeks to establish the truth but also confronts those closest to Jordan, who have been enabling the gambling addict."
}, {
  "imdbId" : "0061277",
  "season" : "2",
  "episodeNumber" : "22",
  "title" : "Last Rites for Miss Emma",
  "description" : "Mannix is hired to find a shipment of morphine -- \"Miss Emma\" -- stolen from a pharmaceutical firm. Peggy takes on a more active role than usual in trying to solve the morphine theft. Peggy also finds herself strongly attracted to Floyd Brown, a handsome black man who unsuccessfully tried to stop the morphine thieves, getting himself shot in the process."
}, {
  "imdbId" : "0061277",
  "season" : "2",
  "episodeNumber" : "23",
  "title" : "The Solid Gold Web",
  "description" : "Diana Walker, the daughter of a newspaper tycoon and Mannix' old flame, comes back into Mannix' life after a four-year absence. She is in a fragile mental state after believing that she killed a hoodlum named Johnny Malina, with whom she was also once involved, in a night-time road accident. Diana's father, sensing that she's terribly upset about something, asks Mannix to contact her once again, hoping that she will confide in Mannix about whatever is disturbing her."
}, {
  "imdbId" : "0061277",
  "season" : "2",
  "episodeNumber" : "24",
  "title" : "Merry Go Round for Murder",
  "description" : "Mannix is called in the middle of the night by an acquaintance, Pete Neal, and offered $1,000 to protect a man named Frank Devereau just until the following morning. Devereau is carrying $250,000, but he and Neal insist that the money is not stolen. Suddenly a car swerves by, shots ring out, Neal is killed, and the car disappears with both the money and Neal's body. Then Devereau runs off, too, leaving Mannix to report the shooting and disappearance of the money to the police with no other witnesses, no physical evidence, and no explanation where Devereau got such a ..."
}, {
  "imdbId" : "0061277",
  "season" : "2",
  "episodeNumber" : "25",
  "title" : "To Catch a Rabbit",
  "description" : "Peter Martin, the son of a respected doctor who often ministered to the less fortunate, is found at the bottom of the stairs in his home with his neck broken. His sister does not believe the medical examiner's conclusion that his death was accidental, and hires Mannix to find out if he was murdered, and if so, by whom. A clue left by a young boy whom Mannix observes spying on the Martin home leads Mannix to a Chicano neighborhood, where he discovers further evidence about Martin's death, but also uncovers resentments and accusations toward Martin by some residents of ..."
}, {
  "imdbId" : "0061277",
  "season" : "3",
  "episodeNumber" : "1",
  "title" : "Eagles Sometimes Can't Fly",
  "description" : "Brad Turner, a young black man who is an old friend of Peggy's, shows up at her door one night with his friend Jimmy Whitewing, who is part Indian. They were in a liquor store when it was held up, with Jimmy getting wounded during the incident, making it look like Brad and Jimmy committed the robbery. Peggy performs first aid on Jimmy, but also calls Joe Mannix. When Mannix tries to convince them to go to the police, however, they flee. Mannix nevertheless decides to investigate the matter, hoping to exonerate them."
}, {
  "imdbId" : "0061277",
  "season" : "3",
  "episodeNumber" : "2",
  "title" : "Color Her Missing",
  "description" : "Corey Boone, a private detective and a mentor to Joe Mannix, dies after being thrown from the window of a penthouse. Suspicion falls on the owner of the penthouse, a shady attorney named Charles Egan, who claims he was out driving around when Boone was killed. His one possible alibi is a young woman with whom he claims to have had a brief encounter in a remote area at the time of Boone's death. But then Egan, who has been charged with Boone's murder, surprises Mannix by asking him to find the missing witness."
}, {
  "imdbId" : "0061277",
  "season" : "3",
  "episodeNumber" : "3",
  "title" : "Return to Summer Grove",
  "description" : "Jean McBride, an old flame of Joe Mannix' who still lives in his hometown of Summer Grove, appears in his office one evening. Jean is married to Troy McBride, who once quarterbacked the Summer Grove football team on which Mannix also played. But now a double-tragedy has befallen Troy -- he is in an iron lung as a result of an accident, and has also been charged with murder. Mannix accompanies him and Jean back to Summer Grove to assist in the defense of the murder charge -- but his return home also forces Mannix to deal with unresolved conflicts with his father, from ..."
}, {
  "imdbId" : "0061277",
  "season" : "3",
  "episodeNumber" : "4",
  "title" : "The Playground",
  "description" : "Joe Mannix is called by an old friend named Rudy who is an executive with Majestic Studios, about the studio's big star, Mitch Cantrell. Cantrell is both obnoxious and reckless, but Rudy's concern is that someone has been threatening Cantrell's life -- threats that appear to have come true when someone stretched a metal wire across a road in front of Cantrell's motorcycle. When the attempts on Cantrell's life begin to multiply, Mannix tries to convince Cantrell that he needs to take precautions, but Cantrell refuses. Mannix nevertheless stays on at the studio, hoping ..."
}, {
  "imdbId" : "0061277",
  "season" : "3",
  "episodeNumber" : "5",
  "title" : "A Question of Midnight",
  "description" : "Benjamin Holland, a former physician, runs a general store in a small town up the coast from Los Angeles. Holland lost his medical license two years earlier when he reported the wrong lab results to a surgeon and then disappeared from the hospital without permission. Now he is being prosecuted for practicing medicine without a license because he administered life-saving treatment to a young boy. His girlfriend, a woman named Andrea, is an old friend of Joe Mannix from their college days, when she was \"queen of the freshman ball.\" She believes that the solution to ..."
}, {
  "imdbId" : "0061277",
  "season" : "3",
  "episodeNumber" : "6",
  "title" : "A Penny for the Peepshow",
  "description" : "Mannix is visited by a young woman named Celia James, who somewhat reluctantly explains that her uncle recently visited her and left behind a briefcase. When he did not return or contact her as she had anticipated, she opened the briefcase to find that it contained more than $300,000 in cash, as well as lists of names and places. She has barely finished telling him this when three men burst into Mannix' office. They tell Mannix, Peggy, and Celia that they are escaped convicts and want money to aid in making their escape. Their attention soon turns to the two women, ..."
}, {
  "imdbId" : "0061277",
  "season" : "3",
  "episodeNumber" : "7",
  "title" : "A Sleep in the Deep",
  "description" : "Joe Mannix is hired by Ellen Barton, whose husband drowned while swimming toward the dock near the marina where they lived. She is convinced that her husband, a champion swimmer, could not have died accidentally, and that instead he was murdered. As he pursues the investigation, Mannix enlists help from Dave Wright, the marina's security officer, whose life he once saved when Wright was still a police officer."
}, {
  "imdbId" : "0061277",
  "season" : "3",
  "episodeNumber" : "8",
  "title" : "Memory: Zero",
  "description" : "Maggie Wells, the secretary of a private investigator who was murdered, is on her way to see Joe Mannix. The cab driver taking her there fails to follow the route to Mannix' office, and then attempts to shoot her, but she is able to escape. Shaken, she manages to meet with Mannix, and asks him to figure out why someone is trying to kill her. Mannix places her in a trailer in a secluded location, and tries to get her to remember as many details as she can about her late boss, in order to figure out which of his former clients' business dealings might have put her in ..."
}, {
  "imdbId" : "0061277",
  "season" : "3",
  "episodeNumber" : "9",
  "title" : "The Nowhere Victim",
  "description" : "A husband is driving his wife home after their anniversary celebration when he apparently runs down a man on a darkened street. The couple returns to the scene but can find no evidence of the man they thought they hit. Reluctant to go to the police because the husband had been drinking that night, they hire Mannix to make sure that no one was injured. Mannix approaches the only witness to the incident posing as the driver of the vehicle, but the witness suddenly claims that he saw nothing. Then the mystery deepens as Mannix is visited by two men who accuse him of ..."
}, {
  "imdbId" : "0061277",
  "season" : "3",
  "episodeNumber" : "10",
  "title" : "The Sound of Darkness",
  "description" : "Mannix is hired by a man who was shot at, but not harmed, by a hired killer in an apparent threat of some kind. While shadowing his client into a derelict building, Mannix is shot at by the hit man. The bullet grazes Mannix' temple, causing a bout of psychosomatic blindness. With the help of an ex-Marine friend of police Lt. Tobias, Mannix learns how to survive in the world of blindness, to prepare himself for what he suspects will be hit man's return to finish the job of silencing Mannix."
}, {
  "imdbId" : "0061277",
  "season" : "3",
  "episodeNumber" : "11",
  "title" : "Who Killed Me?",
  "description" : "Bradley Everett is the owner of Everett Aviation. He departs one day on a flight to Mexico, and his plane is reported lost off the coast of Baja California. His presumed death has no sooner been reported than a man with a bandaged face and sunglasses walks into Mannix' office -- who turns out to be Everett in disguise, having survived his misadventure at sea. He tells Mannix that the loss of his plane was not an accident, and that his reported death will allow Mannix to investigate who might have had a motive for his murder -- his two business partners, his wife, his ..."
}, {
  "imdbId" : "0061277",
  "season" : "3",
  "episodeNumber" : "12",
  "title" : "Missing: Sun and Sky",
  "description" : "Sun and Sky, the horse favored to win the Kentucky Derby and possibly the Triple Crown, is being shipped to Kentucky to participate in the upcoming race. During the flight, however, all four members of the cargo plane's crew are overcome by some kind of drug, though the pilot manages to radio a distress call before losing consciousness. Mannix is hired by the insurance company holding the policy on the missing horse to investigate what happened. His search turns up the missing plane, and all four unconscious men, but not Sun and Sky. Mannix discovers that at least two..."
}, {
  "imdbId" : "0061277",
  "season" : "3",
  "episodeNumber" : "13",
  "title" : "Tooth of the Serpent",
  "description" : "Peggy has an old friend named Eve Chancellor, whose husband Jim started on the police force at the same time as Peggy's late husband. Eve is concerned about her son Cap, who has dropped out of school and spends much of his time away from home without accounting for his activities. When he brings a gun home one day, Eve hires Mannix to find Cap and to learn what he is involved in, hoping to help Cap avoid straying into a life of crime."
}, {
  "imdbId" : "0061277",
  "season" : "3",
  "episodeNumber" : "14",
  "title" : "Medal for a Hero",
  "description" : "Police uncover evidence they believe indicate that Peggy's late husband was on the take. This devastates Peggy's son, Toby. Joe Mannix, claiming Toby as his client, undertakes an investigation to clear the name of Peggy's husband. Mannix butts heads with an investigator for the department's internal affairs section, who vows to get the detective's license. Mannix also fends off an attempt on his own life as he tries to find out the truth."
}, {
  "imdbId" : "0061277",
  "season" : "3",
  "episodeNumber" : "15",
  "title" : "Walk with a Dead Man",
  "description" : "Mannix is about to leave his office to meet a client one night when he receives a telephone call suggesting that he spend the night at home instead. As he exits his office, a shot is fired at him. Mannix manages to meet the client anyway, a secretive executive who claims that a blackmailer is threatening to reveal embarrassing information about his wife. But as the case grows more involved, Mannix' client suddenly denies having hired him, or even knowing who he is."
}, {
  "imdbId" : "0061277",
  "season" : "3",
  "episodeNumber" : "16",
  "title" : "A Chance at the Roses",
  "description" : "Against his better judgment, Mannix agrees to look into the case of a young man who twice robbed the same pharmacy seeking drugs. The second time, he shot one of the employees, but even though the police had the pharmacy staked out, he managed to escape. The accused man's wife hires Mannix, insisting that her husband was incapable of committing such a crime. Mannix initially finds little to encourage him, but as he delves into the background of the man who was shot, he finds that the police account of what supposedly happened doesn't add up."
}, {
  "imdbId" : "0061277",
  "season" : "3",
  "episodeNumber" : "17",
  "title" : "Blind Mirror",
  "description" : "In a story reminiscent of \"Rashomon,\" Mannix is hired by publishing executive George Diamond to locate Diamond's secretary, Winifred Hill. Hill may -- or may not -- have seen Diamond attempt to push his estranged wife, Stella, into the ocean near his beach house. In a panic, Hill goes into hiding. Diamond claims that she misinterpreted what she saw and tells Mannix he simply wants Hill to know the truth. During the course of his investigation, however, Mannix uncovers several different versions of what happened, including two from George Diamond. Then a murder takes ..."
}, {
  "imdbId" : "0061277",
  "season" : "3",
  "episodeNumber" : "18",
  "title" : "Harlequin's Gold",
  "description" : "Mannix is hired by a bank to search for Paul Gantry, an Australian sailor who stands to inherit a sizable sum of money. To find him, Mannix goes under cover at the waterfront posing as a sailor looking for any of his \"shipmates\" from a recently sunken freighter, the Harlequin, on which Gantry served as one of the crew. As Mannix learns more information about the case, however, he comes to have doubts about whether Gantry really stands to collect the inheritance as his client informed him."
}, {
  "imdbId" : "0061277",
  "season" : "3",
  "episodeNumber" : "19",
  "title" : "Who Is Sylvia?",
  "description" : "Joe Mannix is invited to a party at the home of Phil Graves, with whom he served in the Army during the Korean War. Now Phil is a bank executive married to a wealthy socialite named Kathy. She confides in Joe that there have been three recent attempts on her life, including one that day when someone apparently tampered with the brakes of her car. Joe agrees to look into why someone would have tried to kill her, and pursues the identity of a mysterious \"Sylvia,\" when he finds an expensive locket engraved with that name in Kathy Graves' car."
}, {
  "imdbId" : "0061277",
  "season" : "3",
  "episodeNumber" : "20",
  "title" : "Only One Death to a Customer",
  "description" : "Three attempts are made on Mannix' life within a short period of time, and the killers were each offered a substantial sum of money to do the job. Mannix concludes that the only man who hated him enough to put out these contracts on his life was Frank Bauer, whom he captured and helped put in jail for a murder and robbery in Nevada. The only problem: Bauer, who had recently broken out of prison, was killed during his escape. Mannix decides to go to Nevada to find out whether Bauer's brother may be behind the attempts on his life -- and perhaps to find the more than ..."
}, {
  "imdbId" : "0061277",
  "season" : "3",
  "episodeNumber" : "21",
  "title" : "Fly, Little One",
  "description" : "A respected doctor at a school for emotionally disturbed children is murdered during the theft of $150,000 in bearer bonds that were to be a donation to the school. Joe Mannix is hired by an insurance company to try to recover the bonds. In the process, he meets one of the doctor's former patients, a nine-year old girl named Dana who lives partly in a fantasy world involving Peter Pan and Wendy. As Mannix gets to know the little girl, however, he begins to suspect that her talk of \"pirates\" and \"bombs\" might mean she knows something important about the person who ..."
}, {
  "imdbId" : "0061277",
  "season" : "3",
  "episodeNumber" : "22",
  "title" : "The Search for Darrell Andrews",
  "description" : "Wes Tully, a private detective who is a friend of Joe Mannix, is killed by two men who carefully stage his death to look like an accidental drowning. But Tully had confided in Mannix that he might be killed because of a case he was working on, and that his death would be made to look like an accident. Believing that his friend was murdered, Mannix retrieves some important evidence from the case Tully was working on -- but that only prompts the men who killed Tully to threaten Peggy and Toby in order to get that evidence back."
}, {
  "imdbId" : "0061277",
  "season" : "3",
  "episodeNumber" : "23",
  "title" : "Murder Revisited",
  "description" : "A controversial television interviewer telephones a shadowy figure named Harry Armitage for the \"hot seat\" segment of his show, accusing Armitage of bribery and influence peddling. As he speaks to Armitage on live television, shots ring out and Armitage is later found dead in his apartment. A woman named Muriel Price is found running from the scene, and her gun is determined to be the murder weapon. Joe Mannix, who had just been hired by Armitage before his death, is then hired by Muriel's twin sister, Valerie, to try to prove that her sister is innocent."
}, {
  "imdbId" : "0061277",
  "season" : "3",
  "episodeNumber" : "24",
  "title" : "War of Nerves",
  "description" : "A young woman who has entered a county fair competition in a rural community north of Los Angeles disappears, and her wealthy father hires Joe Mannix to look for her. As Mannix begins his investigation, everyone he interviews claims that the woman never arrived in town. Then everyone -- the police, the town council, and even his hotel clerk -- suddenly seem interested only in having Mannix leave town as quickly as possible. Mannix learns, however, that they are all frightened by an extortion plot that involves not only the missing woman, but a threat to every person ..."
}, {
  "imdbId" : "0061277",
  "season" : "3",
  "episodeNumber" : "25",
  "title" : "Once Upon a Saturday",
  "description" : "Joe Mannix is visited by an old friend, Beverly Miller, a life-long worker in the carnival world, whose dream of owning her own carnival is threatened when there are several attempts on her life. Mannix visits the carnival on a Saturday as Beverly prepares it for its opening day, to see if he can learn whether someone is indeed trying to kill her. He also brings along Peggy and her son Toby, to atone for bringing Peggy into the office on her day off. Mannix finds that many of the \"carny\" workers are uncooperative because they deem his presence to be bad luck. And the ..."
}, {
  "imdbId" : "0061277",
  "season" : "4",
  "episodeNumber" : "1",
  "title" : "A Ticket to the Eclipse",
  "description" : "The niece of Ray Endicott, one of the soldiers from Joe Mannix' old unit in Korea, is murdered in her apartment, and a lighter found there links the killing to another member of the unit, Tommy Gantt, who once dated the girl. But Mannix isn't convinced of Gantt's guilt, and begins to believe that the real killer is yet another former member of the unit -- who may be taking revenge on his former comrades one by one."
}, {
  "imdbId" : "0061277",
  "season" : "4",
  "episodeNumber" : "2",
  "title" : "One for the Lady",
  "description" : "On his way to visit a potential client in an office building late at night, Mannix surprises a burglar in a jewelry store. The burglar is killed in a shootout, but the police investigation suggests not only that Mannix did not kill the man in self-defense, but that he stole some of the jewelry. With his license suspended and his finances dwindling, Mannix is tempted to accept an offer to be the bodyguard of a reputed mobster's widow."
}, {
  "imdbId" : "0061277",
  "season" : "4",
  "episodeNumber" : "3",
  "title" : "Time Out of Mind",
  "description" : "Sonny Carter, once a world-champion boxer, has been accused of killing a man who sometimes hung around the boxing arenas trying to fix fights. Sonny's aunt calls her old friend, Peggy, to ask if Joe Mannix will try to find Sonny, who has disappeared. Mannix agrees to look into the matter, but he gets attacked by some thugs who tell him to stop his investigation. The other problem for Mannix is Sonny himself, who would rather flee than face the police investigation."
}, {
  "imdbId" : "0061277",
  "season" : "4",
  "episodeNumber" : "4",
  "title" : "Figures in a Landscape",
  "description" : "Someone has been making threatening telephone calls to Joe Mannix, and this mysterious person begins to take shots at him, too -- one of which cuts down Joe's friend Barry Nolan, who runs the photography shop across from Joe's office. That incident brings Joe into a chance encounter with renowned magazine photographer Jill Packard, who eventually begins a friendship with him. But Joe begins to suspect that there's more to the threats than someone who just has a grudge against him, when one of the shots nearly hits Jill, too."
}, {
  "imdbId" : "0061277",
  "season" : "4",
  "episodeNumber" : "5",
  "title" : "The Mouse That Died",
  "description" : "Mannix is hired by the sister of Geoffrey Paradine, a college student who has disappeared. As the episode opens, Mannix is taken off the case because she claims to have found him. Then she admits that although Paradine has contacted her, she believes that her brother is still in trouble. But as he continues to search for Paradine, Mannix starts to have strange hallucinations -- the first symptoms that someone has poisoned Mannix with a slow-acting toxin that will eventually kill him unless an antidote can be found."
}, {
  "imdbId" : "0061277",
  "season" : "4",
  "episodeNumber" : "6",
  "title" : "The Lost Art of Dying",
  "description" : "A group of prisoners on death row in a prison near Lawson City stage a takeover, taking as a hostage a guard named Charlie Keefer, who is a friend of Joe Mannix. The prisoners demand that Mannix come to see them, where they tell Mannix that one of their number, Carl Dancik, is innocent, and that they want Mannix to re-open his case. Dancik was convicted of the murder of an old girlfriend, but claims he was framed for the crime. With only a few days to turn something up, Mannix turns to another old friend in Lawson City, award-winning newspaperman Frank McGill, to see ..."
}, {
  "imdbId" : "0061277",
  "season" : "4",
  "episodeNumber" : "7",
  "title" : "The Other Game in Town",
  "description" : "Victor Brady, a leader in the electronics business, runs up a gambling debt of nearly $250,000 to a Las Vegas casino. Brady's private plane disappears from the radar on its way back to Los Angeles, but after his memorial service, his widow hires Joe Mannix to look for him, claiming that her husband is still alive and contacting her for help in raising the money to pay the casino. His investigation leads Mannix to that casino and the assorted people who work for it and who knew Victor Brady."
}, {
  "imdbId" : "0061277",
  "season" : "4",
  "episodeNumber" : "8",
  "title" : "The World Between",
  "description" : "Peggy is shot by a stray bullet when Joe grapples with a gunman who has come to the office to steal evidence from one of Joe's cases. While she recuperates in the hospital, she finds herself strongly attracted to the patient across the hall, who is staying in the hospital under an assumed name. She eventually discovers that he is the seriously ill head of a recently-independent African country -- and that the reason for his being incognito is that his political enemies hope that he will not survive his medical treatment."
}, {
  "imdbId" : "0061277",
  "season" : "4",
  "episodeNumber" : "9",
  "title" : "Sunburst",
  "description" : "Mannix is on his way to go fishing in the desert when he stops at a roadside diner for gas and a check of his engine. While having a cup of coffee, he discovers that the couple who run the diner are being held hostage by three men. Mannix manages to reach the authorities -- but the mystery deepens when the couple claim to know nothing of their supposed kidnapping."
}, {
  "imdbId" : "0061277",
  "season" : "4",
  "episodeNumber" : "10",
  "title" : "To Cage a Seagull",
  "description" : "Joe Mannix is about to go on a golf date with his friend Pete Pinelli, a helicopter traffic reporter for a local radio station, when he receives word that Pinelli's copter has crashed in a remote area of Los Angeles County. Mannix uncovers a witness who saw a light plane in the area just before the crash, and becomes convinced that Pinelli was murdered because he saw something that he wasn't supposed to see -- a conclusion that's bolstered when the pilot of the light plane appears to have been murdered as well."
}, {
  "imdbId" : "0061277",
  "season" : "4",
  "episodeNumber" : "11",
  "title" : "Bang, Bang, You're Dead",
  "description" : "While playing in an abandoned movie theatre, a nine year-old girl observes three men watching a film and overhears them apparently plotting to kill someone. The girl's mother takes her to see Joe Mannix, who is initially skeptical because the girl sometimes seems to confuse reality and fantasy. But Mannix starts to believe her story when an attempt is made on the girl's life."
}, {
  "imdbId" : "0061277",
  "season" : "4",
  "episodeNumber" : "12",
  "title" : "Deja Vu",
  "description" : "A young woman visits Joe Mannix at his office with a strange story of having had a dream in which he was killed. Mannix reassures her that he doesn't see any danger, and suggests that she dreamed about him because his capturing a blackmailer was recently covered in the newspaper. But Mannix begins to have second thoughts about dismissing her story when the details of her prediction come true."
}, {
  "imdbId" : "0061277",
  "season" : "4",
  "episodeNumber" : "13",
  "title" : "Duet for Three",
  "description" : "Joe Mannix is hired by Ellen Gray, whose husband committed suicide in Hong Kong shortly after confessing that he was apparently in over his head in some shady business dealings. When Ellen returns to Los Angeles, however, she finds herself being shadowed by some mysterious men who also had followed her in Hong Kong -- and whom she fears now may be trying to kill her."
}, {
  "imdbId" : "0061277",
  "season" : "4",
  "episodeNumber" : "14",
  "title" : "Round Trip to Nowhere",
  "description" : "A client named George Hewitt hires Joe Mannix to help find a man whom Hewitt claims has been harassing his wife, such as by accosting her in a taxicab in Chicago. Hewitt then speeds off from their meeting and is killed in a car chase with another vehicle. Mannix tries to discuss Hewitt's concerns with his widow only to find that she denies many of the things Hewitt had told Mannix -- such as never having been in Chicago, and not recognizing the man from a photograph."
}, {
  "imdbId" : "0061277",
  "season" : "4",
  "episodeNumber" : "15",
  "title" : "What Happened to Sunday?",
  "description" : "After leaping from a bridge to escape two hoodlums who were trying to run him down, Joe Mannix awakens in a hospital on a Monday morning with no memory of the previous 24 hours. With Peggy's help, and a few clues from items in his possession when he was found, Mannix begins to reconstruct the missing Sunday as fragments of his memories return -- including time spent with a beautiful redhead, and the image of a young woman falling from a high place."
}, {
  "imdbId" : "0061277",
  "season" : "4",
  "episodeNumber" : "16",
  "title" : "The Judas Touch",
  "description" : "The police chief in a small town 100 miles north of Los Angeles asks Joe Mannix to come to the town to assist him. Another old friend of Joe's, Paul Parrish, whom Joe convinced the chief to hire after Parrish had been in prison for a crime he didn't commit, is now suspected of killing his former cell mate from San Quentin and stealing $150,000 in cash that the cell mate had hidden before going to prison."
}, {
  "imdbId" : "0061277",
  "season" : "4",
  "episodeNumber" : "17",
  "title" : "With Intent to Kill",
  "description" : "Tough L.A. police Lt. Ira Deegan is warned off the investigation of a heist that netted $85,000 -- a threat that seems to have come true when his garage is blown up, although no one is hurt. Then Joe Mannix begins investigating the theft, which he claims is for the $8,500 recovery fee offered by the insurance company that would have to pay off on the theft. But Mannix' client is actually someone who is worried about Deegan's safety -- namely, his wife."
}, {
  "imdbId" : "0061277",
  "season" : "4",
  "episodeNumber" : "18",
  "title" : "The Crime That Wasn't",
  "description" : "A young boy named Dennis Coverly comes to Joe Mannix and tries to hire him. The boy says his parents have been arguing about whether to go to the police about something that happened the previous Saturday night when they were at a restaurant celebrating their anniversary. Mannix visits the boy's parents and is assured that nothing is wrong -- but Mannix starts to have second thoughts when he notices a former felon watching their house, and shortly thereafter someone tries to kill Mannix when he visits the restaurant."
}, {
  "imdbId" : "0061277",
  "season" : "4",
  "episodeNumber" : "19",
  "title" : "A Gathering of Ghosts",
  "description" : "Mannix travels to a western ghost town in response to an urgent telegram, only to learn that he's been lured there by four surviving members of his undefeated college football team, along with two of their wives, for an impromptu reunion. But then one of their number is killed, and Mannix discovers that their means of leaving the town has been sabotaged, too -- meaning that someone, perhaps the absent member of the team, intends to kill them all."
}, {
  "imdbId" : "0061277",
  "season" : "4",
  "episodeNumber" : "20",
  "title" : "A Day Filled with Shadows",
  "description" : "Joe Mannix is hired by a secretive businessman named Alton K. Moore, who wants Mannix to look for his son Cal, a basketball player at U.C.L.A. who has been missing for several days. Although the case takes Mannix back to his alma mater, he has his doubts about Moore, who insists on meeting in remote places instead of at his office. His concerns about the elder Moore -- and the serious trouble that Cal may be in -- begin to seem justified when several thugs begin shadowing Mannix during his search."
}, {
  "imdbId" : "0061277",
  "season" : "4",
  "episodeNumber" : "21",
  "title" : "Voice in the Dark",
  "description" : "Mannix is summoned to the apartment of Dorothy Kinman, a former Olympic-class diver who was rendered a paraplegic in an auto accident. Besides being reluctant ever to leave her apartment, Ms. Kinman claims that a man keeps telephoning her with death threats. But although he's initially concerned for her safety, Mannix begins to suspect that the threatening phone calls may just be an illusion -- or a hoax -- on Ms. Kinman's part."
}, {
  "imdbId" : "0061277",
  "season" : "4",
  "episodeNumber" : "22",
  "title" : "The Color of Murder",
  "description" : "A somewhat ditsy heiress named Cindy Conrad comes by Mannix' office one evening, complaining that a mysterious woman has been phoning her to offer important information about the death of Conrad's father several years before. Mannix correctly guesses that the caller wants a large sum of money to provide the information. He tries to convince Conrad to ignore the calls -- but he begins to believe that something is wrong when someone takes a shot at them as he is escorting Conrad to her car."
}, {
  "imdbId" : "0061277",
  "season" : "4",
  "episodeNumber" : "23",
  "title" : "Shadow Play",
  "description" : "Joe Mannix receives an urgent letter from a woman named Lynn Sargent asking him to fly to Arizona. She meets him at the airport and hands him a check for $1,000 and a small sealed package, telling him the money is his fee to take the package to the Los Angeles Police Department. Just as she does so, two men try to take the package, but Mannix manages to retain it after a scuffle. But the mystery deepens when the package turns out to contain nothing but blank sheets of paper -- and the police chief in the town tells Mannix that Lynn Sargent died a month earlier in a ..."
}, {
  "imdbId" : "0061277",
  "season" : "4",
  "episodeNumber" : "24",
  "title" : "Overkill",
  "description" : "A serial killer who calls himself \"Overkill\" has been terrorizing Los Angeles, and the most recent victim was \"Red\" Bailey, an old friend of Joe Mannix. But as Mannix and the police look into Bailey's killing, they learn that Bailey was investigating the Overkill case on his own -- and may have discovered that at least one of the killings attributed to Overkill was a copycat murder that someone wanted to be blamed on Overkill."
}, {
  "imdbId" : "0061277",
  "season" : "5",
  "episodeNumber" : "1",
  "title" : "Dark So Early, Dark So Long",
  "description" : "Joe Mannix is asked by his old friend, Mildred Oliver, to look into the circumstances of her daughter Leslie, who has become an alcoholic and has been acting strangely lately. In the middle of his investigation, Leslie becomes a suspect in the murder of an unemployed trumpet player, who appears to have been blackmailing Leslie and receiving payoffs - which gives her the perfect motive to have killed him."
}, {
  "imdbId" : "0061277",
  "season" : "5",
  "episodeNumber" : "2",
  "title" : "Cold Trail",
  "description" : "Joe Mannix is on a ski vacation to the Sierras where be becomes acquainted with two young women, Barbara and Marie. Barbara disappears on the slopes, and is later found dead after an apparent ski accident. But then Mannix learns that Barbara and Marie had switched ski outfits, making it easy to confuse one for the other on the ski runs. He begins to suspect that Barbara's death may have been to cover up an attempt on Marie's life, or an attempt to kidnap Marie -- especially when someone tries to kill him as well."
}, {
  "imdbId" : "0061277",
  "season" : "5",
  "episodeNumber" : "3",
  "title" : "A Step in Time",
  "description" : "Mannix is jogging on a beach near an isolated point of land overlooked by a large house when he witnesses a woman being dragged inside the house by two rough-looking characters. He has a neighbor call the police, and when the sheriff's deputy arrives, Mannix describes the two men and the woman he saw being attacked. He is startled, however, when the deputy tells him that his description of the crime and of the three participants perfectly matches the murder of a woman in that house - except that it happened a year before."
}, {
  "imdbId" : "0061277",
  "season" : "5",
  "episodeNumber" : "4",
  "title" : "Wine from These Grapes",
  "description" : "Joe Mannix once again returns to his hometown in California's Central Valley, this time to assist Armenian attorney Leo Kolligan in defending Juan Esparza, a farmworker accused of murder. Esparza is a labor organizer who organized picketing against Charlie Apellini, the owner of the vineyard where the victim worked. In between stints of working on the case, Joe finds time to reconnect with his father, Stefan -- who is much more accepting of Joe and his chosen profession than he was during Joe's visit two years before."
}, {
  "imdbId" : "0061277",
  "season" : "5",
  "episodeNumber" : "5",
  "title" : "Woman in the Shadows",
  "description" : "Joe Mannix is approached one evening by a woman named Lisa Ralph, who says that she believes someone may be trying to kill her, possibly because she has a valuable manuscript that she inherited from her late father. Mannix agrees to help her, but begins to have his doubts about her when she first disappears from his office, and then later leaves him at a restaurant without explanation."
}, {
  "imdbId" : "0061277",
  "season" : "5",
  "episodeNumber" : "6",
  "title" : "Days Beyond Recall",
  "description" : "A woman hires Joe Mannix to find her missing brother, whom she says is an alcoholic living on skid row. Mannix locates the man, but finds that he is not the woman's brother -- although he is the target of several hoods who want to kill him. As he pursues the case, Mannix learns that the man may actually be an investigative journalist who was on the verge of breaking a major story when he disappeared under mysterious circumstances."
}, {
  "imdbId" : "0061277",
  "season" : "5",
  "episodeNumber" : "7",
  "title" : "Run Till Dark",
  "description" : "A group of boys who play baseball together hire Joe Mannix to look for their coach, who has gone missing shortly before an important game. Mannix discovers that the man was actually an ex-con who changed his name as soon as he was released, and failed to keep even one appointment with his parole officer. Mannix begins to believe that the man's disappearance may be explained by the number of other criminals who seem determined to locate him -- possibly to silence him for good."
}, {
  "imdbId" : "0061277",
  "season" : "5",
  "episodeNumber" : "8",
  "title" : "The Glass Trap",
  "description" : "Joe Mannix and Peggy go to a nightclub intending to listen to a young guitarist, where Peggy recognizes a fugitive criminal named Brastow. Joe manages to recapture Brastow, who is to be extradited to New York to face charges of murdering a police officer. Brastow is to be escorted by an old acquaintance of Joe's named Ross Santini, now a New York detective. But Joe becomes puzzled by several attempts on his life by men he believes to be working for Brastow, and concerned about his friend Santini's increasingly odd behavior."
}, {
  "imdbId" : "0061277",
  "season" : "5",
  "episodeNumber" : "9",
  "title" : "A Choice of Evils",
  "description" : "On a rainy day in Los Angeles, Joe Mannix' secretary Peggy is kidnapped by two men on the instructions of crime boss Lawrence Powers. Powers has the two men hold Peggy to force Mannix to investigate which of his three closest associates is acting as a stool pigeon. Mannix only has 72 hours to learn this information -- or Peggy's life will be forfeited."
}, {
  "imdbId" : "0061277",
  "season" : "5",
  "episodeNumber" : "10",
  "title" : "A Button for General D.",
  "description" : "Joe Mannix is summoned to a scene where an old friend of his, Monte Dawes, has killed one man and is holding a young woman, Cindy Warren, hostage. His friend is killed, and Mannix manages to overhear his dying words, which seem to make no sense - something about a \"button\" and a \"General D.\" With the help of Cindy Warren, to whom Mannix feels an increasing attraction, he tries to puzzle out why Dawes ended up dying as he did - and why several hoods seem to be interested in him and Miss Warren."
}, {
  "imdbId" : "0061277",
  "season" : "5",
  "episodeNumber" : "11",
  "title" : "The Man Outside",
  "description" : "Late one night, Joe Mannix is surprised by Gen. Alec Holt, his former commanding officer in Korea, now a good friend and vice-president of Coronet Electronics. He tells Mannix that he is being blackmailed by a photographer who has pictures of him in a compromising position, and gives Mannix $10,000 to buy the film. Mannix makes the exchange but then is jumped by two thugs. Although he manages to escape, a return visit from the two thugs and Gen. Holt's refusal to explain why the two men want the film leads Mannix to believe that the case involves more than evidence of..."
}, {
  "imdbId" : "0061277",
  "season" : "5",
  "episodeNumber" : "12",
  "title" : "Murder Times Three",
  "description" : "While visiting a rural property to investigate a case, Mannix is attacked by two bikers and nearly killed. He concludes that someone wants to scare him off of one of the three cases he is currently working on - wealthy parents who are searching for their missing daughter; an embezzlement case for a fellow private detective named Dan Brockway; and a threatening telephone call received by a young couple. But as soon as Mannix decides to figure out which case prompted the warning, he learns that he has been fired from all three cases at the same time."
}, {
  "imdbId" : "0061277",
  "season" : "5",
  "episodeNumber" : "13",
  "title" : "Catspaw",
  "description" : "Tip Ellis, a fellow private investigator and friend of Joe Mannix, is murdered while looking into a case of industrial espionage in Fresno. Mannix travels to Fresno to pay his respects, and also to look into the case his late friend was handling. In the meantime, a letter postmarked from Fresno arrives at Mannix' office -- possibly an effort by Tip Ellis to pass along information about the case to Mannix. That letter begins to take on great importance when someone takes extraordinary measures to steal the letter from Mannix' safe before he can read it."
}, {
  "imdbId" : "0061277",
  "season" : "5",
  "episodeNumber" : "14",
  "title" : "To Save a Dead Man",
  "description" : "A dying man stumbles into a church and tells a young nun that he was responsible for sending an innocent man to prison. Her parish priest asks Joe Mannix, an old friend, to find out who the dead man was referring to. Mannix discovers that the dead man was a witness in a murder trial several years before -- but the man in prison, and his former attorney, steadfastly insist he was guilty. Mannix reluctantly begins to accept this, too -- until several attempts are made to convince him to stop investigating the case."
}, {
  "imdbId" : "0061277",
  "season" : "5",
  "episodeNumber" : "15",
  "title" : "Nightshade",
  "description" : "Fellow private investigator Charlie Frome is killed by a hit-and-run driver, apparently while working on a case, and Joe Mannix decides to see if he can determine why Frome was murdered. He learns that Frome was working for television star Danny Brite, but Brite claims he hired Frome only to look for a former acquaintance. Based on evidence found in Charlie Frome's apartment, however, Mannix concludes that Frome's investigation involved a soldier in Vietnam who has gone missing in action -- and possibly someone who is blackmailing Danny Brite."
}, {
  "imdbId" : "0061277",
  "season" : "5",
  "episodeNumber" : "16",
  "title" : "Babe in the Woods",
  "description" : "A maverick computer genius named Bobby Quinn is gunned down by a sniper while playing golf with his employer, Lawrence Martin, the head of a large conglomerate. Martin hires Mannix to find the plans for a revolutionary computer that Quinn designed that will be the size of a briefcase. What Martin doesn't tell Mannix is that he knows Quinn also left behind a letter with the plans that has damaging information against Martin -- and that Martin has taken steps to ensure that Mannix will never read the letter even if he locates the plans."
}, {
  "imdbId" : "0061277",
  "season" : "5",
  "episodeNumber" : "17",
  "title" : "The Sound of Murder",
  "description" : "Mannix is hired by a woman from Cleveland named Marcia Inman to locate her missing husband. Mannix investigates her husband's business contacts and follows a man matching his description after the man leaves what appears to be his mistress' apartment. But when the man Mannix followed ends up dead, Mrs. Inman claims that the dead man was not her missing husband."
}, {
  "imdbId" : "0061277",
  "season" : "5",
  "episodeNumber" : "18",
  "title" : "Moving Target",
  "description" : "Someone tries to kill Ken Mitchell, the head of a toy-making firm. Not wanting a violent incident to be associated with a toy business, Mitchell instead hires Joe Mannix to find out who might have tried to kill him. Suspicion soon falls upon Mitchell's \"silent partner,\" Paul Anders, but Mannix' investigation is stymied when it first appears that Anders may have committed suicide . . . or may never have existed."
}, {
  "imdbId" : "0061277",
  "season" : "5",
  "episodeNumber" : "19",
  "title" : "Cry Pigeon",
  "description" : "Tom Fortune, the rising young scion of a mobster family, tries to hire Mannix to shadow his wife, whom he suspects of being unfaithful, when Fortune is gunned down. Fortune's family members, especially his father, suspect that Mannix set up Tom for the ambush -- suspicions that are enhanced when Tom Fortune's widow is spotted leaving Mannix' office."
}, {
  "imdbId" : "0061277",
  "season" : "5",
  "episodeNumber" : "20",
  "title" : "A Walk in the Shadows",
  "description" : "A man named Tom Farnon suspects his wife of having an affair, and follows her to his boat where she is to meet her lover. But a shot rings out, the other man flees, the boat explodes, and Farnon finds himself a suspect in her murder. Farnon approaches Joe Mannix and asks Mannix to learn the identity of the man she met. The best lead Mannix has is Phil Rand, another private investigator who once worked for Farnon -- but Rand insists that Mrs. Farnon never had an affair."
}, {
  "imdbId" : "0061277",
  "season" : "5",
  "episodeNumber" : "21",
  "title" : "Lifeline",
  "description" : "Vince Logan is a talented singer who is also a friend of Peggy's. One night while he and Peggy are in a nightclub, Logan is approached by a police officer about what appears to be a minor property damage claim. Logan responds by taking a gun and barricading himself in a warehouse, where he eventually is shot trying to flee. As Logan fights for his life, Joe Mannix decides to try to find out why Logan was so reluctant to cooperate with the police even about a routine matter."
}, {
  "imdbId" : "0061277",
  "season" : "5",
  "episodeNumber" : "22",
  "title" : "To Draw the Lightning",
  "description" : "Police Lt. Larry Gifford follows a tip leading him to a warehouse, where he surprises a man apparently committing a burglary. After an exchange of gunfire, Gifford discovers that the man he killed is Danny Constantine, who once killed Gifford's partner but was released on a technicality. Facing possible dismissal from the police force, or even murder charges, Gifford hires Joe Mannix to try to find information that will clear his name."
}, {
  "imdbId" : "0061277",
  "season" : "5",
  "episodeNumber" : "23",
  "title" : "Scapegoat",
  "description" : "Joe Mannix is called to the office of an air freight company and asked to investigate some cargo thefts, unaware that this is a ruse to allow the operators of the company to substitute a double in his place. When Mannix then tries to leave on a confidential trip to London, he is kidnapped by the men from the air freight company and taken to a remote old west ghost town - while the impostor takes his place on the mission to London."
}, {
  "imdbId" : "0061277",
  "season" : "5",
  "episodeNumber" : "24",
  "title" : "Death Is the Fifth Gear",
  "description" : "Joe Mannix is participating in an auto race when he suddenly begins to experience hallucinations. The resulting crash lands him in a private hospital, where the delusions and paranoia continue. But then a young nurse confides in Mannix that the physician in charge of the facility -- whom Mannix also knew as his friend -- has actually been giving him drugs to keep him in that condition. With her help, Mannix arranges an escape, to learn why he has been victimized in this way."
}, {
  "imdbId" : "0061277",
  "season" : "6",
  "episodeNumber" : "1",
  "title" : "The Open Web",
  "description" : "Joe Mannix is visited one night by Ken Gordon, a young police officer whose life Mannix once saved. Unfortunately, moments later Gordon takes a bullet meant for Mannix, fired by Victor Roarke, a criminal whom Mannix once helped capture. Roarke is taken into custody, but claims to know the location of a missing judge's body -- but Mannix and Art Malcolm soon discover that Roarke's claim is part of an elaborate attempt at escape and extortion."
}, {
  "imdbId" : "0061277",
  "season" : "6",
  "episodeNumber" : "2",
  "title" : "Cry Silence",
  "description" : "A former priest named James Conway comes to see Joe Mannix because he believes someone is trying to kill him. Conway has concluded that a former penitent, who confessed to a murder, believes that his confession is no longer safe because Conway has left the priesthood. Mannix accepts the case, hoping to find the man and convince him that his secret is safe with Conway. But then Mannix is disturbed to find that someone seems to be trying to kill him, too."
}, {
  "imdbId" : "0061277",
  "season" : "6",
  "episodeNumber" : "3",
  "title" : "The Crimson Halo",
  "description" : "Mannix is hired by attorney Noah Otway to find out why someone tried to kill Otway's client, Dr. Graham Aspinall, a renowned surgeon whose specialty is removing tumors that are otherwise believed to be inoperable. Despite the doctor's denials that anyone has a motive to kill him, Mannix comes to believe otherwise when he barely saves Aspinall from a second attempt on his life. And Mannix discovers that there are several people who might have a motive to kill Dr. Aspinall -- including the second-in-command at his medical institute; the boyfriend of one of Aspinall's ..."
}, {
  "imdbId" : "0061277",
  "season" : "6",
  "episodeNumber" : "4",
  "title" : "Broken Mirror",
  "description" : "The wife of a wealthy industrialist disappears from their sailboat off the coast of Mexico, and he initially hires Mannix to learn how she disappeared (and partly because he knows that a husband is usually the primary suspect in the disappearance of a wife). Then his wife is found, apparently safe, in a small village in Mexico. But after she returns to California, Mannix -- with Art Malcolm's help -- learns some disturbing information about her past, which suggests that she might know more about her disappearance than she is willing to admit."
}, {
  "imdbId" : "0061277",
  "season" : "6",
  "episodeNumber" : "5",
  "title" : "Portrait of a Hero",
  "description" : "A Vietnam war hero who married into the family of an aircraft manufacturer is killed by a grenade tossed into an elevator just before the doors close. The elevator operator, Roy Elkins, survives, but while in a near-coma, he keeps murmuring what appears to be a woman's name, \"Joyce.\" Because Joe Mannix is Elkins' friend, he decides to try to find out why someone nearly killed him -- beginning with an attempt to learn what Elkins means by the mysterious \"Joyce.\""
}, {
  "imdbId" : "0061277",
  "season" : "6",
  "episodeNumber" : "6",
  "title" : "The Inside Man",
  "description" : "Joe Mannix goes undercover by joining a New Orleans mob to learn the identity of another member of the organization who wants to turn state's evidence against the head mobster, Lytell. His task becomes complicated, however, when he begins a romance with a woman named Angela who is close to Lytell and may still be loyal to him -- and when he learns that there is an informer within New Orleans' law enforcement who has tipped Lytell that there is an informant in his organization, too."
}, {
  "imdbId" : "0061277",
  "season" : "6",
  "episodeNumber" : "7",
  "title" : "To Kill a Memory",
  "description" : "A young man whom his associates know as Dan Turner arrives in Los Angeles, where he separates from them and boards a bus for Palmdale. There he finds his family, who know him as Alex Lachlan, an Army Ranger missing in Vietnam and presumed dead. Joe Mannix is asked to help unravel where he has been for two years or why he is carrying Turner's identification. Mannix uncovers evidence that Turner/Lachlan may have fallen in with some shady associates -- and there appear to be reasons why Lachlan's brother isn't happy he has returned, either."
}, {
  "imdbId" : "0061277",
  "season" : "6",
  "episodeNumber" : "8",
  "title" : "The Upside-Down Penny",
  "description" : "A young boy approaches Joe Mannix and offers him $1.85 to try to find a stamp album that the boy says he lost at an amusement arcade. After some investigation, Mannix believes the album might have been found by a street artist nicknamed Gemini whose girlfriend says he suddenly disappeared after talking about an \"inheritance\". Mannix' theory that Gemini found the album seems to be confirmed when Gemini tries to sell one stamp to a dealer - except that the stamp turns out to be worth thousands of dollars."
}, {
  "imdbId" : "0061277",
  "season" : "6",
  "episodeNumber" : "9",
  "title" : "One Step to Midnight",
  "description" : "Mannix goes to what he believes is a meeting with a new client, but is ambushed by a gunman who accuses him of working for Bruno Raphael, a former crime boss now exiled from the United States. While trying to figure out why someone thinks he is working for Raphael, Mannix meets with Raphael's granddaughter and her husband, who tell Mannix that someone has been shadowing them. Mannix soon learns that Raphael has indeed returned to the United States - and that he is caught between Raphael and his successor mobsters, any of whom might have a motive to kill Mannix."
}, {
  "imdbId" : "0061277",
  "season" : "6",
  "episodeNumber" : "10",
  "title" : "Harvest of Death",
  "description" : "Two crop-dusting pilots who worked for orange grower Clint Carpenter have vanished without a trace. Joe Mannix is asked by his former military buddy, Dave Winters, who runs the crop-dusting service, to help solve the mystery of their disappearance. Mannix returns to the California farmland of his youth posing as a new pilot, but soon finds himself in the middle of a feud between his client and the local Armenian farm workers - whose leader claims that he and his people were cheated out of the land Carpenter now cultivates."
}, {
  "imdbId" : "0061277",
  "season" : "6",
  "episodeNumber" : "11",
  "title" : "A Puzzle for One",
  "description" : "Joe Mannix refers four cases to down-on-his-luck fellow private eye Jerry Henderson. But when Henderson is murdered, Mannix suspects that it was because of one of the four cases he referred -- an extortion case, a divorce involving infidelity, a drug overdose victim's father, and a man being pressured by a loan shark. Feeling responsible for Henderson's death, Mannix decides to look into each case himself to find out whether one of them resulted in his friend's death."
}, {
  "imdbId" : "0061277",
  "season" : "6",
  "episodeNumber" : "12",
  "title" : "Lost Sunday",
  "description" : "Mannix travels to northern California, where he's been hired by the sister of a young man who disputes the cause of her brother's death. The coroner's verdict was accidental death when the man fell from a gantry at a sand and gravel quarry while drunk. Mannix finds evidence that his death may not have been accidental, beginning with his discovery of rifle shell casings at the quarry. But his investigation is halted when he's jailed on trumped-up charges by two local deputies -- who clearly intend that Mannix never come up for a court hearing or get out of jail alive."
}, {
  "imdbId" : "0061277",
  "season" : "6",
  "episodeNumber" : "13",
  "title" : "See No Evil",
  "description" : "A woman is murdered on a street near Peggy's home, and Joe Mannix is the first one to reach the murder scene. Joe questions a neighbor in a nearby house, and concludes the man may have seen more than he will admit. Hired by the deceased woman's husband to try to find her killer, Joe pursues the case and uncovers evidence leading to the uncomfortable conclusion that the woman's killer might be the son of one of Peggy's old friends -- and that he might also be responsible for the disappearance of the witness."
}, {
  "imdbId" : "0061277",
  "season" : "6",
  "episodeNumber" : "14",
  "title" : "Light and Shadow",
  "description" : "The wife of a wealthy jet-setter is accused of murdering a philandering playboy on her husband's yacht, and the wealthy man hires Joe Mannix to investigate the crime, hoping he will turn up evidence to exculpate his wife. Mannix finds that there is no shortage of suspects who might have wanted the murdered man dead -- including his own client and his client's daughter. But when another suspect is killed, and two hoods show up threatening Mannix to get off the case, Mannix realizes that he may be investigating more than just a murder among the idle rich."
}, {
  "imdbId" : "0061277",
  "season" : "6",
  "episodeNumber" : "15",
  "title" : "A Game of Shadows",
  "description" : "The head of an electronics firm arrives home to find his wife drowned at the bottom of their pool, just as one of his rising young associates flees the scene. It looks like an open-and-shut case to the police, but the missing man's girlfriend insists that he is innocent, and asks Mannix to find the man and assist him. Mannix reluctantly takes the case, but the mystery soon deepens as Mannix discovers that the man may have had other identities -- and secrets aplenty in his past."
}, {
  "imdbId" : "0061277",
  "season" : "6",
  "episodeNumber" : "16",
  "title" : "The Man Who Wasn't There",
  "description" : "When a prizefighter is gunned down during a match, the initial speculation is that he was punished for refusing to take a dive. But Joe Mannix, who happened to attend the match, speculates that the bullet may have been meant for someone in the audience -- and a review of the fight film suggests that the real target was Mannix himself. This is reinforced when there is another attempt on Mannix' life -- but the evidence begins to point to someone whom Mannix believes couldn't possibly have tried to commit the murder."
}, {
  "imdbId" : "0061277",
  "season" : "6",
  "episodeNumber" : "17",
  "title" : "A Matter of Principle",
  "description" : "Joe Mannix is visited by Portia and Penelope Penhaven, two elderly, eccentric sisters who insist that Mannix investigate a hit-and-run earlier that day, which damaged one of the headlights on their ancient automobile. Amused by their request, and overborne by Portia's forceful personality, Mannix agrees to look into the matter, but discovers that the vehicle that hit them was taken from a rental lot, apparently without the knowledge of the lot's owner. Digging deeper, however, Mannix soon discovers that the hit-and-run might be related to a murder committed nor far ..."
}, {
  "imdbId" : "0061277",
  "season" : "6",
  "episodeNumber" : "18",
  "title" : "Out of the Night",
  "description" : "Against Joe's wishes, Peggy agrees to go undercover to gain evidence against a woman named Dodie Green, who is believed to be the source of heroin that caused the death of a teenager whom both Joe and Peggy knew. Peggy manages to work her way into Green's operation, but is unaware that the handsome man who starts to court her is actually working with Green - or that he seeking to prove that Peggy is a police informant."
}, {
  "imdbId" : "0061277",
  "season" : "6",
  "episodeNumber" : "19",
  "title" : "Carol Lockwood, Past Tense",
  "description" : "A woman's body washes ashore, whom Lt. Art Malcolm recognizes her as Joe Mannix' former girlfriend, Carol Lockwood. The forensic evidence suggests that she was killed during a boat explosion, possibly while in the company of a wealthy man with whom she also had a relationship. But as Mannix examines the evidence, he begins to suspect that Carol's death was more than just an accident -- perhaps even part of a sophisticated murder plot."
}, {
  "imdbId" : "0061277",
  "season" : "6",
  "episodeNumber" : "20",
  "title" : "The Faces of Murder",
  "description" : "Gil Ryan, a shady underworld figure, is the star witness in the criminal trial of Lucas Hume, a man with connections to city politics. Then Ryan is gunned down in spite of his police protection, and Hume is found standing over the body, holding the gun that fired the shots. Despite what appears to be an open-and-shut murder case, however, Joe Mannix is hired by Hume's sister, who claims to have had an affair with Ryan -- and wants Mannix to prove that she, not her brother, was the one who shot Ryan."
}, {
  "imdbId" : "0061277",
  "season" : "6",
  "episodeNumber" : "21",
  "title" : "Search for a Whisper",
  "description" : "Joe Mannix is hired by wealthy businessman Adam Langer to dig up enough dirt on a politician to destroy the man's career. At first Mannix is unwilling to take the job, until Langer explains that that politician is himself -- that he wants to run for governor and needs to learn what a political opponent might be able to uncover. Mannix initially finds some mildly damaging information on Langer -- but becomes concerned as the witnesses he has interviewed start to meet violent deaths."
}, {
  "imdbId" : "0061277",
  "season" : "6",
  "episodeNumber" : "22",
  "title" : "To Quote a Dead Man",
  "description" : "A hobo known as Boston comes to see Joe Mannix, explaining that someone has recently tried to kill him, and asking Mannix to find out who it is and why. Mannix agrees to look into the matter, and eventually realizes that the distinctive overcoat Boston wears might be what has made him a target -- because he \"inherited\" the coat from another hobo who might have overheard something about an underworld killing."
}, {
  "imdbId" : "0061277",
  "season" : "6",
  "episodeNumber" : "23",
  "title" : "A Problem of Innocence",
  "description" : "William Avery is released after serving a prison sentence for embezzlement, but almost immediately dies in a car accident. Someone nevertheless begins to stalk his daughter, apparently believing that she knows where the missing money is hidden. Though Avery's daughter insists that her father was innocent, she hires Joe Mannix to protect her -- and Mannix concludes that the best way to help her is to re-open an investigation of the theft, to find out who from Avery's past would still want to find the missing funds."
}, {
  "imdbId" : "0061277",
  "season" : "6",
  "episodeNumber" : "24",
  "title" : "The Danford File",
  "description" : "Joe Mannix is invited to the home of Arthur Danford by an old friend, Barney Edmonds, who is managing Danford's campaign for governor of Hawaii. Mannix recognizes Danford's wife, Laura, as a woman who once had a shady past, which put her on the fringes of a mob killing. Laura confides to Mannix that she is being blackmailed by her old boyfriend, who is threatening to reveal her past life to destroy her husband's political career. Mannix offers to intercede with the blackmailer -- but as he tries to find the blackmailer, each person Mannix locates seems to meet with ..."
}, {
  "imdbId" : "0061277",
  "season" : "7",
  "episodeNumber" : "1",
  "title" : "The Girl in the Polka Dot Dress",
  "description" : "A psychic tells Joe that he saw a vision of a girl in a polka dot dress getting shot. Joe checks it out and saves her. The next vision the psychic has is of her death."
}, {
  "imdbId" : "0061277",
  "season" : "7",
  "episodeNumber" : "2",
  "title" : "A Way to Dusty Death",
  "description" : "Joe is trying to find a missing teenage boy who was acquitted of murder on a technicality. The boy's small town is convinced he did it and sheriff Howard Duff is not helpful."
}, {
  "imdbId" : "0061277",
  "season" : "7",
  "episodeNumber" : "3",
  "title" : "Climb a Deadly Mountain",
  "description" : "Joe's plane is struck by lightning and crashes in the mountains. Greg Morris, escaped con, rescues him. Three prison guards on their trail want to kill them both."
}, {
  "imdbId" : "0061277",
  "season" : "7",
  "episodeNumber" : "4",
  "title" : "Little Girl Lost",
  "description" : "A reporter is killed in front of his daughter at the zoo. Joe has to find out who killed him and why because the little girl thinks it's her fault."
}, {
  "imdbId" : "0061277",
  "season" : "7",
  "episodeNumber" : "5",
  "title" : "The Gang's All Here",
  "description" : "Joe kills Red Dietz, a crook idolized by kids in his former gang the Nomads. They decide to kill Joe as an initiation rite for a new member."
}, {
  "imdbId" : "0061277",
  "season" : "7",
  "episodeNumber" : "6",
  "title" : "Desert Run",
  "description" : "A plane crashes in the desert and Joe is hired to find the missing pilot. He finds a small town with a big secret."
}, {
  "imdbId" : "0061277",
  "season" : "7",
  "episodeNumber" : "7",
  "title" : "Silent Target",
  "description" : "Joe goes on a fishing trip and his car breaks down close to a hideout for syndicate hoods. Frank Langella plays an assassin in town for a big hit."
}, {
  "imdbId" : "0061277",
  "season" : "7",
  "episodeNumber" : "8",
  "title" : "A World Without Sundays",
  "description" : "Peter Haskell is famous ex-QB Marty Hatch. He's mixed up with a mobster's girl friend and Joe has to save them from a hit man."
}, {
  "imdbId" : "0061277",
  "season" : "7",
  "episodeNumber" : "9",
  "title" : "Sing a Song of Murder",
  "description" : "Someone tries to kill world-famous opera diva Barbara Sonderman, who is about to return to the stage after a year's hiatus from performing. She hires Joe Mannix to find out who tried to kill her and why, but Mannix becomes disturbed by evidence suggesting that his client may have withheld information from him. Nevertheless, Mannix pursues a lead involving the death of her father, a policeman in a small town up the coast from Los Angeles -- while also struggling with his own growing feelings for Barbara."
}, {
  "imdbId" : "0061277",
  "season" : "7",
  "episodeNumber" : "10",
  "title" : "Search in the Dark",
  "description" : "Victor Buono is a blind man obsessed with finding the Auroras, a fabulous diamond collection stolen years ago."
}, {
  "imdbId" : "0061277",
  "season" : "7",
  "episodeNumber" : "11",
  "title" : "The Deadly Madonna",
  "description" : "Anne Baxter is a famous actress making a comeback after a year in a sanitarium. Someone is trying to scare her back into the mental ward. Joe thinks the answers might be related to an unfinished movie she was in called \"The Deadly Madonna.\""
}, {
  "imdbId" : "0061277",
  "season" : "7",
  "episodeNumber" : "12",
  "title" : "Cry Danger",
  "description" : "Mannix travels to San Francisco to wind up a case. At the airport he spots old flame Jan Holloway, who stood him up some time before. She tells Joe she is really married to a man named Carter Elliott. Several hoods then hustle Mannix away, apparently because he spoke to her -- leading him into a deepening mystery involving $14 million and Mrs. Elliott's apparent death shortly thereafter."
}, {
  "imdbId" : "0061277",
  "season" : "7",
  "episodeNumber" : "13",
  "title" : "All the Dead Were Strangers",
  "description" : "The survivors of a plane crash are dying one by one. Even Joe's suspects are not safe."
}, {
  "imdbId" : "0061277",
  "season" : "7",
  "episodeNumber" : "14",
  "title" : "Race Against Time: Part 1",
  "description" : "Mannix is asked to sneak a famous heart doctor into a repressive country to perform surgery on a revolutionary."
}, {
  "imdbId" : "0061277",
  "season" : "7",
  "episodeNumber" : "15",
  "title" : "Race Against Time: Part 2",
  "description" : "Mannix and Dr. Considine are in danger, but so is the patient: someone in his camp is a traitor."
}, {
  "imdbId" : "0061277",
  "season" : "7",
  "episodeNumber" : "16",
  "title" : "The Dark Hours",
  "description" : "Joe is shot and dumped in the middle of nowhere. He tries to figure it all out from his hospital bed."
}, {
  "imdbId" : "0061277",
  "season" : "7",
  "episodeNumber" : "17",
  "title" : "A Night Full of Darkness",
  "description" : "Confirmed bachelor Art Malcolm gets married, but his bride is soon killed in a drive-by shooting. Joe comes to his aid when Art is arrested for the murder of her killer."
}, {
  "imdbId" : "0061277",
  "season" : "7",
  "episodeNumber" : "18",
  "title" : "Walk a Double Line",
  "description" : "Joe tries to prove that a young man is innocent of killing his boss in a locked room mystery."
}, {
  "imdbId" : "0061277",
  "season" : "7",
  "episodeNumber" : "19",
  "title" : "The Girl from Nowhere",
  "description" : "Mannix tries to protect a woman he sees at a funeral from stalker Tommy Ryker. If he's not careful, the next funeral Joe attends will be his own."
}, {
  "imdbId" : "0061277",
  "season" : "7",
  "episodeNumber" : "20",
  "title" : "A Rage to Kill",
  "description" : "A psychiatrist is murdered and his book about three violent patients may lead Joe to the killer."
}, {
  "imdbId" : "0061277",
  "season" : "7",
  "episodeNumber" : "21",
  "title" : "Mask for a Charade",
  "description" : "Eye witnesses saw policeman Al Reardon commit murder. He hires Joe to prove it was a frame-up, but can't seem to get his story straight."
}, {
  "imdbId" : "0061277",
  "season" : "7",
  "episodeNumber" : "22",
  "title" : "A Question of Murder",
  "description" : "A down-and-out boxer is rundown by a hit-and-run driver. His only fan, a young boy, hires Joe to prove it was murder."
}, {
  "imdbId" : "0061277",
  "season" : "7",
  "episodeNumber" : "23",
  "title" : "Trap for a Pigeon",
  "description" : "A mobster's lawyer desperately wants Joe to recover a briefcase that was stolen in a hotel robbery. His life depends on Joe getting it back."
}, {
  "imdbId" : "0061277",
  "season" : "7",
  "episodeNumber" : "24",
  "title" : "The Ragged Edge",
  "description" : "Art Malcolm tries to help a heroin addict. The heroin addict's name is Joe Mannix."
}, {
  "imdbId" : "0061277",
  "season" : "8",
  "episodeNumber" : "1",
  "title" : "Portrait in Blues",
  "description" : "A pair of musicians are performing their act when one of them is almost electrocuted. Mannix is hired to look into the matter. But the detective faces twists almost immediately. For starters, the woman who hired Mannix isn't who she said she was. Mannix also needs to act fast before another attempt on the musician's life is made."
}, {
  "imdbId" : "0061277",
  "season" : "8",
  "episodeNumber" : "2",
  "title" : "Game Plan",
  "description" : "Joe Mannix receives an urgent phone call from his friend George Lassiter asking him to come to Albuquerque because of a problem with Lassiter's daughter Jeannie, who is also Joe's goddaughter. Mannix arrives quickly only to be told that the problem has been solved. Sensing that he's not receiving the whole story, though, Mannix decides to conduct his own investigation -- leading him to discover that his friend is involved in a novel form both of kidnapping and of paying the ransom."
}, {
  "imdbId" : "0061277",
  "season" : "8",
  "episodeNumber" : "3",
  "title" : "A Fine Day for Dying",
  "description" : "Jenny Cole, the daughter of a friend of Joe Mannix, awakens after almost a year in a coma following a hit-and-run accident. But the celebration of her return to health is soon cut short when someone tries to kill Jenny. This leads Mannix to conclude that Jenny must have seen something on the day of the accident that she shouldn't have seen -- and that someone wants to tie up that loose end by \"putting her to sleep\" permanently."
}, {
  "imdbId" : "0061277",
  "season" : "8",
  "episodeNumber" : "4",
  "title" : "Walk on the Blind Side",
  "description" : "The search is on and it's up to Mannix to uncover every possible stone, when Peggy's apprehended by syndicate thugs, who have mistaken her for an informant they are seeking."
}, {
  "imdbId" : "0061277",
  "season" : "8",
  "episodeNumber" : "5",
  "title" : "The Green Man",
  "description" : "Mannix, Federal Agents (and violent associates), race to find a missing counterfeiter, who took off with the printing plates for creating the illegal currency."
}, {
  "imdbId" : "0061277",
  "season" : "8",
  "episodeNumber" : "6",
  "title" : "Death Has No Face",
  "description" : "Someone has been calling Joe Mannix with vague threats of harm, and he initially disregards them as an occupational hazard. But when the threats turn into a near-fatal attack, Mannix reviews his old cases for a clue to the person's identity - and thinks he may have found it in an old extortion case in which he sent the extortionist to prison."
}, {
  "imdbId" : "0061277",
  "season" : "8",
  "episodeNumber" : "7",
  "title" : "A Small Favor for an Old Friend",
  "description" : "After spending three weeks incommunicado on a fishing trip, Mannix returns to Los Angeles to learn that his buddy from the Korean War, Harry Endicott, has apparently been killed in a plane crash. Finding a letter from Endicott appealing for help that was mailed the day before the crash, Mannix decides to run down some leads in Endicott's hometown of San Francisco. But upon his arrival, Mannix finds the mystery much deeper than he suspected - when first several people claim to have seen Mannix in the past few days, and then he locates an apartment where everything ..."
}, {
  "imdbId" : "0061277",
  "season" : "8",
  "episodeNumber" : "8",
  "title" : "Enter Tami Okada",
  "description" : "Joe Mannix is visited by Japanese detective Tami Okada (whose first name is pronounced as if spelled \"Tommy\"). Searching for a missing Japanese government courier who was apparently kidnapped upon arrival in Los Angeles, Okada asks Mannix for help. Mannix agrees, escorting Okada to the Japanese Village in Buena Park, and to \"Little Tokyo\" -- but their investigation soon leads to suspicions that the courier's disappearance may have been staged."
}, {
  "imdbId" : "0061277",
  "season" : "8",
  "episodeNumber" : "9",
  "title" : "Picture of a Shadow",
  "description" : "A prominent photographer is murdered and Mannix attempts to solve the case. ....but, this and a photo, could help solve possibly related killings."
}, {
  "imdbId" : "0061277",
  "season" : "8",
  "episodeNumber" : "10",
  "title" : "Desert Sun",
  "description" : "In a small New Mexican town, Mannix is called on to, somehow, reveal that an Native American's death was not an accident, but murder out of bigotry and prejudice."
}, {
  "imdbId" : "0061277",
  "season" : "8",
  "episodeNumber" : "11",
  "title" : "The Survivor Who Wasn't",
  "description" : "A man survives a plane crash and undergoes plastic surgery but when his wife second guesses his identity, she hires Mannix to uncover the truth."
}, {
  "imdbId" : "0061277",
  "season" : "8",
  "episodeNumber" : "12",
  "title" : "A Choice of Victims",
  "description" : "It's not Hooray For Hollywood when Joe must solve the murder of a wealthy businessman and protect his wife, who was performing in a charity show and may have been the intended victim."
}, {
  "imdbId" : "0061277",
  "season" : "8",
  "episodeNumber" : "13",
  "title" : "A Word Called Courage",
  "description" : "Joe Mannix is confronted by Harry Bennett, with whom Mannix served in Korea and who was later court-martialed, on testimony from Mannix, for giving information to his captors while a prisoner of war. Bennett claims that he is going to put Mannix through the same ordeal he faced at the hands of the North Koreans, and gives Mannix a name that Bennett claims Mannix will be unable to hold back once he becomes a captive. Then Bennett's threats seem to come true when Mannix is offered a sizable sum of money for the name of an informant within an underworld organization - ..."
}, {
  "imdbId" : "0061277",
  "season" : "8",
  "episodeNumber" : "14",
  "title" : "Man in a Trap",
  "description" : "The violent shooting of an old detective friend, leads Joe Mannix to investigate a syndicate don, that his friend had somehow ended up working for."
}, {
  "imdbId" : "0061277",
  "season" : "8",
  "episodeNumber" : "15",
  "title" : "Chance Meeting",
  "description" : "Peggy's cousin and her husband, a Vietnam veteran named Bill Rogell, are traveling to Los Angeles by bus when Rogell runs into fellow veteran Clint Williams at a stopover. While they reminisce, Rogell thinks he recognizes another man from their unit, but Williams insists Rogell is mistaken. Joe Mannix becomes involved, however, when the couple arrive in Los Angeles and Rogell is stabbed at the bus station."
}, {
  "imdbId" : "0061277",
  "season" : "8",
  "episodeNumber" : "16",
  "title" : "Edge of the Web",
  "description" : "Mannix must find and learn the truth, when a former college student's accused of killing his former anthropology professor."
}, {
  "imdbId" : "0061277",
  "season" : "8",
  "episodeNumber" : "17",
  "title" : "A Ransom for Yesterday",
  "description" : "A suddenly demanded ransom of $250,000, leads to Mannix to becoming involved in an unsolved and closed case regarding a kidnapped boy....which took place over 5 years ago."
}, {
  "imdbId" : "0061277",
  "season" : "8",
  "episodeNumber" : "18",
  "title" : "The Empty Tower",
  "description" : "At the start of a long weekend, off to a fishing vacation with friend Tony Elliott, Mannix stops at Tonys office so Tony can pick up a set of fishing flies. They walk in on a methodical heist of the businesses in the building. Mannix is trapped in the building, playing a cat and mouse game with the three burglars."
}, {
  "imdbId" : "0061277",
  "season" : "8",
  "episodeNumber" : "19",
  "title" : "Quartet for Blunt Instrument",
  "description" : "While driving back to Los Angeles, Mannix gives a lift to a black hitchhiker named Perry Riggs. Riggs is soon arrested at a roadblock, however, and charged with the murder of his former boss, a scientist who had been working on a formula for a gasoline replacement. Mannix decides to stay in the town to investigate the circumstances of the man's death -- in the hope that he can find evidence exonerating Riggs."
}, {
  "imdbId" : "0061277",
  "season" : "8",
  "episodeNumber" : "20",
  "title" : "Bird of Prey: Part 1",
  "description" : "Mannix travels to an island that's part of a South American country. Mannix's client wants to repay the man for the saving the life of the son of the client some years earlier. But Mannix soon discovers the case is more complicated than he bargained for. The man he's searching for is part of a plot to assassinate the president of the country. Just as Mannix is putting the pieces together, he's captured by the conspirators."
}, {
  "imdbId" : "0061277",
  "season" : "8",
  "episodeNumber" : "21",
  "title" : "Bird of Prey: Part 2",
  "description" : "The conspirators assassinate the president of a South American country and successfully frame Mannix for the killing. Now, the detective must dodge the authorities and hunt the conspirators as he tries to clear his name."
}, {
  "imdbId" : "0061277",
  "season" : "8",
  "episodeNumber" : "22",
  "title" : "Design for Dying",
  "description" : "Newspaper publisher Darrell Bigelow has political ambitions, but is concerned about the extramarital activities of his wife, Rebekah. Bigelow hires Joe Mannix to \"bring her home,\" and Mannix is soon able to track her down. But his easy success in closing the case soon leads Mannix to suspect that Bigelow's story was a cover-up, and that he used Mannix for a different, and much darker, purpose."
}, {
  "imdbId" : "0061277",
  "season" : "8",
  "episodeNumber" : "23",
  "title" : "Search for a Dead Man",
  "description" : "A hit man shoots his victim, a notorious crime boss, from a sniper's perch, but moments later can find no body where the man fell. Unable to convince the men who hired him that the crime boss is actually dead, he concocts a story about being a witness to a shooting and hires Joe Mannix to investigate whether a man really was killed that night, and if not, what happened to him."
}, {
  "imdbId" : "0061277",
  "season" : "8",
  "episodeNumber" : "24",
  "title" : "Hardball",
  "description" : "In the series' final show: To ensure a safe release of 6 hostages taken by a desperate drug dealer, Mannix, with no other choice, must find and deliver a member who turned informer against the dealer and his men."
}]