[{
  "imdbId" : "0851851",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Pilot",
  "description" : "A modern-day warrior and single mom hides from a government out to get her and her teenage son."
}, {
  "imdbId" : "0851851",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Gnothi Seauton",
  "description" : "John goes stir crazy when he's confined to the house, Sarah looks up an old friend for some help, but she may face betrayal, and Cromartie begins reassembling himself."
}, {
  "imdbId" : "0851851",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "The Turk",
  "description" : "John and Cameron start their new school, Sarah befriends a man who may be important to Sky Net and then struggles with what she must do. Meanwhile, Cromartie has tracked down a scientist to assist him in his regeneration."
}, {
  "imdbId" : "0851851",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Heavy Metal",
  "description" : "While John continues to have more difficulty coming to terms with a student who committed suicide and felt he was powerless to prevent it, he becomes separated from Sarah and Cameron while they're searching for some stolen cargo when he's accidentally trapped in the back of an armored truck loaded with enough metal to build 500 endoskeletons. But instead, John finds another Terminator with an unknown mission. Meanwhile, the murder of a plastic surgeon that Agent Ellison is investigating leads him to a surprising suspect, while Cromartie, the terminator who followed ..."
}, {
  "imdbId" : "0851851",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Queen's Gambit",
  "description" : "Sarah reevaluates the capabilities of her friend Andy Goode's computer, the Turk II, after he enters it in a major chess competition. During the competition, Sarah meets a stranger with a history similar to hers, and who is being pursued by another terminator. At school, John meets a new friend in shop class and becomes curious about the attractive and mysterious Cheri, who is possibly being abused at home. Cameron continues to try to fit in at school, but struggles to act \"normal\" in her session with the grief counselor. Agent Ellison finds remnants from a past ..."
}, {
  "imdbId" : "0851851",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Dungeons & Dragons",
  "description" : "With Derek Reese severely injured, John calls on Sarah's former fiancé Charlie Dixon, an EMT, to provide medical assistance. Sarah finds herself having to explain where she has been for the last 8 years and just who Derek is and where he is from. In flashbacks (of a sort) we learn of Derek's life in the future as a resistance fighter, his relationship with John Connor, and of his travel back in time with a team sent to help Sarah and John. Derek doesn't know that his brother Kyle is John's father."
}, {
  "imdbId" : "0851851",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "The Demon Hand",
  "description" : "While Derek Reese is recovering from his wounds, Cameron tries to recover the missing cyborg hand to ensure all remnants of the Terminator have been destroyed. Sarah learns that it is now in the possession of the FBI, specifically Special Agent James Ellison. She breaks into Ellison's apartment to find that he has extensive information about her, including videotaped interviews from when she was hospitalized. Derek continues to see Cameron as a threat and tells Sarah to make her leave. Agent Ellison visits Sarah's one-time psychiatrist, but faces a surprising ..."
}, {
  "imdbId" : "0851851",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Vick's Chip",
  "description" : "Derek catches Cameron in a lie that puts them inside Vick's head, Sarah continues to track the Turk, and Cromartie comes closer to finding John."
}, {
  "imdbId" : "0851851",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "What He Beheld",
  "description" : "Sarah finds herself in a business transaction with a mysterious business man named Sarkissian, who claims to be in possession of the stolen Turk computer system and wants an exorbitant amount of money for it. Cromartie closes in on John at his school, and Cameron thinks of a way to throw him off John's trail. Derek recalls his childhood before the so-called Judgement Day in 2011, when a nuclear war triggered by Skynet will destroy the world. Agent Ellison finally discovers that the terminator Cromartie is impersonating an FBI agent, and makes arrangements to apprehend..."
}, {
  "imdbId" : "0851851",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "Samson & Delilah",
  "description" : "John finds himself battling an unlikely opponent alone; Derek and Charley search for the family after an explosion; and Ellison deals with the aftermath of Cromartie's massacre."
}, {
  "imdbId" : "0851851",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "Automatic for the People",
  "description" : "Sarah, Derek and Cameron try to prevent a nuclear meltdown, Charley has to fill in Michelle when James shows up at their home, and John meets someone new."
}, {
  "imdbId" : "0851851",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "The Mousetrap",
  "description" : "Cromartie uses Charley and Michelle in a plot to lure Sarah into the desert and leave John alone and vulnerable in the city. Meanwhile, Catherine Weaver has a job proposal for Agent Ellison."
}, {
  "imdbId" : "0851851",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "Allison from Palmdale",
  "description" : "Another malfunction causes Cameron to believe that she is actually a human from the future named Allison. Sarah accompanies her pregnant landlady to the hospital. Ellison continues to contemplate Catherine Weaver's job offer."
}, {
  "imdbId" : "0851851",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "Goodbye to All That",
  "description" : "John and Derek sign on for military school to protect a key future Resistance hero from termination. Back at home, Sarah and Cameron protect a young boy who shares the same name as the intended target."
}, {
  "imdbId" : "0851851",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "The Tower Is Tall But the Fall Is Short",
  "description" : "A woman from Derek's past surprises him and elsewhere, Sarah, John and Cameron wonder what a T-1001 would need with a doctor."
}, {
  "imdbId" : "0851851",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "Brothers of Nablus",
  "description" : "While Sarah and Cameron search for the person who robbed the house, Cromartie returns to hunt down Cameron and John. Meanwhile, a new cyborg arrives and creates trouble for Ellison."
}, {
  "imdbId" : "0851851",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "Mr. Ferguson Is Ill Today",
  "description" : "Cromartie kidnaps Sarah and races to Mexico to find John. When Derek, Cameron and Ellison discover what has happened, they come to their defense--which leads to one final, deadly confrontation with Cromartie."
}, {
  "imdbId" : "0851851",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "Complications",
  "description" : "Sarah turns to Dr. Sherman when she begins having nightmares, Jesse tries to convince Derek that she has captured an important figure from the future, and John and Cameron discover that Cromartie's body is missing."
}, {
  "imdbId" : "0851851",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "Strange Things Happen at the One Two Point",
  "description" : "Sarah's quest to find the meaning behind the \"three dots\" leads to a technology firm seeking an advanced microchip. Dr. Sherman is killed while working with Catherine Weaver's A.I. computer, and Jesse comes clean about her mission."
}, {
  "imdbId" : "0851851",
  "season" : "2",
  "episodeNumber" : "11",
  "title" : "Self Made Man",
  "description" : "Cameron learns that a terminator was accidentally sent back to 1920s Los Angeles, and she tries to find out what happened to him. Meanwhile, John has a run-in with a group of punks while taking Riley home from a party."
}, {
  "imdbId" : "0851851",
  "season" : "2",
  "episodeNumber" : "12",
  "title" : "Alpine Fields",
  "description" : "Terminators come after a family whose unborn daughter plays an important role in the war against the Machines, and Sarah, Cameron, and Derek try to protect them."
}, {
  "imdbId" : "0851851",
  "season" : "2",
  "episodeNumber" : "13",
  "title" : "Earthlings Welcome Here",
  "description" : "Sarah turns to a UFO convention for answers about the \"three dots,\" more details about Riley's mission are revealed, and Ellison begins working with Catherine Weaver's AI prototype, \"John Henry.\""
}, {
  "imdbId" : "0851851",
  "season" : "2",
  "episodeNumber" : "14",
  "title" : "The Good Wound",
  "description" : "Sarah has visions of John's dead father as she tries to find a doctor to remove a bullet from her leg, Jesse removes Riley from the hospital after her suicide attempt, and Catherine covers her tracks after a secret location is identified."
}, {
  "imdbId" : "0851851",
  "season" : "2",
  "episodeNumber" : "15",
  "title" : "Desert Cantos",
  "description" : "Sarah attends a memorial service for Catherine Weaver's victims at the supposed heating and air conditioning plant to search for answers and find a connection to Skynet."
}, {
  "imdbId" : "0851851",
  "season" : "2",
  "episodeNumber" : "16",
  "title" : "Some Must Watch While Some Must Sleep",
  "description" : "Sarah suspects that something fishy is going on at the medical clinic where she is being treated for insomnia. During her stay, she has flashbacks to a run-in she had with a man from the plant whom she thought she had already killed."
}, {
  "imdbId" : "0851851",
  "season" : "2",
  "episodeNumber" : "17",
  "title" : "Ourselves Alone",
  "description" : "While Derek does surveillance on a lawyer he suspects may be connected to Skynet, Sarah and Cameron begin to have doubts about Riley."
}, {
  "imdbId" : "0851851",
  "season" : "2",
  "episodeNumber" : "18",
  "title" : "Today Is the Day: Part 1",
  "description" : "As the Connors prepare to move, they find out that Riley is dead, and Sarah begins to doubt Cameron's motives. Jesse flashes back to a submarine mission in the future, and John Henry plays hide and seek with Catherine Weaver's daughter."
}, {
  "imdbId" : "0851851",
  "season" : "2",
  "episodeNumber" : "19",
  "title" : "Today Is the Day: Part 2",
  "description" : "Jesse recalls more of her fateful future mission aboard the Jimmy Carter. Back in the present, her plan to turn John against Cameron backfires when John discovers that Jesse--not Cameron--killed Riley."
}, {
  "imdbId" : "0851851",
  "season" : "2",
  "episodeNumber" : "20",
  "title" : "To the Lighthouse",
  "description" : "Sarah and John hit the road without Cameron and Derek to stay with Charley Dixon, where she reveals to Charey that her cancer may have emerged. Meanwhile, a computer worm infects John Henry."
}, {
  "imdbId" : "0851851",
  "season" : "2",
  "episodeNumber" : "21",
  "title" : "Adam Raised a Cain",
  "description" : "Sarah, John and Cameron save Catherine Weaver's daughter Savannah from being killed by a machine, but Derek is killed in the process. Ellison is then forced to broker a meeting between Sarah and Catherine to return the child."
}, {
  "imdbId" : "0851851",
  "season" : "2",
  "episodeNumber" : "22",
  "title" : "Born to Run",
  "description" : "Sarah is in police custody, but John and Cameron disobey her orders and help her escape. The three then go to Zeira Corp so that Sarah can confront Catherine Weaver, and Cameron can confront John Henry."
}]