[{
  "imdbId" : "5171438",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "The Vulcan Hello",
  "description" : "While patrolling Federation space, the U.S.S. Shenzhou encounters an object of unknown origin, putting First Officer Michael Burnham to her greatest test yet."
}, {
  "imdbId" : "5171438",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Battle at the Binary Stars",
  "description" : "Escaping from the brig while the ship is under attack, Burnham joins the captain in an audacious plan to end a battle rapidly escalating into war."
}, {
  "imdbId" : "5171438",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Context is for Kings",
  "description" : "Burnham finds herself aboard the U.S.S. Discovery, where she quickly realizes things are not as they seem, including the mysterious Captain Gabriel Lorca."
}, {
  "imdbId" : "5171438",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "The Butcher's Knife Cares Not for the Lamb's Cry",
  "description" : "With tensions and stakes high as Starfleet continues in their efforts to end the war with Klingons, Burnham begins to settle in to her new position aboard the U.S.S. Discovery."
}, {
  "imdbId" : "5171438",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Choose Your Pain",
  "description" : "While on a mission, Lorca is captured by the Klingons and unexpectedly finds himself in the company of prisoner of war Starfleet Lieutenant Ash Tyler and notorious criminal Harry Mudd."
}, {
  "imdbId" : "5171438",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Lethe",
  "description" : "The USS Discovery crew is intrigued by new addition, Lt. Ash Tyler. Sarek seeks Burnham's help, rekindling memories from her past. Admiral Cornwell questions Lorca's tactics."
}, {
  "imdbId" : "5171438",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Magic to Make the Sanest Man Go Mad",
  "description" : "As the U.S.S. Discovery crew attempts to let loose at a party, an unwelcome visitor comes aboard bringing about a problematic and twisted sequence of events."
}, {
  "imdbId" : "5171438",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Si Vis Pacem, Para Bellum",
  "description" : "The U.S.S. Discovery is tasked with a high priority mission to the planet Pahvo and learn the science behind the Klingons' cloaking technology."
}, {
  "imdbId" : "5171438",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "Into the Forest I Go",
  "description" : "Bypassing Starfleet's orders, Lorca uses the USS Discovery crew's ultimate asset, the ship itself, in an effort to end the war with the Klingons once and for all."
}, {
  "imdbId" : "5171438",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "Despite Yourself",
  "description" : "While in unfamiliar territory, the U.S.S. Discovery crew is forced to get creative in their next efforts to survive opposing and unprecedented forces and return home."
}, {
  "imdbId" : "5171438",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "The Wolf Inside",
  "description" : "As the crew continues their guise, Burnham undergoes a merciless mission in hopes of helping the U.S.S. Discovery return home. Tilly works on restoring Stamets' neurofunction."
}, {
  "imdbId" : "5171438",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "Vaulting Ambition",
  "description" : "Burnham heads to the ISS Charon with a special \"gift\" for the Emperor. With the help of an unexpected source, Stamets gains clarity while trapped inside the mycelial network. Saru asks for L'Rell's help."
}, {
  "imdbId" : "5171438",
  "season" : "1",
  "episodeNumber" : "13",
  "title" : "What's Past is Prologue",
  "description" : "Lorca plans to move forward with a coup against the Emperor, propelling Burnham to make a quick decision to save not only herself, but the U.S.S. Discovery."
}, {
  "imdbId" : "5171438",
  "season" : "1",
  "episodeNumber" : "14",
  "title" : "The War Without, the War Within",
  "description" : "Burnham and the crew are faced with the harsh reality of the war during their absence. In order to move forward, Starfleet must use unconventional tactics and sources to take their next action against the Klingons."
}, {
  "imdbId" : "5171438",
  "season" : "1",
  "episodeNumber" : "15",
  "title" : "Will You Take My Hand?",
  "description" : "With Georgiou at the helm of the plan to end the Klingon war once and for all, the USS Discovery crew struggles to fathom and tolerate her hostile tactics. Memories of past hardships are rekindled within Burnham."
}]