[{
  "imdbId" : "0076984",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Saga of a Star World",
  "description" : "The Twelve Colonies of Man are annihilated by the Cylons. Adama, commanding the last surviving Battlestar, takes it upon himself to lead all remaining survivors aboard 220 ships to find a new home. After the Galactica's fighter pilots successfully navigate a path through the Nova of Madagon minefield, the spoiled Sire Uri proposes to settle down on Carillon, where food and entertainment are provided by the natives. However, Adama suspects a Cylon trap."
}, {
  "imdbId" : "0076984",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Lost Planet of the Gods: Part 1",
  "description" : "Out on patrol, Apollo and Starbuck come across a great void, while Boomer and Jolly are infected with a plague that soon infects the remaining Viper pilots. Soon, Apollo and Starbuck find themselves having to train a group of female cadets, including Apollo's fiancée, Serina."
}, {
  "imdbId" : "0076984",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Lost Planet of the Gods: Part 2",
  "description" : "Adama orders the fleet to set a course into the seemingly endless void, where he expects to find the lost planet of Kobol, mother-world of the twelve tribes of man. Apollo and Serina are 'sealed' in marriage while Starbuck is being held captive on Baltar's Basestar. When Baltar learns of the search for Kobol, he follows the Colonial fleet for a face to face confrontation with Adama."
}, {
  "imdbId" : "0076984",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "The Lost Warrior",
  "description" : "Apollo crashes on the Wild West like planet Equellus after being pursued by four Cylon fighters. Taken in by a widow named Bella and her son Puppis, Apollo takes on crime boss La Certa and Red-Eye, a Cylon centurion turned formidable gunfighter who killed Bella's husband Martin."
}, {
  "imdbId" : "0076984",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "The Long Patrol",
  "description" : "Starbuck's unplanned double-date with Cassiopeia and Athena on the recently-reopened luxury liner Rising Star is interrupted when the Galactica picks up long-range transmission traffic indicting human life in a distant solar system on the other side of a vast asteroid dust field. Starbuck is recalled to duty to pilot the Starchaser, an up-powered reconnaissance viper denuded of weaponry and bearing a voice-activated computer - Computer, Oral Response Activated, known simply as CORA - that can handle the vast increase in performance in the new viper. Starbuck is ..."
}, {
  "imdbId" : "0076984",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Gun on Ice Planet Zero: Part 1",
  "description" : "A special task force, mostly made up out of convicts, is dispatched to destroy a giant Cylon operated pulsar cannon on the planet Aracta directly in the Colonial Fleet's path. Having lost a cadet on the planet earlier, Starbuck is eager to join the expedition for once. Boxey and Muffit also join the group as stowaways."
}, {
  "imdbId" : "0076984",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Gun on Ice Planet Zero: Part 2",
  "description" : "As Apollo and the team of convicted specialists brave the snowy mountain to blow up the Ravashol Pulsar, the criminals plan their escape. Starbuck is still determined to make a detour and rescue cadet Cree, but the Theta clones object to the destruction of their creator's weapon."
}, {
  "imdbId" : "0076984",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "The Magnificent Warriors",
  "description" : "After the Cylon's destroy two of the fleet's Agro ships and cripple the last remaining one, Adama hopes to swap an old energizer for seed on the the planet Sectar in Quadrant Zeta. Unfortunately Siress Belloby won't give up the energizer unless the commander courts her. Down on the planet, the inhabitants of the small Agro community of Serenity are looking for a new dispensable constable to hold off the Borays who raid the town each high moon."
}, {
  "imdbId" : "0076984",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "The Young Lords",
  "description" : "Shot down by Cylons, Starbuck crash lands on Attila, a planet on the far edge of Omega Sector and finds himself rescued from a phalanx of Cylons by a family of children. Kyle, the young leader of these self proclaimed warriors, soon hatches a plan to trade Starbuck to Outpost commander Spectre for his captured father."
}, {
  "imdbId" : "0076984",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "The Living Legend: Part 1",
  "description" : "While suffering from a fuel shortage, The Galactica finds the supposedly lost Battlestar Pegasus, led by the legendary Commander Cain."
}, {
  "imdbId" : "0076984",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "The Living Legend: Part 2",
  "description" : "After Baltar's attack is repulsed, the crews of the Galactica and Pegasus carry out an attack on the planet Gamoray to acquire fuel supplies."
}, {
  "imdbId" : "0076984",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "Fire in Space",
  "description" : "The crew of the Galactica struggle to fight massive fires on board caused by Cylon suicide incendiary attacks."
}, {
  "imdbId" : "0076984",
  "season" : "1",
  "episodeNumber" : "13",
  "title" : "War of the Gods: Part 1",
  "description" : "Silver Spar Squadron is overtaken by a Ship of Lights and subsequently disappears. Investigating a red planet, Apollo, Starbuck and Sheba find a crashed starship and a lone survivor, the mysterious Count Iblis. After Sheba takes him on a tour of the Galactica and other ships in the fleet, the charismatic Count offers to perform three miracles of the Colonial's choosing if they will surrender leadership of the fleet to him."
}, {
  "imdbId" : "0076984",
  "season" : "1",
  "episodeNumber" : "14",
  "title" : "War of the Gods: Part 2",
  "description" : "Count Iblis has delivered the Colonials' enemy, Baltar before the Council of Twelve. As the Colonials celebrate, Adama and Apollo come to the conclusion that the secret to Iblis' identity can only be found within the wreckage of the ship where he was first encountered."
}, {
  "imdbId" : "0076984",
  "season" : "1",
  "episodeNumber" : "15",
  "title" : "The Man with Nine Lives",
  "description" : "On the Rising Star, Three Borellian Nomen on a Blood Hunt are searching for a certain Captain Dimitri. Their prey, an old con artist now calling himself Chameleon, convinces Starbuck there is a chance he might be his long lost father in order to sneak past his pursuers and onto the Galactica."
}, {
  "imdbId" : "0076984",
  "season" : "1",
  "episodeNumber" : "16",
  "title" : "Murder on the Rising Star",
  "description" : "Starbuck is engaged in a game of triad (by Earth standards a mixture of basketball and football) and is consistently struck by hot-tempered bullying Flight Sergeant Ortega, whose low-blows to Starbuck finally result in a fight and ejection of both from the game. Starbuck nearly resumed the fight with Ortega but is stopped by Cassiopeia. Both men separate and after Ortega cleans up he is confronted - and found shot to death. Starbuck is seen rushing to the shuttle bay before Ortega's body is found - and when Starbuck's laser gun is tested it is found to be the murder ..."
}, {
  "imdbId" : "0076984",
  "season" : "1",
  "episodeNumber" : "17",
  "title" : "Greetings from Earth",
  "description" : "Apollo and Starbuck come across a vessel they think may have come from Earth and take it aboard the Galactica. On board are two adults and four children in a state of suspended animation. Adama disagrees with the Council of Twelve about opening the sleeping chambers, for that may mean endangering the humans within. When the adult male, Michael, wakes up, he finds it difficult to breath the air on board the Galactica. Apollo, Starbuck and Cassiopea decide to escort the Lunar Shuttle Avion to its destination, hoping to find out if the travelers home, Terra, may be ..."
}, {
  "imdbId" : "0076984",
  "season" : "1",
  "episodeNumber" : "18",
  "title" : "Baltar's Escape",
  "description" : "With all of their enemies seemingly defeated, the Council of Twelve proposes to revoke the martial law that has been in effect since the destruction of the Colonies and give Commander Adama a permanent Council envoy, Siress Tinia. Meanwhile, Baltar plans his escape from the prison barge by enlisting the help of the Borelian Nomen and Commandant Leiter's enforcers."
}, {
  "imdbId" : "0076984",
  "season" : "1",
  "episodeNumber" : "19",
  "title" : "Experiment in Terra",
  "description" : "The mysterious Ship of Lights reappears, hijacks Apollo and his viper in space and sends him on a quest to save the planet Terra during peace negotiations with the Eastern Alliance. One of the beings of light takes human form to guide Apollo, and makes him take on the appearance of a missing Terran named Charlie."
}, {
  "imdbId" : "0076984",
  "season" : "1",
  "episodeNumber" : "20",
  "title" : "Take the Celestra",
  "description" : "During a celebration honoring Commander Kronus, Starbuck recognizes an old flame of his, Aurora and breaks off a date with Cassiopeia to follow his lost love to the Celestra. On their arrival, Starbuck and Apollo find themselves in the midst of a mutiny."
}, {
  "imdbId" : "0076984",
  "season" : "1",
  "episodeNumber" : "21",
  "title" : "The Hand of God",
  "description" : "On a night off, Apollo takes Starbuck, Cassiopeia, and Sheba to one of the least-explored areas of the Galactica - the last of the ancient battlestar's astro-navigational domes, an area Apollo has been repairing in his spare time as relaxation and as an outlet for his passion for deep-star exploration. The dome's scanner is set for long-range communication, and to their surprise they receive a signal, an image of an ancient spacecraft similar to what the Colonies once flew. After showing the signal to Boomer and Commander Adama, they are sent on a long-range Viper ..."
}]