[{
  "imdbId" : "0244365",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Broken Bow: Part 1",
  "description" : "Enterprise, Earths first vessel capable of exploring the universe, is to embark on a dangerous first mission: bringing back a chased Klingon to his home world."
}, {
  "imdbId" : "0244365",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Broken Bow: Part 2",
  "description" : "Archer learns from the Suliban Sarin that Klaang was carrying a message to the Klingons to prevent civil war in the Klingon Empire. She urges to find him."
}, {
  "imdbId" : "0244365",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Fight or Flight",
  "description" : "Captain Archer wants to convert curiosity into deeds and decides to enter a ship floating in space. Hoshi has trouble adjusting to life on Enterprise."
}, {
  "imdbId" : "0244365",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Strange New World",
  "description" : "Human curiosity speaks louder than Vulcan logic. Despite T'Pol's objection, Archer sends an away team to explore an uninhabited planet before getting a full scan of its unique properties. When nightfall arrives, the away team seeks shelter from a storm in a nearby cave. Panic and anxiety strike the team when a pollen brings on hallucinations of a life-form in the cave. Tucker's preconceptions of Vulcans are intensified when his delusions convince him T'Pol, in league with the \"rock people,\" intend to kill him and his human crew-mates."
}, {
  "imdbId" : "0244365",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Unexpected",
  "description" : "After helping to repair the warp drive on board of a Xyrillian ship, Trip notices a strange bulging on his arm."
}, {
  "imdbId" : "0244365",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Terra Nova",
  "description" : "Enterprise tries to find out what happen on Terra Nova, the first colonization attempt outside Earths solar system."
}, {
  "imdbId" : "0244365",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "The Andorian Incident",
  "description" : "Archer, Trip and T'Pol are caught at a Vulcan sanctuary by Andorians. They think the sanctuary is used to spy on Andoria."
}, {
  "imdbId" : "0244365",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Breaking the Ice",
  "description" : "Enterprise discovers a comet which contains the very rare element eisilium. Then unexpectedly a Vulcan ship arrives. Captain Vanik tells they're interested in human behavior."
}, {
  "imdbId" : "0244365",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "Civilization",
  "description" : "T'Pol finds unusual neutrino readings on a planet with a preindustrial society."
}, {
  "imdbId" : "0244365",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "Fortunate Son",
  "description" : "Enterprise is sent to help the freighter Fortunate after an attack. Its first officer, Ryan, is hiding something however."
}, {
  "imdbId" : "0244365",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "Cold Front",
  "description" : "Enterprise has a group of aliens watching a stellar phenomenon on board. When the ship is miraculously saved from blowing up, crewman Daniels has an important message for Archer."
}, {
  "imdbId" : "0244365",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "Silent Enemy",
  "description" : "After an attack by a mysterious ship, Archers orders Enterprise' return to Jupiter to install phase cannons."
}, {
  "imdbId" : "0244365",
  "season" : "1",
  "episodeNumber" : "13",
  "title" : "Dear Doctor",
  "description" : "Phlox is asked to save the Valakians from annihilation by disease. He discovers something about another humanoid race on the planet however."
}, {
  "imdbId" : "0244365",
  "season" : "1",
  "episodeNumber" : "14",
  "title" : "Sleeping Dogs",
  "description" : "Enterprise tries to rescue a Klingon ship from sinking into a gas giant."
}, {
  "imdbId" : "0244365",
  "season" : "1",
  "episodeNumber" : "15",
  "title" : "Shadows of P'Jem",
  "description" : "T'Pol is being recalled because of Enterprise' involvement in the destruction of the P'Jem sanctuary. Then T'Pol and Archer get kidnapped visiting the planet Coridan."
}, {
  "imdbId" : "0244365",
  "season" : "1",
  "episodeNumber" : "16",
  "title" : "Shuttlepod One",
  "description" : "Tucker and Reed return in Shuttlepod One to rendez-vous with Enterprise, only to find evidence that it has been destroyed. An unknown phenomenon, resembling a myth known as a \"micro-singularity,\" damages the shuttlepod, leaving the men only days of breathable air and no way to call for help."
}, {
  "imdbId" : "0244365",
  "season" : "1",
  "episodeNumber" : "17",
  "title" : "Fusion",
  "description" : "Enterprise is on its way to explore the giant Arachnid Nebula when they rendezvous with a Vulcan ship that has been in space for more than eight years. Its crew is V'tosh ka'tur. That means they have a different interpretation of the teachings of Surak and try to find a balance between logic and emotion instead of suppressing them. Trip starts working on repairs with engineer Kov while captain Archer receives a message from the terminally ill father of Kov. Meanwhile another Vulcan, Tolaris, tries to convert T'Pol to their ways. He wants to do a mind meld with her."
}, {
  "imdbId" : "0244365",
  "season" : "1",
  "episodeNumber" : "18",
  "title" : "Rogue Planet",
  "description" : "Lieutenant Reed discovers a rogue planet, which has broken out of orbit and therefore is devoid of any light. Life is still possible in some places because heat is bubbling up from under the surface, but T'Pol doesn't detect any humanoid life. Further scans however give a strange energy reading which seems to be coming from a ship on the surface. After the crew has landed, they encounter the Eska. The Eska come from another planet and they say they are hunting for the drayjin, an animal considered a delicacy. When captain Jonathan Archer tries to sleep on the planet, ..."
}, {
  "imdbId" : "0244365",
  "season" : "1",
  "episodeNumber" : "19",
  "title" : "Acquisition",
  "description" : "Four greedy Ferengis have invaded Enterprise while the crew is unconscious. They have already confiscated numerous valuable supplies, but are still interested in more. They wake up captain Archer to get the know the whereabouts of 'the vault'. Another crew member is still awake in the decontamination chamber, Trip. He wakes T'Pol. Since the weakness of the invaders is not difficult to find, the three try to outsmart the Ferengis."
}, {
  "imdbId" : "0244365",
  "season" : "1",
  "episodeNumber" : "20",
  "title" : "Oasis",
  "description" : "The crew of Enterprise have a meeting with the trader D'Marr. Unfortunately he is unable to provide them with valuable ores, but knows of a location where these can be obtained. He tells he found an apparently abandoned ship and tried to empty it to make a fortune. But according to D'Marr the ship is haunted and he was forced to leave. Enterprise starts looking for the ship anyway. Scans show there really aren't any bio-signs, but after coming on board the crew soon gets the feeling they are not alone."
}, {
  "imdbId" : "0244365",
  "season" : "1",
  "episodeNumber" : "21",
  "title" : "Detained",
  "description" : "Captain Archer and Mayweather are investigating a strange energy reading from the other side of a moon. The next moment they find themselves in a complex inhabited by Sulibans. The Sulibans are kept against their will by the Tandarans, who are in war with the Cabal, a Suliban terrorist organization. Archer and Mayweather are held prisoner because of trespassing, but Tandaran colonel Grat assures their release will only be a formality. While captain Archer is suspicious of the Suliban at first, he soon finds out they're innocent and makes plan to release them. ..."
}, {
  "imdbId" : "0244365",
  "season" : "1",
  "episodeNumber" : "22",
  "title" : "Vox Sola",
  "description" : "A group of Kreetassans are on board of Enterprise for a friendly meeting. But they leave rather unexpectedly as they seem very offended by something. The crew have no idea what however. But as their ship leaves an alien gel like creature manages to crawl aboard. The creature is growing and growing and shows rather hostile tendencies as it encapsulates five crew members, including captain Archer and commander Tucker. T'Pol, Hoshi and Reed have to come up with a solution quickly. The lives of the five are at stake as the creature begins a symbiotic relationship that in ..."
}, {
  "imdbId" : "0244365",
  "season" : "1",
  "episodeNumber" : "23",
  "title" : "Fallen Hero",
  "description" : "Enterprise is planning a trip to the relaxation planet Risa, when it gets an urgent request from the Vulcan High Command. They must pick up ambassador V'Lar who has fallen in disgrace. Apparently she misused her position during negotiations on the planet Mazar and has been evicted. After Enterprise picked up V'Lar and is on its way for a meeting with the Vulcan warship Sh'Ran, suddenly a Mazarite ship appears. They want V'Lar for further interrogating. When captain Archer wants to discuss it first with Starfleet Command, they open fire."
}, {
  "imdbId" : "0244365",
  "season" : "1",
  "episodeNumber" : "24",
  "title" : "Desert Crossing",
  "description" : "Enterprise is for the second time on its way to Risa when yet again another urgent matter comes up: a distress call. It comes from a small vessel. The owner, Zobral, is extremely happy with the help from Enterprise and invites Captain Archer to his home world for a good meal and a game of Geskana. When Archer and Trip have landed on the desert planet, Enterprise gets a message from the Torothan Chancellor Trelit. He tells Zobral isn't as nice a man as captain Archer thinks."
}, {
  "imdbId" : "0244365",
  "season" : "1",
  "episodeNumber" : "25",
  "title" : "Two Days and Two Nights",
  "description" : "After several delays, the Enterprise crew gets some well-deserved shore leave on the famed pleasure planet Risa. Commander Tucker and Lieutenant Reed eagerly seek out female companionship, only to fall into a tourist trap. Captain Archer meets an attractive female who seems to be more interested in his knowledge of the Suliban than his companionship. Hoshi Sato meets a fellow vacationer and they share more than each other's native languages. Doctor Phlox takes the opportunity to hibernate, only to be rudely awakened when Mayweather needs medical treatment."
}, {
  "imdbId" : "0244365",
  "season" : "1",
  "episodeNumber" : "26",
  "title" : "Shockwave: Part 1",
  "description" : "Enterprise discovers a mining colony of the Paraagans. The crew gets an invitation for a meeting on the surface and a shuttle pod tries to break through the atmosphere. All of the sudden just under the shuttle a giant explosion begins and scorches the earth beneath. All 3600 colonists are reported dead. After examination Enterprise finds out plasma leaking from the pod's vents ignited tetrazine in the atmosphere. Lieutenant Reed however ensures he closed the plasma vents before the shuttle went of. After conversations with admiral Forrest of Starfleet Command, captain..."
}, {
  "imdbId" : "0244365",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "Shockwave: Part 2",
  "description" : "Captain Archer and temporal agent Daniels have been stranded in the 31st century. In a library they investigate the damage to the time line and try to find way a to get Archer back in his own century. Meanwhile Silik the Suliban leader is trying his utmost to find the whereabouts of Archer and he is willing to go far for the answer. But the crew of Enterprise has plans of their own. Trip finds a way to use the com system and is able to speak with Reed. Together they try to contact other crew members and make plans to purge Enterprise of the Sulibans."
}, {
  "imdbId" : "0244365",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "Carbon Creek",
  "description" : "Celebrating T'Pol's one year anniversary as a member of the Enterprise's crew, Archer and Trip have dinner with her. Over dinner she tells them of the true first contact between Humans and Vulcans. It appears that her great-great-grandmother and a the crew of a scout ship crashed on Earth...in 1957."
}, {
  "imdbId" : "0244365",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "Minefield",
  "description" : "The Enterprise stumbles into an area of space containing cloaked mines. When a malfunctioning, active mine attaches itself to a critical area of the ship's hull, Lieutenant Reed dons an EV suit and attempts to disarm it. Complications arise when the mine's leg penetrates Reed's leg, pinning him to the hull. Captian Archer must find a way to get rid of the mine and save Reed before the Romulans run out of patience."
}, {
  "imdbId" : "0244365",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "Dead Stop",
  "description" : "After the encounter with the Romulan minefield, Enterprise is severely damaged. Engineer Trip fears the worst. With the ship only capable of warp 2.5, traveling back to Jupiter will take practically forever and he doesn't have the necessary components to make the repairs himself. Captain Archer decides to send out a distress call and it isn't long before he gets a response from the Tellarites. They give the coordinates of a strange repair station. Upon approaching Enterprise is scanned. The atmosphere and the docking port are automatically changed to Enterprise' specs..."
}, {
  "imdbId" : "0244365",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "A Night in Sickbay",
  "description" : "After previously offending the Kreetassans, Enterprise attempts to make a better second impression, only to upset the alien race once again. A frustrated Captain Archer returns from the planet only to be further upset to find that his dog Porthos, has been affected by a pathogen native to the world. While Phlox works around the clock treating Porthos, Archer stands vigil in sickbay, experiencing first-hand the quirky everyday life of his Denobulan Doctor."
}, {
  "imdbId" : "0244365",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "Marauders",
  "description" : "Enterprise visits a colony with a deuterium trading post. But the people seem to be pretty unwilling to trade. Are they hiding something?"
}, {
  "imdbId" : "0244365",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "The Seventh",
  "description" : "T'Pol asks captain Archer to join her on a mission to capture a Vulcan fugitive that escaped her years ago."
}, {
  "imdbId" : "0244365",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "The Communicator",
  "description" : "Upon returning from covertly observing a pre-warp culture, Lieutenant Reed realizes he lost his communicator somewhere on the planet. Archer and Reed return to recover the lost technology, only to find the natives found it first. Captured and interrogated, the crewmen find themselves doing even more damage to the culture, who have scanned the prisoners and know them to be of another race. Meanwhile, Tucker and Mayweather try to figure out how to active the cloak on the Suliban cell ship so they can mount a discreet rescue."
}, {
  "imdbId" : "0244365",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "Singularity",
  "description" : "T'Pol must save the ship after the crew passed out during the approach to a black hole."
}, {
  "imdbId" : "0244365",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "Vanishing Point",
  "description" : "After Hoshi has used the transporter to avoid running into a storm, she starts to feel really weird."
}, {
  "imdbId" : "0244365",
  "season" : "2",
  "episodeNumber" : "11",
  "title" : "Precious Cargo",
  "description" : "While Trip is repairing a stasis pod at a Retellian cargo ship and the woman inside, heir apparent to the throne of Krios, wakes up, the ship makes a hasty departure. Trip must make a plan to escape."
}, {
  "imdbId" : "0244365",
  "season" : "2",
  "episodeNumber" : "12",
  "title" : "The Catwalk",
  "description" : "A mysterious wave is headed toward Enterprise. An alien shuttle warns the crew that the radiation will kill them and seeks shelter aboard ship. With only hours to prepare, ship's control is rerouted and Enterprise personnel take refuge in the highly-insulated, close-quartered catwalk. Soon it is discovered that the alien passengers are immune to the radiation and lied their way into hiding on Enterprise, which has been boarded and commandeered by aliens who assumed it to be abandoned."
}, {
  "imdbId" : "0244365",
  "season" : "2",
  "episodeNumber" : "13",
  "title" : "Dawn",
  "description" : "Trip's shuttle is fired upon and he and his aggressor are forced to land on a nearby moon. While the nighttime weather is calm, the incoming dawn will make the planet inhospitable and deadly. Despite the language barrier and violent introduction, Trip and Zho'Kaan reach an understanding and struggle to survive, hoping to be rescued before the sun rises."
}, {
  "imdbId" : "0244365",
  "season" : "2",
  "episodeNumber" : "14",
  "title" : "Stigma",
  "description" : "The Enterprise makes way to a planet hosting the Interspecies Medical Exchanges convention. Phlox seeks to take advantage of the opportunity to meet with Vulcan doctors to learn more about a highly-stigmatized neurological affliction only transmitted through Vulcan mind melds. The Vulcans discover T'Pol is afflicted. Believing the stigma to be unethical, T'Pol chooses not to reveal that her participation in the mind meld was not voluntary but the result of physical and mental assault. Meanwhile, Feezal, one of Phlox's wives is aboard to assist Trip in the installation..."
}, {
  "imdbId" : "0244365",
  "season" : "2",
  "episodeNumber" : "15",
  "title" : "Cease Fire",
  "description" : "Captain Archer is asked to negotiate between the Andorians and Vulcans who are fighting over a small planet."
}, {
  "imdbId" : "0244365",
  "season" : "2",
  "episodeNumber" : "16",
  "title" : "Future Tense",
  "description" : "Enterprise discovers a pod with the body of a human, that seems to be wanted by both Sulibans and Tholians."
}, {
  "imdbId" : "0244365",
  "season" : "2",
  "episodeNumber" : "17",
  "title" : "Canamar",
  "description" : "Archer and Trip are accused of smuggling and sent to the penal colony Canamar. While Enterprise manages to negotiate their release, a mutiny breaks out on the prison ship."
}, {
  "imdbId" : "0244365",
  "season" : "2",
  "episodeNumber" : "18",
  "title" : "The Crossing",
  "description" : "Enterprise is being held captive by non-corporeal beings who claim to be explorers."
}, {
  "imdbId" : "0244365",
  "season" : "2",
  "episodeNumber" : "19",
  "title" : "Judgment",
  "description" : "After Enterprise lends aid to a group of accused rebels, Captain Archer faces a tribunal and charges of conspiring against the Klingon Empire."
}, {
  "imdbId" : "0244365",
  "season" : "2",
  "episodeNumber" : "20",
  "title" : "Horizon",
  "description" : "Ensign Travis Mayweather takes leave when Enterprise rendez-vous with the cargo ship Horizon, his childhood home. The family reunion is bittersweet when Mayweather learns of his father's death and he butts heads with his brother/Acting Captain, Paul, who resents Travis' leaving the Horizon and finding a successful career with Starfleet. Meanwhile, Enterprise backtracks to visit a planet undergoing drastic geographical changes. T'Pol looks to avoid attending movie night."
}, {
  "imdbId" : "0244365",
  "season" : "2",
  "episodeNumber" : "21",
  "title" : "The Breach",
  "description" : "At Dr. Phlox's request, Enterprise attempts to retrieve 3 Denobulan scientists from the planet Xantoras, where the Goverment has ordered all off-worlders to evacuate within 3 days. Tucker, Reed, and Mayweather navigate a series of labyrinthine underground caves in search of the scientists. Meanwhile, Enterprise lends assistance to a damaged ship fleeing the planet. Doctor Phlox faces an ethical dilemma when one of the refugees of the ship refuses life-saving treatment. The patient, an Antaran, holds a grudge against Phlox stemming from a war between their races that ..."
}, {
  "imdbId" : "0244365",
  "season" : "2",
  "episodeNumber" : "22",
  "title" : "Cogenitor",
  "description" : "Enterprise encounters a hyper-giant, the first to be studied by humans. While there, they make first contact with the Vissians, a technologically sophisticated race with three genders. While making quick friends and eagerly learning about the advanced technology, Trip gets curious about the Vissians third gender, known as the Cogenitor, who is crucial in the Vissian reproductive process. While intellectually equal to males and females, the Cogentior are not granted the same liberties, such as freedom of travel, education, or even names. Against the wishes of the ..."
}, {
  "imdbId" : "0244365",
  "season" : "2",
  "episodeNumber" : "23",
  "title" : "Regeneration",
  "description" : "Borg casualties from a century earlier (events depicted in \"Star Trek: First Contact\") are re-animated by a research team. The Enterprise is ordered to intercept them before they can escape in their commandeered ship."
}, {
  "imdbId" : "0244365",
  "season" : "2",
  "episodeNumber" : "24",
  "title" : "First Flight",
  "description" : "Capt. Archer recounts the story of a Warp engine test to T'Pol."
}, {
  "imdbId" : "0244365",
  "season" : "2",
  "episodeNumber" : "25",
  "title" : "Bounty",
  "description" : "While surveying an uninhabited planet, Enterprise is met by a Tellarite ship. Captain Archer is abducted by Skalaar, a Tellarite hoping to collect a bounty placed on Archer by the Klingons. Meanwhile, a microbe from the planet infects T'Pol and Phlox. The affliction causes T'Pol to prematurely enter Pon farr, a chemical imbalance invoking Vulcans urge to mate. Phlox tries to treat an emotionally unstable T'Pol, who is getting too close for Denobulan comfort."
}, {
  "imdbId" : "0244365",
  "season" : "2",
  "episodeNumber" : "26",
  "title" : "The Expanse",
  "description" : "An unknown probe fires on Earth from space, cutting a swath from Florida to Venezula. Everything in the path of the attack was destroyed, resulting in the deaths of seven million humans including Tucker's baby sister Elizabeth. Enterprise is recalled to Earth for upgrades to the ship and to take on military crewman. Silik give Archer a message from the future about Earth's latest enemy. The Klingon Empire gives Duras another chance to capture Archer. Enterprise heads for infamous and dangerous Delphic Expanse."
}, {
  "imdbId" : "0244365",
  "season" : "3",
  "episodeNumber" : "1",
  "title" : "The Xindi",
  "description" : "The Enterprise has been in the Delphic Expanse for six weeks and have yet to get any intel about the Xindi. Strange anomalies affect the ship, sending cargo flying violently through the bays, pockets of atmosphere losing gravity and other incidents defying the known laws of physics. T'Pol helps Trip's insomnia with an intimate Vulcan therapy. Archer and Trip find another race of Xindi imprisoned in a mine."
}, {
  "imdbId" : "0244365",
  "season" : "3",
  "episodeNumber" : "2",
  "title" : "Anomaly",
  "description" : "After an attack by Oosarian pirates, Enterprise follows them to a mysterious sphere."
}, {
  "imdbId" : "0244365",
  "season" : "3",
  "episodeNumber" : "3",
  "title" : "Extinction",
  "description" : "Archer, Reed and Sato are transformed to aliens while visiting a planet."
}, {
  "imdbId" : "0244365",
  "season" : "3",
  "episodeNumber" : "4",
  "title" : "Rajiin",
  "description" : "Enterprise helps an alien woman, Rajiin, seeking to escape her life as a sex slave. Once on board she uses her alien abilities to gather biometric data about humans and is recaptured by her employers, the Xindi council."
}, {
  "imdbId" : "0244365",
  "season" : "3",
  "episodeNumber" : "5",
  "title" : "Impulse",
  "description" : "Enterprise answers an automated distress call of the Vulcan ship Seleya, lost in the Expanse 9 months ago. Captain Archer, T'Pol, Lt. Reed and Cpl. Hawkins dock Shuttlepod One with Seleya, only to be attacked by the survivors. The Vulcan crew have been reduced to zombie-like drones, permanently brain-damaged by a neurotoxin in the Trellium. Meanwhile, Enterprise navigates an unpredictable asteroid field rich in Trellium, an ore that can be refined to make a vital insulation for traveling the expanse with minimal damage from the anomalies. Tucker and Mayweather land ..."
}, {
  "imdbId" : "0244365",
  "season" : "3",
  "episodeNumber" : "6",
  "title" : "Exile",
  "description" : "Hoshi Sato is contacted by a 400-year-old telepathic alien exiled on planet in The Expanse, shunned by his society because of his abilities. The alien offers to use his powers to help Enterprise find the Xindi and the weapon they are building, but only if Hoshi will stay with him while he works. She agrees to stay behind, while Enterprise confirms The Expanse has a second Sphere and is on its way to investigate."
}, {
  "imdbId" : "0244365",
  "season" : "3",
  "episodeNumber" : "7",
  "title" : "The Shipment",
  "description" : "Enterprise follows a lead and discovers a Xindi lab that refines Kemocite, the key ingredient in the weapon being built to destroy Earth. An away team of Archer, Reed and Hayes confront the lead researcher, Gralik Durr, who was employed by Degra to refine the Kemocite but was never told what it would be used for. When Gralik realizes it was his research that contributed to the 7 million deaths on Earth, he agrees to help Archer prevent further loss of life. Meanwhile, on Enterprise, Phlox and Tucker study the weapon they seized from the Xindi and find an organic ..."
}, {
  "imdbId" : "0244365",
  "season" : "3",
  "episodeNumber" : "8",
  "title" : "Twilight",
  "description" : "Enterprise is hit with a rather intense anomaly. Refusing to leave an injured T'Pol behind, Archer is struck by the anomaly, leaving his brain infected with parasites, preventing him from making any new memories. Fast-forward 12 years. T'Pol has been caring for Archer since his affliction. As she does every day, T'Pol catches Archer up on the past 12 years, knowing he will forget everything within hours. She was in command of Enterprise after his injury, that the parasites live outside normal space-time and usual remedies never worked, that the Xindi were successful, ..."
}, {
  "imdbId" : "0244365",
  "season" : "3",
  "episodeNumber" : "9",
  "title" : "North Star",
  "description" : "Enterprise investigates a unknown colony with humans who still live a Wild West life. They seem to be suppressing an alien race."
}, {
  "imdbId" : "0244365",
  "season" : "3",
  "episodeNumber" : "10",
  "title" : "Similitude",
  "description" : "Archer decides to make a fast-growing clone of Trip to help save his life while Enterprise is stranded in a dangerous field with nucleonic particles."
}, {
  "imdbId" : "0244365",
  "season" : "3",
  "episodeNumber" : "11",
  "title" : "Carpenter Street",
  "description" : "Archer and T'Pol travel back 150 years to Earth to stop three Xindi reptilians."
}, {
  "imdbId" : "0244365",
  "season" : "3",
  "episodeNumber" : "12",
  "title" : "Chosen Realm",
  "description" : "Enterprise is taken over by religious zealots who want to use Enterprise for a war against heretics."
}, {
  "imdbId" : "0244365",
  "season" : "3",
  "episodeNumber" : "13",
  "title" : "Proving Ground",
  "description" : "Enterprise has found the location of the testing site of the Xindi weapon and gets some rather unexpected help."
}, {
  "imdbId" : "0244365",
  "season" : "3",
  "episodeNumber" : "14",
  "title" : "Stratagem",
  "description" : "Archer and Xindi Degra are in a shuttle. With Degra having memory loss, Archer tells him they escaped together from a prison and the Insectoids took over power after destroying Earth."
}, {
  "imdbId" : "0244365",
  "season" : "3",
  "episodeNumber" : "15",
  "title" : "Harbinger",
  "description" : "With Reed and Hayes fighting over a training program and Trip seemingly making T'Pol jealous, Enterprise discovers a dying alien in pod with technology similar to the Spheres."
}, {
  "imdbId" : "0244365",
  "season" : "3",
  "episodeNumber" : "16",
  "title" : "Doctor's Orders",
  "description" : "While in command of Enterprise because the entire crew is in a coma, Dr. Phlox starts hearing some strange sounds."
}, {
  "imdbId" : "0244365",
  "season" : "3",
  "episodeNumber" : "17",
  "title" : "Hatchery",
  "description" : "Captain Archer orders the crew of Enterprise to save an insectoid Xindi hatchery."
}, {
  "imdbId" : "0244365",
  "season" : "3",
  "episodeNumber" : "18",
  "title" : "Azati Prime",
  "description" : "Archer decides he should pilot a kamikaze shuttle to destroy the Xindi weapon. Temporal agent Daniels urges him to reconsider."
}, {
  "imdbId" : "0244365",
  "season" : "3",
  "episodeNumber" : "19",
  "title" : "Damage",
  "description" : "Captain Archer has been returned to Enterprise by the Xindi council awaiting a hearing. But after a heavy attack by the Reptilians, Enterprise is stranded without a functional warp drive. They meet another ship in trouble because of space anomalies. The ship's captain isn't willing to trade in their warp coil and Archer must make a tough decision. Meanwhile T'Pol is having some strange sensations and can't control her emotions."
}, {
  "imdbId" : "0244365",
  "season" : "3",
  "episodeNumber" : "20",
  "title" : "The Forgotten",
  "description" : "Enterprise has arrived on time for the appointment with Xindi Degra. Captain Archer invites them to their ship, while he does his best to convince both Degra and Arboreal Jannar that the destruction of Earth is actually part of the grand scheme of the sphere builders to conquer the universe. While Jannar remains reluctant, Degra seems to be slightly won over. Trip Tucker is having a hard time keeping Enterprise in shape and is also having difficulties with writing a letter to the parents of crewman Taylor, informing of her death. Then trouble arises when out of the ..."
}, {
  "imdbId" : "0244365",
  "season" : "3",
  "episodeNumber" : "21",
  "title" : "E²",
  "description" : "Trying to pass through a subspace corridor, Enterprise is stopped by Enterprise."
}, {
  "imdbId" : "0244365",
  "season" : "3",
  "episodeNumber" : "22",
  "title" : "The Council",
  "description" : "Enterprise has arrived at the location of the Xindi Council and with the help of Degra, Archer can make his plea in front of the five races of Xindi. Archer needs to prove that the Sphere Builders have been telling lies. While the Primates and Arboreals are already aware of the truth, convincing the other three races will not be easy. The Reptilians and Insectoids refuse to even listen to Archer. Meanwhile, the Sphere Builders haven't been sitting still, and have arranged a secret meeting with the Reptilians."
}, {
  "imdbId" : "0244365",
  "season" : "3",
  "episodeNumber" : "23",
  "title" : "Countdown",
  "description" : "While the Reptilians force Hoshi to decipher a launch code, the Primates, Arboreals and Archer think of a way to stop the Xindi weapon."
}, {
  "imdbId" : "0244365",
  "season" : "3",
  "episodeNumber" : "24",
  "title" : "Zero Hour",
  "description" : "Archer takes Degra's ship to try to prevent Earth from being destroyed and gets some unexpected help. Enterprise tries to destroy Sphere 41, but the Sphere Builders know about the plan."
}, {
  "imdbId" : "0244365",
  "season" : "4",
  "episodeNumber" : "1",
  "title" : "Storm Front: Part 1",
  "description" : "Enterprise seems to have traveled back in time to World War Two, but it's not the World War that we are used to."
}, {
  "imdbId" : "0244365",
  "season" : "4",
  "episodeNumber" : "2",
  "title" : "Storm Front: Part 2",
  "description" : "After Silik attacked Trip, Vosk wants to make a deal with Archer: supplies of the ship for the completion of his time machine in return for a trip to the 22nd century."
}, {
  "imdbId" : "0244365",
  "season" : "4",
  "episodeNumber" : "3",
  "title" : "Home",
  "description" : "The crew take some time off. Archer meets an old friend, captain Erika Hernandez. T'Pol takes Trip to Vulcan, with a surprise waiting. Phlox finds out Earth has become xenophobic."
}, {
  "imdbId" : "0244365",
  "season" : "4",
  "episodeNumber" : "4",
  "title" : "Borderland",
  "description" : "After a Klingon ship is attacked, it's discovered the imprisoned Dr. Soongs genetically enhanced humans are responsible. Archer takes him to prevent a war."
}, {
  "imdbId" : "0244365",
  "season" : "4",
  "episodeNumber" : "5",
  "title" : "Cold Station 12",
  "description" : "The Augments are on their way to Cold Station 12, where Augments embryos are kept."
}, {
  "imdbId" : "0244365",
  "season" : "4",
  "episodeNumber" : "6",
  "title" : "The Augments",
  "description" : "The Augments have yet again escaped. While Dr. Soong wants to hide the embryos, Malik has an entirely different and way more cruel plan."
}, {
  "imdbId" : "0244365",
  "season" : "4",
  "episodeNumber" : "7",
  "title" : "The Forge",
  "description" : "After a bombing destroyed the Earth embassy on Vulcan, Syrrannites are suspected. T'Pol receives a map from her Syrrannite mother, leading into a dangerous desert, The Forge."
}, {
  "imdbId" : "0244365",
  "season" : "4",
  "episodeNumber" : "8",
  "title" : "Awakening",
  "description" : "After crossing the desert and surviving the sand storms, T'Pol and Archer confront the Syrranites in the Forge. The pair meet T'Pau, who denies any connection with the embassy bombing and Admiral Forrest's death. Archer, now possessing the mental essence of Surak known as the 'katra', agrees to let T'Pau extract it, even after T'Pol's mother T'Les warns the ritual may kill him. Meanwhile Vulcan administrator V'Las is willing to destroy Enterprise to make sure an attack on the Syrrannites isn't witnessed. Former Ambassador Soval allies with Commander Tucker to try to ..."
}, {
  "imdbId" : "0244365",
  "season" : "4",
  "episodeNumber" : "9",
  "title" : "Kir'Shara",
  "description" : "While Enterprise travels to Andoria to warn them of the attack, Archer tries to bring the Kir'Shara to the High Command."
}, {
  "imdbId" : "0244365",
  "season" : "4",
  "episodeNumber" : "10",
  "title" : "Daedalus",
  "description" : "Dr. Emory Erickson comes aboard to supposedly do tests for sub quantum teleportation. He seems to have a different agenda however."
}, {
  "imdbId" : "0244365",
  "season" : "4",
  "episodeNumber" : "11",
  "title" : "Observer Effect",
  "description" : "Noncorporeal aliens inhabit the bodies of Enterprise crew members to study how the crew reacts to a lethal virus infection that has afflicted Trip and Hoshi."
}, {
  "imdbId" : "0244365",
  "season" : "4",
  "episodeNumber" : "12",
  "title" : "Babel One",
  "description" : "Enterprise agrees to escort Tellarite delegates to peace talks with Andorians. En route they rescue several Andorians who abandoned the ship Kumarr, who insist it was Tellarites who attacked them. When Enterprise is soon attacked by the same ship which now appears to be a Andorian ship, Archer must prove to the warring races that a third party must be setting them up to fail at their attempt at peace."
}, {
  "imdbId" : "0244365",
  "season" : "4",
  "episodeNumber" : "13",
  "title" : "United",
  "description" : "Captain Archer must convince Vulcans, Tellarites and Andorians to unite to find the Romulan ship."
}, {
  "imdbId" : "0244365",
  "season" : "4",
  "episodeNumber" : "14",
  "title" : "The Aenar",
  "description" : "Enterprise finds out the marauder was piloted telepathically by an Aenar, a subspecies from Andoria."
}, {
  "imdbId" : "0244365",
  "season" : "4",
  "episodeNumber" : "15",
  "title" : "Affliction",
  "description" : "While Enterprise is at Earth, Phlox is abducted by the Klingons and forced to research a cure for a virus destined to wipe out the race. Reed is tapped by a secret agency and ordered to betray Archer. Trip transfers to the Columbia."
}, {
  "imdbId" : "0244365",
  "season" : "4",
  "episodeNumber" : "16",
  "title" : "Divergence",
  "description" : "While Enterprise tries to bring Trip on board to reverse the malicious Klingon modifications, Phlox and Antaak find a cure for the virus that will not please general K'Vagh."
}, {
  "imdbId" : "0244365",
  "season" : "4",
  "episodeNumber" : "17",
  "title" : "Bound",
  "description" : "The men on the Enterprise fall under the seduction of three Orion women. Trip is the only male member of the crew not to succumb to the women."
}, {
  "imdbId" : "0244365",
  "season" : "4",
  "episodeNumber" : "18",
  "title" : "In a Mirror, Darkly: Part 1",
  "description" : "The Mirror Universe crew is at war with rebels of the Empire when they discover the Tholians have captured a vessel from the future."
}, {
  "imdbId" : "0244365",
  "season" : "4",
  "episodeNumber" : "19",
  "title" : "In a Mirror, Darkly: Part 2",
  "description" : "After capturing a Constitution class starship from the future, the evil Mirror Universe Captain Archer attempts to become Emperor."
}, {
  "imdbId" : "0244365",
  "season" : "4",
  "episodeNumber" : "20",
  "title" : "Demons",
  "description" : "While attending conference on an alliance, Trip and T'Pol find out from a dying woman they have a baby. Investigation shows the woman was a member of the xenophobic organization Terra Prime."
}, {
  "imdbId" : "0244365",
  "season" : "4",
  "episodeNumber" : "21",
  "title" : "Terra Prime",
  "description" : "Paxton threatens to destroy Starfleet Headquarters if aliens won't leave Earth. Enterprise must shut down the array on Mars, but it is defended well."
}, {
  "imdbId" : "0244365",
  "season" : "4",
  "episodeNumber" : "22",
  "title" : "These Are the Voyages...",
  "description" : "Commander William Riker is trying to clear his mind and relives the last mission of the first Enterprise in the holodeck."
}]