[{
  "imdbId" : "5232792",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Impact",
  "description" : "On the way to a space colony, a crisis sends the Robinsons hurtling towards an unfamiliar planet, where they struggle to survive a harrowing night."
}, {
  "imdbId" : "5232792",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Diamonds in the Sky",
  "description" : "Another crash brings more travelers to the planet, as the Robinsons work to salvage their ship with help from their mysterious new companion."
}, {
  "imdbId" : "5232792",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Infestation",
  "description" : "Flashbacks reveal clues to Dr. Smith's past; The Robinsons contend with a new threat as the ship's fuel supply starts dropping - fast."
}, {
  "imdbId" : "5232792",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "The Robinsons Were Here",
  "description" : "The Robinsons make contact with another family of survivors; Will races to protect his friend after Judy learns what happened aboard the Resolute."
}, {
  "imdbId" : "5232792",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Transmission",
  "description" : "As the team builds a tower to signal the Resolute, Maureen investigates a planetary anomaly, and Will braces for a tough conversation with his dad."
}, {
  "imdbId" : "5232792",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Eulogy",
  "description" : "Maureen debates whether to share what she saw in the sky, Don leads a mission to find fuel, and the robot's presence stokes tensions within the group."
}, {
  "imdbId" : "5232792",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Pressurized",
  "description" : "Judy and Don race home across the desert with their precious cargo. John and Maureen are dealt a heavy blow. Penny does her best to comfort Will."
}, {
  "imdbId" : "5232792",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Trajectory",
  "description" : "Maureen finds a solution to the fuel issue, but putting her plan into action proves trickier than expected. Dr. Smith realizes her cover is blown."
}, {
  "imdbId" : "5232792",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "Resurrection",
  "description" : "Judy sets out to find Maureen, while Will and Penny lead an expedition to the caves. Dr. Smith pursues a new escape plan."
}, {
  "imdbId" : "5232792",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "Danger, Will Robinson",
  "description" : "The Robinson family scrambles to launch from the Lost Planet, stage an impossible rescue, and reach the Resolute before it leaves orbit for good. Unfortunately, some have other plans."
}]