[{
  "imdbId" : "0088571",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Moonlighting (Pilot)",
  "description" : "Maddie Hayes wakes up to find her staff have quit and all her money has been stolen. One of her few remaining assets is a loss-making investigation agency run by David Addison. She sacks the staff but David is determined to keep it going."
}, {
  "imdbId" : "0088571",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Gunfight at the So-So Corral",
  "description" : "It is Maddie's first day at the Blue Moon Detective Agency but there is nothing to do. In desperation, David 'steals' a client from a rival agency. The man wants them to find his estranged son, but all is not as it seems."
}, {
  "imdbId" : "0088571",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Read the Mind... See the Movie",
  "description" : "Blue Moon have been hired as security consultants for an aerospace firm from which a rival company has been stealing secrets. Maddie and David work through the rival company's owner and a psychic before they work out what is going on."
}, {
  "imdbId" : "0088571",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "The Next Murder You Hear",
  "description" : "A talk radio host is murdered on the air and David thinks it would be great for business if they solved the case. While investigating they find that him and the station manager's wife were having an affair, then they find that he faked his death and is still alive. The plot thicken's when the station manager is murdered."
}, {
  "imdbId" : "0088571",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Next Stop Murder",
  "description" : "When Ms. DiPesto has won a competition, she is allowed to join a"
}, {
  "imdbId" : "0088571",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "The Murder's in the Mail",
  "description" : "David gets the agency a job collecting money from debtors, which he believes that it will be easy but Maddie is not so sure. They find themselves involved in murder, a disappearing body and an international conspiracy."
}, {
  "imdbId" : "0088571",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "Brother, Can You Spare a Blonde?",
  "description" : "When David's brother Richard shows up, he does not only seem to be a rich man, but also makes an impression on Maddie. While David has got to handle his jealousy, Maddie has trouble to pay back her $37 000 debt to the bank. When David is attacked by a stranger, who wants back his money, David realizes that all the money that his brother spends does not belong to him."
}, {
  "imdbId" : "0088571",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "The Lady in the Iron Mask",
  "description" : "A mysterious woman appears in Maddie's and David's agency, who does not want to show her face. She wants Maddie and David to find her former lover, who is the reason why she can't show her face. The two detectives find this man, but find out on the next day that someone murdered him. Of course, the mysterious woman is their very first suspect."
}, {
  "imdbId" : "0088571",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "Money Talks... Maddie Walks",
  "description" : "Maddie learns where the accountant who took her money is and is determined to get it back, David tries to talk some sense into her, telling her he is in South America so her money is gone. She won't listen and hopes a plane, she imagines him feeling guilty and apologizing instead he maneuvers he out, and just when she thinks all hope is lost David shows up. With him they win, but if they won some other poor sucker lost, Maddie want's him to be the poor sucker. They get him in a little one on one, $100,000 to start Maddie puts up her house and car. When it comes to the..."
}, {
  "imdbId" : "0088571",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "The Dream Sequence Always Rings Twice",
  "description" : "When David and Maddie meet the owner of a club who tells them about an unresolved murder. Maddie and David argue about who they think the real murderer is and, in their dreams, set about solving the murder that occurred 40 years ago."
}, {
  "imdbId" : "0088571",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "My Fair David",
  "description" : "A wealthy woman comes to David and Maddie when her son is kidnapped. They are hired to negotiate the price of the ransom and to get her stepson back safely. Things are further complicated when the stepson is kidnapped a second time."
}, {
  "imdbId" : "0088571",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "Knowing Her",
  "description" : "Maddie is hired to find a silver locket by an old girlfriend of David's. He has strong feelings for her and thinks that her husband is trying to kill her. However, Maddie isn't so sure, especially when she kills her husband in self-defense."
}, {
  "imdbId" : "0088571",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "Somewhere Under the Rainbow",
  "description" : "An Irish girl who claims to be a leprechaun wants to hire the Blue moon detective agency to protect her. David is willing to take the case, but Maddie thinks that the girl is mentally ill and needs a psychiatrist, not a detective agency."
}, {
  "imdbId" : "0088571",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "Portrait of Maddie",
  "description" : "An artist, whom Maddie has never met, paints her portrait and then shoots himself. Maddie decides to purchase the portrait and gives it to the artist's brother, who is then killed. It turns out the brother was an international art thief."
}, {
  "imdbId" : "0088571",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "Atlas Belched",
  "description" : "A rival detective agency has made an offer for Blue Moon Detective Agency and Maddie accepts the offer. Addison is upset and sets up his own agency. Neither courses of action work out well."
}, {
  "imdbId" : "0088571",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "Twas the Episode Before Christmas",
  "description" : "A criminal in the witness protection scheme is killed but his wife and baby manage to escape. When fleeing, the baby is left in Agnes' apartment but without any explanation. Maddie and Addison decide to try to find the mother."
}, {
  "imdbId" : "0088571",
  "season" : "2",
  "episodeNumber" : "11",
  "title" : "The Bride of Tupperman",
  "description" : "A wealthy man comes into the agency wanting to get married. He has a description of his perfect wife but he just hasn't found her yet. Maddie and Addison then compete to find the woman who matches the description, but there's a twist."
}, {
  "imdbId" : "0088571",
  "season" : "2",
  "episodeNumber" : "12",
  "title" : "North by North DiPesto",
  "description" : "Agnes is feeling down and feels that her life is in a rut. To cheer her up, Maddie and Addison decide to send her to an investigator's ball where she meets a man. When he is stabbed the next day, her troubles have only just begun."
}, {
  "imdbId" : "0088571",
  "season" : "2",
  "episodeNumber" : "13",
  "title" : "In God We Strongly Suspect",
  "description" : "An escape artist is drowned when he fails to exit his trick water cabinet. His widow approaches the Blue Moon agency asking for protection. Her husband had threatened to come back and kill her after his death."
}, {
  "imdbId" : "0088571",
  "season" : "2",
  "episodeNumber" : "14",
  "title" : "Every Daughter's Father Is a Virgin",
  "description" : "Maddie's parents are in town but her mother is worried that her father is having an affair. Maddie wants to follow her father to prove that he is not having an affair. To spare her possible embarrassment, Addison does it for her."
}, {
  "imdbId" : "0088571",
  "season" : "2",
  "episodeNumber" : "15",
  "title" : "Witness for the Execution",
  "description" : "A man dying from an incurable disease comes into the agency. He says he is going to be murdered for the insurance and he wants Maddie and Addison to be a witnesses. Maddie doesn't want anything to do with it but Addison wants to do it."
}, {
  "imdbId" : "0088571",
  "season" : "2",
  "episodeNumber" : "16",
  "title" : "Sleep Talkin' Guy",
  "description" : "A prostitute speaks to Addison about a potential murder that she heard about from one of her clients who talks in his sleep. After he realises that the information is accurate, Addison decides to use her to solve more cases."
}, {
  "imdbId" : "0088571",
  "season" : "2",
  "episodeNumber" : "17",
  "title" : "Funeral for a Door Nail",
  "description" : "A man's wife is killed in a car accident, which leaves him so upset he wants to die. He arranges to have himself killed by a hit man. From the distance he sees his wife in the street and so he then hires Maddie and Addison to stop the hit."
}, {
  "imdbId" : "0088571",
  "season" : "2",
  "episodeNumber" : "18",
  "title" : "Camille",
  "description" : "When a con woman escapes from the custody of a crooked detective she accidentally stops an assassin killing an American senator. Addison has the bright idea of employing Camille to raise the profile of the company."
}, {
  "imdbId" : "0088571",
  "season" : "3",
  "episodeNumber" : "1",
  "title" : "The Son Also Rises",
  "description" : "David's father contacts David after a long time. The reason for the visit is that David Sr. is getting married and wants David Jr. to be the best man. When David Jr. sees the bride-to-be, he realises that he had a one night stand with her."
}, {
  "imdbId" : "0088571",
  "season" : "3",
  "episodeNumber" : "2",
  "title" : "The Man Who Cried Wife",
  "description" : "In an argument, a man kills his wife and buries her in a forest. However, when he starts getting phone calls from her the next day, he tries to dig up her body only to find that it is gone. He then decides to use Blue Moon to find her."
}, {
  "imdbId" : "0088571",
  "season" : "3",
  "episodeNumber" : "3",
  "title" : "Symphony in Knocked Flat",
  "description" : "Maddie and David have an argument about what a date should be all about. David decides to show her a good date by buying stolen tickets to a symphony concert from a scalper. They then find themselves involved in an assassination plot."
}, {
  "imdbId" : "0088571",
  "season" : "3",
  "episodeNumber" : "4",
  "title" : "Yours, Very Deadly",
  "description" : "A woman approaches Blue Moon for help. For over two years, she had been corresponding with an unknown admirer. The woman wants Maddie and David to find the admirer and ask him to stop. When they find him, they are in for a surprise."
}, {
  "imdbId" : "0088571",
  "season" : "3",
  "episodeNumber" : "5",
  "title" : "All Creatures Great... and Not So Great",
  "description" : "A Catholic priest is infatuated with a woman who comes to confession regularly. This week, the woman says she wants to commit suicide. She disappears before he can catch up with her so he asks Blue Moon Investigations to find her."
}, {
  "imdbId" : "0088571",
  "season" : "3",
  "episodeNumber" : "6",
  "title" : "Big Man on Mulberry Street",
  "description" : "David hears that his former brother-in-law has just died. Maddie is shocked that David was briefly married. She becomes very curious about his former wife and follows him to New York where she finds out some amazing information."
}, {
  "imdbId" : "0088571",
  "season" : "3",
  "episodeNumber" : "7",
  "title" : "Atomic Shakespeare",
  "description" : "A student starts to watch Moonlighting, then his mother appears and reminds he has to read Taming of the Shrew for school. As he starts to read, the characters from Moonlighting enact the play."
}, {
  "imdbId" : "0088571",
  "season" : "3",
  "episodeNumber" : "8",
  "title" : "It's a Wonderful Job",
  "description" : "It's Christmas and Blue Moon has to work. The staff are not happy. Maddie is also under pressure and says she regrets keeping the agency open. Her guardian angel approaches her and shows her how life would have been if she had done this."
}, {
  "imdbId" : "0088571",
  "season" : "3",
  "episodeNumber" : "9",
  "title" : "The Straight Poop",
  "description" : "Other shows have done it when you flash back and discuss the show. Now \"Moonlighting\" after too long with no new episode Rona Barrett, an 80's reporter goes in to get \"The Straight Poop\" apparently Maddie and David have been fighting and not speaking to one another. As she talks with Maddie, David, Miss Dipesto, and Mr. Viola they flash back to previous episodes to show examples of their statements and in the end they kiss and make up."
}, {
  "imdbId" : "0088571",
  "season" : "3",
  "episodeNumber" : "10",
  "title" : "Poltergeist III - Dipesto Nothing",
  "description" : "Agnes has been at Blue Moon for five years and is upset Herbert is already working on a case after only three months. To prove herself and without telling them, Agnes takes on a case that Maddie and David refuse to do."
}, {
  "imdbId" : "0088571",
  "season" : "3",
  "episodeNumber" : "11",
  "title" : "Blonde on Blonde",
  "description" : "When Maddie walks in on an office poker game run by David and does nothing about it, he realises that something is wrong. Maddie is feeling a bit low and wants to go out and pick up a man for a one night stand. David decides to follow her."
}, {
  "imdbId" : "0088571",
  "season" : "3",
  "episodeNumber" : "12",
  "title" : "Sam & Dave",
  "description" : "David attempts to be civil towards Maddie and Sam, but ends up becoming a drunken embarrassment."
}, {
  "imdbId" : "0088571",
  "season" : "3",
  "episodeNumber" : "13",
  "title" : "Maddie's Turn to Cry",
  "description" : "Maddie is still torn between Sam and David, and David is still jealous of the situation. They continue to investigate whether a woman's lover is betraying her by continuing to be with his wife, when his wife suddenly commits suicide."
}, {
  "imdbId" : "0088571",
  "season" : "3",
  "episodeNumber" : "14",
  "title" : "I Am Curious... Maddie",
  "description" : "The battle between Sam and David continues and became serious when Sam proposed to Maddie. She is non-committal with her answer but it forces David to think about how he feels about Maddie. Sam and David end up having a fight."
}, {
  "imdbId" : "0088571",
  "season" : "3",
  "episodeNumber" : "15",
  "title" : "To Heiress Human",
  "description" : "It's the morning after they slept together but Maddie and David are in different moods. She wants to forget that it ever happened. A wealthy heiress hires Blue Moon to prove that her boyfriend loves her and isn't after her money."
}]