[{
  "imdbId" : "3400010",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Get Action (1858-1901)",
  "description" : "The Roosevelt family originally migrated from Holland in the 17th century. They eventually became one of New York's most prominent families with a dedication to public service. Teddy Roosevelt was the second of four children and suffered from ill-health in his youth. Teddy's father was a philanthropist who dedicated half of his time to charitable organizations. The senior Roosevelt's wife, a Southerner, begged him not to enlist in the Union Army during the Civil War and he obliged, something Teddy never forgave him for and for which he tried to make amends in his own ..."
}, {
  "imdbId" : "3400010",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "In the Arena (1901-1910)",
  "description" : "Having boundless energy Teddy Roosevelt proved to be a president like no other. He set out to shift power from the Congress, which dominated at the time, to the executive branch of government. He went after combines and trusts and then focused on completing the Panama canal, purchasing shares owned by France. When the Columbian Senate refused to pass a deal he had negotiated with them, he threw his support behind Panamanian rebels. He faced re-election in 1904 and won easily but he also committed what is considered to be the gravest error of his political career: he ..."
}, {
  "imdbId" : "3400010",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "The Fire of Life (1910-1919)",
  "description" : "FDR, now 28 years old, first sought and won elected office in 1910 when he ran for a seat in the New York state senate. He ran and won as a Democrat and his party did well in these midterm elections. In Albany, he proved to be a force to be reckoned with and led a group of senators opposing the governor's nominee to the U,S. Senate. He was reelected in 1912 but accepted the post of Assistant Secretary of the Navy in the Wilson administration. Teddy Roosevelt decided as early as 1910 that he would again seek the Republican nomination for president. The party bosses ..."
}, {
  "imdbId" : "3400010",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "The Storm (1920-1933)",
  "description" : "Franklin Roosevelt was nominated as the vice presidential candidate for the 1920 election. He campaigned vigorously and was joined by Eleanor who, along with all other women, were going to vote for the first time. Although the Republican Warren G, Harding won the election, FDR was seen to have done well and was well placed to gain the presidential nomination in 1924. In August 1921 however, FDR fell ill while at his summer retreat on Campobello island in Canada. Doctors had great difficulty determining the exact nature of the disease - he suffered from high fevers and..."
}, {
  "imdbId" : "3400010",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "The Rising Road (1933-1939)",
  "description" : "By the time Franklin was inaugurated in March 1933, 5000 banks had failed and 9 million bank accounts were wiped out. He declared a 3 day bank holiday and went on the radio urging people to show faith in the system by depositing funds when they re-opened. It worked. His cabinet included the first woman, Frances Perkins as Secretary of Labor. The first 100 days saw 15 major bills passed including deposit insurance, home ownership loans and major public works projects. The National Recovery Administration was his most ambitious program, setting prices and wages in 541 ..."
}, {
  "imdbId" : "3400010",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "The Common Cause (1939-1944)",
  "description" : "After the German invasion of Poland in September 1939 Franklin Roosevelt assured the nation that the USA would remain neutral. The public generally agreed. He did ask Congress to authorize additional funding for the military, which was small and poorly armed, and for industry to build 50,000 airplanes which was 10 times their current annual capacity. The main political question remained whether FDR would run for a third term in office. He advised the Democratic convention that he would not run but they nominated him anyway and he agreed. He defeated Wendell Wilkie in ..."
}, {
  "imdbId" : "3400010",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "A Strong and Active Faith (1944-1962)",
  "description" : "The war - and the resulting levels of work and security - had kept Franklin Roosevelt out of public sight. By the spring of 1944 however, he was seriously ill with bronchitis. This information was kept from the public with his doctor issuing far more positive medical reports. The event most had been waiting for finally occurred on June 6, 1944 when Allied forces landed in France. Among those going ashore was FDR's cousin and longtime political foe Theodore Roosevelt Jr., a Brigadier General who led his men in the attack at Utah beach. Less than a month later however, ..."
}]