[{
  "imdbId" : "0374455",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Rising",
  "description" : "A team of scientists think they have found the location of the long lost city of Atlantis. It can be reached by a stargate that leads to another galaxy."
}, {
  "imdbId" : "0374455",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Hide and Seek",
  "description" : "Rodney can't get rid of a device that makes him invincible, disabling him to drink or eat. Meanwhile power malfunctions and one of the Athosians mentions seeing a shadow."
}, {
  "imdbId" : "0374455",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Thirty Eight Minutes",
  "description" : "Sheppard gets bitten by a wraith-like bug and is dying. While the puddle jumper returns it gets stuck in the Stargate. There's 38 minutes for a solution."
}, {
  "imdbId" : "0374455",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Suspicion",
  "description" : "There's suspicion of a Wraith collaborator and some of the team suspect the Athosians. Ford and Sheppard find land on Atlantis' planet."
}, {
  "imdbId" : "0374455",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Childhood's End",
  "description" : "Rodney investigates a ZPM from a planet whose inhabitants kill themselves when they turned 25 years old to prevent the Wraiths from finding them profitable."
}, {
  "imdbId" : "0374455",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Poisoning the Well",
  "description" : "Atlantis offers help to the Hoffans, who are working on a cure against the Wraith."
}, {
  "imdbId" : "0374455",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Underground",
  "description" : "Atlantis wants to trade food with the Genii, a simple civilization who turn out to be not so simple. They are planning a nuclear attack against the Wraith."
}, {
  "imdbId" : "0374455",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Home",
  "description" : "A strange energy generating fog allows travel back to Earth. But something's wrong."
}, {
  "imdbId" : "0374455",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "The Storm",
  "description" : "Two hurricanes are approaching Atlantis and an evacuation is necessary. The leader of the planet taking them in tells the Genii about the situation."
}, {
  "imdbId" : "0374455",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "The Eye",
  "description" : "McKay and Weir start repairing the grounding station, while Sheppard tries to fight Kolya. The puddle jumper on the mainland enters the eye of the storm."
}, {
  "imdbId" : "0374455",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "The Defiant One",
  "description" : "Major John Sheppard, Rodney McKay and two scientists explore a planet where a Wraith spaceship, which fell there 10,000 years ago, during the Atlantis-Wraith War, is still sending a SOS signal."
}, {
  "imdbId" : "0374455",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "Hot Zone",
  "description" : "A team of scientists, including McKay, Zelenka and Ford, are exposed to a deadly virus. Sheppard goes after one of the scientists trying to escape."
}, {
  "imdbId" : "0374455",
  "season" : "1",
  "episodeNumber" : "13",
  "title" : "Sanctuary",
  "description" : "Sheppard invites a priestess, who claims to not know about a weapon protecting her planet from the Wraith, to Atlantis to discuss asylum for refugees."
}, {
  "imdbId" : "0374455",
  "season" : "1",
  "episodeNumber" : "14",
  "title" : "Before I Sleep",
  "description" : "It's Elizabeth's birthday and she gets a very special gift: a woman who has been in stasis in an Atlantis' laboratory for 10,000 years and is actually herself."
}, {
  "imdbId" : "0374455",
  "season" : "1",
  "episodeNumber" : "15",
  "title" : "The Brotherhood",
  "description" : "The team is on Dagan, where they must find key stones to retrieve a ZPM. Zelenka finds out Atlantis has a deep space scanner."
}, {
  "imdbId" : "0374455",
  "season" : "1",
  "episodeNumber" : "16",
  "title" : "Letters from Pegasus",
  "description" : "McKay finds a way to send a message to Earth, leaving space for personal messages. Sheppard and Teyla are off to spy on the Wraith fleet approaching Atlantis."
}, {
  "imdbId" : "0374455",
  "season" : "1",
  "episodeNumber" : "17",
  "title" : "The Gift",
  "description" : "Teyla is haunted by nightmares, leaving her agitated. After seeing a psychologist, an old Athosian woman tells her a secret about her ability to sense the Wraith."
}, {
  "imdbId" : "0374455",
  "season" : "1",
  "episodeNumber" : "18",
  "title" : "The Siege: Part 1",
  "description" : "McKay and Zelenka come up with the idea to repair the Ancients' weapon satellite. Bates and Teyla get into a fight, he is found unconscious a while later."
}, {
  "imdbId" : "0374455",
  "season" : "1",
  "episodeNumber" : "19",
  "title" : "The Siege: Part 2",
  "description" : "All hope seems lost, until Colonel Everett arrives suddenly from Earth. He is determined to defend the city until the arrival of a ZPM, brought by a new ship."
}, {
  "imdbId" : "0374455",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "The Siege: Part 3",
  "description" : "The Daedalus arrives and the two hive ships are destroyed. Atlantis seems saved, then Zelenka detects 12 more ships. Ford seems changed after a fall in the water."
}, {
  "imdbId" : "0374455",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "The Intruder",
  "description" : "McKay, Sheppard, Beckett and Weir are on the Daedalus. McKay finds a Wraith virus that is infecting ship systems and sending a signal to the Wraith."
}, {
  "imdbId" : "0374455",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "Runner",
  "description" : "The team is searching for Ford on a planet. Teyla and Sheppard are taken hostage by a stranger, while Ford tries to convince McKay that he's normal."
}, {
  "imdbId" : "0374455",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "Duet",
  "description" : "After an attempt to retrieve McKay and soldier Laura Cadman from the memory banks of a Wraith dart, Cadman gets stuck in McKay's mind."
}, {
  "imdbId" : "0374455",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "Condemned",
  "description" : "The team discovers a planet where the stargate is kept on a prison island to keep the Wraith satisfied. Their magistrate is willing to trade a rare mineral."
}, {
  "imdbId" : "0374455",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "Trinity",
  "description" : "The team discover an Ancient project to create the ultimate power source. McKay thinks he can finish it. Ronon finds out he is not the only surviving Satedan."
}, {
  "imdbId" : "0374455",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "Instinct",
  "description" : "The team find a hidden Wraith girl, cared for by a man with a serum stilling her hunger. Beckett wants to perfect a retrovirus turning Wraith into Humans."
}, {
  "imdbId" : "0374455",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "Conversion",
  "description" : "Sheppard is infected with the Wraith retrovirus and slowly turns into an Iratus bug. To provide a treatment stem cells must be retrieved from one of their eggs."
}, {
  "imdbId" : "0374455",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "Aurora",
  "description" : "McKay finds an Ancient warship adrift in space. Sheppard finds out they are carrying a communique that mentions a weakness in Wraith technology."
}, {
  "imdbId" : "0374455",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "The Lost Boys",
  "description" : "The team is captured by Ford and are forced to take the Wraith enzyme. Ford has a plan."
}, {
  "imdbId" : "0374455",
  "season" : "2",
  "episodeNumber" : "11",
  "title" : "The Hive",
  "description" : "Sheppard's interrogation is suddenly aborted. Teyla senses another hive ship has arrived. Meanwhile McKay tries to convince his guard to call in help."
}, {
  "imdbId" : "0374455",
  "season" : "2",
  "episodeNumber" : "12",
  "title" : "Epiphany",
  "description" : "The teams discovers a ridge that can only be entered through a door. Sheppard gets pulled in by a field. McKay discovers time goes very fast behind it."
}, {
  "imdbId" : "0374455",
  "season" : "2",
  "episodeNumber" : "13",
  "title" : "Critical Mass",
  "description" : "The Trust, a Goa'uld terrorist organization, has planted a bomb in Atlantis."
}, {
  "imdbId" : "0374455",
  "season" : "2",
  "episodeNumber" : "14",
  "title" : "Grace Under Pressure",
  "description" : "McKay and a pilot crash with a puddle jumper into the ocean on Atlantis. They start to sink."
}, {
  "imdbId" : "0374455",
  "season" : "2",
  "episodeNumber" : "15",
  "title" : "The Tower",
  "description" : "The Stargate Atlantis team finds a world where the leader lives in a tower who possesses the power to stop the Wraith attacks."
}, {
  "imdbId" : "0374455",
  "season" : "2",
  "episodeNumber" : "16",
  "title" : "The Long Goodbye",
  "description" : "The team discovers two life pods with a dying woman and man in it. Upon opening Weir gets imprinted with the mind of the woman. She asks a special favor."
}, {
  "imdbId" : "0374455",
  "season" : "2",
  "episodeNumber" : "17",
  "title" : "Coup D'etat",
  "description" : "While Teyla and Ronon investigate the mysterious death of major Lorne, the Genii Ladon Radim contacts Atlantis. He wants to trade in a ZPM."
}, {
  "imdbId" : "0374455",
  "season" : "2",
  "episodeNumber" : "18",
  "title" : "Michael",
  "description" : "Michael Kenmore, a new lieutenant, awakes in the infirmary and doesn't remember a thing. The crew is very concerned about his well-being, he seems different."
}, {
  "imdbId" : "0374455",
  "season" : "2",
  "episodeNumber" : "19",
  "title" : "Inferno",
  "description" : "Atlantis helps with repairing an Ancient shield generator on Taranis. They discover the Taranians are in possession of an Ancient warship."
}, {
  "imdbId" : "0374455",
  "season" : "2",
  "episodeNumber" : "20",
  "title" : "Allies",
  "description" : "The hive ship approaching Atlantis is Michael's. He wants a trade: the retrovirus for not revealing the secret of Atlantis and insights on Wraith technology."
}, {
  "imdbId" : "0374455",
  "season" : "3",
  "episodeNumber" : "1",
  "title" : "No Man's Land",
  "description" : "Because McKay is helping the Wraith Hive with the implementation of the retrovirus, Ronan also stays on board. Appearing later on, the Hive betrays the Atlantis Team and the as they try to take out the Daedalus, they both deploy their fighters. Sheppard takes an X302 and hooks onto the hull of the Hive. Weir orders the Daedalus and the Orion to engage the Hive fleet and is being recalled to Cheyenne Mountain to brief the Internal Oversight Advisor's. Back in Pegasus, Sheppard tries to contact McKay and Ronan over the COM but Michael picks up and elaborates on his ..."
}, {
  "imdbId" : "0374455",
  "season" : "3",
  "episodeNumber" : "2",
  "title" : "Misbegotten",
  "description" : "Because of the earlier battle, Daedalus has been severely damaged and life-support is minimal at best, they decide to transport everyone onto the Wraith Hive after they've deployed the Retrovirus and all the Wraith has been converted into Humanoids again. Tayla contacts Cayenne through the gate and briefs Weir of their current status. It appears that a Hive is approaching, which later on appears that it's controlled by Sheppard and Michael. While Weir struggles with the IOA, Richard Woolsey, they've re-deployed the retrovirus on Michael and once again, put the earlier..."
}, {
  "imdbId" : "0374455",
  "season" : "3",
  "episodeNumber" : "3",
  "title" : "Irresistible",
  "description" : "The new plan of the McKay-Carter Subway Station is under way. The Atlantis Team needs to harvest space gates in order to form the Galactic Bridge. Sheppard disagrees with McKay's plan to steal the gates and they go in for first contact with the \"back water hamlets\" as McKay calls it. As they walk into the city, they are greeted by a man called Lucius, who has the locals eating out of his hand. Everyone is hanging on this man's every word and so is Carson. He's completely smitten with him and Lucius now knows the location and the thriving existence of Atlantis. It ..."
}, {
  "imdbId" : "0374455",
  "season" : "3",
  "episodeNumber" : "4",
  "title" : "Sateda",
  "description" : "After a group of people captures and gives Ronon to the Wraith, he becomes a runner again, but this time he's left in his home planet, Sateda, where the Stargate has been disabled."
}, {
  "imdbId" : "0374455",
  "season" : "3",
  "episodeNumber" : "5",
  "title" : "Progeny",
  "description" : "The Atlantis expedition encounters a highly advanced race, the Asurans. Who they at first believe to be the ancients. However, this new race is just a new face of an old nemesis."
}, {
  "imdbId" : "0374455",
  "season" : "3",
  "episodeNumber" : "6",
  "title" : "The Real World",
  "description" : "Dr Weir finds herself on Earth where, to everyone else, the Atlantis Expedition was just her delusion."
}, {
  "imdbId" : "0374455",
  "season" : "3",
  "episodeNumber" : "7",
  "title" : "Common Ground",
  "description" : "John Sheppard is kidnapped by the Genii and is in the company of a Wraith."
}, {
  "imdbId" : "0374455",
  "season" : "3",
  "episodeNumber" : "8",
  "title" : "McKay and Mrs. Miller",
  "description" : "Rodney's sister is brought to Atlantis to make use of one of her theories."
}, {
  "imdbId" : "0374455",
  "season" : "3",
  "episodeNumber" : "9",
  "title" : "Phantoms",
  "description" : "A device that creates hallucinations affects the team off-world."
}, {
  "imdbId" : "0374455",
  "season" : "3",
  "episodeNumber" : "10",
  "title" : "The Return: Part 1",
  "description" : "The Atlantis expedition must turn to an old friend for help as the Asurans prepare to invade the city."
}, {
  "imdbId" : "0374455",
  "season" : "3",
  "episodeNumber" : "11",
  "title" : "The Return: Part 2",
  "description" : "The team returns to Atlantis in an attempt to regain control of the city."
}, {
  "imdbId" : "0374455",
  "season" : "3",
  "episodeNumber" : "12",
  "title" : "Echoes",
  "description" : "Teyla witnesses what appear to be an Ancient apparitions, which soon other people start to see."
}, {
  "imdbId" : "0374455",
  "season" : "3",
  "episodeNumber" : "13",
  "title" : "Irresponsible",
  "description" : "The team investigate rumours of an invincible hero off-world, only to find Lucius Lavin again manipulating a hapless village."
}, {
  "imdbId" : "0374455",
  "season" : "3",
  "episodeNumber" : "14",
  "title" : "Tao of Rodney",
  "description" : "When Rodney uses an Ancient device, he gets special powers, but soon Dr Weir discovers it's a double-handled gift: if he doesn't ascend, he'll die."
}, {
  "imdbId" : "0374455",
  "season" : "3",
  "episodeNumber" : "15",
  "title" : "The Game",
  "description" : "The Atlantis team finds a program in the Atlantis database which throws Mckay and Sheppard into a Simsesque game that could destroy two civilizations in the Pegasus Galaxy."
}, {
  "imdbId" : "0374455",
  "season" : "3",
  "episodeNumber" : "16",
  "title" : "The Ark",
  "description" : "The team boards a crippled space station to discover people have been preserved there with the hope to outlive their enemy, the Wraith."
}, {
  "imdbId" : "0374455",
  "season" : "3",
  "episodeNumber" : "17",
  "title" : "Sunday",
  "description" : "Almost every member of the Atlantis expedition has a day off. Some of them are enjoying their free time or are catching up on some old work. The Sunday, a day like no other, suddenly turns bad and it appears that a lot of people are in danger."
}, {
  "imdbId" : "0374455",
  "season" : "3",
  "episodeNumber" : "18",
  "title" : "Submersion",
  "description" : "The Atlantis team finds an Ancient underwater research facility and puts a team together to check it out."
}, {
  "imdbId" : "0374455",
  "season" : "3",
  "episodeNumber" : "19",
  "title" : "Vengeance",
  "description" : "After losing contact with the new Taranin (the people rescued by the Atlantis team when a super volcano threatened to destroy their planet) settlement, Sheppard's team leaves to investigate. Finding the town deserted, they move to investigate an extensive subterranean tunnel system. What they find there holds dark tidings for the entire Pegasus Galaxy."
}, {
  "imdbId" : "0374455",
  "season" : "3",
  "episodeNumber" : "20",
  "title" : "First Strike",
  "description" : "After learning the Asurians are building a fleet of ships, Earth sends its newest ship, the Apollo, under the command of Colonel Abe Ellis to initiate a preemptive first strike to stop them from attacking Atlantis or worse, Earth itself."
}, {
  "imdbId" : "0374455",
  "season" : "4",
  "episodeNumber" : "1",
  "title" : "Adrift",
  "description" : "With a damaged ZPM, and diminished hopes of survival, the Atlantis team finds themselves stranded in the middle of empty space with hardly any time before they run out of power completely. Dr. McKay is challenged to the max as he tries to find a way to save Atlantis from its doom. Meanwhile, Dr. Keller races to treat Weir's increasing head injuries, but the only answer she can come up with could have grave results for everyone on board."
}, {
  "imdbId" : "0374455",
  "season" : "4",
  "episodeNumber" : "2",
  "title" : "Lifeline",
  "description" : "The Atlantis team, along with Weir and now with the ability to make large hyperspace jumps in only a puddle jumper, must now journey to the replicator home planet to steal one of their many ZPMs to bring the city back to life, and finish the journey to their new planet"
}, {
  "imdbId" : "0374455",
  "season" : "4",
  "episodeNumber" : "3",
  "title" : "Reunion",
  "description" : "While on a regular mission, Ronan runs into some Satedan friends from his past. As old emotions start to return, new thoughts come with them, one of which involves leaving Atlantis. But could danger be lurking just around the corner?"
}, {
  "imdbId" : "0374455",
  "season" : "4",
  "episodeNumber" : "4",
  "title" : "Doppelganger",
  "description" : "While exploring a new planet, Sheppard started to watch a strange crystal. He doesn't know why, but he had to touch it. Back on Atlantis, everybody but him started to have some bad nightmares."
}, {
  "imdbId" : "0374455",
  "season" : "4",
  "episodeNumber" : "5",
  "title" : "Travelers",
  "description" : "Sheppard is kidnapped by a group of people living in a starship fleet. They were telling him that they were living on these ships for a long time, due to the war with the Wraith. He was forced to help them make an ancient's ship fly. Sheppard tricked them and flew with the ship, and 3 of the kidnappers."
}, {
  "imdbId" : "0374455",
  "season" : "4",
  "episodeNumber" : "6",
  "title" : "Tabula Rasa",
  "description" : "Rodney McKay awakens in his lab, tied to a chair and with no memory of who or where he is. He did seemingly leave himself a video message telling him to look for Teyla. The problem began some 14 hours before when Dr. Katie Brown returned to Atlantis with plants from a planet she had visited. The plants had been cleared through the normal quarantine procedure but she is soon afflicted with severe headaches and loss of memory, eventually falling into a coma. Memory loss begins to afflict other members of the crew but they soon become distrustful of one another, making ..."
}, {
  "imdbId" : "0374455",
  "season" : "4",
  "episodeNumber" : "7",
  "title" : "Missing",
  "description" : "Teyla and Dr. Keller go to the Athosian's new planet, and what they see is that the Athosian are not there anymore. They've gone missing. It seems to be the work of a warrior tribe, the Bola Kai."
}, {
  "imdbId" : "0374455",
  "season" : "4",
  "episodeNumber" : "8",
  "title" : "The Seer",
  "description" : "Having been told by the Genii spy on New Athos that her people were still alive, Teyla asks permission to visit a man named Davos who is a legendary seer and may be able to help her. When they arrive, Dr. Keller realizes that the man is dying. His ability to see the future is real, but the snippets of the future he is able to show them are open to interpretation. John is called back to Atlantis when they receive a message from the Wraith whose life he had previously saved. He offers to work with McKay to fix the nano virus that is now malfunctioning. As if this ..."
}, {
  "imdbId" : "0374455",
  "season" : "4",
  "episodeNumber" : "9",
  "title" : "Miller's Crossing",
  "description" : "Rodney McKay is continuing to work on solving the problems with the replicator nano code and finally gives in to Zalenka's request that he contact his sister Jeannie for help. He sends her an e-mail but that same night, she is kidnapped and taken to a private medical facility where she is expected to use nano technology to save the life of a wealthy industrialist's daughter. Rodney and others travel to Earth to look into Jeannie's disappearance but Rodney is soon kidnapped and put to work as well. Rodney and Jeannie think they have found a working solution but when it..."
}, {
  "imdbId" : "0374455",
  "season" : "4",
  "episodeNumber" : "10",
  "title" : "This Mortal Coil",
  "description" : "When what appears to be a satellite crashes into Atlantis, the team becomes aware of strange behaviour on the base."
}, {
  "imdbId" : "0374455",
  "season" : "4",
  "episodeNumber" : "11",
  "title" : "Be All My Sins Remember'd",
  "description" : "The Atlantis team decides to attack the numerous ships of the Replicators, with the help of uneasy alliances."
}, {
  "imdbId" : "0374455",
  "season" : "4",
  "episodeNumber" : "12",
  "title" : "Spoils of War",
  "description" : "A transmission from space leads the team to the discovery of a breeding ground for Wraith soldiers."
}, {
  "imdbId" : "0374455",
  "season" : "4",
  "episodeNumber" : "13",
  "title" : "Quarantine",
  "description" : "The entire city locks down for a false quarantine, leaving people stranded with a decreasing amount of oxygen, while Rodney is unable to reach a computer."
}, {
  "imdbId" : "0374455",
  "season" : "4",
  "episodeNumber" : "14",
  "title" : "Harmony",
  "description" : "Sheppard and McKay must escort a prospective queen as part of their diplomatic duties, unaware that an ambush has been set by some familiar enemies."
}, {
  "imdbId" : "0374455",
  "season" : "4",
  "episodeNumber" : "15",
  "title" : "Outcast",
  "description" : "After returning to Earth for his father's funeral, John Sheppad discovers the existence of a human form replicator loose in the population."
}, {
  "imdbId" : "0374455",
  "season" : "4",
  "episodeNumber" : "16",
  "title" : "Trio",
  "description" : "Keller, Carter and McKay are stranded in an abandoned Genii mine while off-world."
}, {
  "imdbId" : "0374455",
  "season" : "4",
  "episodeNumber" : "17",
  "title" : "Midway",
  "description" : "The IOA is conducting interviews back on Earth to ensure that any personnel serving on Atlantis (in particular, aliens) are suitable for their roles. The episode opens up with a pregnant Teyla having been interviewed and reporting back to Atlantis. Ronon is next. Col. Carter is unsure about Ronon's ability to handle the IOA's interview and therefore asks Teal'c to come to Atlantis in a coaching capacity for Ronon. After a rocky start to their relationship, Ronon and Teal'c return to Earth, via the series of Stargates and a Midway Station, that McKay had previously ..."
}, {
  "imdbId" : "0374455",
  "season" : "4",
  "episodeNumber" : "18",
  "title" : "The Kindred: Part 1",
  "description" : "A plague of sorts is spreading across the Pegasus galaxy and Dr. Keller estimates that hundreds of thousands will die if they don't don't find a way to stop it. Her research shows however that the disease's origin is with the Hoff, who had been working on a way to kill the Wraith. Sheppard and the others think they know who might be spreading the virus and why. Teyla meanwhile believes she is receiving messages from Kanaan, the father of her child. She's getting his messages while sleeping and most think she's just dreaming. She follows the clues he gives her but she ..."
}, {
  "imdbId" : "0374455",
  "season" : "4",
  "episodeNumber" : "19",
  "title" : "The Kindred: Part 2",
  "description" : "Slowly, everyone on Atlantis comes to terms with the sudden re-appearance of Dr. Carson Beckett who, he claims, has been Michael's prisoner for some two years. He tells them what he was doing in Michael's laboratory and they set off to find the kidnapped Teyla. Dr. Keller figures out just how he's come to there at all. Sheppard meanwhile has been using all of his contacts to try and locate Teyla but they come across someone from the past. Teyla in turn has found some of the Athosians alive but they are few in number as a result of Michael's experiments. Michael ..."
}, {
  "imdbId" : "0374455",
  "season" : "4",
  "episodeNumber" : "20",
  "title" : "The Last Man",
  "description" : "After yet another fruitless search for the missing Teyla, Sheppard returns to Atlantis, only to find it deserted. Worse yet, the city isn't just abnormally hot, but the entire ocean has completely dried up, leaving a sandy desert! Sheppard then finds a hologram of an aged Dr. McKay, telling him that a solar flare had sent him 48,000 years into the future. Once he learns the demise of Atlantis and everyone on it, and worse yet that the sun in the solar system is dying and he won't survive there much longer, he and the holographic McKay must find a way to send Sheppard ..."
}, {
  "imdbId" : "0374455",
  "season" : "5",
  "episodeNumber" : "1",
  "title" : "Search and Rescue",
  "description" : "After the explosion of Michael's medical compound, which caved in, trapping the Atlantis team and the marines, Colonel Samantha Carter sends a rescue party along with a medical team and the combat engineers, as well as a new addition to the Atlantis team, Captain Alicia Vega. As the rescue starts, it appears that the team has been split into the two surviving groups of Ronan and Lt. Colonel Sheppard, and McKay and Major Lorne. When McKay finds Michael's hard drive, it contains a lot of data about his operations. Suddenly, McKay realizes that, when the compound self ..."
}, {
  "imdbId" : "0374455",
  "season" : "5",
  "episodeNumber" : "2",
  "title" : "The Seed",
  "description" : "Dr. Carson Beckett is removed from stasis because he's the only one who can find the antidote to a mysterious virus that has incapacitated base personnel, beginning with Dr. Jennifer Keller."
}, {
  "imdbId" : "0374455",
  "season" : "5",
  "episodeNumber" : "3",
  "title" : "Broken Ties",
  "description" : "Ronon is abducted by a Wraith who tries to brainwash him."
}, {
  "imdbId" : "0374455",
  "season" : "5",
  "episodeNumber" : "4",
  "title" : "The Daedalus Variations",
  "description" : "An empty Daedalus is found orbiting the planet. The team goes to check it out and they are transported to an alternate universe."
}, {
  "imdbId" : "0374455",
  "season" : "5",
  "episodeNumber" : "5",
  "title" : "Ghost in the Machine",
  "description" : "A group of beings stranded in sub-space seek help from Atlantis to return to normal space. But their outrageous claims and erratic behavior strains the trust of their benefactors and forces a painful solution."
}, {
  "imdbId" : "0374455",
  "season" : "5",
  "episodeNumber" : "6",
  "title" : "The Shrine",
  "description" : "Rodney is infected with a deadly illness known as \"second childhood\" which diminishes his mind capabilities and makes him lose his memory gradually."
}, {
  "imdbId" : "0374455",
  "season" : "5",
  "episodeNumber" : "7",
  "title" : "Whispers",
  "description" : "Sheppard and Beckett battle zombie-like, wraith-engineered mutants with a team of the best and brightest female SG members. They also happen to be gorgeous - the SG team, not the mutants."
}, {
  "imdbId" : "0374455",
  "season" : "5",
  "episodeNumber" : "8",
  "title" : "The Queen",
  "description" : "Sheppard, McKay, Teyla, Ronan and Jennifer Keller travel to a rendezvous with Todd the Wraith. Keller believes she has found a vaccine of sorts to modify the Wraith at a genetic level that will render it unnecessary for them to feed on humans. She needs test subjects however and Todd agrees but indicates that they will have to seek the support of the Queen of an allied Wraith hive. Since his own Queen has been killed, it will be necessary for someone to impersonate her - and the only person able to get away with that would be Teyla. She agrees but once on board the ..."
}, {
  "imdbId" : "0374455",
  "season" : "5",
  "episodeNumber" : "9",
  "title" : "Tracker",
  "description" : "Jennifer, Ronon & Rodney find themselves in the middle of a Wraith fox hunt when Jennifer is kidnapped by a runner (the fox) to help him with an humanitarian mission."
}, {
  "imdbId" : "0374455",
  "season" : "5",
  "episodeNumber" : "10",
  "title" : "First Contact",
  "description" : "Dr. Daniel Jackson comes to Atlantis in search of a lost Atlantian room. The discovery reveals a new race. Daniel and McKay are kidnapped by the new race and are forced to finish a device which may kill the Wraith. Todd feels betrayed and takes the Daedalus."
}, {
  "imdbId" : "0374455",
  "season" : "5",
  "episodeNumber" : "11",
  "title" : "The Lost Tribe",
  "description" : "The new race that stole the device, not to mention Rodney and Daniel, turns out to be an old one meaning very old and well known to the human race. With an ancient grudge to settle they force Rodney to activate the device against the Wraith with a side effect that could kill millions through out the galaxy. That make the Wraith mad so they abscond with the Daedalus to retaliate. Once again we lowly humans have to take control of a messy situation to keep the master races from wreaking havoc in the galaxy."
}, {
  "imdbId" : "0374455",
  "season" : "5",
  "episodeNumber" : "12",
  "title" : "Outsiders",
  "description" : "The Atlantis team endeavors to thwart Wraith plans to either find a cure for the retrovirus or exterminate all those infected."
}, {
  "imdbId" : "0374455",
  "season" : "5",
  "episodeNumber" : "13",
  "title" : "Inquisition",
  "description" : "Sheppard and his team are lured to a planet and are soon put on trial for crimes against the people of the Pegasus galaxy. In flashbacks, the three judge tribunal recounts the indictment against them including the re-awakening of the Wraith and the various missions where at least a few, if not more, innocent bystanders were killed. Sheppard does his best to argue that on balance, fewer were killed by their presence than would have been the case if they had never been there. A least one of the judges is clearly determined to find them guilty while a second seems far ..."
}, {
  "imdbId" : "0374455",
  "season" : "5",
  "episodeNumber" : "14",
  "title" : "The Prodigal",
  "description" : "When the power is shut down and most of the inhabitants are locked out of key controls, it is apparent that Atlantis has been taken over by an off-world group, soon identified as Michael and his hybrids. He is after Teyla's newborn child who is key in his quest to gain control of the Pegasus galaxy. While Sheppard and McKay try to get their hands on a jumper to launch an attack, Ronan and others who were taken prisoner by Michael during his initial invasion launch reprisals of their own. When Teyla manages to get away and hide, Michael gives her a simple choice: ..."
}, {
  "imdbId" : "0374455",
  "season" : "5",
  "episodeNumber" : "15",
  "title" : "Remnants",
  "description" : "Radek discovers an alien device that Rodney finds holds serious surprises. Sheppard runs into a reincarnated Acastus Kolya who plans to attack Atlantis. An IOC representative arrives to replace Woosley who receives advice from a mysterious woman."
}, {
  "imdbId" : "0374455",
  "season" : "5",
  "episodeNumber" : "16",
  "title" : "Brain Storm",
  "description" : "Rodney finally invites Jennifer on a date; to attend a science conference with him. But petty jealousies arise at the conference that have to be suppressed when a proposed solution for global warming has potentially lethal side effects."
}, {
  "imdbId" : "0374455",
  "season" : "5",
  "episodeNumber" : "17",
  "title" : "Infection",
  "description" : "A Wraith cruiser arrives at Atlantis and is strangely uncommunicative. The anti-wraith drug story arc is concluded and we see a relationship blossom."
}, {
  "imdbId" : "0374455",
  "season" : "5",
  "episodeNumber" : "18",
  "title" : "Identity",
  "description" : "An alien mind takes up residence in Jennifer's body and seems as confused as her colleagues are by her erratic behavior. Which begs the question; where is Jennifer?"
}, {
  "imdbId" : "0374455",
  "season" : "5",
  "episodeNumber" : "19",
  "title" : "Vegas",
  "description" : "The killings a Wraith is making in Las Vegas are investigated by Detective John Sheppard... who knows nothing about life-sucking aliens from another galaxy."
}, {
  "imdbId" : "0374455",
  "season" : "5",
  "episodeNumber" : "20",
  "title" : "Enemy at the Gate",
  "description" : "A hive ship turbo-charged with a ZPM has received the Wraith's message from a alternate universe containing the location of Earth. The ship is now heading for Earth."
}]