[{
  "imdbId" : "0286486",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Pilot",
  "description" : "While Dutch and Claudette investigate the murder of Nancy Reborg, they discover that her daughter is missing and has been sold by her addict father to a child molester. David tries to crack corruption in the Barn by recruiting Terry to help him take down Vic."
}, {
  "imdbId" : "0286486",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Our Gang",
  "description" : "Following the shooting death of a police department informant, Aceveda turns up the heat in the investigation of Mackey and his Strike Team."
}, {
  "imdbId" : "0286486",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "The Spread",
  "description" : "It's warrant sweep day at the Barn. Vic and the Strike Team discover visiting NBA superstar Derrick Tripp hanging out with his 'homies' before the evening game with the Lakers. Vic decides to do his part for the home team by keeping Tripp as a 'friendly hostage'. One of Vic's street informants, Connie, approaches him after having been roughed up by a new john. Vic hands off the case to Claudette and Dutch, who is convinced they're on the trail of a serial killer. Dutch's theories are proved wrong when he and Claudette ultimately discover that their perp is not a serial killer but rather a disturbed man who is raping women in a desperate attempt to procreate. Danny and Julien stumble upon a gun smuggling ring while delivering one of their warrants and disaster is averted only by Danny's sharp instincts. David has his hands full overseeing the sweep, managing an increasingly packed cage, soothing the frazzled nerves of the attending desk sergeant, and avoiding a potential lawsuit from Derrick Tripp's lawyer over the disappearance of his star client."
}, {
  "imdbId" : "0286486",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Dawg Days",
  "description" : "A dispute over an up-and-coming singer's success erupts in a gang war that threatens to bring Vic down, too; a case that could help Aceveda's political future sends Dutch and Claudette searching for a missing day laborer."
}, {
  "imdbId" : "0286486",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Blowback",
  "description" : "Mackey must recover the stolen evidence from a drug bust before Aceveda is able to pin the theft on him."
}, {
  "imdbId" : "0286486",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Cherrypoppers",
  "description" : "As Dutch's theory about a serial killer preying on prostitutes proves true, he convinces Aceveda to launch an all out effort to find him before he strikes again; Julien decides to bring down Vic for stealing drugs."
}, {
  "imdbId" : "0286486",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Pay in Pain",
  "description" : "The murder of seven gang members has Vic be teamed with a Latino detective assigned to crack the case."
}, {
  "imdbId" : "0286486",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Cupid & Psycho",
  "description" : "As the Strike Team is reassigned pending the investigation in the theft of evidence, Vic teams with Claudette in order to keep some deadly drugs off the street."
}, {
  "imdbId" : "0286486",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "Throwaway",
  "description" : "Lemonhead sets out to make things right following his shooting of an unarmed man."
}, {
  "imdbId" : "0286486",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "Dragonchasers",
  "description" : "As Dutch uncovers a lead to the serial killer, a reporter questions force Aceveda to explain problems he thought were buried far in the past."
}, {
  "imdbId" : "0286486",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "Carnivores",
  "description" : "A confrontation between a local drug dealer and Black Muslims places Vic in danger of being exposed."
}, {
  "imdbId" : "0286486",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "Two Days of Blood",
  "description" : "As a deployment policy leads to a double homicide that places Aceveda in the hot seat with potential voters, Vic is forced to help Gilroy avoid being implicated in a hit and run."
}, {
  "imdbId" : "0286486",
  "season" : "1",
  "episodeNumber" : "13",
  "title" : "Circles",
  "description" : "As cop killings strike Farmington, Aceveda is caught between two corrupt cops looking to save their own skins."
}, {
  "imdbId" : "0286486",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "The Quick Fix",
  "description" : "As Captain Aceveda tries to fend off a city council investigation, Vic looks to stop a pair of brutal drug lords from moving into Farmington."
}, {
  "imdbId" : "0286486",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "Dead Soldiers",
  "description" : "An arson attack on a local drug dealer threatens to expose Vic's protection racket."
}, {
  "imdbId" : "0286486",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "Partners",
  "description" : "An amputated arm sends Dutch in search of a sadomasochistic killer; Vic sets out to help his old mentor on the force get revenge against the thug whose complaint forced him into retirement."
}, {
  "imdbId" : "0286486",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "Carte Blanche",
  "description" : "A murder investigation leads Vic to a massive money-laundering scheme."
}, {
  "imdbId" : "0286486",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "Greenlit",
  "description" : "Elementary school drug dealing prompts Vic to redouble his efforts to bring down a ruthless new supplier."
}, {
  "imdbId" : "0286486",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "Homewrecker",
  "description" : "The Barn mobilizes to investigate a murderous rampage at a battered women's shelter."
}, {
  "imdbId" : "0286486",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "Barnstormers",
  "description" : "As a new murder investigation exposes Dutch's crisis of confidence, Vic sets out to stop the abuse of a neighbor by her violent boyfriend."
}, {
  "imdbId" : "0286486",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "Scar Tissue",
  "description" : "Vic and the Strike team set their sights on taking Armadillo off the streets for good."
}, {
  "imdbId" : "0286486",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "Co-Pilot",
  "description" : "In a look back at the Barn's early days, Vic struggles to secure his hold on the Strike Team command, while Dutch is faced with choosing between a veteran detective and Claudette."
}, {
  "imdbId" : "0286486",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "Coyotes",
  "description" : "The leak of the auditor's report jeopardizes the futures of everyone at the Farm."
}, {
  "imdbId" : "0286486",
  "season" : "2",
  "episodeNumber" : "11",
  "title" : "Inferno",
  "description" : "Vic mobilizes the Strike Team to help Aceveda's election campaign; Dutch and Claudette suspect a teenaged girl is lying about the rape accusation she's made against her employer."
}, {
  "imdbId" : "0286486",
  "season" : "2",
  "episodeNumber" : "12",
  "title" : "Breakpoint",
  "description" : "As his own life starts crumbling around him, Vic pitches in to help Dutch in the search for a deadly pedophile."
}, {
  "imdbId" : "0286486",
  "season" : "2",
  "episodeNumber" : "13",
  "title" : "Dominoes Falling",
  "description" : "As he struggles to keep his job, Vic pushes ahead with a new plan to hijack a mob money shipment."
}, {
  "imdbId" : "0286486",
  "season" : "3",
  "episodeNumber" : "1",
  "title" : "Playing Tight",
  "description" : "Vic sets out to stop stolen military weapons from fueling a gang war, unaware that it threatens to expose him as the mastermind behind the theft of the Armenian mob's laundered money."
}, {
  "imdbId" : "0286486",
  "season" : "3",
  "episodeNumber" : "2",
  "title" : "Blood and Water",
  "description" : "Vic promises a gang lieutenant the top job if he agrees to set up his boss; Dutch and Claudette's investigation into a gang shooting points to an unexpected triggerman."
}, {
  "imdbId" : "0286486",
  "season" : "3",
  "episodeNumber" : "3",
  "title" : "Bottom Bitch",
  "description" : "A hooker wants to Vic to punish her former pimp, Dutch arrests a sex offender in an elderly woman's rape."
}, {
  "imdbId" : "0286486",
  "season" : "3",
  "episodeNumber" : "4",
  "title" : "Streaks and Tips",
  "description" : "The rivalry between the Strike Team and the Decoy Squad heats up as they compete to find a murder suspect."
}, {
  "imdbId" : "0286486",
  "season" : "3",
  "episodeNumber" : "5",
  "title" : "Mum",
  "description" : "As Dutch and Claudette continue to pursue a rapist who is targeting elderly women, the arrest of a local gang member threatens to expose the Strike Team's involvement in the money train heist."
}, {
  "imdbId" : "0286486",
  "season" : "3",
  "episodeNumber" : "6",
  "title" : "Posse Up",
  "description" : "Officer Tommy Hisk becomes a prime suspect in the murder of his ex-wife and son."
}, {
  "imdbId" : "0286486",
  "season" : "3",
  "episodeNumber" : "7",
  "title" : "Safe",
  "description" : "As missing persons investigation uncovers a graveyard for illegal immigrants working in an illicit drug lab."
}, {
  "imdbId" : "0286486",
  "season" : "3",
  "episodeNumber" : "8",
  "title" : "Cracking Ice",
  "description" : "Vic is enlisted to help save his rivals on the Decoy team from having their undercover operation exposed."
}, {
  "imdbId" : "0286486",
  "season" : "3",
  "episodeNumber" : "9",
  "title" : "Slipknot",
  "description" : "A lynching threatens to ignite a race war between Farmington's black and Latino gangs."
}, {
  "imdbId" : "0286486",
  "season" : "3",
  "episodeNumber" : "10",
  "title" : "What Power Is...",
  "description" : "Captain Aceveda turns up the heat in his search for the gangster who sexually assaulted him."
}, {
  "imdbId" : "0286486",
  "season" : "3",
  "episodeNumber" : "11",
  "title" : "Strays",
  "description" : "As Dutch tries to understand 'The Cuddler' rapist, Vic enlists Danny for an important undercover assignment."
}, {
  "imdbId" : "0286486",
  "season" : "3",
  "episodeNumber" : "12",
  "title" : "Riceburner",
  "description" : "The pursuit of a gang hitman pits the tight-lipped Korean community against the police."
}, {
  "imdbId" : "0286486",
  "season" : "3",
  "episodeNumber" : "13",
  "title" : "Fire in the Hole",
  "description" : "As Vic tries to sidetrack the money train investigation, Claudette goes undercover to crack a child porn ring."
}, {
  "imdbId" : "0286486",
  "season" : "3",
  "episodeNumber" : "14",
  "title" : "All In",
  "description" : "As the Strike Team is threatened with exposure in the money train heist, Claudette goes it alone in order to find evidence of a public defender's drug addiction."
}, {
  "imdbId" : "0286486",
  "season" : "3",
  "episodeNumber" : "15",
  "title" : "On Tilt",
  "description" : "As Vic goes after Margos, Claudette risks her career to see that an innocent man is freed from prison."
}, {
  "imdbId" : "0286486",
  "season" : "4",
  "episodeNumber" : "1",
  "title" : "The Cure",
  "description" : "Vic Mackey is adrift after his past actions have caught up with him. He's no longer the cop he used to be - the Strike Team has dissolved and he's stuck babysitting a menial surveillance sting that keeps him off the street. With Captain Aceveda moving on to his new City Council position, Captain Monica Rawling prepares to take over the Barn and implement her controversial anti-gang policies."
}, {
  "imdbId" : "0286486",
  "season" : "4",
  "episodeNumber" : "2",
  "title" : "Grave",
  "description" : "Vic agrees to quietly bring in a teenaged drug user before learning of his role in a deadly armed robbery."
}, {
  "imdbId" : "0286486",
  "season" : "4",
  "episodeNumber" : "3",
  "title" : "Bang",
  "description" : "When her official arrival at the Barn is greeted by the outbreak of a deadly gang war, Monica assigns Vic the task of ending it."
}, {
  "imdbId" : "0286486",
  "season" : "4",
  "episodeNumber" : "4",
  "title" : "Doghouse",
  "description" : "As Vic pursues an escaped rapist, A.D.A Insardi sends Dutch and Claudette after a low level drug dealer."
}, {
  "imdbId" : "0286486",
  "season" : "4",
  "episodeNumber" : "5",
  "title" : "Tar Baby",
  "description" : "As Monica is forced to defend her crime-fighting tactics, Vic's pursuit of a killer creates problems for Antwon, while Dutch's secret deal with the D.A.'s office gets him and Claudette assigned to a murder investigation."
}, {
  "imdbId" : "0286486",
  "season" : "4",
  "episodeNumber" : "6",
  "title" : "Insurgents",
  "description" : "A raid on a church being used as a drug drop places Monica in hot water with the community and her own cops."
}, {
  "imdbId" : "0286486",
  "season" : "4",
  "episodeNumber" : "7",
  "title" : "Hurt",
  "description" : "As Aceveda uses a cleverly-edited videotape to force her to sideline Vic, Monica goes toe-to-toe with a social worker whose negligence led to the hospitalization of a seven-year-old foster child."
}, {
  "imdbId" : "0286486",
  "season" : "4",
  "episodeNumber" : "8",
  "title" : "Cut Throat",
  "description" : "With Shane under orders to deliver Vic's body to Antwon, Monica looks for the leak that has led to the murder of some neighborhood informants."
}, {
  "imdbId" : "0286486",
  "season" : "4",
  "episodeNumber" : "9",
  "title" : "String Theory",
  "description" : "As Shane enlists Vic and his men in the search for the body of a teenaged informant, the disappearance of two cops on patrol begins to look like payback for Monica's tough new policies."
}, {
  "imdbId" : "0286486",
  "season" : "4",
  "episodeNumber" : "10",
  "title" : "Back in the Hole",
  "description" : "As Vic decides to tell Monica the truth about Shane, Dutch and Claudette suspect an alleged serial killer of murder."
}, {
  "imdbId" : "0286486",
  "season" : "4",
  "episodeNumber" : "11",
  "title" : "A Thousand Deaths",
  "description" : "Vic pits Antwon's henchmen against each other in an effort to find the cop killers; Dutch and Claudette suspect Detective Billings of failing to stop a deadly carjacking."
}, {
  "imdbId" : "0286486",
  "season" : "4",
  "episodeNumber" : "12",
  "title" : "Judas Priest",
  "description" : "Vic and Monica work to link Antwon to the cop killings, only to have Aceveda sell them out in an effort to keep the truth about his sexual assault from being made public."
}, {
  "imdbId" : "0286486",
  "season" : "4",
  "episodeNumber" : "13",
  "title" : "Ain't That a Shame",
  "description" : "Monica asks Vic to find a way to hold Antwon Mitchell responsible for the murder of two Farmington cops."
}, {
  "imdbId" : "0286486",
  "season" : "5",
  "episodeNumber" : "1",
  "title" : "Extraction",
  "description" : "As the Strike Team tries to end a race war between Blacks and Mexicans, Dutch and Claudette investigate a riot at a high school that also stem from racial tensions."
}, {
  "imdbId" : "0286486",
  "season" : "5",
  "episodeNumber" : "2",
  "title" : "Enemy of Good",
  "description" : "Lem's loyalty to Vic is tested when he's interrogated by Lt. Kavanaugh and Aceveda about the Strike Team's corrupt past."
}, {
  "imdbId" : "0286486",
  "season" : "5",
  "episodeNumber" : "3",
  "title" : "Jailbait",
  "description" : "While the Strike Team figures out their next step concerning IAD's investigation into Lem, they put Tina undercover to help bust a sex trafficking operation."
}, {
  "imdbId" : "0286486",
  "season" : "5",
  "episodeNumber" : "4",
  "title" : "Tapa Boca",
  "description" : "As Becca contemplates whether or not to represent the Strike Team, Vic discovers the truth about Emolia."
}, {
  "imdbId" : "0286486",
  "season" : "5",
  "episodeNumber" : "5",
  "title" : "Trophy",
  "description" : "Kavanaugh bugs the Strike Team's clubhouse to get his stalled investigation back on track as Vic and the guys try to end a deadly prescription drug ring."
}, {
  "imdbId" : "0286486",
  "season" : "5",
  "episodeNumber" : "6",
  "title" : "Rap Payback",
  "description" : "The walls close in on Vic when Kavanaugh invades the Barn and sets up office."
}, {
  "imdbId" : "0286486",
  "season" : "5",
  "episodeNumber" : "7",
  "title" : "Man Inside",
  "description" : "The Strike Team's solidarity begins to crack under Kavanaugh's constant scrutiny."
}, {
  "imdbId" : "0286486",
  "season" : "5",
  "episodeNumber" : "8",
  "title" : "Kavanaugh",
  "description" : "As Kavanaugh deals with the emotional circumstances surrounding the return of his ex-wife, his obsession to take down the Strike Team comes to a head."
}, {
  "imdbId" : "0286486",
  "season" : "5",
  "episodeNumber" : "9",
  "title" : "Smoked",
  "description" : "With their finances frozen, Vic and his guys are forced to find other means to bail Lem out of jail."
}, {
  "imdbId" : "0286486",
  "season" : "5",
  "episodeNumber" : "10",
  "title" : "Of Mice and Lem",
  "description" : "While Lem prepares to plead guilty to the heroin charges, Vic strikes a deal with Antwon Mitchell that will guarantee Lem's safety in prison."
}, {
  "imdbId" : "0286486",
  "season" : "5",
  "episodeNumber" : "11",
  "title" : "Postpartum",
  "description" : "Vic arranges to get Lem safely out of the country and set up a new life for him in Mexico."
}, {
  "imdbId" : "0286486",
  "season" : "6",
  "episodeNumber" : "1",
  "title" : "On the Jones",
  "description" : "Shane's guilt for killing Lem intensifies after the Strike Team learns that he didn't make a deal with the authorities, and Kavanaugh resorts to threatening informants and planting evidence to pin Lem's murder on Vic."
}, {
  "imdbId" : "0286486",
  "season" : "6",
  "episodeNumber" : "2",
  "title" : "Baptism by Fire",
  "description" : "Detectives discover the evidence Kavanaugh planted to make Vic look guilty for Lem's death, but Dutch begins to suspect that everything is too convenient. Meanwhile, Vic tries to find the Salvadoran leader Guardo, who escaped to Mexico."
}, {
  "imdbId" : "0286486",
  "season" : "6",
  "episodeNumber" : "3",
  "title" : "Back to One",
  "description" : "Vic captures Guardo and tries to coerce a confession to Lem's murder out of him. However, Shane, the real killer, begs Vic for leniency on Guardo's behalf. Meanwhile, Dutch and Gardocki bring down a gang of meth dealers."
}, {
  "imdbId" : "0286486",
  "season" : "6",
  "episodeNumber" : "4",
  "title" : "The New Guy",
  "description" : "Claudette begins making radical changes to the Strike Team in anticipation of Vic's imminent forced retirement. Meanwhile, Vic's helplessness for not saving Lem boils over after he fails to play peacemaker in a gang war."
}, {
  "imdbId" : "0286486",
  "season" : "6",
  "episodeNumber" : "5",
  "title" : "Haunts",
  "description" : "Shane is hospitalized after a beating, and his wife leaves him for having an affair. An unlikely suspect emerges in the serial rapist case, and an undercover agent in the Salvadoran gang tells Vic that Guardo didn't kill Lem."
}, {
  "imdbId" : "0286486",
  "season" : "6",
  "episodeNumber" : "6",
  "title" : "Chasing Ghosts",
  "description" : "After Vic learns that Guardo wasn't Lem's killer, he begins to suspect that Shane could have been responsible. Meanwhile, Vic does a favor for a city official, hoping it will give him an ally in his quest to avoid early retirement."
}, {
  "imdbId" : "0286486",
  "season" : "6",
  "episodeNumber" : "7",
  "title" : "Exiled",
  "description" : "Shane contacts the Armenian mob and collects information against the Strike Team, in order to protect himself from Vic. Meanwhile, Vic learns that Hernan lied about the San Marcos massacre when the Byz Lats retaliate against the Salvadorans."
}, {
  "imdbId" : "0286486",
  "season" : "6",
  "episodeNumber" : "8",
  "title" : "The Math of the Wrath",
  "description" : "Shane offers his services to Kesakhian's daughter, who is running the Armenian mob for her sick father. Meanwhile, Hiatt tells Vic that Claudette has made sure that Vic's 'retirement' from the Strike Team is a done deal."
}, {
  "imdbId" : "0286486",
  "season" : "6",
  "episodeNumber" : "9",
  "title" : "Recoil",
  "description" : "Vic's city official can't help him out with his forced retirement, but he finds a new ally when he solves the San Marcos murders. Shane and Vic fight over Kesakhian's daughter's loyalties, and Billings gets revenge on Dutch."
}, {
  "imdbId" : "0286486",
  "season" : "6",
  "episodeNumber" : "10",
  "title" : "Spanish Practices",
  "description" : "Vic and Aceveda form an unlikely alliance to expose a mutual enemy."
}, {
  "imdbId" : "0286486",
  "season" : "7",
  "episodeNumber" : "1",
  "title" : "Coefficient of Drag",
  "description" : "Vic and Shane's relationship continues to deteriorate as they work against each other to track down the Armenian hit man. The war between the Mexicans and Salvadorans continues, and Vic gets a temporary reprieve from early retirement."
}, {
  "imdbId" : "0286486",
  "season" : "7",
  "episodeNumber" : "2",
  "title" : "Snitch",
  "description" : "Vic's plan to play the Armenians against the Mexicans could backfire when the wrong man is targeted. Dutch plays hardball to get a witness to a homicide to step forward, and the mayor's new initiative to stop gang violence backfires."
}, {
  "imdbId" : "0286486",
  "season" : "7",
  "episodeNumber" : "3",
  "title" : "Money Shot",
  "description" : "Vic sets up a plan behind Shane's back to get the Armenians on their side. Meanwhile, Gardocki starts getting fed up about Vic continuing to work with Shane, and Dutch tries to get Danni a desk job to protect her."
}, {
  "imdbId" : "0286486",
  "season" : "7",
  "episodeNumber" : "4",
  "title" : "Genocide",
  "description" : "Now that Aceveda has taken the 'blackmail box' from Vic, Vic tries to convince Cruz Pezuela that the Armenians stole it. However, his ruse has more unintended consequences."
}, {
  "imdbId" : "0286486",
  "season" : "7",
  "episodeNumber" : "5",
  "title" : "Game Face",
  "description" : "Vic learns that the federal agent helping them out is in the 'blackmail box' and has ties to Cruz Pezuela. Dutch tries to find out if he has a future serial killer on his hands, and Claudette's health is brought into question."
}, {
  "imdbId" : "0286486",
  "season" : "7",
  "episodeNumber" : "6",
  "title" : "Animal Control",
  "description" : "Vic launches his latest plan to get rid of the Armenian threat. However, the main difference in this plan is that, if successful, it will get rid of Shane too. Meanwhile for Shane, a ghost from his past reemerges."
}, {
  "imdbId" : "0286486",
  "season" : "7",
  "episodeNumber" : "7",
  "title" : "Bitches Brew",
  "description" : "Vic loses his hearing, which is brought up ahead of schedule, and faces early retirement. He also loses favor with Cruz Pezuela and begins playing hardball with Dani, who wants him to give up all rights to their child."
}, {
  "imdbId" : "0286486",
  "season" : "7",
  "episodeNumber" : "8",
  "title" : "Parricide",
  "description" : "Shane's plan to get rid of Vic and Ronnie falls apart and threatens to be exposed. Cruz Pezuela asks Vic to strong-arm a priest, while David Aceveda joins Vic in working with the feds to bring Pezuela down."
}, {
  "imdbId" : "0286486",
  "season" : "7",
  "episodeNumber" : "9",
  "title" : "Moving Day",
  "description" : "Vic turns in his badge a week early and sets out to find and kill Shane and his wife. However, Ronnie is benched after Claudette shuts down the Strike Team. Meanwhile, Aceveda finds out more disturbing information about Cruz Pezuela."
}, {
  "imdbId" : "0286486",
  "season" : "7",
  "episodeNumber" : "10",
  "title" : "Party Line",
  "description" : "As he puts a price on Shane's head, Vic is asked to prove his loyalty to Beltran by killing Pezuela."
}, {
  "imdbId" : "0286486",
  "season" : "7",
  "episodeNumber" : "11",
  "title" : "Petty Cash",
  "description" : "As everything falls into place for the sting operation to bring Vic down, Shane is desperate for money. Back at the Barn, Ronnie tries to intercept a blackmail package, and Aceveda begins to question Pezuela's 'suicide.'"
}, {
  "imdbId" : "0286486",
  "season" : "7",
  "episodeNumber" : "12",
  "title" : "Possible Kill Screen",
  "description" : "Mara breaks her collarbone and accidentally shoots and kills an innocent person when Shane's plan to get more money goes sideways. Meanwhile, Vic contemplates leaving Ronnie out to dry and taking a deal with the Feds without him."
}, {
  "imdbId" : "0286486",
  "season" : "7",
  "episodeNumber" : "13",
  "title" : "Family Meeting",
  "description" : "As Vic hopes his immunity deal will help keep his family together, and Shane takes extreme measures to keep his pregnant wife from being charged with murder, Dutch finds he's a suspect in the disappearance of a teenage serial killer's mother."
}]