[{
  "imdbId" : "5171438",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "The Vulcan Hello",
  "description" : "While patrolling Federation space, the U.S.S. Shenzhou encounters an object of unknown origin, putting First Officer Michael Burnham to her greatest test yet."
}, {
  "imdbId" : "5171438",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Battle at the Binary Stars",
  "description" : "Escaping from the brig while the ship is under attack, Burnham joins the captain in an audacious plan to end a battle rapidly escalating into war."
}, {
  "imdbId" : "5171438",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Context Is for Kings",
  "description" : "Burnham finds herself aboard the U.S.S. Discovery, where she quickly realizes things are not as they seem, including the mysterious Captain Gabriel Lorca."
}, {
  "imdbId" : "5171438",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "The Butcher's Knife Cares Not for the Lamb's Cry",
  "description" : "With tensions and stakes high as Starfleet continues in their efforts to end the war with Klingons, Burnham begins to settle in to her new position aboard the U.S.S. Discovery."
}, {
  "imdbId" : "5171438",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Choose Your Pain",
  "description" : "While on a mission, Lorca is captured by the Klingons and unexpectedly finds himself in the company of prisoner of war Starfleet Lieutenant Ash Tyler and notorious criminal Harry Mudd."
}, {
  "imdbId" : "5171438",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Lethe",
  "description" : "The USS Discovery crew is intrigued by new addition, Lt. Ash Tyler. Sarek seeks Burnham's help, rekindling memories from her past. Admiral Cornwell questions Lorca's tactics."
}, {
  "imdbId" : "5171438",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Magic to Make the Sanest Man Go Mad",
  "description" : "As the U.S.S. Discovery crew attempts to let loose at a party, an unwelcome visitor comes aboard bringing about a problematic and twisted sequence of events."
}, {
  "imdbId" : "5171438",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Si Vis Pacem, Para Bellum",
  "description" : "The U.S.S. Discovery is tasked with a high priority mission to the planet Pahvo and learn the science behind the Klingons' cloaking technology."
}, {
  "imdbId" : "5171438",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "Into the Forest I Go",
  "description" : "Bypassing Starfleet's orders, Lorca uses the USS Discovery crew's ultimate asset, the ship itself, in an effort to end the war with the Klingons once and for all."
}, {
  "imdbId" : "5171438",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "Despite Yourself",
  "description" : "While in unfamiliar territory, the U.S.S. Discovery crew is forced to get creative in their next efforts to survive opposing and unprecedented forces and return home."
}, {
  "imdbId" : "5171438",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "The Wolf Inside",
  "description" : "As the crew continues their guise, Burnham undergoes a merciless mission in hopes of helping the U.S.S. Discovery return home. Tilly works on restoring Stamets' neurofunction."
}, {
  "imdbId" : "5171438",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "Vaulting Ambition",
  "description" : "Burnham heads to the ISS Charon with a special \"gift\" for the Emperor. With the help of an unexpected source, Stamets gains clarity while trapped inside the mycelial network. Saru asks for L'Rell's help."
}, {
  "imdbId" : "5171438",
  "season" : "1",
  "episodeNumber" : "13",
  "title" : "What's Past Is Prologue",
  "description" : "Lorca plans to move forward with a coup against the Emperor, propelling Burnham to make a quick decision to save not only herself, but the U.S.S. Discovery."
}, {
  "imdbId" : "5171438",
  "season" : "1",
  "episodeNumber" : "14",
  "title" : "The War Without, the War Within",
  "description" : "Burnham and the crew are faced with the harsh reality of the war during their absence. In order to move forward, Starfleet must use unconventional tactics and sources to take their next action against the Klingons."
}, {
  "imdbId" : "5171438",
  "season" : "1",
  "episodeNumber" : "15",
  "title" : "Will You Take My Hand?",
  "description" : "With Georgiou at the helm of the plan to end the Klingon war once and for all, the USS Discovery crew struggles to fathom and tolerate her hostile tactics. Memories of past hardships are rekindled within Burnham."
}, {
  "imdbId" : "5171438",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "Brother",
  "description" : "The crew of the U.S.S. Discovery joins forces with Captain Pike to unravel the mystery of seven mysterious red signals that have appeared across the universe."
}, {
  "imdbId" : "5171438",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "New Eden",
  "description" : "A new signal brings the Discovery to a distant planet, Terralysium, that is inhabited by the descendants of human survivors of World War III, which was fought on Earth 200 years earlier."
}, {
  "imdbId" : "5171438",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "Point of Light",
  "description" : "A surprise visitor to the U.S.S. Discovery brings shocking news about Spock and dredges up past regrets for Burnham. Following the asteroid incident, Tilly struggles to keep a grip on her reality. L'Rell's authority on Qo'noS is threatened."
}, {
  "imdbId" : "5171438",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "An Obol for Charon",
  "description" : "A mysterious sphere threatens the U.S.S. Discovery even as May, in her original form, implements a plan that puts Tilly's life in danger. Saru and Burnham's bond grows when Saru is forced to acknowledge a deeply unsettling Kelpien truth. Pike receives new intel on Spock from a loyal friend."
}, {
  "imdbId" : "5171438",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "Saints of Imperfection",
  "description" : "Burnham and the crew navigate a dangerous alien landscape in a race against time to save Tilly's life, but Stamets is not at all prepared for what they find in the process. Section 31 is assigned to help track down Spock, much to Pike's dismay."
}, {
  "imdbId" : "5171438",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "The Sound of Thunder",
  "description" : "When a new signal appears over Saru's home planet, Burnham, Saru and the crew embark on a perilous mission that puts Saru in danger and raises questions about the Red Angel's intentions. Hugh struggles to come to terms with his new reality."
}, {
  "imdbId" : "5171438",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "Light and Shadows",
  "description" : "Burnham goes to Vulcan in search of Spock, where she unearths surprising family secrets. In researching what is left of the Red Angel's signal over Kaminar, Pike and Tyler end up in battle with time itself. Georgiou has a few tricks up her sleeve for Leland and Section 31."
}, {
  "imdbId" : "5171438",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "If Memory Serves",
  "description" : "Spock and Burnham head to Talos IV, where the process of healing Spock forces the siblings to confront their troubled past. Stamets desperately tries to reconnect with an increasingly disconnected Hugh, while Tyler struggles to shed the crew's suspicions of him due to his past as Voq."
}, {
  "imdbId" : "5171438",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "Project Daedalus",
  "description" : "The Discovery crew infiltrates Section 31's headquarters and suspicions arise that the crew may have a traitor in their midst. Meanwhile, Burnham tries to help Spock, but her efforts don't go as planned."
}, {
  "imdbId" : "5171438",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "The Red Angel",
  "description" : "Burnham is stunned when she learns her ties to Section 31 run deeper than she ever fathomed. Armed with the identity of the Red Angel, the U.S.S. Discovery goes to work on its most critical mission to date."
}, {
  "imdbId" : "5171438",
  "season" : "2",
  "episodeNumber" : "11",
  "title" : "Perpetual Infinity",
  "description" : "Burnham receives the reunion she's been longing for, but it doesn't go quite as she imagined. Georgiou and Tyler sense a disturbing change in Leland."
}, {
  "imdbId" : "5171438",
  "season" : "2",
  "episodeNumber" : "12",
  "title" : "Through the Valley of Shadows",
  "description" : "A fourth signal leads the U.S.S. Discovery to an insular world, where Pike is forced to make a life-changing choice. Burnham and Spock investigate a Section 31 ship gone rogue, leading to a discovery with catastrophic consequences."
}, {
  "imdbId" : "5171438",
  "season" : "2",
  "episodeNumber" : "13",
  "title" : "Such Sweet Sorrow",
  "description" : "When the U.S.S. Discovery's crucial mission does not go according to plan, Burnham realizes what must ultimately be done. The crew prepares for the battle of a lifetime as Leland's Control ships get closer."
}, {
  "imdbId" : "5171438",
  "season" : "2",
  "episodeNumber" : "14",
  "title" : "Such Sweet Sorrow, Part 2",
  "description" : "The U.S.S. Discovery battles against Control in a fight not only for their lives but for the future, with a little help from some unexpected friends. Spock and Burnham discern vital new connections between the red signals while Burnham faces one of life's harshest truths: the right decisions are often the hardest to make."
}, {
  "imdbId" : "5171438",
  "season" : "3",
  "episodeNumber" : "1",
  "title" : "That Hope Is You, Part 1",
  "description" : "Arriving 930 years in the future, Burnham navigates a galaxy she no longer recognizes while searching for the rest of the U.S.S. Discovery crew."
}, {
  "imdbId" : "5171438",
  "season" : "3",
  "episodeNumber" : "2",
  "title" : "Far from Home",
  "description" : "After the U.S.S. Discovery crash-lands on a strange planet, the crew finds themselves racing against time to repair their ship. Meanwhile, Saru and Tilly embark on a perilous first-contact mission in hopes of finding Burnham."
}, {
  "imdbId" : "5171438",
  "season" : "3",
  "episodeNumber" : "3",
  "title" : "People of Earth",
  "description" : "Finally reunited, Burnham and the U.S.S. Discovery crew journey to Earth, eager to learn what happened to the Federation in their absence."
}, {
  "imdbId" : "5171438",
  "season" : "3",
  "episodeNumber" : "4",
  "title" : "Forget Me Not",
  "description" : "Burnham and Adira visit the Trill homeworld while Saru's efforts on the Discovery to help the crew reconnect yield surprises."
}, {
  "imdbId" : "5171438",
  "season" : "3",
  "episodeNumber" : "5",
  "title" : "Die Trying",
  "description" : "After reuniting with what remains of Starfleet and the Federation, the U.S.S. Discovery and its crew must prove that a 930 year old crew and starship are exactly what this new future needs."
}, {
  "imdbId" : "5171438",
  "season" : "3",
  "episodeNumber" : "6",
  "title" : "Scavengers",
  "description" : "After receiving a message from Book, Burnham and Georgiou embark on a rogue mission to find him, leaving Saru to pick up the pieces with Admiral Vance. Meanwhile, Stamets forms an unexpected bond with Adira."
}, {
  "imdbId" : "5171438",
  "season" : "3",
  "episodeNumber" : "7",
  "title" : "Unification III",
  "description" : "While grappling with the fallout of her recent actions, and what her future might hold, Burnham agrees to represent the Federation in an intense debate about the release of politically sensitive - but highly valuable - Burn data."
}, {
  "imdbId" : "5171438",
  "season" : "3",
  "episodeNumber" : "8",
  "title" : "The Sanctuary",
  "description" : "The U.S.S. Discovery crew travel to Book's home planet to help rescue it from Osyraa, the formidable leader of the Emerald Chain; Stamets and Adira continue their search for valuable information on the origin of the Burn."
}, {
  "imdbId" : "5171438",
  "season" : "3",
  "episodeNumber" : "9",
  "title" : "Terra Firma, Part 1",
  "description" : "The U.S.S. Discovery crew journey to a mysterious planet in hopes of finding a cure for Georgiou's deteriorating condition. Stamets and Adira make a stunning breakthrough with the newly acquired Burn data."
}, {
  "imdbId" : "5171438",
  "season" : "3",
  "episodeNumber" : "10",
  "title" : "Terra Firma, Part 2",
  "description" : "Georgiou uncovers the true depths of the plot against her, leading her to a revelation about how deeply her time on the U.S.S. Discovery truly changed her."
}, {
  "imdbId" : "5171438",
  "season" : "3",
  "episodeNumber" : "11",
  "title" : "Su'Kal",
  "description" : "Discovery ventures to the Verubin Nebula, where Burnham, Saru, and Culber make a shocking realization about the origin of the Burn as the rest of the crew faces an unexpected threat."
}, {
  "imdbId" : "5171438",
  "season" : "3",
  "episodeNumber" : "12",
  "title" : "There Is a Tide...",
  "description" : "After capturing the U.S.S. Discovery, Osyraa seeks a meeting with Admiral Vance while Burnham and the crew must overcome unimaginable odds as they attempt to regain command of their ship."
}, {
  "imdbId" : "5171438",
  "season" : "3",
  "episodeNumber" : "13",
  "title" : "That Hope Is You, Part 2",
  "description" : "As the Emerald Chain tightens its grip and the mystery of the Burn is finally solved, Burnham and the crew have one last chance to save themselves - and the Federation."
}, {
  "imdbId" : "5171438",
  "season" : "4",
  "episodeNumber" : "1",
  "title" : "Kobayashi Maru",
  "description" : "After months spent reconnecting the Federation with distant worlds, Captain Michael Burnham and the crew of the U.S.S. Discovery are sent to assist a damaged space station."
}, {
  "imdbId" : "5171438",
  "season" : "4",
  "episodeNumber" : "2",
  "title" : "Anomaly",
  "description" : "Saru returns to help the U.S.S. Discovery uncover the mystery of an unusually destructive new force; as Burnham leads the crew, she must also find a way to help Book cope with an unimaginable loss."
}, {
  "imdbId" : "5171438",
  "season" : "4",
  "episodeNumber" : "3",
  "title" : "Choose to Live",
  "description" : "Burnham and Tilly hunt the killer of a Starfleet officer as Stamets and the science team race against the clock to prevent the anomaly from killing anyone else."
}, {
  "imdbId" : "5171438",
  "season" : "4",
  "episodeNumber" : "4",
  "title" : "All Is Possible",
  "description" : "Tilly and Adira lead a team of Starfleet Academy cadets on a training mission that takes a dangerous turn. Meanwhile, Burnham is pulled into tense negotiations on Ni'Var."
}, {
  "imdbId" : "5171438",
  "season" : "4",
  "episodeNumber" : "5",
  "title" : "The Examples",
  "description" : "Burnham and Book race to evacuate a group of stranded colonists in the anomaly's path as one of the Federation's brightest scientists comes aboard the U.S.S. Discovery to do high-stakes research with Saru and Stamets."
}, {
  "imdbId" : "5171438",
  "season" : "4",
  "episodeNumber" : "6",
  "title" : "Stormy Weather",
  "description" : "Seeking answers, the U.S.S. Discovery ventures into a subspace rift created by the Dark Matter Anomaly. Meanwhile, Book faces a strange visitor from his past."
}, {
  "imdbId" : "5171438",
  "season" : "4",
  "episodeNumber" : "7",
  "title" : "...But to Connect",
  "description" : "Tensions rise as representatives from across the galaxy gather to confront the threat of the Dark Matter Anomaly. Zora's new sentience raises difficult questions."
}, {
  "imdbId" : "5171438",
  "season" : "4",
  "episodeNumber" : "8",
  "title" : "All In",
  "description" : "Following a hunch, Captain Burnham tracks Book to an old haunt from their courier days and gets drawn into a high-stakes competition for a powerful weapon."
}, {
  "imdbId" : "5171438",
  "season" : "4",
  "episodeNumber" : "9",
  "title" : "Rubicon",
  "description" : "Captain Burnham and the U.S.S. Discovery race to stop Book and Ruon Tarka from launching a rogue plan that could inadvertently endanger the galaxy."
}, {
  "imdbId" : "5171438",
  "season" : "4",
  "episodeNumber" : "10",
  "title" : "The Galactic Barrier",
  "description" : "Captain Burnham and her crew must go where few have gone before: beyond the Galactic Barrier. Meanwhile, Book learns the truth of what drives Ruon Tarka."
}, {
  "imdbId" : "5171438",
  "season" : "4",
  "episodeNumber" : "11",
  "title" : "Rosetta",
  "description" : "While Captain Burnham leads an away mission to a planet that was once home to the aliens responsible for the DMA, Book and Tarka secretly infiltrate the U.S.S. Discovery."
}, {
  "imdbId" : "5171438",
  "season" : "4",
  "episodeNumber" : "12",
  "title" : "Species Ten-C",
  "description" : "As the DMA approaches Earth and Ni'Var, Captain Burnham and the crew of the U.S.S. Discovery attempt to make First Contact with the powerful species responsible before it's too late."
}, {
  "imdbId" : "5171438",
  "season" : "4",
  "episodeNumber" : "13",
  "title" : "Coming Home",
  "description" : "As the DMA approaches Earth and Ni'Var, and with evacuations underway, Burnham and the team aboard the U.S.S. Discovery must find a way to communicate and connect with a species far different from their own before time runs out."
}]