[{
  "imdbId" : "8806524",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Remembrance",
  "description" : "Fourteen years after retiring from Starfleet, Jean-Luc Picard, still haunted by the death of Data, is living a quiet life on his family vineyard when a woman comes to him for help."
}, {
  "imdbId" : "8806524",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Maps and Legends",
  "description" : "Without the support of Starfleet, Picard turns to Dr. Agnes Jurati and his estranged colleague Raffi Musiker for help in finding the truth about Dahj, unaware that hidden enemies are also interested in what he'll find."
}, {
  "imdbId" : "8806524",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "The End Is the Beginning",
  "description" : "After reflecting on the past with Raffi, Picard hires her partner, Cristobal Rios, to help him in his search for Bruce Maddox; Soji's work on the Borg cube catches the attention of the executive director."
}, {
  "imdbId" : "8806524",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Absolute Candor",
  "description" : "On the way to Freecloud, Picard requests a stop at a Romulan refugee planet where he reunites with Elnor, the young Romulan he befriended fourteen years ago; Narek continues to learn more about Soji."
}, {
  "imdbId" : "8806524",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Stardust City Rag",
  "description" : "The La Sirena crew reach Freecloud and find Bruce Maddox in a precarious situation, so Seven of Nine, the ex-Borg they recently picked up, lends her assistance."
}, {
  "imdbId" : "8806524",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "The Impossible Box",
  "description" : "Picard and the crew trace Soji to the Borg cube, forcing Picard to face memories of being Locutus; Narek believes he's found a way to safely exploit information from Soji."
}, {
  "imdbId" : "8806524",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Nepenthe",
  "description" : "Picard and Soji, who's struggling to make sense of her recently unlocked memories, travel to a planet that happens to be the home of Picard's old friends Will Riker and Deanna Troi; Elnor and Hugh are left on the Borg cube to face Narissa."
}, {
  "imdbId" : "8806524",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Broken Pieces",
  "description" : "Picard realizes how far some will go to protect secrets that go back generations when truths about the attack on Mars are revealed; Narissa orders her guards to capture Elnor, setting off a chain reaction on the Borg cube."
}, {
  "imdbId" : "8806524",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "Et in Arcadia Ego, Part 1",
  "description" : "With the Romulans in pursuit, Picard and the crew finally reach Soji's home planet - and discover more than they expected about the inhabitants."
}, {
  "imdbId" : "8806524",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "Et in Arcadia Ego, Part 2",
  "description" : "Picard and his team are pitted against the Romulans and the synthetics of Coppelius in a final confrontation."
}]