[{
  "imdbId" : "3148266",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Pilot",
  "description" : "27 years after a virus wipes out most of humanity, scientists send a man (James Cole) back to 2015 to stop the plague from ever happening. Cole's only lead is a virologist (Dr. Cassandra Railly), who knows the dangerous source of the outbreak."
}, {
  "imdbId" : "3148266",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Mentally Divergent",
  "description" : "Cole returns to the year 2015 to gather knowledge from a patient inside a mental institution. Jones believes that the 12 Monkeys are somehow involved in the pandemic that wiped out the population of Earth, thus making Cole's attempt to extract the information from the patient, imperative. Dr Railly feels that her intervention in Cole's case has given her incentive to continue to help him in his mission, much to Cole's compliance."
}, {
  "imdbId" : "3148266",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Cassandra Complex",
  "description" : "Cole is led to Haiti in 2014, where a dangerous outbreak proved to be a devastating moment in Dr. Railly's life."
}, {
  "imdbId" : "3148266",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Atari",
  "description" : "A fight for the future ensues when a dangerous band of marauders hunting for Cole and Ramse threatens the mission to save the past."
}, {
  "imdbId" : "3148266",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "The Night Room",
  "description" : "Cole and Dr. Railly face off with the Army of the 12 Monkeys when both discover the Night Room -- an off-site, black ops lab that houses the virus that will one day destroy the world."
}, {
  "imdbId" : "3148266",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "The Red Forest",
  "description" : "After the events in the night room, Cole automatically returns to 2043 and finds that the timeline has been altered. He meets Jones, who has no idea who he is. In this timeline, the time transporter is not functioning but a blood tests confirms that they had met previously. A database check also reveals that Cassie was killed in 2015, likely the event that caused the change. He finds that Ramse is in charge of the facility and after some persuasion, he agrees to send Cole back to 2015. To set things right, he has to keep Cassie from being killed."
}, {
  "imdbId" : "3148266",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "The Keys",
  "description" : "Cole, Railly and Aaron race to stop the virus from being deployed as a bio-weapon in Chechnya."
}, {
  "imdbId" : "3148266",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Yesterday",
  "description" : "The Core that powers the time machine is fading. To get Cole back from the past, Jones must convince her former colleagues at the military operation \"Spearhead\" that her mission is worth saving."
}, {
  "imdbId" : "3148266",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "Tomorrow",
  "description" : "Cole finds himself in 2017 at the height of the plague. Out of options, Jones faces an impossible choice to replace the Core."
}, {
  "imdbId" : "3148266",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "Divine Move",
  "description" : "Forces come to a head when Ramse takes measures to protect his newfound family, leaving Cole to deal with the fallout."
}, {
  "imdbId" : "3148266",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "Shonin",
  "description" : "Cole splinters to Tokyo in 1987 in a last chance effort to stop the Army of the 12 Monkeys."
}, {
  "imdbId" : "3148266",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "Paradox",
  "description" : "With Cole dying from the effects of time-travel, Railly must find the one person who can save him."
}, {
  "imdbId" : "3148266",
  "season" : "1",
  "episodeNumber" : "13",
  "title" : "Arms of Mine",
  "description" : "Cole and Cassandra try for a final confrontation with the Witness, while Jones faces a new threat to the mission."
}, {
  "imdbId" : "3148266",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "Year of the Monkey",
  "description" : "Cole and Ramse mend their broken friendship while on the run from the Army of the 12 Monkeys. And in the year 2043, Railly and Jones navigate an uncertain future as Deacon and the Twelve command the Temporal Facility."
}, {
  "imdbId" : "3148266",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "Primary",
  "description" : "Cole gets stranded in 2016 after an attempt to destroy the virus changes the future; Jones and Railly deal with the consequences of the changed timeline."
}, {
  "imdbId" : "3148266",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "One Hundred Years",
  "description" : "Despite the growing tension between them, Cole and Cassie time travel to New York during World War II to track down a dangerous member of the Twelve."
}, {
  "imdbId" : "3148266",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "Emergence",
  "description" : "Jones turns to Ramse for help getting Cole and Cassie back from 1944; Jones visits old Jennifer Goines to explore the true nature of time."
}, {
  "imdbId" : "3148266",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "Bodies of Water",
  "description" : "In the present, Cassie and Jennifer Goines run from the 12 Monkeys; in 2044, Cole and Ramse face off against Deacon."
}, {
  "imdbId" : "3148266",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "Immortal",
  "description" : "Cole and Ramse travel to 1970s New York City to prevent the Twelve from murdering a Vietnam veteran with a connection to the Witness."
}, {
  "imdbId" : "3148266",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "Meltdown",
  "description" : "Cole comes face to face with the Witness, the phantom behind the Army of the 12 Monkeys as Cassie's (Amanda Schull) hallucinations undergo a chilling evolution. Making matters worse, the Temporal Facility becomes increasingly dangerous after the malfunctioning time machine begins to tear apart time and space, bringing back deadly visitors from the past."
}, {
  "imdbId" : "3148266",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "Lullaby",
  "description" : "Cassandra Railey goes back to 2020 on a mission to kill Dr. Katarina Jones. Followed by James Cole to stop her from this mission, they find themselves stuck in a time loop."
}, {
  "imdbId" : "3148266",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "Hyena",
  "description" : "In 2016 Jennifer is taking matters into her own hands, going after the tall man when Cole splinters back to help her. Cassie and Ramses are both looking for revenge, looking for a place called Titan and Katarina is trying to make sense of a newfound relationship."
}, {
  "imdbId" : "3148266",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "Fatherland",
  "description" : "Cole's loyalty is tested when Ramse and Railly go rogue and embark on an unsanctioned mission into 1961 East Berlin in the hopes of finding an unscrupulous German doctor who knows the location of The Witness so they can kill him."
}, {
  "imdbId" : "3148266",
  "season" : "2",
  "episodeNumber" : "11",
  "title" : "Resurrection",
  "description" : "As the temporal facility gets closer to destruction, Cole goes to 1957 to save humanity while everyone else looks for Titan, the stronghold of the Witness."
}, {
  "imdbId" : "3148266",
  "season" : "2",
  "episodeNumber" : "12",
  "title" : "Blood Washed Away",
  "description" : "Cole and Cassandra search for the primary in 1957 to prevent the paradox , while in 2044, Ramsey, Deacon and the daughters try to find titan to kill the witness."
}, {
  "imdbId" : "3148266",
  "season" : "2",
  "episodeNumber" : "13",
  "title" : "Memory of Tomorrow",
  "description" : "Cole and Railly adjust to the past, but a mysterious woman with apocalyptic visions gets them to do the unthinkable to save the world."
}, {
  "imdbId" : "3148266",
  "season" : "3",
  "episodeNumber" : "1",
  "title" : "Mother",
  "description" : "The birth of the Witness and the beginning of the end of the world."
}, {
  "imdbId" : "3148266",
  "season" : "3",
  "episodeNumber" : "2",
  "title" : "Guardians",
  "description" : "Cole travels to 1922 and faces new enemies; the origins of the Witness' world-ending plan are revealed."
}, {
  "imdbId" : "3148266",
  "season" : "3",
  "episodeNumber" : "3",
  "title" : "Enemy",
  "description" : "An old enemy unveils a dangerous new scheme which could shatter bonds and unravel reality."
}, {
  "imdbId" : "3148266",
  "season" : "3",
  "episodeNumber" : "4",
  "title" : "Brothers",
  "description" : "Cole faces the unthinkable to save the woman he loves; an escape from the time traveling city of Titan."
}, {
  "imdbId" : "3148266",
  "season" : "3",
  "episodeNumber" : "5",
  "title" : "Causality",
  "description" : "To track the Witness, the gang must travel to the most outrageous era yet - the 1980s."
}, {
  "imdbId" : "3148266",
  "season" : "3",
  "episodeNumber" : "6",
  "title" : "Nature",
  "description" : "The origin of the Army of the 12 Monkeys is finally revealed."
}, {
  "imdbId" : "3148266",
  "season" : "3",
  "episodeNumber" : "7",
  "title" : "Nurture",
  "description" : "One team, two agendas and a single event that changes the course of the mission, and pits friends against friend."
}, {
  "imdbId" : "3148266",
  "season" : "3",
  "episodeNumber" : "8",
  "title" : "Masks",
  "description" : "Former friends, now enemies, race to find the Witness in 1904, who, at last, reveals his face."
}, {
  "imdbId" : "3148266",
  "season" : "3",
  "episodeNumber" : "9",
  "title" : "Thief",
  "description" : "The reason why the Witness wants to destroy time and reality is revealed."
}, {
  "imdbId" : "3148266",
  "season" : "3",
  "episodeNumber" : "10",
  "title" : "Witness",
  "description" : "The final battle with the Witness begins."
}]