[{
  "imdbId" : "0077097",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Pilot: Part 1",
  "description" : "Andy Travis joins the WKRP staff as program director and institutes sudden changes that most of the eccentric staff and the station's cantankerous owner don't immediately like."
}, {
  "imdbId" : "0077097",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Pilot: Part 2",
  "description" : "Andy looks for a way to publicize the station's new format, while elderly listeners invade the station to protest the removal of their favorite music."
}, {
  "imdbId" : "0077097",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Les on a Ledge",
  "description" : "Les finds himself desperately distressed when he is mistaken for a homosexual."
}, {
  "imdbId" : "0077097",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Hoodlum Rock",
  "description" : "WKRP promotes a concert for the well dressed and spoken, and gleefully violent, rock band, Scum of the Earth."
}, {
  "imdbId" : "0077097",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Hold Up",
  "description" : "Herb manages to ensnare a new client, Del's Stereo Shop, by promising a live remote broadcast with the doctor, himself. The remote turns into a disaster when Bucky, the Union and Bobby Boogie all intervene."
}, {
  "imdbId" : "0077097",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Bailey's Show",
  "description" : "Public Service Announcements (PSAs) at WKRP were all about forest fires before Bailey had her big idea: \"Cincinnati Beat,\" where regular citizens are interviewed by the resident Doctor. Bailey is excited to be producing the show. But, when all of the prospective guests turn out to be freaks, aliens and weirdoes, Bailey has a crisis of confidence."
}, {
  "imdbId" : "0077097",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Turkeys Away",
  "description" : "Feeling left out by all the recent changes, Mr. Carlson decides to launch his own Thanksgiving promotion. With the aid of Herb and Les, the Big Guy turns a routine turkey give-away into a comic catastrophe."
}, {
  "imdbId" : "0077097",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Love Returns",
  "description" : "Andy's former struggling musician girlfriend, now a big country music star, shows up on tour in Cincinnati. The passion is rekindled and she wants Andy to quit WKRP and join her on tour. Can Andy turn his back on WKRP to chase love?"
}, {
  "imdbId" : "0077097",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "Mama's Review",
  "description" : "Mrs. Carlson comes to the station to review what has happened since Andy's start as Program Director."
}, {
  "imdbId" : "0077097",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "A Date with Jennifer",
  "description" : "Mr. Carlson has been on a tear writing memo after memo instituting new station policies. Amidst Mr. Carlson's memo-writing, Les announces that he has won the \"coveted\" Silver Sow award. Regardless of the cost cutting measures he's announced in memos, Mr. Carlson says that the station will pay for tickets to the awards banquet for Les and his date. With cues around him making him feel like he has no chance with women, Les asks any of the guys, like Herb or Andy, if they'd like to go to the banquet with him. Taking the bulls by the horns, Herb, as Les' pal, shows him ..."
}, {
  "imdbId" : "0077097",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "The Contest Nobody Could Win",
  "description" : "Johnny causes considerable consternation at the station when he accidentally announces a contest prize of $5000 instead of $50."
}, {
  "imdbId" : "0077097",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "Tornado",
  "description" : "The station staff finds themselves in danger when Herb unplugs a teleprinter just as it is receiving a local tornado warning."
}, {
  "imdbId" : "0077097",
  "season" : "1",
  "episodeNumber" : "13",
  "title" : "Goodbye Johnny",
  "description" : "Johnny gets a job offer and a chance to return to the Los Angeles radio market (the place of his greatest success.) The staff of WKRP try to trick Fever into staying by showing how much they mean to him."
}, {
  "imdbId" : "0077097",
  "season" : "1",
  "episodeNumber" : "14",
  "title" : "Johnny Comes Back",
  "description" : "Johnny returns to WKRP only to discover he has already been replaced by a DJ who is secretly taking payola in the form of cocaine."
}, {
  "imdbId" : "0077097",
  "season" : "1",
  "episodeNumber" : "15",
  "title" : "Never Leave Me, Lucille",
  "description" : "Herb and his wife Lucille are getting a divorce, the first night after the decision Herb resorting to sleeping on the couch in the office. Herb may or may not be aware that Lucille's want for the divorce is because she thinks he takes her for granted as a woman. The divorce has an effect on everyone in the office. Herb needs a temporary place to stay until he gets his own place, with none of the guys, except Les, really wanting Herb, with Les out of the question solely because of the size of his apartment. And now that Herb is a \"free\" man, Jennifer feels more exposed..."
}, {
  "imdbId" : "0077097",
  "season" : "1",
  "episodeNumber" : "16",
  "title" : "I Want to Keep My Baby",
  "description" : "A young mother, with no money, no friends, and nowhere to turn, leaves her baby for Johnny at the station."
}, {
  "imdbId" : "0077097",
  "season" : "1",
  "episodeNumber" : "17",
  "title" : "Commercial Break",
  "description" : "The staff of WKRP is tasked with creating a commercial for a lucrative advertising contract with a funeral home, to Mr. Carlson's growing discomfort."
}, {
  "imdbId" : "0077097",
  "season" : "1",
  "episodeNumber" : "18",
  "title" : "Who Is Gordon Sims?",
  "description" : "Venus is forced to confess his real name, and the fact that he is wanted for desertion from the Army."
}, {
  "imdbId" : "0077097",
  "season" : "1",
  "episodeNumber" : "19",
  "title" : "I Do, I Do... for Now",
  "description" : "Jennifer receives an unexpected visit from T.J. Watson, a guitar-toting, good (or not so good) ol' boy she knew from her days growing up in Rock Throw, West Virginia. Although Jennifer doesn't initially even recognize him, he reminds her of their \"engagement\", a deal they made when they were younger. In an act of desperation to get out of marrying T.J., Jennifer tells him that she is already married, her husband being the first man at the station to come along: Johnny. To Jennifer's dismay, T.J. doesn't seem that easily dissuaded, she and Johnny who are forced to ..."
}, {
  "imdbId" : "0077097",
  "season" : "1",
  "episodeNumber" : "20",
  "title" : "Young Master Carlson",
  "description" : "Mr. Carlson's son disappears from Prussian Valley Military Academy. When he turns up at the station with Mama Carlson, he is put to work at the station and promptly gets into trouble."
}, {
  "imdbId" : "0077097",
  "season" : "1",
  "episodeNumber" : "21",
  "title" : "Fish Story",
  "description" : "On the day Carlson and Travis are being interviewed by a newspaper, everything around them goes wrong in the silliest way possible."
}, {
  "imdbId" : "0077097",
  "season" : "1",
  "episodeNumber" : "22",
  "title" : "Preacher",
  "description" : "Andy and Mr. Carlson must deal with an intimidating ex-wrestler now religious broadcaster whose merchandising during his show is getting out of hand."
}, {
  "imdbId" : "0077097",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "For Love or Money: Part 1",
  "description" : "After thinking about doing so for quite some time, Bailey finally has the nerve to ask Johnny out on a date. While Johnny knows that the outing will just be the two of them, he considers it something quite different than Bailey. Their date may end up taking a back seat in Johnny's life when he receives a telephone call from new ageist Buffy Denver, with who he had a two year relationship in Los Angeles after his first divorce and who, in town, wants to meet with him. As Johnny considers Buffy one of the great passions in his life, he does whatever he can to make his ..."
}, {
  "imdbId" : "0077097",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "For Love or Money: Part 2",
  "description" : "It's in the evening at the radio station. Venus is in the control booth finishing up his show. Mr. Carlson and Andy are working late on the financials. And Bailey is wandering around feeling sorry for herself having been stood up by Johnny, the two who were supposed to go on a date - what would have been their first - to see a"
}, {
  "imdbId" : "0077097",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "Baseball",
  "description" : "As he covers all the news including sports, Les unilaterally accepts a $200 wager from Clark Callahan, station manager at WPIG, on a co-ed slo-pitch game between the two radio stations. Les, who never played any sports, including softball, when he was growing up, he stuck inside taking violin lessons instead, sees the game and the challenge as a rite of passage he never went through but should have as a child. No one else at the station wants to play, largely because they don't want to lose as, unaware to Les, WPIG plays in a city league and plays well. But a series ..."
}, {
  "imdbId" : "0077097",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "Bad Risk",
  "description" : "To help make ends meet, Herb is selling insurance on the side, he seeing his first potential customers being the staff at the station. While some are able to avoid Herb upon hearing what he's doing, others, like Les and Mr. Carlson, are relatively easy prey for Herb's heavy handed sales tactics, Les in particular who Herb is able to oversell. Part of Les' issue is that he is in a funk, largely in having to gather and report on the largely depressing news, which is getting into his psyche. Once Andy finds out about Herb's moonlighting job, he wants to put an end to it ..."
}, {
  "imdbId" : "0077097",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "Jennifer Falls in Love",
  "description" : "Jennifer is in love with a blonde haired model of a guy named Steel Hawthorne. The only problem? He is poor. And he also seems interested in her because she has money. Is he treating her the way she treats other men?"
}, {
  "imdbId" : "0077097",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "Carlson for President",
  "description" : "Including the incumbent Charles Tillman, Mr. Carlson is one of four people running for the one open city council seat, many at the station believing it solely a measure to gain Mother Carlson's approval. Including Herb as his campaign manager, everyone at the station is helping Mr. Carlson with the campaign, some who have the ulterior motive of Mr. Carlson having less time to spend at the station if he wins. But Mr. Carlson winning is an uphill task as he isn't even registering in the public opinion polls, and he will continue not registering if he uses his preferred ..."
}, {
  "imdbId" : "0077097",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "Mike Fright",
  "description" : "In reference to the garbage strike happening in the city, Johnny, on the air, makes a flippant comment that if the city won't pick up people's garbage, the people should bring their garbage to the city by dumping it on the steps of city hall. Much to Johnny's surprise, hundreds of his listeners take the words to heart and dump their garbage at city hall. Their actions have repercussions on the station, Mr. Carlson and Andy who have to deal with the liability of the station by Johnny's words, the situation which is only inflamed by further on-air words by Les. While Mr..."
}, {
  "imdbId" : "0077097",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "The Patter of Little Feet",
  "description" : "Arthur's wife Carmen believes that she may be pregnant, causing Carlson (Gordon Jump) to consider whether or not he is ready for another child at his age."
}, {
  "imdbId" : "0077097",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "Baby, If You've Ever Wondered",
  "description" : "When the station's ratings fail to improve to Andy's expectations, he wonders if he is accomplishing anything with the screwy staff."
}, {
  "imdbId" : "0077097",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "Bailey's Big Break",
  "description" : "Les is forced to hire another newsman to relieve him of some of his broadcasts. A protesting Les doesn't want anyone, especially when Andy thinks it should be Bailey."
}, {
  "imdbId" : "0077097",
  "season" : "2",
  "episodeNumber" : "11",
  "title" : "Jennifer's Home for Christmas",
  "description" : "Christmas is coming up and everyone at the station is anxious to leave and start their holiday plans...everyone, except for Jennifer. Jennifer seems as if she has no holiday plans and is dismayed that the rest of the staff don't want to celebrate Christmas as a family. The gang joins together to give Jennifer a warm Christmas."
}, {
  "imdbId" : "0077097",
  "season" : "2",
  "episodeNumber" : "12",
  "title" : "Sparky",
  "description" : "Andy tells Les that Arthur hired someone else to do the sports reporting on the radio - the former manager of the Red's baseball team, Sparky Anderson, who is a hero to Arthur. When Sparky is a disaster on the radio, Arthur has to fire him."
}, {
  "imdbId" : "0077097",
  "season" : "2",
  "episodeNumber" : "13",
  "title" : "God Talks to Johnny",
  "description" : "Johnny wakes in the middle of the night and thinks he hears someone. He determines it is God speaking to him. His performance on the radio in the morning is changed because he is touched by God, and he wants to spread the word to everyone."
}, {
  "imdbId" : "0077097",
  "season" : "2",
  "episodeNumber" : "14",
  "title" : "A Family Affair",
  "description" : "Andy's sister Carol is visiting and Andy sets her up on a blind date with Johnny. But when Carol visits the radio station, she meets Venus and they set up their own date. Andy does not approve, but then he has to prove his is not a racist."
}, {
  "imdbId" : "0077097",
  "season" : "2",
  "episodeNumber" : "15",
  "title" : "Herb's Dad",
  "description" : "Herb's father visits the station to see his son. Herb Sr is a born salesman just like Herb Jr, and has run away from the retirement home where he was living. Herb Sr wants his son to give him money so he can go to California."
}, {
  "imdbId" : "0077097",
  "season" : "2",
  "episodeNumber" : "16",
  "title" : "Put Up or Shut Up",
  "description" : "Herb's wife is out of town for 10 days. And he decides this is the time to go wild and get Jennifer to finally go out with him. When Jennifer finds out she has to deal with Herb for 10 days, she tells Bailey she can't make it. Bailey's advice to Jennifer is just to take Herb up on it and he'll chicken out. The next time Herb asks her, she accepts and her troubles begin, because Herb doesn't seem to be backing down. As the time approaches Herb does seem to be backing down, he is thinking about his family and missing them. It's around this time that Les tells Herb what ..."
}, {
  "imdbId" : "0077097",
  "season" : "2",
  "episodeNumber" : "17",
  "title" : "The Americanization of Ivan",
  "description" : "Despite Andy's directive to the contrary, Les continues to broadcast editorials of his own unique views under the guise of they being the station's views. He also wants to use his news credentials to further those views. As such, anti-Communist hog aficionado Les, with Bailey tagging along as his paid babysitter to ensure he doesn't get into trouble, plans to, in his own words, torpedo a news conference being held by a traveling group of Russian hog experts. At the sparsely attended press conference, Bailey, through a note slipped to her, learns that one of the ..."
}, {
  "imdbId" : "0077097",
  "season" : "2",
  "episodeNumber" : "18",
  "title" : "Les' Groupie",
  "description" : "Newsman Les Nessman is surprised to learn he has a female \"groupie\" who loves his news show very much, but also loves him to the point of unreasonably interfering with and taking over his life at home and work."
}, {
  "imdbId" : "0077097",
  "season" : "2",
  "episodeNumber" : "19",
  "title" : "In Concert",
  "description" : "The staff find themselves consumed with guilt for promoting a Who concert at Riverfront Coliseum when its general admission policy causes a terrible tragedy."
}, {
  "imdbId" : "0077097",
  "season" : "2",
  "episodeNumber" : "20",
  "title" : "The Doctor's Daughter",
  "description" : "After being separated for 7 years, Johnny's daughter, Laurie, comes to visit her father, bringing with her a new boyfriend. Johnny immediately steps into the role of the disapproving father and learns that there's a lot he doesn't know about his daughter."
}, {
  "imdbId" : "0077097",
  "season" : "2",
  "episodeNumber" : "21",
  "title" : "Filthy Pictures: Part 1",
  "description" : "Andy and Jennifer agree do a photo shoot for a charity. While dressing after the session is done, the photographer for the photo shoot, takes nude photos of Jennifer without her knowledge and tries to blackmail her."
}, {
  "imdbId" : "0077097",
  "season" : "2",
  "episodeNumber" : "22",
  "title" : "Filthy Pictures: Part 2",
  "description" : "After the nude photos of Jennifer and the blackmail plot is revealed, the radio staff tries to recover the photos and negatives from the unscrupulous photographer."
}, {
  "imdbId" : "0077097",
  "season" : "2",
  "episodeNumber" : "23",
  "title" : "Venus Rising",
  "description" : "Venus is offered a job as Program Director at another radio station. At WREQ, he finds the programs are auto run programming and he does not have to do anything. They only want him as an affirmative action hire."
}, {
  "imdbId" : "0077097",
  "season" : "2",
  "episodeNumber" : "24",
  "title" : "Most Improved Station",
  "description" : "At an award ceremony for radio stations, Johnny is selected the most popular personality, but the station loses in the most improved station category. At work, everyone starts bickering over everything and they have to work out their issues."
}, {
  "imdbId" : "0077097",
  "season" : "3",
  "episodeNumber" : "1",
  "title" : "The Airplane Show",
  "description" : "Les has long been jealous that WPIG has the only traffic news helicopter in Cincinnati, such a helicopter which Andy had promised Les when he first got hired, which has yet to materialize, and which Andy now admits won't. As such, Les hires penny-pinching crop duster Buddy Barker to fly him over the skies of Cincinnati in his biplane so that Les can report the traffic live. This act, which Les didn't clear with either Mr. Carlson or Andy, has him literally grounded and figuratively chained to his desk by Mr. Carlson, in the station not being able to handle the ..."
}, {
  "imdbId" : "0077097",
  "season" : "3",
  "episodeNumber" : "2",
  "title" : "Jennifer Moves",
  "description" : "Jennifer buys a large house in a quiet suburb and asks the WKRP staffers to help her move. While moving furniture into an upper room Les hears demonic voices, and a telephone installation man appears to be a lot more sinister than he should be. Mr. Carlson has problems trying to get Jennifer's piano into the house and Jennifer begins to have second thoughts about her purchase."
}, {
  "imdbId" : "0077097",
  "season" : "3",
  "episodeNumber" : "3",
  "title" : "Real Families",
  "description" : "The Tarlek family is profiled on \"Real Families\". Herb and people being interviewed seem rehearsed, so the producers of the show \"dig deep\" and expose the real Tarlek family."
}, {
  "imdbId" : "0077097",
  "season" : "3",
  "episodeNumber" : "4",
  "title" : "The Baby",
  "description" : "Mr Carlson's wife Carmen goes into labor and he is terrified at being with her in the delivery room. The radio staff goes to the hospital to support him."
}, {
  "imdbId" : "0077097",
  "season" : "3",
  "episodeNumber" : "5",
  "title" : "Hotel Oceanview",
  "description" : "WKRP books a meeting room at the Hotel Oceanview in Dayton, to entice the Vicki Von Vicki Jeans company to advertise with them. Andy has problems with the slide projector while Mr. Carlson worries about the Dayton poisoner and whether he will be the next victim. Herb is pleasantly surprised when Ms. Vicki's personal assistant comes on to him, but his happiness is short-lived when he finds out her secret."
}, {
  "imdbId" : "0077097",
  "season" : "3",
  "episodeNumber" : "6",
  "title" : "A Mile in My Shoes",
  "description" : "Andy tells Herb to collect past due bills from sales clients. But Herb is called for jury duty so Andy takes over the sales department. Andy finds out just how hard it is to deal with the clients. Venus becomes acting Programming Director."
}, {
  "imdbId" : "0077097",
  "season" : "3",
  "episodeNumber" : "7",
  "title" : "Bah, Humbug",
  "description" : "Mr Carlson eats one of Johnny's special brownies and falls asleep at the station. He has a Christmas Carol dream about being a Scrooge for not giving the radio staff a Christmas bonus."
}, {
  "imdbId" : "0077097",
  "season" : "3",
  "episodeNumber" : "8",
  "title" : "Baby, It's Cold Inside",
  "description" : "The heat has gone out at the Flimm Building. But Johnny (Hessman) has ideas of his own on how to keep his co-workers warm."
}, {
  "imdbId" : "0077097",
  "season" : "3",
  "episodeNumber" : "9",
  "title" : "The Painting",
  "description" : "Bailey and Herb attended the auction at Mr Carlson's church. Bailey loved one painting, and Herb purchased it. Herb tries to re-sell it to Bailey but she cannot afford it. Then Herb learns it might be valuable and thinks of becoming rich."
}, {
  "imdbId" : "0077097",
  "season" : "3",
  "episodeNumber" : "10",
  "title" : "Daydreams",
  "description" : "Mr Carlson has to give a speech at a Broadcasters Dinner, so he rehearses his speech at work. It is boring, so everyone starts to daydream. Each of them think about the job they would rather have than working at the station."
}, {
  "imdbId" : "0077097",
  "season" : "3",
  "episodeNumber" : "11",
  "title" : "Frog Story",
  "description" : "Herb accidentally sprayed his daughter's pet frog pink, and brings it into the station in hopes someone will know how to fix it before his daughter finds out. The frog does not look healthy."
}, {
  "imdbId" : "0077097",
  "season" : "3",
  "episodeNumber" : "12",
  "title" : "Venus and the Man",
  "description" : "The station's cleaning lady asks Venus a favor. Her son wants to drop out of high school. She wants Venus to talk to her son, a gang member, about staying in school. Venus bets the boy he can make learning more interesting."
}, {
  "imdbId" : "0077097",
  "season" : "3",
  "episodeNumber" : "13",
  "title" : "Dr. Fever and Mr. Tide: Part 1",
  "description" : "Johnny will host a rock and roll dance show to earn extra money. He thinks he is going to be able to do the show his way but he finds he has to wear their outfits and play their songs. He creates a new personality, Rip Tide, to do the show."
}, {
  "imdbId" : "0077097",
  "season" : "3",
  "episodeNumber" : "14",
  "title" : "Dr. Fever and Mr. Tide: Part 2",
  "description" : "After creating a Rip Tide personality to do a dance show on TV, the new personality starts taking over Johnny Fever's life. Herb tries to take advantage of it by marketing Rip Tide, while the others help him drop the act."
}, {
  "imdbId" : "0077097",
  "season" : "3",
  "episodeNumber" : "15",
  "title" : "Ask Jennifer",
  "description" : "The station starts a phone-in advice show, and Jennifer eventually proves to be the best host for it."
}, {
  "imdbId" : "0077097",
  "season" : "3",
  "episodeNumber" : "16",
  "title" : "I Am Woman",
  "description" : "Mr Carlson is notified the radio station building is being torn down. Bailey campaigns to have the building declared a landmark. Mr Carlson's mother promises a better station will be built, so he campaigns against the landmark status."
}, {
  "imdbId" : "0077097",
  "season" : "3",
  "episodeNumber" : "17",
  "title" : "Secrets of Dayton Heights",
  "description" : "Les is prepared to attend a presidential press conference, but finds his credentials are being questioned. The Secret Service uncovered the fact that his biological father was a communist."
}, {
  "imdbId" : "0077097",
  "season" : "3",
  "episodeNumber" : "18",
  "title" : "Out to Lunch",
  "description" : "Bailey is upset when it seems everyone else has an expense account for lunches except her. Meanwhile, Herb has been having a lot of lunches with clients and having a lot of drinks to help close a deal. His drinking gets out of hand."
}, {
  "imdbId" : "0077097",
  "season" : "3",
  "episodeNumber" : "19",
  "title" : "A Simple Little Wedding",
  "description" : "Arthur and Carmen's 25th wedding anniversary is approaching and they plan to have the wedding ceremony they never had because their marriage was an elopement. Unfortunately, Mama Carlson has her own plans for their ceremony."
}, {
  "imdbId" : "0077097",
  "season" : "3",
  "episodeNumber" : "20",
  "title" : "Nothing to Fear But...",
  "description" : "While Johnny does a night stint on the radio, the station is robbed. No one is hurt, but a lot of the expensive items are taken. Mr Carlton installs a security system and everyone starts being paranoid."
}, {
  "imdbId" : "0077097",
  "season" : "3",
  "episodeNumber" : "21",
  "title" : "Til Debt Do Us Part",
  "description" : "Johnny welcomes the chance to end his alimony payments...until he meets his ex-wife's intended."
}, {
  "imdbId" : "0077097",
  "season" : "3",
  "episodeNumber" : "22",
  "title" : "Clean Up Radio Everywhere",
  "description" : "A preacher with Clean Up Radio Everywhere wants WKRP to stop playing specific songs due to the lyrics. Mr. Carlson thinks the station should cooperate, while the rest say the songs are classics and shouldn't be subjected to censorship."
}, {
  "imdbId" : "0077097",
  "season" : "4",
  "episodeNumber" : "1",
  "title" : "An Explosive Affair: Part 1",
  "description" : "In the first of this two-part episode, WKRP receives a terrorist bomb threat."
}, {
  "imdbId" : "0077097",
  "season" : "4",
  "episodeNumber" : "2",
  "title" : "An Explosive Affair: Part 2",
  "description" : "Conclusion of two-part series. WKRP receives a terrorist bomb threat."
}, {
  "imdbId" : "0077097",
  "season" : "4",
  "episodeNumber" : "3",
  "title" : "The Union",
  "description" : "When the staff plans to unionize, Carlson's mother (Bruce) threatens to sell the station."
}, {
  "imdbId" : "0077097",
  "season" : "4",
  "episodeNumber" : "4",
  "title" : "Rumors",
  "description" : "Johnny's apartment is being fumigated and he needs a place to stay. Everyone turns him down except for Bailey. Rumors start at the office that they are having an affair. Johnny is also afraid the new DJ will take over his radio time slot."
}, {
  "imdbId" : "0077097",
  "season" : "4",
  "episodeNumber" : "5",
  "title" : "Straight from the Heart",
  "description" : "Les is being given an award for a news broadcast. Herb is going on vacation, but Jennifer is worried when Herb takes insurance papers with him. He checks into a hospital for heart tests and asks Les to stay with him. They go to a porn movie."
}, {
  "imdbId" : "0077097",
  "season" : "4",
  "episodeNumber" : "6",
  "title" : "Who's on First?",
  "description" : "With Herb in the hospital, Mr. Carlson must fill in for him in order to negotiate a contract. But if Mr. Carlson is Herb, who is Mr. Carlson? In the meantime, Johnny avoids settling a poker debt."
}, {
  "imdbId" : "0077097",
  "season" : "4",
  "episodeNumber" : "7",
  "title" : "Three Days of the Condo",
  "description" : "When Johnny comes into a large amount of money, everyone at the station is curious to see what he will do with it."
}, {
  "imdbId" : "0077097",
  "season" : "4",
  "episodeNumber" : "8",
  "title" : "Jennifer and the Will",
  "description" : "When an elderly gentleman friend of Jennifer's dies, the man's family blames her for stealing his fortune."
}, {
  "imdbId" : "0077097",
  "season" : "4",
  "episodeNumber" : "9",
  "title" : "The Consultant",
  "description" : "Mother Carlson hires a radio doctor to evaluate the station and Andy worries when the doctor threatens to write a poor review if the station doesn't buy his services."
}, {
  "imdbId" : "0077097",
  "season" : "4",
  "episodeNumber" : "10",
  "title" : "Love, Exciting and New",
  "description" : "Andy wants a new transmitter for the station, and visits Mrs Carlson to ask for it. Andy ends up taking her out to discuss business, but she seems to want more than that."
}, {
  "imdbId" : "0077097",
  "season" : "4",
  "episodeNumber" : "11",
  "title" : "You Can't Go Out of Town Again",
  "description" : "Arthur and Carmen attend his college reunion. He finds out their first date was because someone dared her to go out with him. Bailey wants to get a computer for billing. Venus tries to impress a new date."
}, {
  "imdbId" : "0077097",
  "season" : "4",
  "episodeNumber" : "12",
  "title" : "Pills",
  "description" : "The station sells some new commercial spots to a diet company whose 'magic pills' are not as innocuous as they seem."
}, {
  "imdbId" : "0077097",
  "season" : "4",
  "episodeNumber" : "13",
  "title" : "Changes",
  "description" : "Herb decides it's time for a change in his wardrobe and enlists Jennifer to help him. Meanwhile, Venus is interviewed by a Black magazine."
}, {
  "imdbId" : "0077097",
  "season" : "4",
  "episodeNumber" : "14",
  "title" : "Jennifer and Johnny's Charity",
  "description" : "A fire at the Vine Street Mission that destroys the kitchen. Johnny starts a donation fund and asks Jennifer to ask her wealthy friends to contribute. She throws a party and all goes well -until the homeless show up to show their gratitude."
}, {
  "imdbId" : "0077097",
  "season" : "4",
  "episodeNumber" : "15",
  "title" : "I'll Take Romance",
  "description" : "Herb sets Les up with a blind date through his latest client. Les enjoys the date, but does not realize the Ill Take Romance Dating Service is actually a front for prostitution."
}, {
  "imdbId" : "0077097",
  "season" : "4",
  "episodeNumber" : "16",
  "title" : "Circumstantial Evidence",
  "description" : "Venus' girlfriend gives him a diamond earring, and then excuses herself from the room and leaves. While he wonders where she went, the police visit the station and question Venus. The earring was stolen, and they think Venus is the thief."
}, {
  "imdbId" : "0077097",
  "season" : "4",
  "episodeNumber" : "17",
  "title" : "Fire",
  "description" : "A fire alarm sends the crew home early, However Herb and Jennifer get trapped on the elevator going down. Herb then tells Jennifer some rumors that he has been spreading about them being together."
}, {
  "imdbId" : "0077097",
  "season" : "4",
  "episodeNumber" : "18",
  "title" : "Dear Liar",
  "description" : "When Les jealously plagiarizes Bailey's initial draft of a partially fictional news story on air, the station's broadcast license is put in jeopardy."
}, {
  "imdbId" : "0077097",
  "season" : "4",
  "episodeNumber" : "19",
  "title" : "The Creation of Venus",
  "description" : "While Andy and Venus are playing jokes on each other at the radio station, Mama Carlson visits and then quizzes them. Venus lets it slip he used to be a teacher. Andy and Venus tell the story of how Venus went from school teacher to DJ."
}, {
  "imdbId" : "0077097",
  "season" : "4",
  "episodeNumber" : "20",
  "title" : "The Impossible Dream",
  "description" : "Les' mother is visiting, and complains that Les is in a dead-end job. Les decides he is going to follow his dream and apply for a job at CBS for the evening news in New York."
}, {
  "imdbId" : "0077097",
  "season" : "4",
  "episodeNumber" : "21",
  "title" : "To Err Is Human",
  "description" : "When an ad for one of the station's sponsors that's supposed to have Venus somehow ends up with Herb because Herb placed a picture of himself along with the pictures of Venus and said to use the man with him thinking it's one of Venus. So the sponsor wants to drop them. Jenniffer offers to go and talk to the man using her wiles to convince him not to but only problem is the man is blind."
}, {
  "imdbId" : "0077097",
  "season" : "4",
  "episodeNumber" : "22",
  "title" : "Up and Down the Dial",
  "description" : "Mama Carlson announces plans to change WKRP's format."
}]