[{
  "imdbId" : "4383082",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Magic Bullets",
  "description" : "The search for a \"cure\" for cancer is the greatest epic in the history of science, spanning centuries and continents. This episode follows that centuries-long search, but centers on the story of Sidney Farber, who, defying conventional wisdom in the late 1940s, introduces the modern era of chemotherapy, eventually galvanizing a \"war on cancer.\" Interwoven with Farber's narrative is the contemporary story of a 14-month-old diagnosed with T-cell acute lymphoblastic leukemia. The film follows her as she and her parents struggle with the many hardships and decisions ..."
}, {
  "imdbId" : "4383082",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Ep Two: The Blind Men and the Elephant",
  "description" : "This episode picks up the story in the wake of the declaration of a \"war on cancer\" by Richard Nixon in 1971 and the search for a cure. In the lab, rapid progress is made in understanding the essential nature of the cancer cell, leading to the revolutionary discovery of the genetic basis of cancer, but few new therapies become available. Not until the late 1990s do advances in research begin to translate into more precise targeted therapies with breakthrough drugs. Following the history during these fraught decades, the film intertwines the contemporary story of an ..."
}, {
  "imdbId" : "4383082",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Finding an Achilles Heel",
  "description" : "This episode starts at a moment of optimism: Scientists believe they have cracked the mystery of the malignant cell, and the first targeted therapies have been developed. But very quickly cancer reveals new layers of complexity and a formidable array of defenses. Many call for a new focus on prevention and early detection as the most promising fronts in the war on cancer. By the second decade of the 2000s, the bewildering complexity of the cancer cell yields to a more ordered picture, revealing new vulnerabilities and avenues of attack. Perhaps most exciting is the ..."
}]