[{
  "imdbId" : "1492179",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Iraq: Part One",
  "description" : "John Porter leads his unit into battle trying to rescue the CEO of a British weapons manufacturing company captured in Iraq, just before the invasion started. His team is joined by Hugh Collinson, operative of British military intelligence. The operation almost goes awry when Collinson kills larger portion of Porter's team, and blames a teenage suicide bomber, As'ad, Porter previously saved. The surviving members of the team manage to rescue their target, and Porter rejects Collinson's offer to joint Section 20, a new unit within military intelligence, doubting ..."
}, {
  "imdbId" : "1492179",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Iraq: Part Two",
  "description" : "Seven years after the events of part one, Porter is reactivated and tasked with rescuing a kidnapped reporter Katie Dartmouth. Porter realizes that Katie was kidnapped by the same terrorists he fought seven years before, including that teenager, now a young man. He succeeds in saving Katie's life, but fails to rescue As'ad after Collinson orders the rescue helicopter crew not to allow the rescue of As'ad. Just before the helicopter arrives, As'ad tells porter that Collinson killed those soldiers and covered it up by blaming him."
}, {
  "imdbId" : "1492179",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Zimbabwe: Part One",
  "description" : "A sniper attempts to kill the President of Zimbabwe. Since there is evidence that the sniper could be British, Porter is sent in undercover to locate the sniper and silence him."
}, {
  "imdbId" : "1492179",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Zimbabwe: Part Two",
  "description" : "A sniper attempts to kill the President of Zimbabwe. Since there is evidence that the sniper could be British, Porter is sent in undercover to locate the sniper and silence him."
}, {
  "imdbId" : "1492179",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Afghanistan: Part One",
  "description" : "Porter is sent to Afghanistan to find a computer hacker who has cracked the British army's missile guidance codes. The hacker has successfully found a way to redirect missiles to strike American forces."
}, {
  "imdbId" : "1492179",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Afghanistan: Part Two",
  "description" : "Porter is sent to Afghanistan to find a computer hacker who has cracked the British army's missile guidance codes. The hacker has successfully found a way to redirect missiles to strike American forces."
}, {
  "imdbId" : "1492179",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "Project Dawn #1",
  "description" : "British sergeant Michael Stonebridge recruits help from Ex-Delta Force operative Damien Scott when Section 20 agent John Porter is kidnapped by a Pakistani terrorist. The two then uncover clues to a possible terrorist attack at a New Delhi hotel and race to foil it."
}, {
  "imdbId" : "1492179",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "Project Dawn: Part 2",
  "description" : "Scott and Stonebridge discover that the terrorists in the hotel are searching for Mahmood. Grant learns that Latif's real goal is to capture a Pakistani chemical scientist who worked with the weapons inspection team in Iraq in 2003."
}, {
  "imdbId" : "1492179",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "Project Dawn: Part 3",
  "description" : "Stonebridge, Scott, and Marshall stake out a trio of suspects in South Africa who might have some information about Latif. Ex-IRA leader, Daniel Connolly heists an armored truck in Cape Town."
}, {
  "imdbId" : "1492179",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "Project Dawn: Part 4",
  "description" : "At a remote facility outside Cape Town, Connolly closes in on his WMD prize, while Stonebridge and Scott are faced with dilemmas that could have far-reaching implications on their organization - and on the thread that connects them to Latif."
}, {
  "imdbId" : "1492179",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "Project Dawn: Part 5",
  "description" : "Stonebridge and Scott pose as aides for arms dealer Gerald Crawford to negotiate the release of hostage, Dr. Clare Somersby."
}, {
  "imdbId" : "1492179",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "Project Dawn: Part 6",
  "description" : "The first attempt to rescue Clare ends with Scott in the hospital and Stonebridge in pursuit with Crawford and Jacoub. Tahir takes Clare to a Janjaweed camp. Soldiers look for Scott at the hospital. Grant threatens Maggie about her story."
}, {
  "imdbId" : "1492179",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "Project Dawn: Part 7",
  "description" : "Stonebridge and Scott go to Kosovo to exchange a prisoner for kidnapped European Union officials."
}, {
  "imdbId" : "1492179",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "Project Dawn #8",
  "description" : "Scott and Stonebridge are held captive with the four EU hostages in the wilderness of Kosovo. Hasani plans to sell Dana as a sex slave, and Allen, the double agent who has been providing information to Latif."
}, {
  "imdbId" : "1492179",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "Project Dawn: Part 9",
  "description" : "The boys are called away after MI5 team traced Latif to Chechen rebels country hideout, which turns out to be an abandoned vast Soviet area tunnel complex. They go in with support from Georgian commandos, which are eliminated by explosives. Latif escapes with some cahoots, who were screened for surgery. Some turn up in Budapest, where a world security summit is held, carrying the neuro-toxin and sophisticated bomb found in the tunnels. Damien also found indications of foul play since his Iraq set-up army booting."
}, {
  "imdbId" : "1492179",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "Project Dawn: Part 10",
  "description" : "Latif is finally in Section 20's clutches. The team frantically tries to discover the bombers' target and for that they need Latif to talk. Scott and Stonebridge go after the bombers. Latif's henchmen attack Section 20 command."
}, {
  "imdbId" : "1492179",
  "season" : "3",
  "episodeNumber" : "1",
  "title" : "Vengeance, Part 1",
  "description" : "Season 3 finds Scott and the mysterious agent Rachel Dalton in the Kenyan desert securing the transfer of a Libyan functionary seeking asylum. Back in Britain, Stonebridge is training Section 20 recruits. Nothing goes as planned for either of them."
}, {
  "imdbId" : "1492179",
  "season" : "3",
  "episodeNumber" : "2",
  "title" : "Vengeance, Part 2",
  "description" : "Taken hostage in Mogadishu by Waabri and his girlfriend Asmara, Scott and Dalton escape with the help of Stonebridge and Richmond. Sinclair is replaced as leader of Section 20. Michael and Kerry rekindle their relationship."
}, {
  "imdbId" : "1492179",
  "season" : "3",
  "episodeNumber" : "3",
  "title" : "Vengeance, Part 3",
  "description" : "Still tracking down the triggers in Algeria, Scott and Stonebridge ally with Markunda, an exotic leader of a nomadic tribe to catch Othmani, the brother of an Al Qaeda leader, El Soldat."
}, {
  "imdbId" : "1492179",
  "season" : "3",
  "episodeNumber" : "4",
  "title" : "Vengeance, Part 4",
  "description" : "El Soldat's forces are preparing to assault the farmhouse where Stonebridge, Scott, Markunda, and Othmani are holed up. Sinclair continues to question Dalton's command style. Karl Matlock continues to make inroads to acquire the triggers."
}, {
  "imdbId" : "1492179",
  "season" : "3",
  "episodeNumber" : "5",
  "title" : "Vengeance: Part 5",
  "description" : "Section 20 races to intercept a former South African nuclear scientist, Peter Evans, from Matlock. At the airport, they run into a team of Mossad agents who want to kill Evans. Section 20 learns that Knox is behind loss of the triggers."
}, {
  "imdbId" : "1492179",
  "season" : "3",
  "episodeNumber" : "6",
  "title" : "Vengeance: Part 6",
  "description" : "Stonebridge's mistake allows Matlock to capture Evans. He makes amends by enlisting Ava Knox to go against her father. Sullivan tries to convince Rebecca to leave Mossad."
}, {
  "imdbId" : "1492179",
  "season" : "3",
  "episodeNumber" : "7",
  "title" : "Vengeance: Part 7",
  "description" : "Political prisoner and former Zimbabwe leader Walter Lutulu is broken out of prison by Matlock. Section 20 is breached and its members imprisoned with dire consequences."
}, {
  "imdbId" : "1492179",
  "season" : "3",
  "episodeNumber" : "8",
  "title" : "Vengeance: Part 8",
  "description" : "Lilian Lutulu learns who orchestrated her father's assassination. Scott makes a promise to her to kill Knox. Down one critical person on the team, Section 20 raids Knox's camp in an attempt to retrieve the triggers."
}, {
  "imdbId" : "1492179",
  "season" : "3",
  "episodeNumber" : "9",
  "title" : "Vengeance: Part 9",
  "description" : "Stonebridge warns he can't guarantee to regain control over his obsession with wife-killer Craig, but is told he's too invaluable for the team to consider expulsion, especially to balance maverick Scott in duo operations. One of the now assembled warheads is precipitously transported by the client, South Nigerian anti-western rebels, represented by reputable lawyer Christian Lucas, and explodes in a township when arrested by shooting police. Damien still hopes on collaboration with CIA renegade Christy, but it becomes clear she sold out to the terrorists."
}, {
  "imdbId" : "1492179",
  "season" : "3",
  "episodeNumber" : "10",
  "title" : "Vengeance: Part 10",
  "description" : "Knox turns on his incompetent Nigerian partners, allowing the to be arrested, and even on his own security chief, who protest at abandoning the strong Africa project. Mike gets his confrontation with Craig but spares his life, while a female officer is killed. The nuclear bombs are traced to Cairo, this time for financial blackmail purposes."
}, {
  "imdbId" : "1492179",
  "season" : "3",
  "episodeNumber" : "11",
  "title" : "Strike Back: Locked & Reloaded",
  "description" : "Strike Back: Locked & Reloaded is a 30 minute preview of the hotly anticipated upcoming series \"Strike Back: Vengeance\", starring Phillip Winchester, Sullivan Stapleton and Rhona Mitra, which explores the making of this explosive military drama."
}, {
  "imdbId" : "1492179",
  "season" : "4",
  "episodeNumber" : "1",
  "title" : "Shadow Warfare: Part 1",
  "description" : "A Section 20 operation in the Beqaa Valley goes badly resulting in Baxter's death. Stonebridge and Scott are enjoying a well-deserved vacation. Recalled to duty, they team up with Kim Martinez to track and capture the killer in Colombia."
}, {
  "imdbId" : "1492179",
  "season" : "4",
  "episodeNumber" : "2",
  "title" : "Shadow Warfare: Part 2",
  "description" : "After the Kamali escape, Section 20 tries to capture him by breaking into his safety deposit box in a downtown Bogata bank. Dalton continues to track down the people in Beirut who gave her up."
}, {
  "imdbId" : "1492179",
  "season" : "4",
  "episodeNumber" : "3",
  "title" : "Shadow Warfare: Part 3",
  "description" : "Section 20 tracks facilitator James Leatherby in Beirut. They continue to use Kamali in operations on al-Zuhari and Leatherby. Dalton is making bad decision due to her emotions over Baxter's death. Section 20 acts on tips about al-Zuhari."
}, {
  "imdbId" : "1492179",
  "season" : "4",
  "episodeNumber" : "4",
  "title" : "Shadow Warfare: Part 4",
  "description" : "Leatherby takes Kamali's daughter, Ester, hostage. Section 20 attempts a brazen rescue mission to get her back. Dalton tortures and interrogates Sofia for information. The escape ruse that Kamali and Dalton use has surprising consequences."
}, {
  "imdbId" : "1492179",
  "season" : "4",
  "episodeNumber" : "5",
  "title" : "Shadow Warfare: Part 5",
  "description" : "The tracking of McKenna leads Section 20 to Budapest; At Dalton's funeral, Richmond learns that she has a son. Twenty acquires an optic drive with a message from al-Zuhari about an attack. It seems the IRA and Al-Zuhari have joined forces."
}, {
  "imdbId" : "1492179",
  "season" : "4",
  "episodeNumber" : "6",
  "title" : "Shadow Warfare: Part 6",
  "description" : "The IRA and the Muslim terrorist interrogate Locke. They want the new protocols for NATO. While Section 20 is closing in on the terrorist base, the IRA planning its own attack on the British Embassy."
}, {
  "imdbId" : "1492179",
  "season" : "4",
  "episodeNumber" : "7",
  "title" : "Shadow Warfare: Part 7",
  "description" : "Decoding the NATO hard drive would breach all NATO security. Scott and Stonebridge go undercover in a Russian prison to prevent a hacker from breaching the firewalls of the hard drive. Stonebridge continues to struggle with his focus."
}, {
  "imdbId" : "1492179",
  "season" : "4",
  "episodeNumber" : "8",
  "title" : "Shadow Warfare: Part 8",
  "description" : "Though weaker, Stonebridge gets direct knowledge of Al-Zuhari's plan. Still imprisoned at Black Bear, Scott looks for an escape. Suspicions about Kamali continue to mount. Ulyanov's vendetta against Scott and Stonebridge intensifies."
}, {
  "imdbId" : "1492179",
  "season" : "4",
  "episodeNumber" : "9",
  "title" : "Shadow Warfare: Part 9",
  "description" : "With the death of Leo, Ester needs protection. Scott and Stonebridge keep their promise. Richmond and Martinez follow up on intelligence gained from facility workers. Section 20 attempts to stop a train before it reaches a populated area."
}, {
  "imdbId" : "1492179",
  "season" : "4",
  "episodeNumber" : "10",
  "title" : "Shadow Warfare: Part 10",
  "description" : "Kamali is alive. He fooled everyone when he faked his death. Locke makes a deal with Ulyanov to capture Kamali. Kamali's team attempts to deploy the weapon at Ramstein AFB. Stonebridge and Scott have many important decisions to make."
}, {
  "imdbId" : "1492179",
  "season" : "5",
  "episodeNumber" : "1",
  "title" : "Legacy: Part 1",
  "description" : "A friend of Locke needs section 20's help when his daughter is kidnapped."
}, {
  "imdbId" : "1492179",
  "season" : "5",
  "episodeNumber" : "2",
  "title" : "Legacy: Part 2",
  "description" : "Scott and Mike continue to look for the ones responsible for the embassy bombing. The ambassador recovers in hospital with Chloe and his wife beside him. Mike still recovering from the sore shoulder takes on desk command while Scott and Philip go out to get Ray McQueen back from the corrupt police. Ray will only talk with his wife safe."
}, {
  "imdbId" : "1492179",
  "season" : "5",
  "episodeNumber" : "3",
  "title" : "Legacy: Part 3",
  "description" : "As Locke realises his long-term friend is working with the dangerous Yakuza and Office 39, Scott must protect his son when they come under enemy fire."
}, {
  "imdbId" : "1492179",
  "season" : "5",
  "episodeNumber" : "4",
  "title" : "Legacy: Part 4",
  "description" : "Scott provides some parental advice to his son, while the rest of Section 20 attempt to locate Mei Foster. At the same time, Section 20 accepts an uneasy alliance with a pair of CIA mercenaries who are only interested in Shiro. The team attempts to stop Mei, while Scott races towards the action on a stolen motorcycle."
}, {
  "imdbId" : "1492179",
  "season" : "5",
  "episodeNumber" : "5",
  "title" : "Legacy: Part 5",
  "description" : "Scott and Stonebridge sneak into North Korea to destroy a factory where the vanadium is being processed. Finn is kidnapped. After destroying the factory Scott and Stonebridge surrender because Mei threatens to kill Finn."
}, {
  "imdbId" : "1492179",
  "season" : "5",
  "episodeNumber" : "6",
  "title" : "Legacy: Part 6",
  "description" : "Whitehall denies the existence of Scott and Stonebridge. Locke enlists the help of an old Russian friend to rescue his team. Li-Na uses Finn to coerce a confession."
}, {
  "imdbId" : "1492179",
  "season" : "5",
  "episodeNumber" : "7",
  "title" : "Legacy: Part 7",
  "description" : "The team head for Vienna following the lead on Li-Na & Kwon. From Nina's agent they get details of a meeting between Kwon and someone from Locke's past. They observe the meeting but things do not go according to plan."
}, {
  "imdbId" : "1492179",
  "season" : "5",
  "episodeNumber" : "8",
  "title" : "Legacy: Part 8",
  "description" : "Scott and Stonebridge chase Li-Na and Kwon and attempt to rescue Pirogova. Locke encounters \"Oppenheimer\" again and must decide his fate. Scott and Stonebridge discover Li-Na and Kwon's intended target with codes."
}, {
  "imdbId" : "1492179",
  "season" : "5",
  "episodeNumber" : "9",
  "title" : "Legacy: Part 9",
  "description" : "The Section 20 team is showing no signs of fatigue after their cross-global mission to track down slippery North Korean terrorist, Li-Na. Always one step ahead of his British bosses, instinct-driven Lt. Colonel Locke takes his team rogue once more as they defy Whitehall and travel to Geneva where he is convinced Li-Na and Kwon are preparing to attack the United Nations HQ."
}, {
  "imdbId" : "1492179",
  "season" : "5",
  "episodeNumber" : "10",
  "title" : "Legacy: Part 10",
  "description" : "A group of mercenaries led by Faber and Mason, pursue Scott and Stonebridge as they seek payback."
}, {
  "imdbId" : "1492179",
  "season" : "6",
  "episodeNumber" : "1",
  "title" : "Retribution: Part 1",
  "description" : "After a disastrous failed hand-over from a independent Syrian liberation army unit, of the terrorist, \"Omair Idrisi\", Sergeant Daniel \"Mac\" Macallister, is imprisoned facing a court marshal for hitting his superior officer. Because of the failed hand-over mission, Col. Adeena Donovan, MI6, re-establish the disbanded \"Section 20\" unit. Mac, is offered a chance to join this new unit. He is quickly set on mission to recruit \"Sergeant Samuel Wyatt\", a deniable American operator, in captivity by General Farid. During the rescue/recruit mission, other new \"Section 20\" ..."
}, {
  "imdbId" : "1492179",
  "season" : "6",
  "episodeNumber" : "2",
  "title" : "Retribution: Part 2",
  "description" : "Mac, Wyatt and the gang pursue Idrisi and his radicalized British wife. They seek to track him down via an arms dealer who just made a delivery to the cell leader, and was shot down by the same to get rid of loose ends. The crew from Section 20 rescues the arms dealer to find out what weapons he delivered and where Idrisi is. Later, when attacking Idrisi's compound, the US military gets involved, launching a bunker buster missile and putting the team in harms way."
}, {
  "imdbId" : "1492179",
  "season" : "6",
  "episodeNumber" : "3",
  "title" : "Retribution: Part 3",
  "description" : "As Jane Lowry surfaces in Budapest, Mac and Wyatt are forced to go undercover to infiltrate a dangerous group of white supremacists that has something she needs."
}, {
  "imdbId" : "1492179",
  "season" : "6",
  "episodeNumber" : "4",
  "title" : "Retribution: Part 4",
  "description" : "Mac and Dr. Markov are taken by white supremacist Josef and Rosa Varga to a secret militia base. Jane Lowery targets Col. Donovan. Wyatt whines about being stabbed. Section 20 takes bold steps rescue Mac and Markov."
}, {
  "imdbId" : "1492179",
  "season" : "6",
  "episodeNumber" : "5",
  "title" : "Retribution: Part 5",
  "description" : "With Markov taken by Jane Lowry, Section 20 track them down to a drug lord's mansion. Section 20 carry out a plan to stop Lowry and Markov from unleashing a deadly chemical weapon or the whole world will be at their demise."
}, {
  "imdbId" : "1492179",
  "season" : "6",
  "episodeNumber" : "6",
  "title" : "Retribution: Part 6",
  "description" : "Lowry and Borisovich continue their cat and mouse games with each other and with Section 20. As 20 closes in on Lowry and Markov, Lowry initiates a plan to set off a device in an airport. Reynolds emotes about her actions."
}, {
  "imdbId" : "1492179",
  "season" : "6",
  "episodeNumber" : "7",
  "title" : "Retribution: Part 7",
  "description" : "It's Section 20 v Jane Lowry in a race to get to Omair Idrisi. It's a mission that hurls comms officer Jensen into extreme danger."
}, {
  "imdbId" : "1492179",
  "season" : "6",
  "episodeNumber" : "8",
  "title" : "Retribution: Part 8",
  "description" : "As Lowry makes her play to rescue Idrisi from the Col. Parker's black site, Section 20 races to get him first. Jensen stoically recovers from his wounds. Reynolds continues to believe Donovan is hiding something important to the mission."
}, {
  "imdbId" : "1492179",
  "season" : "6",
  "episodeNumber" : "9",
  "title" : "Retribution: Part 9",
  "description" : "The team learns about Colonel Donovan's involvement in Project Tenebrae. Waves of PMC soldiers trying to recapture Idrisi have a running, driving, and shooting battle with Section 20. Donovan and Lowry have another face to face encounter."
}, {
  "imdbId" : "1492179",
  "season" : "6",
  "episodeNumber" : "10",
  "title" : "Retribution: Part 10",
  "description" : "The Russians are coming. Ives loses Idrisi to Russian agents. Twenty goes after the Atlas of covert British agents that Lowry stole and later hid. Stonebridge and Scott's surprise return aids Section 20 in a bold plan."
}]