[{
  "imdbId" : "0115151",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "The Awakening (Pilot)",
  "description" : "Idealistic couple John Loengard and his girlfriend Kim Sayers arrive in Washington DC to work for the Kennedys. However, John's world shatters when he gets reassigned to Project Blue Book and uncovers an alien conspiracy."
}, {
  "imdbId" : "0115151",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Moving Targets",
  "description" : "Following the assassination of President Kennedy, John learns more about the alien invasion as he and Kim struggle to keep the Hive from killing the world leaders attending the state funeral."
}, {
  "imdbId" : "0115151",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Mercury Rising",
  "description" : "Compelled by a series of strange dreams, Kim locates an astronaut she saw aboard the alien spacecraft."
}, {
  "imdbId" : "0115151",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Dark Days Night",
  "description" : "Loengard and Sayers uncover a Hive plot to use"
}, {
  "imdbId" : "0115151",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Dreamland",
  "description" : "John and Kim come across the eccentric Howard Hughes while investigating a Hive operation in Las Vegas."
}, {
  "imdbId" : "0115151",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Inhuman Nature",
  "description" : "John and Kim uncover a Hive plot that uses livestock to breed new members."
}, {
  "imdbId" : "0115151",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Ancient Future",
  "description" : "Loengard and Sayers uncover the connection between the 1964 Alaskan earthquake and a Native American legend that revolves around a buried Hive spacecraft."
}, {
  "imdbId" : "0115151",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Hostile Convergence",
  "description" : "As John investigates a UFO sighting in New Mexico, Kim steals away to be at her sister's wedding."
}, {
  "imdbId" : "0115151",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "We Shall Overcome",
  "description" : "John and Kim uncover a Hive breeding operation amidst the struggle for civil rights in Mississippi."
}, {
  "imdbId" : "0115151",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "The Last Wave",
  "description" : "John and Kim rely on a young Jim Morrison to help stop a bacteria being bred by the Hive."
}, {
  "imdbId" : "0115151",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "The Enemy Within",
  "description" : "As a spy is uncovered inside Majestic, John finds his brother being brought into the alien hive."
}, {
  "imdbId" : "0115151",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "The Warren Omission",
  "description" : "The Attorney General convinces John to tell his story to the Warren Commission."
}, {
  "imdbId" : "0115151",
  "season" : "1",
  "episodeNumber" : "13",
  "title" : "White Rabbit",
  "description" : "Bach's pursuit of the wreckage of an alien ship helps start US involvement in the Vietnam War."
}, {
  "imdbId" : "0115151",
  "season" : "1",
  "episodeNumber" : "14",
  "title" : "Shades of Gray",
  "description" : "John and Kim help draw an alien Gray into a Majestic trap."
}, {
  "imdbId" : "0115151",
  "season" : "1",
  "episodeNumber" : "15",
  "title" : "Burn, Baby, Burn",
  "description" : "During the outbreak of a race riot, Kim is brought to Los Angeles to have her baby."
}, {
  "imdbId" : "0115151",
  "season" : "1",
  "episodeNumber" : "16",
  "title" : "Both Sides Now",
  "description" : "As the aliens infiltrate the anti-Vietnam War movement, Kim must decide whether to return to the Hive."
}, {
  "imdbId" : "0115151",
  "season" : "1",
  "episodeNumber" : "17",
  "title" : "To Prey in Darkness",
  "description" : "When Majestic learns that some film that shows the aliens is missing they look for it. They eventually find the film in the possession of TV news reporter who's hoping that it could get her into more serious work. So Loengard, Juliet, and Albano proceed to CBS and inform Majestic member William Paley of the situation. When the reporter turns up dead, they have to find it. But the hive also is there."
}, {
  "imdbId" : "0115151",
  "season" : "1",
  "episodeNumber" : "18",
  "title" : "Strangers in the Night",
  "description" : "Juliet and John are sent with Major Colin Powell to investigate the collapse of the Soviet Union's counterpart to Majestic."
}, {
  "imdbId" : "0115151",
  "season" : "1",
  "episodeNumber" : "19",
  "title" : "Bloodlines",
  "description" : "Loengard offers to infiltrate the Hive's mothership to gain critical intelligence data and find his son."
}]