[{
  "imdbId" : "0221300",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Gumbo: Beginnings to 1917",
  "description" : "Jazz begins in New Orleans, 19th century America's most cosmopolitan city, where the sound of marching bands, Italian opera, Caribbean rhythms, and minstrel shows fills the streets with a richly diverse musical culture. In the 1890s, African-American musicians such as Jelly Roll Morton, Buddy Bolden and Sydney Bichet create a new music out of these ingredients. Soon after the start of the new century, people are calling it jazz."
}, {
  "imdbId" : "0221300",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "The Gift: 1917-1924",
  "description" : "Speakeasies, flappers, and easy money - it's the Jazz Age, when the story of jazz becomes a tale of two great cities, Chicago and New York, and of two extraordinary artists whose lives and music will span almost three-quarters of a century - Louis Armstrong and Duke Ellington. Armstrong grew up on the mean streets of New Orleans and moved to Chicago in 1922, inspiring a new generation of musicians. Meanwhile, Ellington outgrows the society music he learned to play in Washington D.C., and heads to Harlem."
}, {
  "imdbId" : "0221300",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Our Language: 1924 -1929",
  "description" : "In the 1920s, jazz is everywhere, and for the first time soloists and singers take center stage. We meet Bessie Smith, Empress of the Blues; Bix Beiderbecke, the first great white jazz star; and Benny Goodman and Artie Shaw, for whom jazz offers a chance to escape the ghetto and achieve their dreams. Duke Ellington appears at the Cotton Club and Louis Armstrong performs his masterpiece, \"West End Blues.\""
}, {
  "imdbId" : "0221300",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "The True Welcome: 1929-1934",
  "description" : "In 1929 as the Great Depression begins, New York is now America's jazz capital. On Broadway, Louis Armstrong revolutionizes the art of American popular song. In Harlem, Chick Webb pioneers his own big-band sound and in the city's clubs, pianists Fats Waller and Art Tatum dazzle audiences. But it is Duke Ellington who takes jazz \"beyond category,\" composing hit tunes that has critics comparing him to Stravinsky."
}, {
  "imdbId" : "0221300",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Swing: Pure Pleasure - 1935-1937",
  "description" : "As the Great Depression drags on, jazz comes as close as it has ever come to being America's popular music. It has a new name, Swing, and for millions of young fans, it will be the defining music of their generation. Benny Goodman is hailed as the \"King of Swing\" and Billie Holiday begins her career as the greatest of all female jazz singers."
}, {
  "imdbId" : "0221300",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Swing: The Velocity of Celebration - 1937-1939",
  "description" : "As the 1930's come to a close, Swing-mania is still going strong, but some fans are saying success has made the music too predictable. Count Basie and the Kansas City sound reignite the spirit of swing. By the decade's end, Duke Ellington has been hailed as a hero in Europe, amid anxious preparations for war. And weeks after that war begins, Coleman Hawkins startles the world with a glimpse of what jazz will become, improvising a new music on the old standard, \"Body and Soul.\""
}, {
  "imdbId" : "0221300",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Dedicated to Chaos: 1940-1945",
  "description" : "When America enters World War II, jazz is part of the arsenal. Bandleaders like Glenn Miller and Artie Shaw enlist, taking their swing to the troops overseas. Many black Americans, segregated at home and in uniform, find themselves fighting for liberties their own country denies them. In a Harlem club called Minton's Playhouse, a small band of young musicians, led by Dizzy Gillespie and the saxophonist Charlie Parker, has discovered a new way of playing - fast, intricate, exhilarating, and sometimes chaotic. The sound will soon be called \"bebop\" and once Americans ..."
}, {
  "imdbId" : "0221300",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Risk: 1945-1955",
  "description" : "The postwar years bring prosperity, but the Cold War threat makes these anxious years as well. In jazz, this underlying tension will be reflected in bebop, and in the troubled life of it's biggest star, Charlie Parker. Dizzy Gillespie, tries to popularize the new sound by adding showmanship and Latin rhythms, while pianist Thelonius Monk infuses it with his eccentric personality to create a music all his own. Dave Brubeck mixes jazz with classical music to produce a million-seller LP. But one man remains determined to give jazz popular appeal on his own terms, the ..."
}, {
  "imdbId" : "0221300",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "The Adventure: 1956-1960",
  "description" : "For jazz, the late 1950s is a period of transition when old stars like Billie Holiday and Lester Young will burn out while young talents arise to take the music in new directions. New virtuosos push the limits of bebop: saxophone colossus Sonny Rollins; jazz diva Sarah Vaughan; and the drummer Art Blakey. But the leading light of the era is Miles Davis whose lush recordings expand the jazz audience; and a cultural icon whose tough-guy charisma comes to define what's hip. As the turbulent Sixties arrive, two saxophonists take jazz into uncharted terrain. John Coltrane ..."
}, {
  "imdbId" : "0221300",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "A Masterpiece by Midnight: 1960 to the Present",
  "description" : "During the Sixties, jazz is in trouble. Though Louis Armstrong briefly outsells the Beatles with \"Hello Dolly,\" most jazz musicians are desperate for work and many head for Europe. In the 1970s, jazz loses the exuberant genius of Louis Armstrong and the transcendent artistry of Duke Ellington, Their passing seems to mark the end of the music itself. But in 1976, when Dexter Gordon returns from Europe for a triumphant comeback, jazz has a homecoming, too. A new generation emerges, led by trumpeter Wynton Marsalis - schooled in the music's traditions, skilled in the art..."
}]