[{
  "imdbId" : "0167720",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Pilot: Part 1",
  "description" : "The President and Vice President were killed in a terrorist attack. Now it seems that a secret branch of the government has in their possession technology from the alien landing at Roswell, and they were able to use it to create a time machine that can send someone back in time seven days. And they would like to send someone back before this happened and tell what's going to happen before it does so they can prevent it. Now all they need is someone to send back, as the trip is excruciating. Frank Parker is an ex-Navy SEAL and CIA operative who has been confined to a ..."
}, {
  "imdbId" : "0167720",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Pilot: Part 2",
  "description" : "Parker is assigned as the \"chrononaut\" for Backstep. While memorizing all the mission details, Parker discovers via TV that his son has been killed by poison gas during the attack on DC. Finally, the backstep is authorized."
}, {
  "imdbId" : "0167720",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "The Gettysburg Virus",
  "description" : "Recalled from a survival exercise, Parker has to go back to prevent the release of a virus that will devastate the world's population."
}, {
  "imdbId" : "0167720",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Come Again?",
  "description" : "Parker finds himself stuck in a time loop involving Olga and a mission to save a cold fusion expert from being killed."
}, {
  "imdbId" : "0167720",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Vows",
  "description" : "Frank is tasked with going back 7 days into the past to try and stop a bomb explosion caused by a failed bank robbery. While on the mission unforeseen events occur that turn Frank's and everyone he loves, world upside down."
}, {
  "imdbId" : "0167720",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Doppleganger: Part 1",
  "description" : "After being sent back to stop a power-hungry general from exploiting an international crisis, Parker finds himself facing a duplicate with a sinister agenda."
}, {
  "imdbId" : "0167720",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Doppleganger: Part 2",
  "description" : "After being left for dead, Parker has to find a way to stop his malevolent duplicate and reverse General Starker's takeover of the United States government."
}, {
  "imdbId" : "0167720",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Shadow Play",
  "description" : "Frank returns to the past after an NCA front operation is destroyed by a bomb. He must try to stop the bomb and identify who placed it. As he attempts this he discovers truths that change his whole professional life."
}, {
  "imdbId" : "0167720",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "As Time Goes By",
  "description" : "Olga's husband Josef, a Russian chrononaut presumed dead after disappearing in a failed Russian time travel program, shows up after seven years of being missing. Claiming to be from over 30 years in the future, Josef says he has come back to bring Olga with him to the future, but Ramsey and Parker strongly suspect things aren't what they appear to be."
}, {
  "imdbId" : "0167720",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "Sleepers",
  "description" : "Several Agents are hypnotized into killing highly important Scientists then committing suicide after the murders. Frank is sent back to stop the man hypnotizing them, known as \"Father\"."
}, {
  "imdbId" : "0167720",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "HAARP Attack",
  "description" : "While on a mission to stop Middle Eastern terrorists from redirecting American bombers to destroy a U.S. military base, a malfunction leaves Parker believing he is only ten years old."
}, {
  "imdbId" : "0167720",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "Last Card Up",
  "description" : "At the compound of a religious leader who doesn't pay taxes, the ATF arrives to take him in. But he refuses to give himself up. Things heat up. Later there's a gunshot that sets off a confrontation between the ATF and the cult that ends with everyone in the compound getting killed in an explosion. Now no one knows who fired the shot and what caused the explosion so before they send Frank back, Talmadge sends him, Olga and Ramsey to get more info. While there Frank hooks up with a TV reporter. Olga finds them in Frank's room. Later reporters flood Neverland because the..."
}, {
  "imdbId" : "0167720",
  "season" : "1",
  "episodeNumber" : "13",
  "title" : "Last Breath",
  "description" : "An accident under the Arctic circle with a Russian sub, causes Plutonium to leak into the ballasts, but a mutiny forces the sub up, spreading radioactive material into the air. Parker must Backstep to stop the terrible event from happening."
}, {
  "imdbId" : "0167720",
  "season" : "1",
  "episodeNumber" : "14",
  "title" : "Parkergeist",
  "description" : "An inside job ends up killing Frank in a sabotaged Backstep, but surprisingly he finds he's a ghost and with some help, must stop the security leak and find a way to fix things."
}, {
  "imdbId" : "0167720",
  "season" : "1",
  "episodeNumber" : "15",
  "title" : "Daddy's Girl",
  "description" : "Parker is sent to Bosnia to rescue the illegitimate daughter of the Vice President, killed in the previous time line in a botched rescue mission."
}, {
  "imdbId" : "0167720",
  "season" : "1",
  "episodeNumber" : "16",
  "title" : "There's Something About Olga",
  "description" : "In Minsk (Soviet Belarus), mental patient Galina Komanov, daughter of a killed defected researcher, is prepared by a skeptic KGB Captain's team to play the double of Dr. Olga Vukavitch, in order to infiltrate the program and steal the time travel secret while the real Olga is captured and tortured in a secret room inside the research building. Failing to seduce Lt. Frank Parker, she knocks him down and keeps him cuffed to a bed to get information from him by torturing. However, her psychosis and desire to keep the American lifestyle, causes her to go out of control. ..."
}, {
  "imdbId" : "0167720",
  "season" : "1",
  "episodeNumber" : "17",
  "title" : "A Dish Best Served Cold",
  "description" : "A Brazilian shaman sends former James Rance, a chrononaut presumed killed and missing in action years ago, on vision quest back from Amazonas to Arizona. He arrives at Dr. Isaac Mentnor's birthday party for his granddaughter Rebecca (9) and poisons her to blackmail him into sending them on a suicide mission through the sabotaged time-travel device. Lieutenant Frank Parker realizes there is one chance: find his original landing pod within a week. The shaman proves surprisingly helpful in several ways."
}, {
  "imdbId" : "0167720",
  "season" : "1",
  "episodeNumber" : "18",
  "title" : "Vegas Heist",
  "description" : "An old buddy Parker served with attempts a heist of a big casino but in the process over two hundred people are killed in an explosion, including several high-level intelligence officials. In the process of correcting it, Parker gets caught up in the heist."
}, {
  "imdbId" : "0167720",
  "season" : "1",
  "episodeNumber" : "19",
  "title" : "EBE's",
  "description" : "An ET-lookalike's baby-version (called Extraterrestrial Biological Entity, EBE) is hit by a prison transport which, in turn, crashes near Rosswell and a nearby poisonous bio-hazard. Frank is sent there on a mission so secret Isaac can't even brief him in advance. Frank has to find out on the job."
}, {
  "imdbId" : "0167720",
  "season" : "1",
  "episodeNumber" : "20",
  "title" : "Walter",
  "description" : "Frank's dinner date, Charlotte, is the 19th agent worldwide to be shot - her name from a list linked with CIA code project Jasmin (Walter broke its code in LA Chinatown for a team sent from Beijing). Patriotic Peter is killed by his false lover Michelle, who wants to sell information to the highest bidder. Frank must take Walter out of the equation to secure the encryption, even if that means killing him, but decides to rescue instead, with painful consequences."
}, {
  "imdbId" : "0167720",
  "season" : "1",
  "episodeNumber" : "21",
  "title" : "Lifeboat",
  "description" : "An alien survivor of the Roswell crash, nick named \"Adam\", who was kept on life support for decades, suddenly awakens and wreaks havoc."
}, {
  "imdbId" : "0167720",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "The Football",
  "description" : "Frank must undo a worldwide nuclear holocaust after the President's Nuclear football is fumbled."
}, {
  "imdbId" : "0167720",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "Pinball Wizard",
  "description" : "Frank must undo a missile attack on the pentagon by a young woman who thinks she is playing a video game."
}, {
  "imdbId" : "0167720",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "Parker.com",
  "description" : "An artificial intelligence program named CLAIRE disables all of the world's defensive systems and it's up to Parker to stop her."
}, {
  "imdbId" : "0167720",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "For the Children",
  "description" : "Parker quits when a Backstep is canceled that would have saved children on a subway train from being killed, and the team must question whether they obey NSA orders or act on their consciences."
}, {
  "imdbId" : "0167720",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "Two Weddings and a Funeral",
  "description" : "Parker weds Olga in Las Vegas, but the bride turns out to be escaped psychotic killer Galina Komanov in disguise."
}, {
  "imdbId" : "0167720",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "Walk Away",
  "description" : "An autopsy on Adam finds alien technology that can help the paralyzed walk again and Dr. Ballard jumps at the chance to be able to walk again. But soon after the device is installed, strange things start happening."
}, {
  "imdbId" : "0167720",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "Sister's Keeper",
  "description" : "Parker hunts for Olga's younger sister, a hustler who is running from Russian mobsters in Las Vegas."
}, {
  "imdbId" : "0167720",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "The Collector",
  "description" : "Parker Backsteps to prevent a collapsed dam from killing people, but when under the influence of alcohol lands in the middle of an execution, letting a serial killer escape. Frank insists on taking on the investigation to make up for his screw-up."
}, {
  "imdbId" : "0167720",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "Love and Other Disasters",
  "description" : "Olga and Ballard attend a royal wedding. While there, there's an explosion so Frank is sent to stop it. They assume that it was an accident. But what they don't know is that someone is trying to stop the wedding. Frank goes there and neutralizes the threat. The ones who did it then pull guns and take everyone there captive and the leader demands the Princess but Frank saves her and they hide. That's when Frank learns how she feels about her marriage."
}, {
  "imdbId" : "0167720",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "The Devil and the Deep Blue Sea",
  "description" : "An unknown confrontation between a U.S. Navy ship and a Chinese sub leads to total destruction and loss of life on both vessels and heightened tensions between the countries. Parker must somehow convince two head strong Naval officers to do otherwise."
}, {
  "imdbId" : "0167720",
  "season" : "2",
  "episodeNumber" : "11",
  "title" : "Time Gremlin",
  "description" : "Parker's efforts to stop a massive earthquake in California are stymied by a destructive gremlin."
}, {
  "imdbId" : "0167720",
  "season" : "2",
  "episodeNumber" : "12",
  "title" : "Buried Alive",
  "description" : "A big disaster leads Frank to Backstep, but when he comes to, he finds the sphere is buried alive, and the project Backstep team cannot find him."
}, {
  "imdbId" : "0167720",
  "season" : "2",
  "episodeNumber" : "13",
  "title" : "The Backstepper's Apprentice",
  "description" : "Parker Backsteps to save the life of a Priest assassinated by a drug cartel and while mid Backstep he cuts through an airliner and momentarily picks up a passenger blown into the sphere. Now they must try to find out the flight before it's too late."
}, {
  "imdbId" : "0167720",
  "season" : "2",
  "episodeNumber" : "14",
  "title" : "Deja Vu All Over Again",
  "description" : "Bradley takes his first vacation in a decade and in doing so, is kidnapped. During questioning he takes a suicide pill, which ultimately leads to a Backstep. Trying to juggle two deaths, Frank experiences what he calls \"time burps\", where time just seems to go back by itself, and he uses these to repeat events again and again in order to get the desired outcome."
}, {
  "imdbId" : "0167720",
  "season" : "2",
  "episodeNumber" : "15",
  "title" : "Space Station Down",
  "description" : "On the first day of operations for the Global Space Station, an accident leads to it's destruction and the scattering of Plutonium across the United States. Frank Backsteps to fix the events, but things go wrong."
}, {
  "imdbId" : "0167720",
  "season" : "2",
  "episodeNumber" : "16",
  "title" : "The Cuban Missile",
  "description" : "After the adopted son of Fidel Castro, a renowned boxer, is assassinated during a boxing match in America, the communist leader retaliates by launching secret nuclear missiles at Miami, triggering a Backstep."
}, {
  "imdbId" : "0167720",
  "season" : "2",
  "episodeNumber" : "17",
  "title" : "X-35 Needs Changing",
  "description" : "Frank and Olga must go to Chechnya in search of a stolen classified U.S. experiment, the X-35 - a human baby with important specifically bred genes."
}, {
  "imdbId" : "0167720",
  "season" : "2",
  "episodeNumber" : "18",
  "title" : "Brother, Can You Spare a Bomb?",
  "description" : "Ramsey's mentally unbalanced brother commits an act of terrorism and he used Ramsey's access to classified information to do it. Ramsey's relieved of duty. Frank goes back to stop him but instead of telling them what happened, he only tells Ramsey so that they can stop his brother and save Ramsey's career."
}, {
  "imdbId" : "0167720",
  "season" : "2",
  "episodeNumber" : "19",
  "title" : "Pope Parker",
  "description" : "Frank backsteps to prevent the assassination of the Pope. But something goes wrong and Frank finds himself in the Pope's persona. So he tries to get word to Neverland but the Pope's Entourage stymies him. He then uses his authority as Pope to send for Olga."
}, {
  "imdbId" : "0167720",
  "season" : "2",
  "episodeNumber" : "20",
  "title" : "Witch Way to the Prom",
  "description" : "3 high school girls use magic and believe they have conjured Parker during a backstep and therefore control him, all just to get a date to prom."
}, {
  "imdbId" : "0167720",
  "season" : "2",
  "episodeNumber" : "21",
  "title" : "Mr. Donovan's Neighborhood",
  "description" : "When a reverend fighting against drug deals in Donovan's old neighborhood gets killed, Donovan's sister is killed as well. Donovan investigates and is arrested for killing one of the men responsible, and Frank engineers a Backstep to go back and save his friend."
}, {
  "imdbId" : "0167720",
  "season" : "2",
  "episodeNumber" : "22",
  "title" : "Playmates and Presidents",
  "description" : "Parker is ordered to Backstep in order to prevent a Presidential candidate from being assassinated. His mission is a success and the Governor asks him to join his campaign team, but Frank soon discovers the Governor has psychological issues and his daughter is trying to get the evidence to the public."
}, {
  "imdbId" : "0167720",
  "season" : "2",
  "episodeNumber" : "23",
  "title" : "The Cure",
  "description" : "A friend of Olga's, who's a scientist, calls to tell her she discovered a cure for cancer. Shortly after she dies in an accident. Frank is sent back to save her and he does. Later someone tries to kill her. Frank catches the man who reveals he's a chrononaut from the future. It seems the woman's cure a few years after it was released would mutate into a plague that killed most of the world. The man claims that another vessel was discovered and they used the fuel source to send him back to stop her. But he says because she is so paranoid, they can't reason with her so ..."
}, {
  "imdbId" : "0167720",
  "season" : "3",
  "episodeNumber" : "1",
  "title" : "Stairway to Heaven",
  "description" : "During a backstep to prevent a train crash spilling nuclear waste into the Colorado River, sunspots cause the sphere to pick-up a stray soul; a dead woman from 1979 who materializes and endears Frank in a quest to find her daughter."
}, {
  "imdbId" : "0167720",
  "season" : "3",
  "episodeNumber" : "2",
  "title" : "Peacekeepers",
  "description" : "Serbian peacekeepers hear about a cache of money left behind be a warlord and go off to get it, run into the warlord coming to retrieve. Frank back steps to save the peacekeepers and the refugees they were supposed to be saving."
}, {
  "imdbId" : "0167720",
  "season" : "3",
  "episodeNumber" : "3",
  "title" : "Rhino",
  "description" : "Seven Days: Parker teams with an old friend, a Navy SEAL, to prevent the assassination of the new president of Columbia at a White House state dinner."
}, {
  "imdbId" : "0167720",
  "season" : "3",
  "episodeNumber" : "4",
  "title" : "The Dunwych Madness",
  "description" : "Know what this is about?"
}, {
  "imdbId" : "0167720",
  "season" : "3",
  "episodeNumber" : "5",
  "title" : "Olga's Excellent Vacation",
  "description" : "Know what this is about?"
}, {
  "imdbId" : "0167720",
  "season" : "3",
  "episodeNumber" : "6",
  "title" : "Deloris Demands",
  "description" : "Someone who calls herself Deloris calls Neverland and knows about Backstep and is making threats, which they don't take seriously. But she then gets a sample of Frank's voice and makes a phone call which makes them think Frank has gone mad. But when they learn it was Deloris, they send Frank back to deal with her. And when he arrives, Deloris wants to play games with him. So he carries it out while they try to find out who Deloris is."
}, {
  "imdbId" : "0167720",
  "season" : "3",
  "episodeNumber" : "7",
  "title" : "The Fire Last Time",
  "description" : "Parker suffers nightmarish flashbacks over the deaths of his comrades in Somalia and guilt over his own survival."
}, {
  "imdbId" : "0167720",
  "season" : "3",
  "episodeNumber" : "8",
  "title" : "Tracker",
  "description" : "The brother of a Chechnyan terrorist Parker killed on a previous Backstep, vows to stop Parker and the Backstep program."
}, {
  "imdbId" : "0167720",
  "season" : "3",
  "episodeNumber" : "9",
  "title" : "Top Dog",
  "description" : "When Bradley appears to be having a breakdown because he is talking about Backstep among other things, he is relieved of duty and Ramsey replaces him. Later they learn that his breakdown was caused by something that could be treated. So they ask to Backstep so they can help him but their superiors refuse to grant it."
}, {
  "imdbId" : "0167720",
  "season" : "3",
  "episodeNumber" : "10",
  "title" : "Adam & Eve & Adam",
  "description" : "A top secret weapon project test gone awry seemingly kills all life on Earth except Parker, Olga, and Owsley who are deep underground in a secret government facility. Now they must make it back in time to Backstep."
}, {
  "imdbId" : "0167720",
  "season" : "3",
  "episodeNumber" : "11",
  "title" : "Head Case",
  "description" : "The President is at odds over how to deal with a Latin American dictator. He's been having strange dreams that he tells to his therapist who records them. One day someone grabs the therapist and takes the tapes of the President's sessions. Later the dictator calls the President and says he has his tapes and will release them unless he gives him his support. When Backstep learns of this, they learn about the therapist's disappearance and send Frank to find out if the two events are related. When he arrives, he goes to the therapist's office just as her abductors arrive..."
}, {
  "imdbId" : "0167720",
  "season" : "3",
  "episodeNumber" : "12",
  "title" : "Raven",
  "description" : "A missile test disaster sends Parker back in time to find a beautiful revenge-minded thief who has stolen the device that will cause the disaster."
}, {
  "imdbId" : "0167720",
  "season" : "3",
  "episodeNumber" : "13",
  "title" : "The First Freshman",
  "description" : "When the President's daughter who's a wild child is killed, and the President is depressed, Frank is sent back to save her. Frank saves her but she's still wild which exasperates the Secret Service Agent assigned to her."
}, {
  "imdbId" : "0167720",
  "season" : "3",
  "episodeNumber" : "14",
  "title" : "Revelation",
  "description" : "Parker must decide whether or not to heed the words of a man who claims to have Backstepped from the far future, and warns that Earth's safety depends on the death of a revered holy man."
}, {
  "imdbId" : "0167720",
  "season" : "3",
  "episodeNumber" : "15",
  "title" : "Crystal Blue Persuasion",
  "description" : "An alien space craft infects an astronaut with something that could wipe out mankind."
}, {
  "imdbId" : "0167720",
  "season" : "3",
  "episodeNumber" : "16",
  "title" : "Empty Quiver",
  "description" : "When someone sets a nuke off, Frank is sent back to avert it. They give him what info they could get on who may have done it. However because of a mistake on Frank's part, the sphere gets sent back without Frank. So they inspect the sphere and find Frank's bag and inspect it and the only item that doesn't appear to be among the things he usually brings with him is a key. That's when Isaac decides to bring in a girl who is a psychic, whom he worked with years ago when she was around nine and who decided to stop working with him because she couldn't fully comprehend her..."
}, {
  "imdbId" : "0167720",
  "season" : "3",
  "episodeNumber" : "17",
  "title" : "Kansas",
  "description" : "A freak accident during some tests on the sphere, accidentally sends Parker into an alternate universe where the government is authoritarian and the NNL base is commanded with deadly force."
}, {
  "imdbId" : "0167720",
  "season" : "3",
  "episodeNumber" : "18",
  "title" : "The Final Countdown",
  "description" : "As tensions with North Korea increase, the by-the-book commander of an American nuclear silo fires a missile despite incomplete information, causing a war. Parker must travel back to try and convince the man what is the right action to be taken."
}, {
  "imdbId" : "0167720",
  "season" : "3",
  "episodeNumber" : "19",
  "title" : "The Brink",
  "description" : "An attack with a laser weapon leaves thousands of concert attending teens permanently blind, with a trail leading Parker back to the Hansen Island mental institute."
}, {
  "imdbId" : "0167720",
  "season" : "3",
  "episodeNumber" : "20",
  "title" : "Sugar Mountain",
  "description" : "Several people including the Canadian Trade Minister are killed in a mysterious fire. Bradley learns from the CIA that the fire was caused by a secret weapon which has fallen into the wrong hands. So Frank is sent back to get it back. He runs into the man who supposedly has it but all he has with him is a boy. Frank escapes with the boy and learns who the weapon is."
}, {
  "imdbId" : "0167720",
  "season" : "3",
  "episodeNumber" : "21",
  "title" : "Born in the USSR",
  "description" : "A deadly gas leak kills thousands of Russians and leads to a coup and power vacuum. When Olga is paid a visit by a former lover seeking her help with the Russian time travel program, she puts the world in peril."
}, {
  "imdbId" : "0167720",
  "season" : "3",
  "episodeNumber" : "22",
  "title" : "Live: From Death Row",
  "description" : "When a General is killed in an air show accident, Parker Backsteps, but instead uses it to save a wrongfully convicted friend on Death Row."
}]