[{
  "imdbId" : "0098878",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Pilot",
  "description" : "A doctor from New York City adjusts to life in a rural town in Alaska."
}, {
  "imdbId" : "0098878",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Brains, Know-How and Native Intelligence",
  "description" : "Dr. Joel Fleischman slowly starts accepting his desperately desolate fate, despite a defective shower leaving him to choose between swallowing his pride in order to get Maggie's plumbing help or bathing in the utterly icy lake. Popular DJ Chris Stevens' 'irreverent' comments on even Walt Whitman get him sacked from Maurice's radio K-Bear, but the boss soon offends everyone else in Cecily. Ed Chigliak's suave way gets reluctant Joel to make confusing house-calls on Ed's uncle, paradoxical medicine man Anku, who treats Joel to a Kentucky takeaway, traditional dancing ..."
}, {
  "imdbId" : "0098878",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Soapy Sanderson",
  "description" : "Dr. Joel Fleischman is depressed when grumpy old patient Soapy Sanderson completely ignores his medical advice, and is stunned when he and Maggie are named joint executors of his 140 acres forest estate where only wolves live. Maggie wants to turn it into a nature reserve, however un-required it is in this part of Alaska. Joel is rather tempted by the Indian chief Ronkomkoma's idea to turn it into a tax shelter by formally drilling for oil which everybody knows isn't there, hoping it may pay his way back to New York. Later Joel learns Soapy was a spirituality college ..."
}, {
  "imdbId" : "0098878",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Dreams, Schemes and Putting Greens",
  "description" : "Shelly becomes pregnant and a wedding is arranged, but Holling has a deep-rooted fear - both his father and grandfather lived over a century, while their wives died young, leaving them alone and grieving for over sixty years each. Holling vowed to avoid their fate. Meanwhile, Maurice and Fleischman entertain a Japanese investor interested in building a resort in Cicely."
}, {
  "imdbId" : "0098878",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Russian Flu",
  "description" : "Dr. Joel Fleischman has his hands full when his fiancé Elaine flies to Cicely for a visit. He becomes so busy trying to defend himself against the townspeople's charges that he is a KGB agent releasing the Russian flu upon them and competing with Marilyn over the best treatment for the illness, that he has no time to spend with his betrothed. Instead Maggie, entertains Elaine, which only further annoys Joel."
}, {
  "imdbId" : "0098878",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Sex, Lies and Ed's Tapes",
  "description" : "There's much to deal with in Cicely when Shelly's husband arrives with the hopes of taking her back to Saskatchewan, much to the astonishment of Holling. Furthermore, Maggie's boyfriend fears he will soon die as the next victim of the O'Connell curse and Ed searches for inspiration while working on his movie script."
}, {
  "imdbId" : "0098878",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "A Kodiak Moment",
  "description" : "Hearing his brother and only surviving fellow Minnifeld died, Maurice looks for a 'son' to adopt. After Joel declines, he gets Chris to try, but although generosity gets them through the hard stuff, a game of croquet proves you can't adopt 'breeding'. When Ed tells Holling Jesse that the fiercest grizzly, who caused him to stop hunting anything else, is back, Shelly insists on joining them on a hunt which shows that although the men are older, the bear still knows them. Joel is asked to attend a hygiene class, but when he arrives learns it's for expectant mothers, ..."
}, {
  "imdbId" : "0098878",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Aurora Borealis: A Fairy Tale for Big People",
  "description" : "While Joel gives Ed golf lessons, the Indian warns him Adam is around, the never actually seen monster-prankster, blamed for all kinds of weirdness since 15 years. Passing the night in his car in the woods after diagnosing a park ranger Burns, Joel is apparently robbed, actually taken in, by very human loner Vietnam vet Adam. Chris is delighted his instinctive sculptural inspiration fits the astronomical phenomenon Aurora Borealis (northern light). Chris accepts help from lost motor-biker Bernard, and discovers they share a lot, even an identity essential."
}, {
  "imdbId" : "0098878",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "Goodbye to All That",
  "description" : "The townspeople try to cheer up Joel after his fiancee dumps him."
}, {
  "imdbId" : "0098878",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "The Big Kiss",
  "description" : "Ed goes on a spirit quest to find his parents; Chris loses his voice and must sleep with the most beautiful woman in town to recover it; to that aim, he invites Maggie to dinner. When Joel mocks her charm, Maggie takes on the challenge."
}, {
  "imdbId" : "0098878",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "All Is Vanity",
  "description" : "Maggie purports Joel to be her boyfriend to gain her father's approval; Holling comes to a very personal decision."
}, {
  "imdbId" : "0098878",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "What I Did for Love",
  "description" : "A charming replacement and Maggie's premonition of death make Joel reconsider his trip to New York."
}, {
  "imdbId" : "0098878",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "Spring Break",
  "description" : "Holling picks fights with patrons; Ed seeks a once-a-year kleptomaniac; Maurice falls for a trooper."
}, {
  "imdbId" : "0098878",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "War and Peace",
  "description" : "Everyone except Maurice welcomes a vacationing Russian; Holling has nightmares; Ed falls in love."
}, {
  "imdbId" : "0098878",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "Slow Dance",
  "description" : "Rick's death by falling satellite further enhances Maggie's reputation; Maurice meets prospective hoteliers."
}, {
  "imdbId" : "0098878",
  "season" : "3",
  "episodeNumber" : "1",
  "title" : "The Bumpy Road to Love",
  "description" : "When a statue is risen in Rick's memory, Maggie learns of his infidelity through a stranger's eulogy. Meanwhile, Adam returns and makes Joel go with him to treat his hypochondriac wife."
}, {
  "imdbId" : "0098878",
  "season" : "3",
  "episodeNumber" : "2",
  "title" : "Only You",
  "description" : "Chris begins attracting all the women in town, almost. Joel tries to study the phenomenon. Maggie has an eye exam and finds out she's far-sighted. Maurice and Holling have a dispute over a picture."
}, {
  "imdbId" : "0098878",
  "season" : "3",
  "episodeNumber" : "3",
  "title" : "Oy, Wilderness",
  "description" : "Joel and Maggie are forced to make an emergency landing and become stranded. They end up surprising each other. Shelley has a visit from her best friend from home, Cindy. When Cindy asks for a divorce, Shelley gets mad."
}, {
  "imdbId" : "0098878",
  "season" : "3",
  "episodeNumber" : "4",
  "title" : "Animals R Us",
  "description" : "Maggie is approached by a dog whom she believes to be Rick reincarnate while Maurice tries to make a business scheme out of Marilyn's ostrich farm."
}, {
  "imdbId" : "0098878",
  "season" : "3",
  "episodeNumber" : "5",
  "title" : "Jules et Joel",
  "description" : "Shortly after hitting his head, Joel is visited by his identical twin brother, Jules, and changes places with him for a day. Meanwhile, Chris is contacted by a bomber who wants to turn himself in."
}, {
  "imdbId" : "0098878",
  "season" : "3",
  "episodeNumber" : "6",
  "title" : "The Body in Question",
  "description" : "While fishing, Chris finds the body of a man frozen in ice. Maurice looks upon this as a business opportunity as a battle begins over the body. Ed takes a job at Ruth Anne's store. Joel explores his Jewish faith."
}, {
  "imdbId" : "0098878",
  "season" : "3",
  "episodeNumber" : "7",
  "title" : "Roots",
  "description" : "Chris's brother/'karmic' doppleganger comes to town. Joel's ex-fiancé Elaine shows up looking for comfort. Adam shows up asking for money and takes a job at the Brick."
}, {
  "imdbId" : "0098878",
  "season" : "3",
  "episodeNumber" : "8",
  "title" : "A-Hunting We Will Go",
  "description" : "Chris and Holling head out on their annual hunting trip when Joel asks to go along. Ruth Anne has a birthday, but wants to avoid a fuss. Shelly organizes a party for her."
}, {
  "imdbId" : "0098878",
  "season" : "3",
  "episodeNumber" : "9",
  "title" : "Get Real",
  "description" : "After their bus breaks down, a circus visits Cicely. Marilyn gets a proposal. Holling and Shelley have a fight."
}, {
  "imdbId" : "0098878",
  "season" : "3",
  "episodeNumber" : "10",
  "title" : "Seoul Mates",
  "description" : "It's Christmas in Cicely and Maurice is approached by a Korean man who turns out to be his son."
}, {
  "imdbId" : "0098878",
  "season" : "3",
  "episodeNumber" : "11",
  "title" : "Dateline: Cicely",
  "description" : "In an effort to sell more issues of his newspaper, Maurice hires pathological liar Adam to write for it."
}, {
  "imdbId" : "0098878",
  "season" : "3",
  "episodeNumber" : "12",
  "title" : "Our Tribe",
  "description" : "Joel is given a goat by a patient. After he objects, the patient decides to make him part of their tribe, but there are some tasks he must perform first. Holling mysteriously closes the bar and sends Shelley out of town."
}, {
  "imdbId" : "0098878",
  "season" : "3",
  "episodeNumber" : "13",
  "title" : "Things Become Extinct",
  "description" : "Holling undergoes a midlife crisis when his uncle dies and Ed makes a documentary about a man who makes flutes."
}, {
  "imdbId" : "0098878",
  "season" : "3",
  "episodeNumber" : "14",
  "title" : "Burning Down the House",
  "description" : "Maggie's mother comes for a visit and delivers some surprising news. Chris builds a catapult. Joel discovers someone's secret identity."
}, {
  "imdbId" : "0098878",
  "season" : "3",
  "episodeNumber" : "15",
  "title" : "Democracy in America",
  "description" : "When a new candidate signs up for the upcoming mayoral election in Cicely, this triggers a large amount of activity among the residents."
}, {
  "imdbId" : "0098878",
  "season" : "3",
  "episodeNumber" : "16",
  "title" : "The Three Amigos",
  "description" : "Maurice and Holling venture into the Alaskan wilderness to bury a recently deceased friend."
}, {
  "imdbId" : "0098878",
  "season" : "3",
  "episodeNumber" : "17",
  "title" : "Lost and Found",
  "description" : "When Joel complains of ghost-like rumblings in the house, Maggie thinks it could be the loner who committed suicide in it decades before, so she orders an exorcism of the house. Meanwhile, the hypochondriac Eve wants Joel's help for her various ailments. And, Maurice is visited by his old Marine colonel who needs to borrow money."
}, {
  "imdbId" : "0098878",
  "season" : "3",
  "episodeNumber" : "18",
  "title" : "My Mother, My Sister",
  "description" : "Shelly's mom (who prefers to be known as Shelly's YOUNGER sister) surprises her with a visit, boasting about her new main squeeze, a really young Army man."
}, {
  "imdbId" : "0098878",
  "season" : "3",
  "episodeNumber" : "19",
  "title" : "Wake Up Call",
  "description" : "Spring arrives in Cicely and with it comes more quirky behavior from its residents: Shelly has a skin rash, Holling decides to give away eggs, Joel gets a lesson in medical care from a tribal medicine man and Maggie has a reawakening with the help of a handsome stranger."
}, {
  "imdbId" : "0098878",
  "season" : "3",
  "episodeNumber" : "20",
  "title" : "The Final Frontier",
  "description" : "During the Northern Lights, Cicely is infused with Japanese tourists, Holling decides to go in search of Jessie the bear and Maggie and the townsfolk are curious when a package arrives that is covered with foreign stamps."
}, {
  "imdbId" : "0098878",
  "season" : "3",
  "episodeNumber" : "21",
  "title" : "It Happened in Juneau",
  "description" : "Joel looks forward to a weekend in Juneau, hoping to spend it with attractive female physicians. But, instead, he winds up in a hotel suite with Maggie who clearly cramps his style. Meanwhile, Chris is flustered when Bernard, his \"karmic doppelganger\", returns from Africa."
}, {
  "imdbId" : "0098878",
  "season" : "3",
  "episodeNumber" : "22",
  "title" : "Our Wedding",
  "description" : "Adam prepares to marry Eve. At his bachelor party, the men ruminate on the differences between men and women. Meanwhile, Eve lets an enthusiastic Shelly take over the wedding plans. And, Maggie and Joel try to finish what they started in Juneau."
}, {
  "imdbId" : "0098878",
  "season" : "3",
  "episodeNumber" : "23",
  "title" : "Cicely",
  "description" : "Joel encounters a 108-year-old man who has come home to Cicely. He tells Joel that Cicely, founded by two incredible, free-thinking women named Roslyn and Cicely, was once considered the \"Paris of the North\". The series regulars appear in this episode as various residents from 1909."
}]