[{
  "imdbId" : "0903747",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Pilot",
  "description" : "A high school chemistry teacher is diagnosed with terminal lung cancer and resorts to selling methamphetamine to provide for his family when he is dead."
}, {
  "imdbId" : "0903747",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Cat's in the Bag...",
  "description" : "Walt and Jesse try to decide what to do with the body of Emilio and their prisoner, Krazy 8."
}, {
  "imdbId" : "0903747",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "...And the Bag's in the River",
  "description" : "Walt is struggling to decide if it's best to kill Krazy 8 or let him go."
}, {
  "imdbId" : "0903747",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Cancer Man",
  "description" : "Walt tells the rest of his family about his cancer. Jesse tries to make amends with his own parents."
}, {
  "imdbId" : "0903747",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Gray Matter",
  "description" : "Walt rejects everyone who tries to help him with the cancer. Jesse tries his best to create Walt's meth, with the help of an old friend."
}, {
  "imdbId" : "0903747",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Crazy Handful of Nothin'",
  "description" : "Walt and Jesse sell their product to a new distributor, named Tuco."
}, {
  "imdbId" : "0903747",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "A No-Rough-Stuff-Type Deal",
  "description" : "Walt and Jesse try to up their game by making more of the crystal every week for Tuco. Unfortunately, some of the ingredients they need is not easy to find. Meanwhile, Skyler realizes that her sister is a shoplifter."
}, {
  "imdbId" : "0903747",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "Seven Thirty-Seven",
  "description" : "After witnessing Tuco murder one of his junkies, Walt and Jesse fear that he will kill them next, to tie up loose ends. Unless they kill Tuco first."
}, {
  "imdbId" : "0903747",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "Grilled",
  "description" : "Tuco takes Walt and Jesse prisoner."
}, {
  "imdbId" : "0903747",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "Bit by a Dead Bee",
  "description" : "Walt and Jesse try to come up with alibis for their disappearances."
}, {
  "imdbId" : "0903747",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "Down",
  "description" : "Skyler keeps mysteriously leaving without talking to Walt. Jesse's parents throw him out of his own house."
}, {
  "imdbId" : "0903747",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "Breakage",
  "description" : "Walt and Jesse decide to start their own little empire with the help of Jesse's friends: Skinny Pete, Combo, and Badger. Meanwhile, Hank tries to pull himself together after his encounter with Tuco."
}, {
  "imdbId" : "0903747",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "Peekaboo",
  "description" : "After Skinny Pete gets ripped off, Walt makes Jesse go get the money. Meanwhile, Walt's cover story on how Elliott and Gretchen are paying for his medical treatment is on the verge of collapsing."
}, {
  "imdbId" : "0903747",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "Negro Y Azul",
  "description" : "Rumor is spreading that Jesse killed the man that ripped Skinny Pete off. Walt uses this to his advantage on expanding their territory. Meanwhile, Hank has been promoted to the El Paso office. But it's not all he hoped it would be."
}, {
  "imdbId" : "0903747",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "Better Call Saul",
  "description" : "Badger is caught by the DEA. Walt and Jesse hire the best criminal lawyer in town, Saul Goodman."
}, {
  "imdbId" : "0903747",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "4 Days Out",
  "description" : "Walt and Jesse become stranded out in the middle of the desert after cooking more crystal."
}, {
  "imdbId" : "0903747",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "Over",
  "description" : "Walt's cancer has greatly improved. Time to celebrate. Meanwhile Jesse tries to meet his new girlfriend's father."
}, {
  "imdbId" : "0903747",
  "season" : "2",
  "episodeNumber" : "11",
  "title" : "Mandala",
  "description" : "Combo is found dead. Walt and Jesse's little empire begins to crumble. Saul tries to set them up with a mysterious distributor."
}, {
  "imdbId" : "0903747",
  "season" : "2",
  "episodeNumber" : "12",
  "title" : "Phoenix",
  "description" : "Walt and Skyler have a baby girl. Now that Jesse is hooked on heroin, Walt refuses to give him his money until he gets clean. Meanwhile, as an excuse for his money, Walt decides to donate the money to himself through his son's new website."
}, {
  "imdbId" : "0903747",
  "season" : "2",
  "episodeNumber" : "13",
  "title" : "ABQ",
  "description" : "Walt's lies have pushed Skyler to her limit. She leaves with the kids. Meanwhile, Jesse blames himself for Jane's death and goes into rehab."
}, {
  "imdbId" : "0903747",
  "season" : "3",
  "episodeNumber" : "1",
  "title" : "No Más",
  "description" : "Skyler is planning to divorce Walt now that she knows about the crystal meth. Jesse finishes rehab."
}, {
  "imdbId" : "0903747",
  "season" : "3",
  "episodeNumber" : "2",
  "title" : "Caballo sin Nombre",
  "description" : "Walter Jr is having a rough time accepting his parents separation. Jesse buys his old house from his parents. Meanwhile, two mysterious men have come into town looking for Walt."
}, {
  "imdbId" : "0903747",
  "season" : "3",
  "episodeNumber" : "3",
  "title" : "I.F.T.",
  "description" : "Walt has moved back into the house without Skyler's consent. Now she can't get him out. Meanwhile, Jesse continues to cope with Jane's death."
}, {
  "imdbId" : "0903747",
  "season" : "3",
  "episodeNumber" : "4",
  "title" : "Green Light",
  "description" : "Walt's world crumbles even more when he finds out that Skyler is cheating on him. Jesse tries to set up a meeting with Gus to try and sell his own version of the blue meth. Meanwhile, Hank is growing obsessed with finding Heisenberg."
}, {
  "imdbId" : "0903747",
  "season" : "3",
  "episodeNumber" : "5",
  "title" : "Más",
  "description" : "Gus tries to get Walt back in the business by offering him three million dollars and a brand new lab. Jesse is furious that Walt received half of the money for his blue meth. Hank tries to track down the RV meth lab."
}, {
  "imdbId" : "0903747",
  "season" : "3",
  "episodeNumber" : "6",
  "title" : "Sunset",
  "description" : "Walt's new business and assistant, Gale, are making his life much easier. Hank trails the RV back to Jesse. When Walt finds out, he tries to destroy the RV."
}, {
  "imdbId" : "0903747",
  "season" : "3",
  "episodeNumber" : "7",
  "title" : "One Minute",
  "description" : "Jesse ends up in the hospital after getting beaten up by Hank. Now he is threatening to press charges against the DEA. To stop him, Walt decides to bring Jesse on as his partner, once again."
}, {
  "imdbId" : "0903747",
  "season" : "3",
  "episodeNumber" : "8",
  "title" : "I See You",
  "description" : "Hank ends up in the hospital after being attacked by Tuco's cousins. Walt spends too much time by his family's side when he should be cooking meth."
}, {
  "imdbId" : "0903747",
  "season" : "3",
  "episodeNumber" : "9",
  "title" : "Kafkaesque",
  "description" : "Skyler hatches a plan as Hank's hospital bills stack up. Meanwhile, Walt and Gus come to a better understanding as Jesse, looking for more independence, pursues a new opportunity."
}, {
  "imdbId" : "0903747",
  "season" : "3",
  "episodeNumber" : "10",
  "title" : "Fly",
  "description" : "There is a fly loose in the lab. Walt and Jesse must do whatever they can to kill it before it contaminates the meth."
}, {
  "imdbId" : "0903747",
  "season" : "3",
  "episodeNumber" : "11",
  "title" : "Abiquiu",
  "description" : "Skyler gets more involved in Walt's business, much to his chagrin as Hank struggles with his recovery. Meanwhile, Jesse takes an active role in his new enterprise, leading him to a startling discovery."
}, {
  "imdbId" : "0903747",
  "season" : "3",
  "episodeNumber" : "12",
  "title" : "Half Measures",
  "description" : "Against Walt's advice, Jesse lashes out. Fearing for Jesse's safety, Walt takes drastic action to intervene. Meanwhile a tragic event leads to a shocking confrontation."
}, {
  "imdbId" : "0903747",
  "season" : "3",
  "episodeNumber" : "13",
  "title" : "Full Measure",
  "description" : "Jesse has disappeared and Walt is in big trouble with Gus. So Gus rehires Gale to learn from Walt's cooking so that they can dispose of Walt once and for all."
}, {
  "imdbId" : "0903747",
  "season" : "4",
  "episodeNumber" : "1",
  "title" : "Box Cutter",
  "description" : "Walt and Jesse are held captive for Gus, after Gale's death. Meanwhile, Skyler tries to find out what happened to Walt."
}, {
  "imdbId" : "0903747",
  "season" : "4",
  "episodeNumber" : "2",
  "title" : "Thirty-Eight Snub",
  "description" : "Walt attempts to form a new alliance as he plans his next move. Meanwhile Skyler pushes Walt towards a business opportunity, in hopes of protecting the family."
}, {
  "imdbId" : "0903747",
  "season" : "4",
  "episodeNumber" : "3",
  "title" : "Open House",
  "description" : "Skyler finds a way to pressure the car-wash owner into selling, while Marie goes on a series of visits to realtors' open houses. Her antics get her in trouble, and Hank has to pull a few strings. One of his cop friends helps Marie out and, in turn, asks Hank to look at a notebook found at the scene of a murder. Meanwhile, Jesse's round-the-clock open houseparty brings no mirth."
}, {
  "imdbId" : "0903747",
  "season" : "4",
  "episodeNumber" : "4",
  "title" : "Bullet Points",
  "description" : "Walt and Skyler have decided to use gambling to explain how Walt has made all of his money. It's not to be a happy story and Skyler insists that Walt admit to a gambling addiction and express deep shame for what he has done. At dinner with Marie and Hank Schrader, they tell their rehearsed story. Hank has a story for Walt however, one of a dead wannabee singer who had lab notes describing a super-processing meth lab. Hank is convinced the dead man is Heisenberg, the drug manufacturer he has been looking for for over a year. Walt tries to warn Jesse and is appalled at ..."
}, {
  "imdbId" : "0903747",
  "season" : "4",
  "episodeNumber" : "5",
  "title" : "Shotgun",
  "description" : "In his attempt to save Jesse, Walt visits Gus' fast food restaurant but isn't quite prepared for what he learns. Nor is Jesse for that matter. In fact, he proves to be quite useful though not everything is as it seems. Hank is convinced that Gale Boetticher was Heisenberg and tells the local police detective that he really has no further interest in the case. He mentions that Jesse Pinkman could have been involved but is not likely the shooter. Walt and Skyler close the deal on the car wash and take a major step in repairing their relationship but at dinner with Hank ..."
}, {
  "imdbId" : "0903747",
  "season" : "4",
  "episodeNumber" : "6",
  "title" : "Cornered",
  "description" : "It's the morning after the night before and Walt has a major hangover. Skyler is now convinced that Walt is in danger but he makes sure she understands exactly how important he is to the criminal organization. He's a little too blunt as Skyler's reaction is to take the baby and disappear for a few days. One of Gus' trucks has been hijacked so Mike and Jesse are tasked to get the blue meth back. Once again, Jesse proves to be unexpectedly useful. In the lab, Walt is fed up with Jesse going off on errands with Mike and so comes up with his own solution to cleaning up. ..."
}, {
  "imdbId" : "0903747",
  "season" : "4",
  "episodeNumber" : "7",
  "title" : "Problem Dog",
  "description" : "The car wash is now in operation but Skyler isn't prepared for the amount of money Walt is bringing in. She also arranges for Walt to return the car he bought Walt Jr. but in the end decides he has other plans for it. Walt still believes his life is in danger as long as Gus is alive and speaks to Saul about how he wants to hire a hit man. He finds someone closer to home. Hank and Walter Jr. visit Gus Fring's chicken restaurant and Hank has something very specific in mind. He's slowly putting the facts together in his quest for Heisenberg. Facing a series of ..."
}, {
  "imdbId" : "0903747",
  "season" : "4",
  "episodeNumber" : "8",
  "title" : "Hermanos",
  "description" : "Hank's discovery of Gus Fring's fingerprint in Gale Boetticher's apartment is enough for DEA and Albuquerque PD to bring Gus in for an interview. He seems to have an answer for everything, including why his fingerprint was found at the crime scene. Everyone but Hank seems to be satisfied and they decide not to pursue the matter. Hank isn't so sure. Gus realizes how close he's come to being caught and in flashbacks, his entry into a world of crime and his work with the Mexican drug cartel is revealed. Hank involves Walt in his plan to track Gus' movements putting Walt ..."
}, {
  "imdbId" : "0903747",
  "season" : "4",
  "episodeNumber" : "9",
  "title" : "Bug",
  "description" : "Hank is like a dog with a bone and keeps digging into Gus Fring's business dealings despite Walt's attempts to get him to stop. When Hank learns that Gus has a warehouse operation, Mike and a crew have to get rid of any trace of drugs on the premises. The Cartel however is lying in wait. When Jesse expresses concern over his future well-being Gus asks him over for dinner and asks him one question: can he cook Walt's recipe without Walt's assistance. Skyler meanwhile gets a visit from her old boss who reveals that he's about to undergo an IRS audit. She has to be quick..."
}, {
  "imdbId" : "0903747",
  "season" : "4",
  "episodeNumber" : "10",
  "title" : "Salud",
  "description" : "Jesse, Gus, and Mike fly down to Mexico, and Jesse cooks the blue meth for the cartel. Walt misses his son's 16th birthday after his fight with Jesse."
}, {
  "imdbId" : "0903747",
  "season" : "4",
  "episodeNumber" : "11",
  "title" : "Crawl Space",
  "description" : "Hank asks Walt to drive him to the laundry where the meth lab is hidden. Ted still won't pay the IRS so Skyler asks Saul for help, and Saul sends in his A-Team. Gus and Jesse return from Mexico, and Walt fears he is in trouble with Gus."
}, {
  "imdbId" : "0903747",
  "season" : "4",
  "episodeNumber" : "12",
  "title" : "End Times",
  "description" : "The DEA is putting Hank and his family in protective custody, however, Walt refuses and awaits his fate in his house. Meanwhile, Brock has fallen terribly ill and Jesse suspects Walt may be behind it."
}, {
  "imdbId" : "0903747",
  "season" : "4",
  "episodeNumber" : "13",
  "title" : "Face Off",
  "description" : "Jesse is brought to the FBI for questioning on his knowledge of Ricin. In a last effort to kill Gus, Walt must ask for help from an old enemy."
}, {
  "imdbId" : "0903747",
  "season" : "5",
  "episodeNumber" : "1",
  "title" : "Live Free or Die",
  "description" : "Now that Gus is dead, Walt, Jesse, and Mike work to cover their tracks. Skyler panics when Ted Beneke wakes up."
}, {
  "imdbId" : "0903747",
  "season" : "5",
  "episodeNumber" : "2",
  "title" : "Madrigal",
  "description" : "Walt and Jesse decide to start things up again. Mike meets an old friend, who is worried about the outcome of the DEA's investigation on Gus and how it will affect them all."
}, {
  "imdbId" : "0903747",
  "season" : "5",
  "episodeNumber" : "3",
  "title" : "Hazard Pay",
  "description" : "Walt, Jesse and Mike start up business together."
}, {
  "imdbId" : "0903747",
  "season" : "5",
  "episodeNumber" : "4",
  "title" : "Fifty-One",
  "description" : "It's Walt's 51st birthday. His return to the drug business causes Skyler to go into depression."
}, {
  "imdbId" : "0903747",
  "season" : "5",
  "episodeNumber" : "5",
  "title" : "Dead Freight",
  "description" : "The boys plan on robbing a train, that has an entire car of methylamine."
}, {
  "imdbId" : "0903747",
  "season" : "5",
  "episodeNumber" : "6",
  "title" : "Buyout",
  "description" : "Jesse and Mike want out. They decide to sell the stolen methylamine to a competitor. That doesn't sit too well with Walt."
}, {
  "imdbId" : "0903747",
  "season" : "5",
  "episodeNumber" : "7",
  "title" : "Say My Name",
  "description" : "Mike and Jesse are out. Now Walt has to handle things on his own. Hank finally finds a rat in Mike's gang."
}, {
  "imdbId" : "0903747",
  "season" : "5",
  "episodeNumber" : "8",
  "title" : "Gliding Over All",
  "description" : "Walt expands his business overseas, and the money is pouring in."
}, {
  "imdbId" : "0903747",
  "season" : "5",
  "episodeNumber" : "9",
  "title" : "Blood Money",
  "description" : "Walt is out of the meth business and trying to move on with his life. Jesse tries to get rid of his money. Hank now knows that Walt is the famous Heisenberg."
}, {
  "imdbId" : "0903747",
  "season" : "5",
  "episodeNumber" : "10",
  "title" : "Buried",
  "description" : "Hank is determined to bring down Walt. Walt scrambles to hide evidence before Hank gets to it, and Skyler tries to stop Hank and Marie from taking away the kids."
}, {
  "imdbId" : "0903747",
  "season" : "5",
  "episodeNumber" : "11",
  "title" : "Confessions",
  "description" : "Walt makes his next move against Hank, putting Hank in a tough position. Hank confronts Jesse and attempts to turn him against Walt, and Jesse decides it's time to move on. Meanwhile, Todd has taken over the business."
}, {
  "imdbId" : "0903747",
  "season" : "5",
  "episodeNumber" : "12",
  "title" : "Rabid Dog",
  "description" : "Walt discovers Jesse broke into his house and attempted to burn it down. Walt wants to protect his family so he moves them into a hotel for a few nights. Jesse decides to work with Hank in order to take down Walt."
}, {
  "imdbId" : "0903747",
  "season" : "5",
  "episodeNumber" : "13",
  "title" : "To'hajiilee",
  "description" : "Jesse and Hank come up with an idea to take Walt down. Walt hires Todd's uncle to kill Jesse."
}, {
  "imdbId" : "0903747",
  "season" : "5",
  "episodeNumber" : "14",
  "title" : "Ozymandias",
  "description" : "Walt goes on the run. Jesse is taken hostage. Skyler believes it's time to tell Flynn the truth."
}, {
  "imdbId" : "0903747",
  "season" : "5",
  "episodeNumber" : "15",
  "title" : "Granite State",
  "description" : "Walt struggles as he adapts to aspects of his new identity. Jesse plans an escape against Jack and his crew."
}, {
  "imdbId" : "0903747",
  "season" : "5",
  "episodeNumber" : "16",
  "title" : "Felina",
  "description" : "Walt ties up whatever loose ends are left as the end draws near."
}]