[{
  "imdbId" : "0071042",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Backlash of the Hunter",
  "description" : "Jim helps a young girl whose father was murdered and LAPD has closed the case on without finding the killer."
}, {
  "imdbId" : "0071042",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "The Kirkoff Case",
  "description" : "Rockford is hired by Larry Kirkoff to find the identity of his parents killer. There are a number of possible suspects including Travis Buckman and Tawnia Baker who were lovers of Mrs. and Mr. Kirkoff respectively. The police actually suspect Larry of the crime, but, lack of evidence prevents them from making a case against him. Rockford's investigation runs him afoul of some pretty bad men who want everyone to go on thinking Larry killed them."
}, {
  "imdbId" : "0071042",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "The Dark and Bloody Ground",
  "description" : "Jim reluctantly agrees to work for Beth Davenport. His job is to help her prove her client, Ann Calhoun, is innocent of the crime she is accused of; murdering her husband Kevin Calhoun. Jim's investigation takes him to the town of Parker, Arizona, where the Calhouns are from. He digs up info someone doesn't want found out and is almost killed trying to return to L.A. Socialites Clyde Russell and Elizabeth Gorman, who were throwing a party the Calhouns attended, are also investigated. Jim's investigation is making someone nervous as another attempt is made on his life."
}, {
  "imdbId" : "0071042",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "The Countess",
  "description" : "A woman meets a man on a lonely stretch of highway while Rockford is filming the exchange from a hillside. Jim is working for the woman. Her name is Deborah Ryder and she is being blackmailed by Carl Brego. He has information of her sordid past and ties to organized crime which she doesn't want revealed. Jim is confident he can get Brego off her back, but, things go sour for him when Brego is killed and the police think Jim did it."
}, {
  "imdbId" : "0071042",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Exit Prentiss Carr",
  "description" : "Rockford has been hired by Janet Carr to locate her husband Prentiss. He finds him dead in a hotel bungalow in Bay City. It looks like murder to Jim but later when the police investigate they deem it a suicide. Jim is convinced it was murder and begins to question Janet as to her whereabouts. He doesn't know who to trust...Janet appears reluctant to tell Jim where she was and he thinks the police could be covering something up."
}, {
  "imdbId" : "0071042",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Tall Woman in Red Wagon",
  "description" : "Jim is hired by a newspaper woman to find her missing friend, who then insists on tagging along to \"help\" his investigation. The missing friend had a sordid past, and several of her old friends want to find her just as badly."
}, {
  "imdbId" : "0071042",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "This Case Is Closed",
  "description" : "Jim travels to Newark, and draws the attention of organized crime and the FBI. The FBI is protecting Jim's target because he is a former federal witness. The target is found dead, and Jim's client has some explaining to do."
}, {
  "imdbId" : "0071042",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "The Big Ripoff",
  "description" : "Suspecting her ex-lover was killed by his wife, a woman hires Rockford to jet to Europe to compile evidence. After a fling with the widow, Rockford suspects Steve Nelson faked his death. When Rockford reveals his findings, the former girlfriend stiffs him for his fee and leaves town. Because Rockford plans to get the insurance finder's fee, he follows the spurned lover to a California mountain resort, where it seems everybody except local artist's model Marilyn Polonski wants the L.A. P.I. gone ASAP."
}, {
  "imdbId" : "0071042",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "Find Me If You Can",
  "description" : "Rockford reluctantly takes a unique assignment: a beautiful mystery woman wants him to find her, to see if someone she fears could also track her down. With a check poised to bounce, the ex-con PI needs the retainer to balance his always-challenged checking account. When Rockford checks with a local police department, he worms out a chilling piece of data: she's been dating Denver Mafia capo-regime, hot-tempered Ralph Correll. But the more Barbara Kelbaker strings along Jim Rockford, the more he's charmed into helping the desperate 30 something."
}, {
  "imdbId" : "0071042",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "In Pursuit of Carol Thorne",
  "description" : "Jim tails a woman just released from prison. She was involved in a robbery of a Marine Payroll. The mastermind of the crime and his henchman follow her as well. They search for the remaining robber who wound up with the loot."
}, {
  "imdbId" : "0071042",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "The Dexter Crisis",
  "description" : "Rockford ends up in the Nevada desert (starting with the bright lights of Las Vegas) searching for a rich guy's mistress and her suitcase of precious \"documents.\""
}, {
  "imdbId" : "0071042",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "Caledonia - It's Worth a Fortune!",
  "description" : "When knowledge of a critically ill convict's hidden fortune comes to light, Rockford becomes involved in helping the con's wife find the treasure before his former partner arrives and demands his share."
}, {
  "imdbId" : "0071042",
  "season" : "1",
  "episodeNumber" : "13",
  "title" : "Profit and Loss, Part 1: Profit",
  "description" : "Jim investigates a large corporation when one of its executives is kidnapped and the wife of another executive claims the company murdered her husband."
}, {
  "imdbId" : "0071042",
  "season" : "1",
  "episodeNumber" : "14",
  "title" : "Profit and Loss, Part 2: Loss",
  "description" : "Rockford discovers the investment firm Fiscal Dynamics is a financial fraud and its president Leon Fielder will do anything to prevent him from destroying his company."
}, {
  "imdbId" : "0071042",
  "season" : "1",
  "episodeNumber" : "15",
  "title" : "Aura Lee, Farewell",
  "description" : "Jim's old friend Sara Butler hires him to find out the real reason her employee Aura Lee Benton died. The police believe it was a drug overdose but Sara is convinced she was murdered."
}, {
  "imdbId" : "0071042",
  "season" : "1",
  "episodeNumber" : "16",
  "title" : "Sleight of Hand",
  "description" : "Jim's girlfriend suddenly disappears with no clue as to how or why. Lt. Diel thinks Rockford is probably responsible for her disappearance and orders him to stay away from the case. But Jim can't stop until he finds out what happened."
}, {
  "imdbId" : "0071042",
  "season" : "1",
  "episodeNumber" : "17",
  "title" : "Counter Gambit",
  "description" : "Two former cons hire Rockford to find an old girlfriend. They actually want her valuable pearl necklace and implicate him as the thief. With Angel's help, he'll get the pearls back and square himself with the police."
}, {
  "imdbId" : "0071042",
  "season" : "1",
  "episodeNumber" : "18",
  "title" : "Claire",
  "description" : "Jim's old girlfriend Claire Prescott calls him for protection from two hoods. He soon discovers there is a missing undercover cop, which puts him up against an arrogant Cpt. Highland as well as the two thugs."
}, {
  "imdbId" : "0071042",
  "season" : "1",
  "episodeNumber" : "19",
  "title" : "Say Goodbye to Jennifer",
  "description" : "An old war buddy of Jim's, now a fashion photographer, hires him to track down a beautiful fashion model, whom the authorities claim was killed in a fiery multi-car accident. It turns out the model -- whom several people want dead because of her suspected role in the murder of her nephew -- is hiding in Seattle, and it is up to Jim to find out why."
}, {
  "imdbId" : "0071042",
  "season" : "1",
  "episodeNumber" : "20",
  "title" : "Charlie Harris at Large",
  "description" : "Charlie Harris, Rockford's former cell mate, is suspected of murdering his rich wife and is on the run. He calls on Rockford to find his alibi witness, a mystery woman with whom he was having an affair."
}, {
  "imdbId" : "0071042",
  "season" : "1",
  "episodeNumber" : "21",
  "title" : "The Four Pound Brick",
  "description" : "A cop dies in an accident that his mother refuses to accept. Rocky offers Jim's services free of charge. After begrudgingly accepting the case he discovers that dirty cops might be involved which then pits him against a very angry Lt. Diel."
}, {
  "imdbId" : "0071042",
  "season" : "1",
  "episodeNumber" : "22",
  "title" : "Just by Accident",
  "description" : "A race car driver dies in an apparent accident that his mother, an old friend of Jim's, thinks was no accident. It turns out he was part of an insurance scam outfit and they soon have a similar plan for Rockford."
}, {
  "imdbId" : "0071042",
  "season" : "1",
  "episodeNumber" : "23",
  "title" : "Roundabout",
  "description" : "An insurance company hires Rockford to locate a missing woman who is due an inheritance. He finds her in Las Vegas where she is an unwitting pawn in a money laundering operation."
}, {
  "imdbId" : "0071042",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "The Aaron Ironwood School of Success",
  "description" : "Aaron Ironwood, a childhood friend of Jim's, comes to town with a business deal that is just too good to be true. He finally agrees to the deal as he thinks Aaron might be in some kind of trouble. He's is - with both the FBI and the mob."
}, {
  "imdbId" : "0071042",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "The Farnsworth Stratagem",
  "description" : "Dennis pleads with Jim to untangle him from a timeshare con, without Dennis' boss, Jim's nemesis Lt. Diehl, finding out he's a victim too. Rockford's a lot more interested when a friend of Dennis' who's also an unhappy vacation homeowner, proves very helpful, and happens to be a gorgeous single blonde. Jim recruits his father and Angel to out-scam the scammers."
}, {
  "imdbId" : "0071042",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "Gearjammers, Part 1",
  "description" : "Rocky is targeted for death after seeing a meeting between a truck dispatcher and a crooked executive. Jim wants desperately to protect his father but discovers he hasn't been keeping up with Rocky enough to even find him on a typical day. The dispatcher was giving the supposedly-retired Rocky work as a trucker, so when Jim discovers the dispatcher dead in a crate bound for Malaysia, the police figure the elusive Rocky knows why."
}, {
  "imdbId" : "0071042",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "Gearjammers, Part 2",
  "description" : "The Rockfords work with Sgt. Becker to solve Rocky's friend's murder. When 6 tractor trailers from the same depot are hijacked by a gang, there must be a connection with the killing, but who desperately needs tons of ladies' underwear, grapefruit and dynamite ? The proud Rocky resents Jim taking care of him, making the slew of hit-men even harder to combat for Dennis and a very confused LAPD."
}, {
  "imdbId" : "0071042",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "The Deep Blue Sleep",
  "description" : "After a late night phone call Beth hires Jim to look for a missing friend who eventually turns up dead. The dead woman worked for a fashion designer who is unknowingly in up to her neck with some very bad \"fellas\"."
}, {
  "imdbId" : "0071042",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "The Great Blue Lake Land and Development Company",
  "description" : "When his car breaks down in a small town Jim leaves $10,000 in a land company's safe. The next morning the money - and the man who locked the money up - are gone. When the man turns up dead the sheriff thinks Rockford did it."
}, {
  "imdbId" : "0071042",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "The Real Easy Red Dog",
  "description" : "Christine Dusseau, a female private eye, first blindsides Rockford, then joins him in tracking down the murderer in a case the police have dismissed as a suicide."
}, {
  "imdbId" : "0071042",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "Resurrection in Black & White",
  "description" : "Convinced that a convicted murderer is actually innocent, a journalist looking for a scoop hires Jim to investigate a six year old murder."
}, {
  "imdbId" : "0071042",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "Chicken Little Is a Little Chicken",
  "description" : "Angel asks Jim to help him collect some money from someone who supposedly welshed on a deal. Not surprisingly he hasn't told Jim the whole truth, which includes two very angry hoods who want money Angel owes them."
}, {
  "imdbId" : "0071042",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "2 Into 5.56 Won't Go",
  "description" : "When an army colonel is murdered after contacting Rockford, Rockford is forced into the middle of a conflict involving military police, military thieves and the colonel's daughter."
}, {
  "imdbId" : "0071042",
  "season" : "2",
  "episodeNumber" : "11",
  "title" : "Pastoria Prime Pick",
  "description" : "A farming hub has more business than it can handle, including giving Rockford the business. The PI's car breaks down near the boomtown, after a source Rockford contacts in a divorce case steers Rockford there. While his car is being worked on, Rockford is quickly entangled between an underage motel worker and her jealous cop boyfriend, and in a double-cross over a narcotics deal. Is it just another tricky day for unlucky Jim, or is bucolic New Pastoria a sunny sin city ?"
}, {
  "imdbId" : "0071042",
  "season" : "2",
  "episodeNumber" : "12",
  "title" : "The Reincarnation of Angie",
  "description" : "Hoods snatch a stockbroker, and his sister hires Rockford for $23.64, because Jim's in the yellow pages and her big brother instructed her not to dial the cops. Jim's protective of the naive 25 year old bookkeeper, despite the tiny fee, because he fears her brother is dead, and she can't accept that her only relative, who's always taken care of her, may be mixed up in a securities scam."
}, {
  "imdbId" : "0071042",
  "season" : "2",
  "episodeNumber" : "13",
  "title" : "The Girl in the Bay City Boys Club",
  "description" : "Jim goes undercover to expose an illegal gambling club and gets help from a young D.A."
}, {
  "imdbId" : "0071042",
  "season" : "2",
  "episodeNumber" : "14",
  "title" : "The Hammer of C Block",
  "description" : "A friend from Jim's time in prison after getting out, needs help clearing himself from the crime he was put into prison for."
}, {
  "imdbId" : "0071042",
  "season" : "2",
  "episodeNumber" : "15",
  "title" : "The No-Cut Contract",
  "description" : "A minor league football player drags Jim into his troubles."
}, {
  "imdbId" : "0071042",
  "season" : "2",
  "episodeNumber" : "16",
  "title" : "A Portrait of Elizabeth",
  "description" : "A client of Beth's hires Jim misleadingly to check on his company."
}, {
  "imdbId" : "0071042",
  "season" : "2",
  "episodeNumber" : "17",
  "title" : "Joey Blue Eyes",
  "description" : "Jim helps one of Beth's clients, who is being swindled out of his business."
}, {
  "imdbId" : "0071042",
  "season" : "2",
  "episodeNumber" : "18",
  "title" : "In Hazard",
  "description" : "Beth has trouble and is nearly killed by a client with tax trouble."
}, {
  "imdbId" : "0071042",
  "season" : "2",
  "episodeNumber" : "19",
  "title" : "The Italian Bird Fiasco",
  "description" : "Jim gets hired by a diamond smuggler posing as an art dealer causing trouble for Jim with LAPD and other smugglers."
}, {
  "imdbId" : "0071042",
  "season" : "2",
  "episodeNumber" : "20",
  "title" : "Where's Houston?",
  "description" : "Rocky's friend is killed thinking his Granddaughter was kidnapped leading Jim with the help of Rocky to untangle a crooked real estate deal."
}, {
  "imdbId" : "0071042",
  "season" : "2",
  "episodeNumber" : "21",
  "title" : "Foul on the First Play",
  "description" : "Jim's shackled to his ex-parole officer Marcus Aurelius, now a PI himself, when a no-holds barred competition for a new NBA franchise ensnares both sleazes. Jim can't figure which jock-sucker, the motormouth Marc works for, but whoever it is, they keep bringing Jim the pain and costing him way-too-many non-reimbursed expenses. As a PO, slick Marc tried to send Jim back up the river; as a PI, he runs Jim dizzy dodging bullets."
}, {
  "imdbId" : "0071042",
  "season" : "2",
  "episodeNumber" : "22",
  "title" : "A Bad Deal in the Valley",
  "description" : "Rockford finds himself in the middle of a bad deal indeed when he agrees to help an old girlfriend and ends up with a suitcase full of counterfeit money and under arrest by the F.B.I."
}, {
  "imdbId" : "0071042",
  "season" : "3",
  "episodeNumber" : "1",
  "title" : "The Fourth Man",
  "description" : "Jim helps a friend who works in the airline industry, who's apparently being pursued by a hit man, and she's no idea why she's being targeted."
}, {
  "imdbId" : "0071042",
  "season" : "3",
  "episodeNumber" : "2",
  "title" : "The Oracle Wore a Cashmere Suit",
  "description" : "Rockford finds himself getting unwanted attention from the media and police, when a popular psychic fingers him as having important information on the disappearance of two people."
}, {
  "imdbId" : "0071042",
  "season" : "3",
  "episodeNumber" : "3",
  "title" : "The Family Hour",
  "description" : "Jim and Rocky find an abandoned young girl that leads to Jim finding and helping her father."
}, {
  "imdbId" : "0071042",
  "season" : "3",
  "episodeNumber" : "4",
  "title" : "Feeding Frenzy",
  "description" : "Jim helps a friend who wants to pay back money he stole three years earlier when his daughter then gets kidnapped leading to problems for Jim with the kidnappers and the police."
}, {
  "imdbId" : "0071042",
  "season" : "3",
  "episodeNumber" : "5",
  "title" : "Drought at Indianhead River",
  "description" : "Jim finds out there's a hit out on Angel and runs into trouble with the mob bailing him out."
}, {
  "imdbId" : "0071042",
  "season" : "3",
  "episodeNumber" : "6",
  "title" : "Coulter City Wildcat",
  "description" : "Rocky is forced to sign oil lease rights he owns away, leading Jim to investigate who and why someone wanted Rocky's seemingly worthless leases so badly."
}, {
  "imdbId" : "0071042",
  "season" : "3",
  "episodeNumber" : "7",
  "title" : "So Help Me God",
  "description" : "Jim gets called before a grand jury where he promptly gets thrown into jail for contempt."
}, {
  "imdbId" : "0071042",
  "season" : "3",
  "episodeNumber" : "8",
  "title" : "Rattlers' Class of '63",
  "description" : "Angel is working a con involving the sale of a landfill, and unknown to him or Jim, it happens to be the location of a dead body from an unsolved case from twelve years before. The people who put it there don't want it found."
}, {
  "imdbId" : "0071042",
  "season" : "3",
  "episodeNumber" : "9",
  "title" : "Return to the 38th Parallel",
  "description" : "Jim gets used by an old Army buddy in an insurance recovery case."
}, {
  "imdbId" : "0071042",
  "season" : "3",
  "episodeNumber" : "10",
  "title" : "Piece Work",
  "description" : "While investigating an insurance claim Jim accidentally stumbles into a gun smuggling operation."
}, {
  "imdbId" : "0071042",
  "season" : "3",
  "episodeNumber" : "11",
  "title" : "The Trouble with Warren",
  "description" : "Beth's nerdy cousin Warren drags Jim into his mounting troubles."
}, {
  "imdbId" : "0071042",
  "season" : "3",
  "episodeNumber" : "12",
  "title" : "There's One in Every Port",
  "description" : "After being conned by friends Jim sets them up to settle the score and save himself."
}, {
  "imdbId" : "0071042",
  "season" : "3",
  "episodeNumber" : "13",
  "title" : "Sticks and Stones May Break Your Bones, But Waterbury Will Bury You",
  "description" : "When several of Jim's fellow P.I.'s lose their licenses under circumstances that are suspiciously similar, he begins to suspect that someone is targeting independent investigators and systematically putting them out of business."
}, {
  "imdbId" : "0071042",
  "season" : "3",
  "episodeNumber" : "14",
  "title" : "The Trees, the Bees and T.T. Flowers: Part 1",
  "description" : "Jim helps a friend of Rocky's who's being forced off his property."
}, {
  "imdbId" : "0071042",
  "season" : "3",
  "episodeNumber" : "15",
  "title" : "The Trees, the Bees and T.T. Flowers: Part 2",
  "description" : "Jim helps a friend of Rocky's who's being forced off his property."
}, {
  "imdbId" : "0071042",
  "season" : "3",
  "episodeNumber" : "16",
  "title" : "The Becker Connection",
  "description" : "Rockford's newest case is to clear his friend Dennis Becker, who is suspected of selling drugs to deal with his financial problems."
}, {
  "imdbId" : "0071042",
  "season" : "3",
  "episodeNumber" : "17",
  "title" : "Just Another Polish Wedding",
  "description" : "Jim gets Gandy a job with his P.I. buddy Marcus Hayes who promptly then tries to steal the case."
}, {
  "imdbId" : "0071042",
  "season" : "3",
  "episodeNumber" : "18",
  "title" : "New Life, Old Dragons",
  "description" : "Jim is hired by a Vietnamese refugee to find her missing brother."
}, {
  "imdbId" : "0071042",
  "season" : "3",
  "episodeNumber" : "19",
  "title" : "To Protect and Serve: Part 1",
  "description" : "Rockford is hired to find a missing woman, only to discover that she is also being sought by a New York crime family."
}, {
  "imdbId" : "0071042",
  "season" : "3",
  "episodeNumber" : "20",
  "title" : "To Protect and Serve: Part 2",
  "description" : "Rockford tries to keep a woman on the run out of the hands of two Minette hoods (and her revenge minded ex-fiancé) but the bungling interference of a disturbed police groupie threatens to get them both killed."
}, {
  "imdbId" : "0071042",
  "season" : "3",
  "episodeNumber" : "21",
  "title" : "Crack Back",
  "description" : "Beth turns to Jim for help when she finds herself being mentally harassed by a mysterious man while trying to win an important trial."
}, {
  "imdbId" : "0071042",
  "season" : "3",
  "episodeNumber" : "22",
  "title" : "Dirty Money, Black Light",
  "description" : "Jim becomes very concerned when Rocky starts receiving thousands of dollars through the mail."
}, {
  "imdbId" : "0071042",
  "season" : "4",
  "episodeNumber" : "1",
  "title" : "Beamer's Last Case",
  "description" : "Rockford returns from vacation in Puerto Rico to discover someone has been using his identity, his trailer and totaled his Firebird. And that's just the beginning of his problems..."
}, {
  "imdbId" : "0071042",
  "season" : "4",
  "episodeNumber" : "2",
  "title" : "Trouble in Chapter 17",
  "description" : "Jim is reluctantly drawn into being bodyguard for a famous author, who believes her popular book on the perfect wife is the cause of death threats against her."
}, {
  "imdbId" : "0071042",
  "season" : "4",
  "episodeNumber" : "3",
  "title" : "The Battle of Canoga Park",
  "description" : "Jim finds himself in an explosive situation when the gun he hides in his cookie jar is used in a murder."
}, {
  "imdbId" : "0071042",
  "season" : "4",
  "episodeNumber" : "4",
  "title" : "Second Chance",
  "description" : "When the life of Gandy Fitch's girlfriend is in danger, he turns to Rockfish for help."
}, {
  "imdbId" : "0071042",
  "season" : "4",
  "episodeNumber" : "5",
  "title" : "The Dog and Pony Show",
  "description" : "Helping a young woman with a history of mental illness leads Jim into crossing paths with the Mob and federal intelligence."
}, {
  "imdbId" : "0071042",
  "season" : "4",
  "episodeNumber" : "6",
  "title" : "Requiem for a Funny Box",
  "description" : "A washed-up comedian finds out about a Mob family member's secret, and gets Jim in trouble by framing him for a murder."
}, {
  "imdbId" : "0071042",
  "season" : "4",
  "episodeNumber" : "7",
  "title" : "Quickie Nirvana",
  "description" : "Rockford ends up regretting allowing an eccentric hippie woman to use his address temporarily, when her ex-boss sends a pair of thugs after her to retrieve some money he put in her care."
}, {
  "imdbId" : "0071042",
  "season" : "4",
  "episodeNumber" : "8",
  "title" : "Irving the Explainer",
  "description" : "Rockford gives himself a headache trying to solve the connection between a 30 year old murder, a valuable missing painting and Nazi Germany."
}, {
  "imdbId" : "0071042",
  "season" : "4",
  "episodeNumber" : "9",
  "title" : "The Mayor's Committee from Deer Lick Falls",
  "description" : "Jim is hired by some small-town businessmen to help them buy a fire engine; they really want him to assassinate someone who could bring the IRS down on them."
}, {
  "imdbId" : "0071042",
  "season" : "4",
  "episodeNumber" : "10",
  "title" : "Hotel of Fear",
  "description" : "Accidently witnessing a murder makes Angel Martin the police's prime witness in the trial of the murderer."
}, {
  "imdbId" : "0071042",
  "season" : "4",
  "episodeNumber" : "11",
  "title" : "Forced Retirement",
  "description" : "Jim gets a whiff of corporate corruption when Beth asks him to check up on a client's associates."
}, {
  "imdbId" : "0071042",
  "season" : "4",
  "episodeNumber" : "12",
  "title" : "The Queen of Peru",
  "description" : "The RV family from hell decides to set up camp next door to Jim's trailer, just when he's got the recovery of a stolen diamond on his mind."
}, {
  "imdbId" : "0071042",
  "season" : "4",
  "episodeNumber" : "13",
  "title" : "A Deadly Maze",
  "description" : "Jim is unwittingly involved in a bizarre experiment when hired to find a man's missing wife."
}, {
  "imdbId" : "0071042",
  "season" : "4",
  "episodeNumber" : "14",
  "title" : "The Attractive Nuisance",
  "description" : "An unexplained break-in at Rocky's new diner has connections with the FBI fifty years ago."
}, {
  "imdbId" : "0071042",
  "season" : "4",
  "episodeNumber" : "15",
  "title" : "The Gang at Don's Drive-In",
  "description" : "An author suffering from writers block tells Jim he thinks he has the next best seller in an old murder case from 1961."
}, {
  "imdbId" : "0071042",
  "season" : "4",
  "episodeNumber" : "16",
  "title" : "The Paper Palace",
  "description" : "A prostitute hires Jim to find out who has been sending her death threats."
}, {
  "imdbId" : "0071042",
  "season" : "4",
  "episodeNumber" : "17",
  "title" : "Dwarf in a Helium Hat",
  "description" : "A threat to the wrong phone number has Jim scrambling to find out who it was meant for."
}, {
  "imdbId" : "0071042",
  "season" : "4",
  "episodeNumber" : "18",
  "title" : "South by Southeast",
  "description" : "Mistaken identity by federal agents has Jim being sent to South America to help them contact a heiress, who has been isolated by her possessive husband."
}, {
  "imdbId" : "0071042",
  "season" : "4",
  "episodeNumber" : "19",
  "title" : "The Competitive Edge",
  "description" : "Jim winds up in a funny farm when he gets too close to the truth about an elite health club."
}, {
  "imdbId" : "0071042",
  "season" : "4",
  "episodeNumber" : "20",
  "title" : "The Prisoner of Rosemont Hall",
  "description" : "When the son of an old friend goes missing, Jim goes to the young man's college to try and find out what happened."
}, {
  "imdbId" : "0071042",
  "season" : "4",
  "episodeNumber" : "21",
  "title" : "The House on Willis Avenue",
  "description" : "When a fellow P.I. is killed on the Ventura freeway, Jim and Richie Brockelman team up to find out if it really was an accident."
}, {
  "imdbId" : "0071042",
  "season" : "5",
  "episodeNumber" : "1",
  "title" : "Heartaches of a Fool",
  "description" : "Jim finds that a country music star, corrupt union boss and Chinese triad all have one thing in common with why Rocky ended in hospital after his rig was forced off the road: sausages."
}, {
  "imdbId" : "0071042",
  "season" : "5",
  "episodeNumber" : "2",
  "title" : "Rosendahl and Gilda Stern Are Dead",
  "description" : "A doctor's murder has direct connections to the Mob, and Jim comes to the assistance of hooker friend Rita Capcovik when she finds herself entangled in it."
}, {
  "imdbId" : "0071042",
  "season" : "5",
  "episodeNumber" : "3",
  "title" : "The Jersey Bounce",
  "description" : "Wrongly accused of beating a man to death, Jim discovers the best legal advice he can find is from disbarred lawyer John Cooper."
}, {
  "imdbId" : "0071042",
  "season" : "5",
  "episodeNumber" : "4",
  "title" : "White on White and Nearly Perfect",
  "description" : "Handsome, charmed PI Lance White may speak lines that sound like they're from a 1940s B movie, but everyone is so attracted to him they hang on his every word. That is everyone except Jim."
}, {
  "imdbId" : "0071042",
  "season" : "5",
  "episodeNumber" : "5",
  "title" : "Kill the Messenger",
  "description" : "When an already overly stressed Dennis Becker is lumped with the unwelcome task of finding out who murdered Deputy Chief Town's unfaithful wife, Jim decides to lend a hand in the investigation."
}, {
  "imdbId" : "0071042",
  "season" : "5",
  "episodeNumber" : "6",
  "title" : "A Good Clean Bust with Sequel Rights",
  "description" : "Jim is forced to babysit Chicago ex-cop, now celebrity, \"Frank Falcone,\" who has a television show and toy line. Falcone isn't easy to babysit, and things get dicey when some old Chicago \"friends\" of Falcone show up to complicate things."
}, {
  "imdbId" : "0071042",
  "season" : "5",
  "episodeNumber" : "7",
  "title" : "Three Day Affair with a Thirty Day Escrow",
  "description" : "After being strong-armed by an Arab sheik and his goons, and getting no help from the police, Jim decides to track down the two people who caused his trouble: a soft-voiced gigolo and the sheik's naive daughter."
}, {
  "imdbId" : "0071042",
  "season" : "5",
  "episodeNumber" : "8",
  "title" : "The Empty Frame",
  "description" : "A swanky party, attended by high society and Police Dept. VIPs, is robbed while Lt. Doug Chapman is in charge of security. Desperate to get back into good graces with his superiors, Chapman swallows his pride and asks Rockford to help him."
}, {
  "imdbId" : "0071042",
  "season" : "5",
  "episodeNumber" : "9",
  "title" : "Black Mirror: Part 1",
  "description" : "A blind psychologist, who is being terrorized by an unknown stalker, turns to Jim for help."
}, {
  "imdbId" : "0071042",
  "season" : "5",
  "episodeNumber" : "10",
  "title" : "Black Mirror: Part 2",
  "description" : "Rockford's investigation of psychologist Megan Dougherty's stalker leads him to one of her patients who may have a split personality - one of which is a paid killer."
}, {
  "imdbId" : "0071042",
  "season" : "5",
  "episodeNumber" : "11",
  "title" : "A Fast Count",
  "description" : "Jim puts up his dukes and steps forward to help a boxing coach who has been framed with bribery and murder."
}, {
  "imdbId" : "0071042",
  "season" : "5",
  "episodeNumber" : "12",
  "title" : "Local Man Eaten by Newspaper",
  "description" : "Jim could use some saintly guidance when he goes undercover on a scandal rag that is getting confidential medical information on a doctor's famous, and infamous, patients."
}, {
  "imdbId" : "0071042",
  "season" : "5",
  "episodeNumber" : "13",
  "title" : "With the French Heel Back, Can the Nehru Jacket Be Far Behind?",
  "description" : "A fashion model friend of Jim is found dead on the ground below her balcony. The police believe it's suicide, but having gotten a desperate phone call from her, Jim believes it's murder."
}, {
  "imdbId" : "0071042",
  "season" : "5",
  "episodeNumber" : "14",
  "title" : "The Battle-Ax and the Exploding Cigar",
  "description" : "Ignorant that he's been driving a hot Cadillac with an illegal stash of guns in the trunk, leads Jim into rubbing shoulders with the FBI and the Company."
}, {
  "imdbId" : "0071042",
  "season" : "5",
  "episodeNumber" : "15",
  "title" : "Guilt",
  "description" : "Jim finds his guilty conscience being manipulated by a former fiancee, who asks him to find out who is threatening her life."
}, {
  "imdbId" : "0071042",
  "season" : "5",
  "episodeNumber" : "16",
  "title" : "The Deuce",
  "description" : "Having Jim doing jury duty leads to a mistrial and his being hired to investigate the case of pedestrian hit by a drunk-driver that brought the accused to court."
}, {
  "imdbId" : "0071042",
  "season" : "5",
  "episodeNumber" : "17",
  "title" : "The Man Who Saw the Alligators",
  "description" : "If having the IRS wanting to do an audit isn't bad enough, a gangster Jim helped put in prison is out on parole and wants a pound of his flesh in revenge."
}, {
  "imdbId" : "0071042",
  "season" : "5",
  "episodeNumber" : "18",
  "title" : "The Return of the Black Shadow",
  "description" : "A gang of bikers beat up Jim and assault John Cooper's sister, leading Coop to seek vengeance by returning to a darker period in his past when he was in a biker gang."
}, {
  "imdbId" : "0071042",
  "season" : "5",
  "episodeNumber" : "19",
  "title" : "A Material Difference",
  "description" : "Jim finds himself being dragged into a complicated situation when Angel's con job as a hit man for hire goes awry."
}, {
  "imdbId" : "0071042",
  "season" : "5",
  "episodeNumber" : "20",
  "title" : "Never Send a Boy King to Do a Man's Job: Part 1",
  "description" : "When a corrupt businessman uses extortion to force Richie Brockleman's father to sell him his business for a paltry amount, Richie goes to Jim for advice on how to get back at him with a con job."
}, {
  "imdbId" : "0071042",
  "season" : "5",
  "episodeNumber" : "21",
  "title" : "Never Send a Boy King to Do a Man's Job: Part 2",
  "description" : "Richie's father has been swindled by a man named Coombs. Jim assembles together a disparate group of con-artists in a complicated scheme using Coombs' anxieties, and even the \"Curse\" of King Tut, to save Mr. Brockelman from ruin."
}, {
  "imdbId" : "0071042",
  "season" : "5",
  "episodeNumber" : "22",
  "title" : "A Different Drummer",
  "description" : "While in hospital after a car accident, Jim stumbles across a black market for vital organs."
}, {
  "imdbId" : "0071042",
  "season" : "6",
  "episodeNumber" : "1",
  "title" : "Paradise Cove",
  "description" : "Jim's Malibu neighbourhood becomes the site of a treasure hunt for a stash of gold bullion, stolen fifty years earlier."
}, {
  "imdbId" : "0071042",
  "season" : "6",
  "episodeNumber" : "2",
  "title" : "Lions, Tigers, Monkeys and Dogs: Part 1",
  "description" : "Jim rubs shoulders with royalty when a princess hires him because she believes someone is trying to kill her friend."
}, {
  "imdbId" : "0071042",
  "season" : "6",
  "episodeNumber" : "3",
  "title" : "Lions, Tigers, Monkeys and Dogs: Part 2",
  "description" : "Rockford continues to investigate why someone is after Kendall and discovers the person responsible is the last person anyone would have expected."
}, {
  "imdbId" : "0071042",
  "season" : "6",
  "episodeNumber" : "4",
  "title" : "Only Rock 'n' Roll Will Never Die: Part 1",
  "description" : "Jim senses something is out of tune while looking into the disappearance of a rock star's producer."
}, {
  "imdbId" : "0071042",
  "season" : "6",
  "episodeNumber" : "5",
  "title" : "Only Rock 'n' Roll Will Never Die: Part 2",
  "description" : "While consoling his morose love-lorn friend Eddie, Jim continues to look for the missing producer. He eventually finds his body but the presumed killer is not whom he had expected."
}, {
  "imdbId" : "0071042",
  "season" : "6",
  "episodeNumber" : "6",
  "title" : "Love Is the Word",
  "description" : "Jim reconnects with Dr. Megan Dougherty and discovers she is engaged to another man. When she believes he is missing Jim agrees to help her, despite the fact he disapproves of her engagement and for his feelings for Megan."
}, {
  "imdbId" : "0071042",
  "season" : "6",
  "episodeNumber" : "7",
  "title" : "Nice Guys Finish Dead",
  "description" : "The special guest of a P.I. convention dinner is found murdered in the restroom, and Jim unhappily finds himself once more having to team up with flawless Lance White, while accident prone Freddie Beamer tags along."
}, {
  "imdbId" : "0071042",
  "season" : "6",
  "episodeNumber" : "8",
  "title" : "The Hawaiian Headache",
  "description" : "Jim is tricked into believing he's won a trip to Hawaii, when it really turns out to be doing a favor for an old army pal in the CIA."
}, {
  "imdbId" : "0071042",
  "season" : "6",
  "episodeNumber" : "9",
  "title" : "No Fault Affair",
  "description" : "Rita Capkovic comes to Jim for help after her former pimp has beaten her up for refusing to work for him again. As Jim helps Rita recover she begins to see him as more than just as a friend, to the concern of everyone."
}, {
  "imdbId" : "0071042",
  "season" : "6",
  "episodeNumber" : "10",
  "title" : "The Big Cheese",
  "description" : "Rockford gets a phone call telling him to expect a package in the mail. Two hoods then murder the caller and go to Rockford's trailer to await the package's arrival. When the package is a wheel of cheese the mystery only gets deeper."
}, {
  "imdbId" : "0071042",
  "season" : "6",
  "episodeNumber" : "11",
  "title" : "Just a Coupla Guys",
  "description" : "Rockford flies to Newark for a case and is robbed, leaving him stranded at the police station. Jim is caught in the middle of a mob war when 2 mooks, looking to make a name for themselves, get involved and complicate everything."
}, {
  "imdbId" : "0071042",
  "season" : "6",
  "episodeNumber" : "12",
  "title" : "Deadlock in Parma",
  "description" : "In the series finale, Jim Rockford drives off into a California sunset in his wounded Firebird, after being ensnared in a small-town council battle with big implications. While trout fishing in the mountains, the vacationing PI becomes the emergency proxy for a fellow angler, an environmentalist councilman, felled by appendicitis. But the seemingly-innocuous proposition for a Parma city park, attracts a trailer load of New Jersey mobsters who urge Rockford to keep his vote green, or sleep with the fishes. Meanwhile, this town council in the land of endless ..."
}]