[{
  "imdbId" : "0426688",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "To Arms",
  "description" : "The First World War shaped the twentieth century. It sparked the Russian Revolution, and it launched America as a world power. The fault lines from its failed peace settlement led to a second terrible world war barely twenty years later. We live with its unresolved consequences; in the Middle East, the Balkans and Ireland. It began as a clash in the Balkans, which grew to engulf Europe and the world. Britain joined in, more to protect her great empire than for the defence of small nations. The merciless pattern of the war was set early on, with Austro-Hungarian atrocities against Serbian civilians."
}, {
  "imdbId" : "0426688",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Under the Eagle",
  "description" : "The first months of the war on the Western Front were mobile, fast and dangerous; casualty rates were higher than with later trench warfare. The Germans were halted by the Allies at the Battle of the Mame, fell back to high ground and dug in. The Allies followed suit. The resulting line of trenches stretched from the Channel to Switzerland. Now 11 million French and Belgian civilians were under occupation. German brutality was no myth. Resistance was ruthlessly surpressed. Civilians, including women and children were massacred, used as human shields, and sent to concentration camps as hostages and forced labourers."
}, {
  "imdbId" : "0426688",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Global War",
  "description" : "War for Europe meant war for the world. Germany gambled that Britain might risk everything to protect her Empire - even victory on the Western Front. So, to divert British resources, maverick German commanders led the British a dance; across the Pacific, Africa and the Middle East. They became legends in Germany and Britain - men like Admiral Graf von Spee, who inflicted Britain's greatest naval defeat for 250 years. The global war sucked in Africans, Chinese and Indians to serve in France. Meanwhile the war in Africa exploited its people and left behind a wasteland, but sowed the seeds of self-determination."
}, {
  "imdbId" : "0426688",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Jihad",
  "description" : "The history of Turkey's involvement in World War I."
}, {
  "imdbId" : "0426688",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Shackled to a Corpse",
  "description" : "The war on the Eastern Front was racial; Slav verses Teuton. It was highly mobile, fought across brutal terrain from the Urais to the Alps. It initiated many horros of twentieth century warfare: chemical weapons, mass expulsions of civilians, the persecution of Jews. The Italian front with Austro-Hungary was perhaps the bitterest of all. Soldiers lived and fought for years in the hardhest environments, enduring avalanches and frost-bite as well as relentless enemy action. Mistrust and contempt increasingly threatened alliances. Germany shored up her ally Austria-Hungary, feeling herself \"shackled to a corpse\", which Austria-Hungary saw Germany as her \"secret enemy\"."
}, {
  "imdbId" : "0426688",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Breaking the Deadlock",
  "description" : "Attrition; \"lions led by donkeys\", the slaughter only ceasing for a brief truce one Christmas - old, mistaken views of the war on the Western Front. In fact there was constant tactical evolutions; hundreds of generals died in action; some men adopted a system of \"Live and Let Live\", with countless informal local truces. The Germans tried new ideas at Verdun: 750,000 French and Germans died with little gain. After terrible failure on the Somme the British used tanks at Cambrai, but the Germans clawed back lost ground. Victory on the Western Front would go to the side that learned to consolidate success."
}, {
  "imdbId" : "0426688",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Blockade",
  "description" : "This history of the naval aspect of the war and how Germany's blockade strategy eventually led to the United States of America to entering it."
}, {
  "imdbId" : "0426688",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Revolution",
  "description" : "Increasingly governments faced the risk of their men mutinying, morale cracking, and civilians rising up in strikes and civil disobedience. As governments worried about containing unrest at home, they set agents working to foment revolution among the enemy. Britain sponsored the Arab Revolt through Lawrence of Arabia, Germany backed Irish independence with arms for the Easter Rising and funded Lenin's Russian coup d'etat in 1917. Revolution became a weapon of war, hitting the enemy from within. When Lenin pulled Russia out of the war, it vindicated all Germany's efforts to use subversion, releasing half a million German soldiers for the Western Front."
}, {
  "imdbId" : "0426688",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "Germany's Last Gamble",
  "description" : "With Russia out of the war, Germany's Triple Alliance attempts to capitalize on the strategic advantage to win the war before the American forces join the fight."
}, {
  "imdbId" : "0426688",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "War Without End",
  "description" : "The war's last months were more destructive than trench warfare had been. Germany remained on French soil, believing herself unbeaten. The Armistice was the Allies' bid to obtain - on paper - Germany's unconditional surrender. At Versailles she was made to shoulder the blame for the war, to force her to pay for it. The war, with losses over 20 million, was later deemed as a senseless waste. For defense against agression. For glory. It curbed militarism, for a while, but was not the war to end all wars. Its terrible message to the century it shaped was that war can fulfill ambitions. That war can work."
}]
