[{
  "imdbId" : "0187636",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Premiere",
  "description" : "Astronaut John Crichton's \"Farscape-1\" space module is swallowed by a wormhole and spat out on the other side of the universe into the middle of a space battle. Taken on board \"Moya\", a huge bio-mechanoid living ship, desperately trying to escape Peacekeeper captivity. On board Moya is a group of alien fugitives trying to escape from the ruthless Peacekeepers, a local military regime. While managing to escape the immediate threat, John Crichton forms friendships with the prisoners and continues to look for a way home. But later a race of beings called, \"The Ancients\" ..."
}, {
  "imdbId" : "0187636",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Exodus from Genesis",
  "description" : "Moya is invaded by some creatures. They increase the heat on Moya, and they're creating replicas of the crew. Peacekeeper cannot stand heat, Aeryn starts to suffer Heat Delirium. The crew must figure who is real and who is a replica, and shut down the heat. They must also contend with a Peacekeeper squad that's searching for Crichton."
}, {
  "imdbId" : "0187636",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Back and Back and Back to the Future",
  "description" : "The crew rescues a scientist and his assistant from a disintegrating ship. Crichton starts seeing the future, which holds death for the crew and Moya. He tries to influence the course of events but cannot change the outcome until they all learn what their guests are truly hiding."
}, {
  "imdbId" : "0187636",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Throne for a Loss",
  "description" : "Rygel is captured and held for ransom by some bounty hunters. Rygel \"borrowed\" a crystal from Moya, without the crystal Moya cannot maintain her orbit and will crash into the planet if it isn't returned shortly."
}, {
  "imdbId" : "0187636",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "PK Tech Girl",
  "description" : "After finding the legendary Peacekeeper battleship, Zelbinion, dead in space and emptied of most of its useful technologies Crichton, Aeryn, and D'Argo find a Peacekeeper tech under Crais's command, Gilina, who survived a raid on the ship. Under threat of another scavenger attack, they work to get the shield generator on board the Zelbinion working. As they share the work, Gilina and Crichton grow much closer."
}, {
  "imdbId" : "0187636",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Thank God It's Friday, Again",
  "description" : "D'Argo goes into a hyper rage and seeks out Crichton, thinking he left the ship for a nearby planet, he pursues his quarry. The crew then searches for D'Argo. When they find him, they find he has changed. He and the inhabitants work in the fields every day. But the crew soon discovers there's more to the harvested plant than they first thought. The crew has to figure a way to save themselves and the planet."
}, {
  "imdbId" : "0187636",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "I, E.T.",
  "description" : "The removal of Moya's control collar activates a homing signal. Pilot manages to mask it by landing Moya in a swamp, unsure if a Leviathan can land on a planet or take off again. They homing signal must be removed, but they need to find something to dull the pain it will cause Moya when the device is removed."
}, {
  "imdbId" : "0187636",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "That Old Black Magic",
  "description" : "Crichton's spirit is captured by Maldis. The sorcerer thrives on vengeance and hate, he brings Crais's spirit down. And the two spirits battle. Zhaan can fight Maldis, but if she fights Maldis, she must take a dark path."
}, {
  "imdbId" : "0187636",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "DNA Mad Scientist",
  "description" : "A scientist claims to have maps to large parts of the galaxy. And offers the crew a map to get to their respective homes. In exchange for the map, he wants some genetic material, he wants Pilot's arm. How far is the crew willing to go to get back home?"
}, {
  "imdbId" : "0187636",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "They've Got a Secret",
  "description" : "D'Argo falls down a shaft and accidentally breaks something. He becomes disoriented, and sees the crew as someone from his past, his wife, their son, and her killer. The crew must get D'Argo back to the present to fix the damage he caused. The crew discover something about Moya."
}, {
  "imdbId" : "0187636",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "Till the Blood Runs Clear",
  "description" : "While flying Crichton's ship near a sun with high flare activity, John and Aeryn narrowly avoid getting sucked into an unstable wormhole. In an attempt to save his damaged ship, he sets down on the desert planet below to see a repairman. She informs him that the solar activity he needs to open another wormhole should be dying down before his ship can be repaired, but they reoccur regularly. If he cannot get his ship repaired and back up in orbit by the time the flares die down, Crichton will be unable to get home for another 5 years."
}, {
  "imdbId" : "0187636",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "The Flax",
  "description" : "Aeryn takes Crichton out in a transport pod for flying lessons, they get stuck in the Flax, a space trap. To make some critical repairs, they must depressurize the pod, but there is only one functional space suit. D'Argo gets a lead on some star maps to get home. He will have to choose between retrieving the maps, or saving his comrades."
}, {
  "imdbId" : "0187636",
  "season" : "1",
  "episodeNumber" : "13",
  "title" : "Rhapsody in Blue",
  "description" : "The crew finds a colony of Delvians. Z'han goes down to be with her own people for a while, but one of them wants something from Z'han and will do almost anything to take it from her."
}, {
  "imdbId" : "0187636",
  "season" : "1",
  "episodeNumber" : "14",
  "title" : "Jeremiah Crichton",
  "description" : "Crichton is getting frustrated in his new environment. He takes his ship out for a quick jaunt, but Moya's pregnancy is causing some changes in the Leviathan, she starbursts suddenly without little warning stranding Crichton. He finally settles on a planet, and adjusts to life amongst the natives. Moya's crew comes after him to explain the situation, but does he want to go back?"
}, {
  "imdbId" : "0187636",
  "season" : "1",
  "episodeNumber" : "15",
  "title" : "Durka Returns",
  "description" : "Moya collides with a Nebari transport. A Nebari official was transporting 2 criminals. Chiana, a Nebari youth. And Durka, a Legendary Peacekeeper who once tortured Rygel. The official claims to have Durka under control, but Rygel still wants revenge."
}, {
  "imdbId" : "0187636",
  "season" : "1",
  "episodeNumber" : "16",
  "title" : "A Human Reaction",
  "description" : "A wormhole appears before Moya, the crew can see Earth on the other side. Crichton flies down the wormhole to the world he left behind. But when the rest of the crew comes looking for him, Crichton's loyalties are tested does he side with his new found friends, or Earth."
}, {
  "imdbId" : "0187636",
  "season" : "1",
  "episodeNumber" : "17",
  "title" : "Through the Looking Glass",
  "description" : "Since the Moya can no longer Starburst, the crew doesn't feel they are safe on the Leviathan. Fearing the crew will leave, Moya attempts a Starburst. The crew is now separated on 3 different versions of Moya, and there is an unknown creature apparently attacking them."
}, {
  "imdbId" : "0187636",
  "season" : "1",
  "episodeNumber" : "18",
  "title" : "A Bug's Life",
  "description" : "The crew encounters a group of Peacekeeper who have just captured a dangerous creature. An entity that can take control of someone with just a touch. The Peacekeepers want to take it to a secret Peacekeeper base to safeguard it. When the creature is released, the race is on to figure out who is being controlled by the creature."
}, {
  "imdbId" : "0187636",
  "season" : "1",
  "episodeNumber" : "19",
  "title" : "Nerve",
  "description" : "Aeryn has been critically wounded. She needs some tissue samples to heal. The only source is the Secret base the Peacekeeper mentioned. Crichton and Chiana go to the base, to get the samples. They encounter an old friend, and a new enemy."
}, {
  "imdbId" : "0187636",
  "season" : "1",
  "episodeNumber" : "20",
  "title" : "The Hidden Memory",
  "description" : "Aeryn is cured, but Crichton has been captured. Now the crew struggles to find a way to rescue him. Scorpius probes Crichton for wormhole knowledge, and discovers something left behind by the Ancients. Crais arrives he wants Crichton. Aeryn will arrive and confront her former Captain, the person who deemed her irreversibly contaminated."
}, {
  "imdbId" : "0187636",
  "season" : "1",
  "episodeNumber" : "21",
  "title" : "Bone to Be Wild",
  "description" : "The crew find a planetoid that's a botanical paradise. Occupied by a scientist and a peaceful girl. But one is a killer. And there's more to this paradise than they realized. One of them wants Z'han for their own agenda."
}, {
  "imdbId" : "0187636",
  "season" : "1",
  "episodeNumber" : "22",
  "title" : "Family Ties",
  "description" : "With death approaching in the form of Peacekeeper search parties, those aboard Moya say their final goodbyes, and share a last feast together, before enacting a plan to save Moya and her baby, named Talyn."
}, {
  "imdbId" : "0187636",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "Mind the Baby",
  "description" : "Aeryn has managed to rescue D'Argo and Crichton, they're hiding in an asteroid belt. But she needed help from Crais and Talyn to rescue them. Even as she's checking on her friends, she's secretly helping Crais train Talyn. How long can she maintain her secret?"
}, {
  "imdbId" : "0187636",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "Vitas Mortis",
  "description" : "The crew finds a dying Orican, a Luxan holy woman. She asks D'Argo to help her with a ceremony. She tests D'Argo's worthiness, and throws him out saying he's not worthy. He explains to his friends why she rejected him, and convince him to explain it to her. She accepts his help, and starts the ceremony, but instead of dying, she becomes revitalized but her actions cause Moya to suffer."
}, {
  "imdbId" : "0187636",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "Taking the Stone",
  "description" : "Upon learning of her brother's death, Chiana leaves Moya in Aeryn's Prowler. Crichton and Aeryn find her on royal burial grounds living with a group of people with some strange customs, including throwing themselves off a cliff. Meanwhile Rigel loots what he can of the burial grounds, but finds the treasure is cursed."
}, {
  "imdbId" : "0187636",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "Crackers Don't Matter",
  "description" : "A visitor comes on Moya with a device that could cloak Moya. The crew welcomes him on board, but soon almost everyone is acting paranoid, and the crew starts attacking each other."
}, {
  "imdbId" : "0187636",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "The Way We Weren't",
  "description" : "Chiana discovers a recording with Moya's original Pilot. After seeing the recording and realizing Aeryn was involved, Pilot orders Aeryn to leave Moya."
}, {
  "imdbId" : "0187636",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "Picture If You Will",
  "description" : "Chiana buys a picture in a store, which is more than it seems. The picture is changes and shows Chiana what will happen to her, when it shows she is on fire, the crew must discover the origins of the picture, and find an old enemy."
}, {
  "imdbId" : "0187636",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "Home on the Remains",
  "description" : "The crew needs food. Zahn needs to eat meat, she starts spewing spores. Only Aeryn seems to have an tolerance for the spores. While she's on Moya with Zahn, the others find a Budong to get some food."
}, {
  "imdbId" : "0187636",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "Dream a Little Dream",
  "description" : "While waiting for Moya to pick their Transport Pod, Zahn tells Crichton of Moya's adventures after the Gammeck base was destroyed. Zahn was on trial for murder, with Chiana, and Rygel acting as her defense lawyers."
}, {
  "imdbId" : "0187636",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "Out of Their Minds",
  "description" : "The crew is attacked by a vessel, Zahn goes over to the ship to negotiate a peace. But the ship attacks again, the attack reacts unexpectedly interacts with the shields causing everyone on board Moya to switch identities, ie Aeryn is now Rygel, Rygel is now Crichton, etc. Now the crew must figure a way to get back to their original bodies."
}, {
  "imdbId" : "0187636",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "My Three Crichtons",
  "description" : "An energy ball enters Moya, and comes into contact with everyone on board. When it reaches Crichton, it engulfs him, then a cave man comes out, followed by Crichton. Blood tests show the cave man is Crichton. Another Crichton emerges from the energy ball, this one is extremely advanced. The probe says it needs to study at least one of the Crichtons. If it doesn't get at least one of them back, it will destroy Moya."
}, {
  "imdbId" : "0187636",
  "season" : "2",
  "episodeNumber" : "11",
  "title" : "Look at the Princess: Part 1: A Kiss Is But a Kiss",
  "description" : "The crew rests on a planet where the successor to the throne needs a genetically compatible mate to take the throne. She finds her mate ... in Crichton. But someone else wants the throne, and are willing to eliminate Crichton to prevent her rise."
}, {
  "imdbId" : "0187636",
  "season" : "2",
  "episodeNumber" : "12",
  "title" : "Look at the Princess: Part 2: I Do, I Think",
  "description" : "The Queen offers Crichton a choice; marry her daughter the crown princess, or she'll turn him over to Scorpius. Meanwhile, Moya has found her builders, the ones who created Leviathans. They know Moya gave birth to a warship, and do not want another one born. They want Moya to shut down, permanently"
}, {
  "imdbId" : "0187636",
  "season" : "2",
  "episodeNumber" : "13",
  "title" : "Look at the Princess: Part 3: The Maltese Crichton",
  "description" : "Crichton has been turned into a statue. Now someone has cut off his head, and everyone searches for it. Once it's reattached, he finds out he cannot be turned into a statue again, he wouldn't survive, but the Princess is having his child. Meanwhile Z'han tries to convince the builders that Moya is peaceful and should not be killed, failing that she tries to convince Moya not to kill herself."
}, {
  "imdbId" : "0187636",
  "season" : "2",
  "episodeNumber" : "14",
  "title" : "Beware of Dog",
  "description" : "Chiana returns from a Commerce Planet with a cute little creature called a Vorc that is said to be capable of hunting down parasites which may have inadvertently come on board with the crew's supplies. Aeryn thinks Chiana was swindled; the Vorc appears too scatterbrained and unimposing to hunt parasites even if Moya had parasites - and Aeryn doubts Moya does. But Crichton soon encounters a hostile beast eating its way through one of Moya's walls. However, when he tells the others about the sighting, they are reluctant to believe him. Crichton is having an increasingly..."
}, {
  "imdbId" : "0187636",
  "season" : "2",
  "episodeNumber" : "15",
  "title" : "Won't Get Fooled Again",
  "description" : "Crichton has returned to Earth. Or has he always been on Earth all this time? People from his past and present appear. Is this some trick, if so who is behind it and why."
}, {
  "imdbId" : "0187636",
  "season" : "2",
  "episodeNumber" : "16",
  "title" : "The Locket",
  "description" : "The crew finds a cloudy area where they might be able to hide from Peacekeepers. Aeryn goes into the area to check it out. She returns a few hours later, much older. And tells them to leave the area. Now they have to figure out how to escape the cloud before they suffer the same fate as Aeryn"
}, {
  "imdbId" : "0187636",
  "season" : "2",
  "episodeNumber" : "17",
  "title" : "The Ugly Truth",
  "description" : "A ship is destroyed by Talyn while Moya's crew is aboard. Talyn, with Crais, starburst away while the rest are captured by another ship. Each member of the crew is interrogated in turn. The one who fired the shot will be executed. Who's telling the true version of the events, and will the guilty party be punished?"
}, {
  "imdbId" : "0187636",
  "season" : "2",
  "episodeNumber" : "18",
  "title" : "A Clockwork Nebari",
  "description" : "Rygel and Aeryn return from a planet to Moya accompanied by another Nebari who aims to take Chiana back. The crew is temporarily mind-cleansed except the Pilot but they put a collar on him and thus take over Moya to attain the nearest Nebari territorial post. Chiana learns that her brother is alive. Crichton who is not affected by mind-cleansing thanks to Scorpius' chip, makes Chiana reveal the reason she is being chased: she knows of her people's plot to infect the galaxy with a deadly contagion. Crichton must work together with Pilot and Rygel, quickly recovered due..."
}, {
  "imdbId" : "0187636",
  "season" : "2",
  "episodeNumber" : "19",
  "title" : "Liars, Guns and Money: Part 1: A Not So Simple Plan",
  "description" : "D'Argo finally gets a lead on his son, Jothee. He will do anything to get him back, but Jothee will be sold as a slave. They need a lot of money to buy Jothee's freedom. The crew will steal from a depository to get the money they need to free Jothee. Stark, back from the dead, is the author of the plan."
}, {
  "imdbId" : "0187636",
  "season" : "2",
  "episodeNumber" : "20",
  "title" : "Liars, Guns and Money: Part 2: With Friends Like These...",
  "description" : "Scorpius bought the lot with D'Argo's son just before Moya arrived and demands Crichton in exchange for Jothee. They plan to buy help of the beings they encountered before to break into repository, for the stolen money. But this money turns out to be alive and eats the ship. Then Crichton makes the ultimate deal."
}, {
  "imdbId" : "0187636",
  "season" : "2",
  "episodeNumber" : "21",
  "title" : "Liars, Guns and Money: Part 3: Plan B",
  "description" : "The crew is going to break into the depository to free Crichton. Crichton is being tortured for wormhole technology. Nothing is going like planned with those mercenaries but unexpected arrival of Talyn helps them to break free. They get rid of Scorpius but their losses are too big, among which Crichton's sanity."
}, {
  "imdbId" : "0187636",
  "season" : "2",
  "episodeNumber" : "22",
  "title" : "Die Me, Dichotomy",
  "description" : "The neural chip in Crichton's head is driving him insane. He pleads with D'Argo to kill him. They take him to a healer to have the chip removed. The chip takes control of Crichton, and someone on Moya will pay the price before Crichton can regain control of his body. Scorpius arrives just after they start the procedure to remove the chip."
}, {
  "imdbId" : "0187636",
  "season" : "3",
  "episodeNumber" : "1",
  "title" : "Season of Death",
  "description" : "Crichton lies on the operating table with the neural chip removed, unable to communicate. Aeryn's cryogenic-ally frozen. The surgeon is able to restore Crichton's ability to speak. A dormant patient awakens and goes after everyone. Zahn attempts to revive Aeryn, but at a very high cost."
}, {
  "imdbId" : "0187636",
  "season" : "3",
  "episodeNumber" : "2",
  "title" : "Suns and Lovers",
  "description" : "The crew relaxes on a space station. D'Argo wants to propose to Chiana, but something will affect his relationship with those closest/dearest to him. A fanatic has a device to attract solar storms, and wants to destroy the station. The crew must find a way to save the station"
}, {
  "imdbId" : "0187636",
  "season" : "3",
  "episodeNumber" : "3",
  "title" : "Self Inflicted Wounds: Part 1 - Could'a, Would'a, Should'a",
  "description" : "The crew searches for a planet where they can plant Zahn, so that she can recover. They encounter a wormhole and stop to investigate. A ship emerges from the wormhole and collides with Moya. Now the two ships are merged together, and stuck inside a wormhole. The two crews must find a way to separate the ships, but if they separate, only one ship will survive."
}, {
  "imdbId" : "0187636",
  "season" : "3",
  "episodeNumber" : "4",
  "title" : "Self Inflicted Wounds: Part 2 - Wait for the Wheel",
  "description" : "The two ships are still linked together. The crews are being attacked by a strange creature, Moya's taking a heavy beating. Crichton finds a transmission from Earth. The ships will finally be separated, with one of the Moya crew making the Ultimate sacrifice."
}, {
  "imdbId" : "0187636",
  "season" : "3",
  "episodeNumber" : "5",
  "title" : "...Different Destinations",
  "description" : "Moya's crew tries to relax on planet. A device unexpectedly reacts with Stark, and they get sent back in time. The crew must figure a way to get history back on course. This is not a typical sci-fi time travel episode. Their actions in the past have repercussions, and Farscape is again secured in a class all by itself."
}, {
  "imdbId" : "0187636",
  "season" : "3",
  "episodeNumber" : "6",
  "title" : "Eat Me",
  "description" : "Upon arriving at the rendezvous coordinates with minimal life support in their transport pod, Crichton, D'Argo, Chiana, and Jool are forced to dock with a nearby Leviathan bearing a Peacekeeper control collar. They find the Leviathan is incredibly sick and its pilot is unresponsive, but cannot easily find the needed parts for repair."
}, {
  "imdbId" : "0187636",
  "season" : "3",
  "episodeNumber" : "7",
  "title" : "Thanks for Sharing",
  "description" : "The crew tend to Crais and Talyn. Both are badly injured. The 2 Crichtons try to adjust to life with each other. The crew gets embroiled in a political situation while trying to buy supplies for Talyn's recovery. Crais tells Aeryn the Peacekeeper Recovery Unit attacking Talyn is led by Aeryn's mother."
}, {
  "imdbId" : "0187636",
  "season" : "3",
  "episodeNumber" : "8",
  "title" : "Green Eyed Monster",
  "description" : "While Rygel and Stark are out scouting the area, Talyn, still recovering from the Peacekeeper attack, is swallowed by a Budong. John and Aeryn attempt to \"lay anchor\" by catching grappling hooks on the Budong's ribs. Meanwhile Stark and Rygel have a near miss with the Budong and attempt to find out what happened to Talyn."
}, {
  "imdbId" : "0187636",
  "season" : "3",
  "episodeNumber" : "9",
  "title" : "Losing Time",
  "description" : "Upon passing through an electromagnetic cluster, Crichton sees a strange being aboard Moya. It seems to attack him, causing him to black out and bleed profusely. However he cannot prove his experience actually occurred, so the rest of the crew believes he is hallucinating. He continues to have these episodes, but without the help of his friends he has little chance of discovering what is happening to him."
}, {
  "imdbId" : "0187636",
  "season" : "3",
  "episodeNumber" : "10",
  "title" : "Relativity",
  "description" : "While Talyn is resting on a planet with high gravity he senses the retrieval squad, led by Aeryn's mother, setting down nearby. John, Aeryn, and Crais head out to confront the Peacekeepers and keep them away from Talyn while he recuperates."
}, {
  "imdbId" : "0187636",
  "season" : "3",
  "episodeNumber" : "11",
  "title" : "Incubator",
  "description" : "Scorpius puts the neural chip in his head to unlock the wormhole knowledge in the chip. He shows his origin to residual memory of Crichton that's been embedded in the chip in an effort to gain his support. Meanwhile the Moya crew encounter a scientist who has been working with Scorpius on wormhole technology."
}, {
  "imdbId" : "0187636",
  "season" : "3",
  "episodeNumber" : "12",
  "title" : "Meltdown",
  "description" : "Back on Talyn, John is trying to figure out whether Crais let Aeryn's mother, Xhalax, live in order to save his own skin, but is interrupted when Talyn goes head first towards the nearby sun. Talyn manages to pull himself from his course, but endures radiation damage. As the crew splits up for damage control, Stark notices a vapor flowing through the ship and begins to hear voices. John and Aeryn, at work repairing some of Talyn's systems, become increasingly flirtatious with each other, but stop after noticing the vapor as well."
}, {
  "imdbId" : "0187636",
  "season" : "3",
  "episodeNumber" : "13",
  "title" : "Scratch 'N Sniff",
  "description" : "D'Argo and Crichton are constantly arguing with each other. Tired of the arguing, Pilot banishes both of them from Moya for 10 days. They return to Moya sooner than expected. They tell them of their adventure planet side, and hope that Pilot understands that they're no longer welcome on that planet."
}, {
  "imdbId" : "0187636",
  "season" : "3",
  "episodeNumber" : "14",
  "title" : "Infinite Possibilities: Part 1 - Daedalus Demands",
  "description" : "A wormhole appears near Talyn. Crichton realizes it's \"Jack\" the ancient whom he encountered earlier. The ancients have found a new home, the ancients are worried about the misuse of wormhole technology. He needs to see if Crichton is worthy of the knowledge, by investigating Furlough, who has built her own Farscape module."
}, {
  "imdbId" : "0187636",
  "season" : "3",
  "episodeNumber" : "15",
  "title" : "Infinite Possibilities: Part 2 - Icarus Abides",
  "description" : "Jack now trusts Crichton, and has unlocked the wormhole knowledge in Crichton's head. Now they race to build a weapon to fend of approaching Scarrans. But an opposing force is even closer waiting for an opportunity to strike, there will be causalities and the survivors will be severely affected."
}, {
  "imdbId" : "0187636",
  "season" : "3",
  "episodeNumber" : "16",
  "title" : "Revenging Angel",
  "description" : "D'Argo injures Crichton, as Crichton lies in a coma/near death, he escapes into a highly animated world. It's Farscape, Chuck Jones/Loony Tunes style. Meanwhile D'Argo's actions create a crisis on Moya, which could destroy the Leviathan"
}, {
  "imdbId" : "0187636",
  "season" : "3",
  "episodeNumber" : "17",
  "title" : "The Choice",
  "description" : "Aeryn is devastated. She leaves Talyn, and grieves on a planet. Talyn's crew tries to help but she doesn't want their help. She spots someone who might be her father. But not all family reunions are joyous."
}, {
  "imdbId" : "0187636",
  "season" : "3",
  "episodeNumber" : "18",
  "title" : "Fractures",
  "description" : "Moya and Talyn's crew reunite at last. Aeryn is still getting over her loss, and cannot face Crichton. Moya rescues some Peacekeeper prisoners but at least one of them still works for the Peacekeepers. Stark gives Crichton a message from the deceased Crichton. He gives his twin a mission."
}, {
  "imdbId" : "0187636",
  "season" : "3",
  "episodeNumber" : "19",
  "title" : "I-Yensch, You-Yensch",
  "description" : "Rygel and D'Argo meet with Scorpius and Braca to negotiate a deal. So that the crew can board the command carrier. 2 would-be-robbers interrupt the bargaining process, now they're forced to work together to find a way out of their predicament"
}, {
  "imdbId" : "0187636",
  "season" : "3",
  "episodeNumber" : "20",
  "title" : "Into the Lion's Den: Part 1 - Lambs to the Slaughter",
  "description" : "The crew must stop Scorpius's research on wormhole technology. The only way to stop him is to board the command carrier and figure a way to destroy it from within."
}, {
  "imdbId" : "0187636",
  "season" : "3",
  "episodeNumber" : "21",
  "title" : "Into the Lion's Den: Part 2 - Wolf in Sheep's Clothing",
  "description" : "The crew has been captured, Crais betrayed them. Now Scorpius is threatening Earth. Crichton must help him develop wormhole weapons or he'll wipe out Earth. Crichton has no choice but to help him. One person will make a decision that will stop Scropius's research, but a high price will be paid."
}, {
  "imdbId" : "0187636",
  "season" : "3",
  "episodeNumber" : "22",
  "title" : "Dog with Two Bones",
  "description" : "Moya wants Talyn's remains in a sacred Leviathan place. But another Leviathan won't allow it. The crew's last mission together is to help fulfill Moya's wishes. After that, everyone goes their separate ways. Crichton discovers a secret of Aeryn's."
}, {
  "imdbId" : "0187636",
  "season" : "4",
  "episodeNumber" : "1",
  "title" : "Crichton Kicks",
  "description" : "It's been several months. Since the crew disbanded, and Moya was sucked down a wormhole. Crichton is now on board aged Leviathan, working on wormholes. But some visitor arrive who want to harvest the Leviathan. Crichton reunites with some of his old crew, and meets a new ally"
}, {
  "imdbId" : "0187636",
  "season" : "4",
  "episodeNumber" : "2",
  "title" : "What Was Lost: Part 1 - Sacrifice",
  "description" : "Everyone but Aeryn meets on Arnesk. Where Jool has discovered the remains of an ancient civilization."
}, {
  "imdbId" : "0187636",
  "season" : "4",
  "episodeNumber" : "3",
  "title" : "What Was Lost: Part 2 - Resurrection",
  "description" : "The crew discovers how far Scorpius has fallen in the Peacekeeper ranks. They must find and activate all the probes to stop the magnetic storm on Arnesk, but someone doesn't want them stopped."
}, {
  "imdbId" : "0187636",
  "season" : "4",
  "episodeNumber" : "4",
  "title" : "Lava's a Many Splendored Thing",
  "description" : "The crew is on the way to rendezvous with Moya. After ingesting a concoction of Noranti's they stop for a break on a planet. Rygel is captured and entombed in amber by raiders."
}, {
  "imdbId" : "0187636",
  "season" : "4",
  "episodeNumber" : "5",
  "title" : "Promises",
  "description" : "Everyone finally reunites on Moya. But Aeryn returns with Scorpius, who claims to have saved the former Peacekeeper's life. Aeryn forces them to accept Scorpius on board, and another crisis arises. Someone wants Aeryn for something she did while she was away from the rest of the crew. He promises a cure for Aeryn, if she'll co-operate. But Aeryn refuses. The crew must figure a ways to save Aeryn."
}, {
  "imdbId" : "0187636",
  "season" : "4",
  "episodeNumber" : "6",
  "title" : "Natural Election",
  "description" : "Pilot and Moya ask the crew to elect a Captain. They each take turns, a crisis arises when John finally summons a wormhole. Something attach itself to Moya. Aeryn's secret is revealed, but there's even more surprises. A leader will soon emerge."
}, {
  "imdbId" : "0187636",
  "season" : "4",
  "episodeNumber" : "7",
  "title" : "John Quixote",
  "description" : "Crichton and Chiana get stuck in a video game where they encounter strange/twisted versions of their friends. They must figure how to beat the game, or they'll be stuck inside forever. The game shows Crichton how dangerous/distracting his feelings for Aeryn are, leading him to a dark path to deal with his feelings"
}, {
  "imdbId" : "0187636",
  "season" : "4",
  "episodeNumber" : "8",
  "title" : "I Shrink Therefore I Am",
  "description" : "Bounty Hunters capture most of the crew. Only John and Noranti are free. Crichton must work with Scorpius to save the crew. When the bounty hunters shrink the crew, and hold them in containers on the bounty hunters, Crichton must figure a way to get rid of the hunters without harming the crew."
}, {
  "imdbId" : "0187636",
  "season" : "4",
  "episodeNumber" : "9",
  "title" : "A Prefect Murder",
  "description" : "While Moya and her crew are resupplying on a generally xenophobic planet, Aeryn kills the next prefect, along with many bystanders and D'Argo, while under a strange form of suggestion."
}, {
  "imdbId" : "0187636",
  "season" : "4",
  "episodeNumber" : "10",
  "title" : "Coup by Clam",
  "description" : "The crew gets checked out by a doctor for Space madness, a condition that's common in the area they're traveling. He gives them some food after the exam, and after they've ingested the meal, tells them the meal will cause them to get linked with whomever they split the dish with. D'Argo/Noranti, Aeryn/Rygel, and Crichton/Sikozu. He'll cure them ... for a price."
}, {
  "imdbId" : "0187636",
  "season" : "4",
  "episodeNumber" : "11",
  "title" : "Unrealized Reality",
  "description" : "Crichton finds a wormhole, and studies with interest in his space suit, and gets pulled inside. He meets Einstein, and exposes Crichton to different realities to showcase the full potential of wormholes. Crichton realizes even his limited knowledge of wormholes is dangerous."
}, {
  "imdbId" : "0187636",
  "season" : "4",
  "episodeNumber" : "12",
  "title" : "Kansas",
  "description" : "Crichton has returned to Earth, but it's the 80's. And Crichton's father is supposed to fly the ill fated Challenger mission. They must save his father, or everyone on Moya will never have met. And some secrets are revealed about John's past"
}, {
  "imdbId" : "0187636",
  "season" : "4",
  "episodeNumber" : "13",
  "title" : "Terra Firma",
  "description" : "Crichton has arrived home, on Earth. Even though the Moya crew relaxes, on Earth and are treated as VIPs, Crichton can't seem to adjust to life on Earth. After all his adventures, can he still call Earth his home?"
}, {
  "imdbId" : "0187636",
  "season" : "4",
  "episodeNumber" : "14",
  "title" : "Twice Shy",
  "description" : "The crew goes into Tormented Space, where they hope to avoid both the Peacekeepers and Scarrans. The crew buys maps for the area, Chiana buys a slave girl and sets her free. The crew tries to contact the trader after discovering Rygel cheated them. The crew starts acting stranger than ever. Rygel's greedier, D'Argo's angrier, Chiana's passion is on overdrive, etc. Crichton's behavior towards Aeryn are finally revealed."
}, {
  "imdbId" : "0187636",
  "season" : "4",
  "episodeNumber" : "15",
  "title" : "Mental as Anything",
  "description" : "The males of the crew undergo some training. Crichton learns how to resist Scarran probes. While D'Argo learns some self control D'Argo encounters his wife's murderer, his wife's brother."
}, {
  "imdbId" : "0187636",
  "season" : "4",
  "episodeNumber" : "16",
  "title" : "Bringing Home the Beacon",
  "description" : "The girls are out looking for an item that will camouflage Moya from long-range scans on an outpost in Tormented Space. While they are waiting for their part, they spot Braca and Grayza with a complement of Peacekeepers searching for them. They must lay low for 4 hours while they wait for their technology to be ready."
}, {
  "imdbId" : "0187636",
  "season" : "4",
  "episodeNumber" : "17",
  "title" : "A Constellation of Doubt",
  "description" : "John Crichton struggles to learn the location of the mysterious Katratzi, whilst watching a television documentary about himself and the aliens."
}, {
  "imdbId" : "0187636",
  "season" : "4",
  "episodeNumber" : "18",
  "title" : "Prayer",
  "description" : "Aeryn has been captured by the Scarrans. The Scarrans realize they no longer need Crichton for wormhole technology. They can gain the knowledge from Aeryn's child. If the child is really Crichton's. More of the former peacekeeper's past is revealed as they probe her, and her grip on reality starts to waiver."
}, {
  "imdbId" : "0187636",
  "season" : "4",
  "episodeNumber" : "19",
  "title" : "We're So Screwed: Part 1: Fetal Attraction",
  "description" : "The crew goes after Aeryn on a Scarran controlled station."
}, {
  "imdbId" : "0187636",
  "season" : "4",
  "episodeNumber" : "20",
  "title" : "We're So Screwed: Part 2: Hot to Katratzi",
  "description" : "The crew has managed to rescue Aeryn, but Scorpius was captured. Fearing he might reveal wormhole technology to the Scarrans, the crew must rescue him. As the Peacekeepers, and Scarrans, negotiate a peace, Crichton offers some they all want to the highest bidder. Scorpius's allegiances are slowly revealing."
}, {
  "imdbId" : "0187636",
  "season" : "4",
  "episodeNumber" : "21",
  "title" : "We're So Screwed: Part 3: La Bomba",
  "description" : "Scorpius has betrayed the crew. Now they're all captured. Their plan failed, the crew has little choice but to help Scorpius's true agenda."
}, {
  "imdbId" : "0187636",
  "season" : "4",
  "episodeNumber" : "22",
  "title" : "Bad Timing",
  "description" : "The Scarrans know where the Wormhole to Earth is, and they're on their way. Crichton and crew race to the wormhole to stop them. But saving the Earth means destroying the chance for John to ever return home. Aeryn finally reveals the father of the baby. John and Aeryn decide to get married, but fate steps in. The finale for the television series."
}]