[{
  "imdbId" : "1856010",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Chapter 1",
  "description" : "Congressman Francis Underwood has been declined the chair for Secretary of State. He's now gathering his own team to plot his revenge. Zoe Barnes, a reporter for the Washington Herald, will do anything to get her big break."
}, {
  "imdbId" : "1856010",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Chapter 2",
  "description" : "Francis and Doug plan to frame Secretary of State nominee, Michael Kern. Meanwhile, Zoe's popularity at the Washington Herald continues to grow."
}, {
  "imdbId" : "1856010",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Chapter 3",
  "description" : "Francis heads for his hometown to deal with a crisis. Zoe negotiates the politics of being a journalist on the rise. Claire finds herself a new business partner."
}, {
  "imdbId" : "1856010",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Chapter 4",
  "description" : "Francis shakes down the Congressional leadership. Zoe is offered the promotion of White House Correspondent and doesn't know if she should take it or not."
}, {
  "imdbId" : "1856010",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Chapter 5",
  "description" : "A feud starts between Francis and Marty Spinella. Russo goes into depression about the job losses at the shipyards."
}, {
  "imdbId" : "1856010",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Chapter 6",
  "description" : "The strike between Frank and Marty starts to get out of hand. Russo has decided to run for Governor of Pennsylvania."
}, {
  "imdbId" : "1856010",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Chapter 7",
  "description" : "Frank helps Peter get ready for his governor race, but Peter is starting to have second thoughts. Doug tries to help a young hooker in trouble."
}, {
  "imdbId" : "1856010",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Chapter 8",
  "description" : "Frank has a library named after him at his old military school. Peter tries to win back the support of his hometown."
}, {
  "imdbId" : "1856010",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "Chapter 9",
  "description" : "Frank tries to do whatever it takes to get the new bill past congress. Russo goes on a bus campaign with the Vice President, but the VP is not making it an easy trip for him. Zoe's relationship with Frank gets a little bumpy."
}, {
  "imdbId" : "1856010",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "Chapter 10",
  "description" : "Told that Claire was behind the watershed bill's failure, Francis works to contain the damage and maintain control over Peter Russo. Zoe and Claire each seek relief from their respective relationships with Francis."
}, {
  "imdbId" : "1856010",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "Chapter 11",
  "description" : "Following the collapse of Russo's campaign, Francis launches a risky ploy to join the Walker administration."
}, {
  "imdbId" : "1856010",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "Chapter 12",
  "description" : "The President sends Frank to St. Louis to persuade Raymond Tusk into becoming the new Vice President. Zoe and Janine investigate Peter Russo's death."
}, {
  "imdbId" : "1856010",
  "season" : "1",
  "episodeNumber" : "13",
  "title" : "Chapter 13",
  "description" : "Frank scrambles to keep his plan on track. Gillian is planning to sue Claire. Zoe, Janine, and Lucas investigate Rachel Posner and her relationship with Peter Russo."
}, {
  "imdbId" : "1856010",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "Chapter 14",
  "description" : "Frank prepares for his promotion to Vice President. Doug tries to erase all leads leading back to him and Frank. Claire fights back against Gillian. Zoe considers working with Frank again."
}, {
  "imdbId" : "1856010",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "Chapter 15",
  "description" : "Frank is announced as Vice President. The US meets with China. Jackie faces obstacles as she plans to run for new whip. Lucas looks into Zoe's death."
}, {
  "imdbId" : "1856010",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "Chapter 16",
  "description" : "The tension between Francis and Raymond Tusk increases while the situation in China is getting worse. A fight in the Senate puts Francis against the republicans."
}, {
  "imdbId" : "1856010",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "Chapter 17",
  "description" : "A Terror threat traps Francis in the Congress building with a bitter Donald Blythe. Claire gives a live interview that shakes the media."
}, {
  "imdbId" : "1856010",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "Chapter 18",
  "description" : "Francis resorts to informal negotiations with a Chinese billionaire. Lucas takes extreme measures in use to reveal the vice president. Team Underwood gets a new member."
}, {
  "imdbId" : "1856010",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "Chapter 19",
  "description" : "In the middle of an energy crisis, Francis and Tusk end their fragile alliance. Lucas must make a difficult choice. Stamper gets closer to Rachel."
}, {
  "imdbId" : "1856010",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "Chapter 20",
  "description" : "Despite friction, the friendship between the Walkers and the Underwoods becomes stronger. But there's a war between Francis and Tusk."
}, {
  "imdbId" : "1856010",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "Chapter 21",
  "description" : "The war with Tusk intensified. Claire influences Tricia Walker, both on the political and domestic front."
}, {
  "imdbId" : "1856010",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "Chapter 22",
  "description" : "It becomes personal when Tusk hits the Underwood pair with a scandal. Freddy and his restaurant will be involved in it all."
}, {
  "imdbId" : "1856010",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "Chapter 23",
  "description" : "With a military stalemate abroad and a possible violent situation at home, Francis wants to put an end to Tusk forever. Claire and Jackie Sharp collide."
}, {
  "imdbId" : "1856010",
  "season" : "2",
  "episodeNumber" : "11",
  "title" : "Chapter 24",
  "description" : "Frank is questioned by a special prosecutor. Remy Danton is trying to keep all options open. Stamper is struggling with his demons."
}, {
  "imdbId" : "1856010",
  "season" : "2",
  "episodeNumber" : "12",
  "title" : "Chapter 25",
  "description" : "Francis feels shut out. Stamper tries to regain control."
}, {
  "imdbId" : "1856010",
  "season" : "2",
  "episodeNumber" : "13",
  "title" : "Chapter 26",
  "description" : "Francis is about to be destroyed while the nation is in turmoil. Stamper must pick up loose ends. Claire marks the conclusion of her ruthlessness."
}, {
  "imdbId" : "1856010",
  "season" : "3",
  "episodeNumber" : "1",
  "title" : "Chapter 27",
  "description" : "Frank's approval ratings have plummeted. Doug goes through rehab over his injury. Claire plans to run for Ambassador to the U.N."
}, {
  "imdbId" : "1856010",
  "season" : "3",
  "episodeNumber" : "2",
  "title" : "Chapter 28",
  "description" : "Claire's U.N. bid runs into trouble. Frank fights off mutiny with a bold address to the country."
}, {
  "imdbId" : "1856010",
  "season" : "3",
  "episodeNumber" : "3",
  "title" : "Chapter 29",
  "description" : "The Russian president's state visit becomes a cold war of wills."
}, {
  "imdbId" : "1856010",
  "season" : "3",
  "episodeNumber" : "4",
  "title" : "Chapter 30",
  "description" : "Claire bypasses Russia at the U.N. Frank tries to outmaneuver a potential challenger and ends up face to face with a higher power."
}, {
  "imdbId" : "1856010",
  "season" : "3",
  "episodeNumber" : "5",
  "title" : "Chapter 31",
  "description" : "Frank declares war on Congress to jump-start his jobs program. Claire spars with the Russian Ambassador."
}, {
  "imdbId" : "1856010",
  "season" : "3",
  "episodeNumber" : "6",
  "title" : "Chapter 32",
  "description" : "Frank and Claire travel to Moscow to negotiate the return of an imprisoned U.S. citizen. Claire takes a stand that jeopardizes their plans."
}, {
  "imdbId" : "1856010",
  "season" : "3",
  "episodeNumber" : "7",
  "title" : "Chapter 33",
  "description" : "The damage is done and the Underwoods must repair it. But deep wounds don't heal fast, and sometimes not at all."
}, {
  "imdbId" : "1856010",
  "season" : "3",
  "episodeNumber" : "8",
  "title" : "Chapter 34",
  "description" : "A hurricane endangers more than just the entire East Coast and Frank must make a difficult choice."
}, {
  "imdbId" : "1856010",
  "season" : "3",
  "episodeNumber" : "9",
  "title" : "Chapter 35",
  "description" : "The Jordan Valley erupts in chaos just as Frank's campaign is picking up steam. Claire gets disturbing intel and counsels him."
}, {
  "imdbId" : "1856010",
  "season" : "3",
  "episodeNumber" : "10",
  "title" : "Chapter 36",
  "description" : "Frank needs to deal with Petrov one on one, while Claire tries to preserve the peace-keeping mission. Sacrifices must be made."
}, {
  "imdbId" : "1856010",
  "season" : "3",
  "episodeNumber" : "11",
  "title" : "Chapter 37",
  "description" : "Things turn ugly when Frank, Jackie, and Heather square off during their first debate. Tom joins Claire on the campaign trail."
}, {
  "imdbId" : "1856010",
  "season" : "3",
  "episodeNumber" : "12",
  "title" : "Chapter 38",
  "description" : "Claire is given an even larger role in the campaign. The gain in points drives Heather to look for dirt on Claire."
}, {
  "imdbId" : "1856010",
  "season" : "3",
  "episodeNumber" : "13",
  "title" : "Chapter 39",
  "description" : "Francis and Claire's relationship reaches a critical point. Doug catches up with his past"
}, {
  "imdbId" : "1856010",
  "season" : "4",
  "episodeNumber" : "1",
  "title" : "Chapter 40",
  "description" : "Clare's absence causes problems for Frank on the campaign trail amid rumors of a marital rift. Claire tries to strike out on her own."
}, {
  "imdbId" : "1856010",
  "season" : "4",
  "episodeNumber" : "2",
  "title" : "Chapter 41",
  "description" : "As Claire begins exploring a campaign of her own, she and Frank engage in backdoor political maneuvering. But this time they're not on the same side."
}, {
  "imdbId" : "1856010",
  "season" : "4",
  "episodeNumber" : "3",
  "title" : "Chapter 42",
  "description" : "Claire joins Frank as he campaigns in South Carolina, but he doesn't trust her. A disastrous scandal blindsides Frank on primary day."
}, {
  "imdbId" : "1856010",
  "season" : "4",
  "episodeNumber" : "4",
  "title" : "Chapter 43",
  "description" : "Claire threatens Frank while Frank makes a politically bold move that may provoke Russia."
}, {
  "imdbId" : "1856010",
  "season" : "4",
  "episodeNumber" : "5",
  "title" : "Chapter 44",
  "description" : "Claire advises the VP Donald Blythe on dealing with Russia. Further investigation of Lucas Goodwin dredges up his accusations against Frank."
}, {
  "imdbId" : "1856010",
  "season" : "4",
  "episodeNumber" : "6",
  "title" : "Chapter 45",
  "description" : "Claire clashes with the Secretary of State Durant over her involvement in negotiations with Russia. Dunbar must choose between her campaign and her ethics."
}, {
  "imdbId" : "1856010",
  "season" : "4",
  "episodeNumber" : "7",
  "title" : "Chapter 46",
  "description" : "Frank and Claire adjust to their new reality. The search for Frank's running mate begins. Frank starts a campaign to weaken Conway's strong support."
}, {
  "imdbId" : "1856010",
  "season" : "4",
  "episodeNumber" : "8",
  "title" : "Chapter 47",
  "description" : "Formidable as ever, Frank and Claire have their eyes on the big picture as they manipulate a potential running mate and push a gun bill."
}, {
  "imdbId" : "1856010",
  "season" : "4",
  "episodeNumber" : "9",
  "title" : "Chapter 48",
  "description" : "At the convention, Frank and his team publicly push for Secretary of State Durant to be chosen as his running mate, but privately push a different agenda."
}, {
  "imdbId" : "1856010",
  "season" : "4",
  "episodeNumber" : "10",
  "title" : "Chapter 49",
  "description" : "As Frank deals with a new threat to his candidacy, Claire has doubts about their plan. Claire faces a difficult decision concerning her mother's health."
}, {
  "imdbId" : "1856010",
  "season" : "4",
  "episodeNumber" : "11",
  "title" : "Chapter 50",
  "description" : "Frank ups the ante on the war on terror to counter Conway's public criticism of his lack of action. Tom joins Claire on the campaign trail."
}, {
  "imdbId" : "1856010",
  "season" : "4",
  "episodeNumber" : "12",
  "title" : "Chapter 51",
  "description" : "Frank asks Conway to help deal with extremists threatening to murder hostages. Tom Hammerschmidt digs deeper into the allegations against Frank."
}, {
  "imdbId" : "1856010",
  "season" : "4",
  "episodeNumber" : "13",
  "title" : "Chapter 52",
  "description" : "As the hostage situation continues, Claire secretly negotiates with an extremist leader. Frank confronts Hammerschmidt."
}, {
  "imdbId" : "1856010",
  "season" : "5",
  "episodeNumber" : "1",
  "title" : "Chapter 53",
  "description" : "As congress debates investigating Frank, he and Claire attempt to stoke fear of terrorism. Tom Yates continues his stay in the White House."
}, {
  "imdbId" : "1856010",
  "season" : "5",
  "episodeNumber" : "2",
  "title" : "Chapter 54",
  "description" : "Frank and his team work to leverage support in key states by any means necessary. Claire learns some upsetting news about one of Frank's friends."
}, {
  "imdbId" : "1856010",
  "season" : "5",
  "episodeNumber" : "3",
  "title" : "Chapter 55",
  "description" : "The day before the election, Conway holds a 24-hour Skype session with voters, while Frank and Claire stump in key States and try to discredit him."
}, {
  "imdbId" : "1856010",
  "season" : "5",
  "episodeNumber" : "4",
  "title" : "Chapter 56",
  "description" : "With a tight race and low voter turnout on Election Day, things look grimm for Frank. But he's got one more trick up his sleeve."
}, {
  "imdbId" : "1856010",
  "season" : "5",
  "episodeNumber" : "5",
  "title" : "Chapter 57",
  "description" : "Nine weeks after Election Day, the Underwoods work to consolidate their power. Leann tries to track down a missing Aidan Macallan."
}, {
  "imdbId" : "1856010",
  "season" : "5",
  "episodeNumber" : "6",
  "title" : "Chapter 58",
  "description" : "In the midst of uncertainty, suspected Russian forces take over an American station in Antarctica. Meanwhile, a damaging news leak could hurt Frank."
}, {
  "imdbId" : "1856010",
  "season" : "5",
  "episodeNumber" : "7",
  "title" : "Chapter 59",
  "description" : "When a crisis forces White House personnel to take shelter in a bunker, Commerce Department official Jane Davis negotiates through back channels."
}, {
  "imdbId" : "1856010",
  "season" : "5",
  "episodeNumber" : "8",
  "title" : "Chapter 60",
  "description" : "While Frank attends an elite men's weekend gathering to firm up support, Claire deals with a stranded Russian ship and threats from Petrov."
}, {
  "imdbId" : "1856010",
  "season" : "5",
  "episodeNumber" : "9",
  "title" : "Chapter 61",
  "description" : "Petrov tries to influence affairs in the U.S. Jane discusses her agenda with Claire. With her job at stake, Leann reaches out to a reporter for help."
}, {
  "imdbId" : "1856010",
  "season" : "5",
  "episodeNumber" : "10",
  "title" : "Chapter 62",
  "description" : "The Underwoods and their team angle to undermine the revived committee investigating Frank. Hammerschmidt's investigation heats up."
}, {
  "imdbId" : "1856010",
  "season" : "5",
  "episodeNumber" : "11",
  "title" : "Chapter 63",
  "description" : "As the team tries to control the fallout from damaging testimony and leaks, everyone is under suspicion and tensions flare between Frank and Claire."
}, {
  "imdbId" : "1856010",
  "season" : "5",
  "episodeNumber" : "12",
  "title" : "Chapter 64",
  "description" : "Frank attempts to stop Cathy from testifying. With Hammerschmidt sniffing out the truth, the Underwoods throw someone close to them under the bus."
}, {
  "imdbId" : "1856010",
  "season" : "5",
  "episodeNumber" : "13",
  "title" : "Chapter 65",
  "description" : "In the wake of a surprising announcement, everything at the White House is shaken up. A decision must be made about whether to go to war."
}]