[{
  "imdbId" : "0060028",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "The Cage",
  "description" : "Capt. Pike is held prisoner and tested by aliens who have the power to project incredibly lifelike illusions."
}, {
  "imdbId" : "0060028",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "The Man Trap",
  "description" : "Dr. McCoy discovers his old flame is not what she seems after crew members begin dying from a sudden lack of salt in their bodies."
}, {
  "imdbId" : "0060028",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Charlie X",
  "description" : "Captain Kirk must learn the limits to the power of a 17-year-old boy with the psychic ability to create anything and destroy anyone."
}, {
  "imdbId" : "0060028",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Where No Man Has Gone Before",
  "description" : "The flight recorder of the 200-year-old U.S.S. Valiant relays a tale of terror--a magnetic storm at the edge of the galaxy!"
}, {
  "imdbId" : "0060028",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "The Naked Time",
  "description" : "The crew is infected with a mysterious disease that removes people's emotional inhibitions to a dangerous degree."
}, {
  "imdbId" : "0060028",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "The Enemy Within",
  "description" : "A transporter malfunction splits Captain Kirk into two halves: one meek and indecisive, the other violent and ill tempered. The remaining crew members stranded on the planet cannot be beamed up to the ship until a the problem is fixed."
}, {
  "imdbId" : "0060028",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Mudd's Women",
  "description" : "The Enterprise picks up untrustworthy entrepreneur Harry Mudd accompanied by three beautiful women who immediately put a spell on all the male crew members."
}, {
  "imdbId" : "0060028",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "What Are Little Girls Made Of?",
  "description" : "Nurse Chapel is reunited with her fiancé; but his new obsession leads him to make an android duplicate of Captain Kirk."
}, {
  "imdbId" : "0060028",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "Miri",
  "description" : "The Enterprise discovers a planet exactly like Earth, but the only inhabitants are children who contract a fatal disease upon entering puberty."
}, {
  "imdbId" : "0060028",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "Dagger of the Mind",
  "description" : "Kirk and psychiatrist Helen Noel are trapped on a maximum security penal colony that experiments with mind control and Spock must use the Vulcan mind-meld to find a way to save them."
}, {
  "imdbId" : "0060028",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "The Corbomite Maneuver",
  "description" : "After being forced to destroy a dangerous probe, a gigantic alien ship arrives to capture and condemn the Enterprise's crew as trespassers."
}, {
  "imdbId" : "0060028",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "The Menagerie: Part I",
  "description" : "Spock kidnaps the crippled Capt. Pike, hijacks the Enterprise and then surrenders for court martial."
}, {
  "imdbId" : "0060028",
  "season" : "1",
  "episodeNumber" : "13",
  "title" : "The Menagerie: Part II",
  "description" : "At Spock's court martial, he explains himself with mysterious footage about when Capt. Pike was kidnapped by powerful illusion casting aliens."
}, {
  "imdbId" : "0060028",
  "season" : "1",
  "episodeNumber" : "14",
  "title" : "The Conscience of the King",
  "description" : "While Captain Kirk investigates whether an actor is actually a presumed dead mass murderer, a mysterious assailant is killing the people who could identify the fugitive."
}, {
  "imdbId" : "0060028",
  "season" : "1",
  "episodeNumber" : "15",
  "title" : "Balance of Terror",
  "description" : "The Enterprise must decide on its response when a Romulan ship makes a destructively hostile armed probe of Federation territory."
}, {
  "imdbId" : "0060028",
  "season" : "1",
  "episodeNumber" : "16",
  "title" : "Shore Leave",
  "description" : "The past three months has left the crew of the Enterprise exhausted and in desperate need of a break, but does this explain McCoy's encounter with a human-sized white rabbit or Kirk crossing paths with the prankster who plagued his days at Starfleet Academy?"
}, {
  "imdbId" : "0060028",
  "season" : "1",
  "episodeNumber" : "17",
  "title" : "The Galileo Seven",
  "description" : "The Galileo, under Spock's command, crash-lands on a hostile planet. As the Enterprise races against time to find the shuttlecraft, Spock's strictly logical leadership clashes with the fear and resentment of his crew."
}, {
  "imdbId" : "0060028",
  "season" : "1",
  "episodeNumber" : "18",
  "title" : "The Squire of Gothos",
  "description" : "A being that controls matter and creates planets wants to play with the Enterprise crew."
}, {
  "imdbId" : "0060028",
  "season" : "1",
  "episodeNumber" : "19",
  "title" : "Arena",
  "description" : "For bringing hostility into their solar system, a superior alien race pits Captain Kirk in single combat against the murderous reptilian captain of an alien ship he was pursuing."
}, {
  "imdbId" : "0060028",
  "season" : "1",
  "episodeNumber" : "20",
  "title" : "Tomorrow Is Yesterday",
  "description" : "The Enterprise is thrown back in time to 1960s Earth."
}, {
  "imdbId" : "0060028",
  "season" : "1",
  "episodeNumber" : "21",
  "title" : "Court Martial",
  "description" : "Kirk draws a court martial in the negligent death of a crewman."
}, {
  "imdbId" : "0060028",
  "season" : "1",
  "episodeNumber" : "22",
  "title" : "The Return of the Archons",
  "description" : "The Enterprise travels to Beta III to learn the fate of the U.S.S. Archon, gone missing a century earlier. One member of the landing party disappears, and one returns in a strangely blissful state. Kirk beams down with another landing party; amidst the chaos of \"Festival\" their hosts asks if they are \"Archons.\" To learn more, Kirk must convince Betan citizens to disobey Landru, the man who has ruled them for 6,000 years - or find those who already resist. But with the Lawgivers everywhere, that task is going to be difficult..."
}, {
  "imdbId" : "0060028",
  "season" : "1",
  "episodeNumber" : "23",
  "title" : "Space Seed",
  "description" : "Capt. Kirk and his crew find and inadvertently revive a genetically augmented world conqueror and his compatriots from Earth's past."
}, {
  "imdbId" : "0060028",
  "season" : "1",
  "episodeNumber" : "24",
  "title" : "A Taste of Armageddon",
  "description" : "Kirk and Spock must save their ship's crew when they are declared all killed in action in a bizarre computer simulated war where the actual deaths must occur to continue."
}, {
  "imdbId" : "0060028",
  "season" : "1",
  "episodeNumber" : "25",
  "title" : "This Side of Paradise",
  "description" : "The Enterprise investigates a planet whose colonists should be dead, but are not."
}, {
  "imdbId" : "0060028",
  "season" : "1",
  "episodeNumber" : "26",
  "title" : "The Devil in the Dark",
  "description" : "The Enterprise is sent to a mining colony that is being terrorized by a mysterious monster."
}, {
  "imdbId" : "0060028",
  "season" : "1",
  "episodeNumber" : "27",
  "title" : "Errand of Mercy",
  "description" : "With a war with Klingons raging, Kirk and Spock attempt to resist an occupation of a planet with incomprehensibly placid natives."
}, {
  "imdbId" : "0060028",
  "season" : "1",
  "episodeNumber" : "28",
  "title" : "The Alternative Factor",
  "description" : "While investigating and scanning an uncharted planet, the Enterprise and its quadrant of space are subjected to a violent force that seems to cause a 'blinking out' of everything near them. When the scanners resume, where once there was no life on the planet, now there is one life sign. Kirk, Spock and a security force beam down to investigate and find a man named Lazarus who collapses and is brought aboard the Enterprise for treatment. To complicate things further, the initial phenomenon almost totally drained their dilithium crystals. Starfleet and Kirk suspect this..."
}, {
  "imdbId" : "0060028",
  "season" : "1",
  "episodeNumber" : "29",
  "title" : "The City on the Edge of Forever",
  "description" : "When a temporarily maddened Dr. McCoy alters history and eliminates his time, Kirk and Spock follow him to prevent it, but the price to do so is high."
}, {
  "imdbId" : "0060028",
  "season" : "1",
  "episodeNumber" : "30",
  "title" : "Operation -- Annihilate!",
  "description" : "The Enterprise crew attempts to stop a plague of amoeba-like creatures from possessing human hosts and spreading throughout the galaxy."
}, {
  "imdbId" : "0060028",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "Amok Time",
  "description" : "In the throes of his Pon Farr mating period, Spock must return to Vulcan to meet his intended future wife, betrothed from childhood."
}, {
  "imdbId" : "0060028",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "Who Mourns for Adonais?",
  "description" : "A powerful being claiming to be the Greek god Apollo appears and demands that the crew of the Enterprise disembark onto his planet to worship him."
}, {
  "imdbId" : "0060028",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "The Changeling",
  "description" : "A powerful artificially intelligent Earth probe, with a murderously twisted imperative, comes aboard the Enterprise and confuses Capt. Kirk as his creator."
}, {
  "imdbId" : "0060028",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "Mirror, Mirror",
  "description" : "A transporter accident places Capt. Kirk's landing party in an alternate universe, where the Federation is a barbarically brutal empire."
}, {
  "imdbId" : "0060028",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "The Apple",
  "description" : "Primitive inhabitants of Gamma Trianguli VI worship a God who orders them to kill visitors, from the Enterprise."
}, {
  "imdbId" : "0060028",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "The Doomsday Machine",
  "description" : "The USS Enterprise encounters the wrecked USS Constellation and its distraught captain who's determined to stop the giant planet-destroying robot ship that killed his crew."
}, {
  "imdbId" : "0060028",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "Catspaw",
  "description" : "Very alien visitors to our galaxy try to connect with human consciousness but miss, winding up tapping into the regions of human nightmares instead."
}, {
  "imdbId" : "0060028",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "I, Mudd",
  "description" : "Harry Mudd returns with a plot to take over the Enterprise by stranding the crew on a planet populated by androids under his command."
}, {
  "imdbId" : "0060028",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "Metamorphosis",
  "description" : "While returning to the Enterprise aboard the shuttlecraft, Kirk, Spock, McCoy and a seriously ill Federation diplomat find themselves kidnapped by an energized cloud."
}, {
  "imdbId" : "0060028",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "Journey to Babel",
  "description" : "The Enterprise hosts a number of quarrelling diplomats, including Spock's father, but someone on board has murder in mind."
}, {
  "imdbId" : "0060028",
  "season" : "2",
  "episodeNumber" : "11",
  "title" : "Friday's Child",
  "description" : "The Federation is in competition with the Klingons for an alliance with the inhabitants of Capella IV. The Capellans are a warrior tribe and there is dissension among them as to who to sign the mining rights treaty with. McCoy is familiar with their customs having once spent several months there. When a Capellan, who clearly favors the Klingons, stages a coup, Kirk, Spock and McCoy flee with the now dead leader's wife, who is about to give birth. Meanwhile, the Enterprise receives a distress call from a Federation vessel under attack and, with Scotty in command, ..."
}, {
  "imdbId" : "0060028",
  "season" : "2",
  "episodeNumber" : "12",
  "title" : "The Deadly Years",
  "description" : "A landing party from the Enterprise is exposed to strange form of radiation which rapidly ages them."
}, {
  "imdbId" : "0060028",
  "season" : "2",
  "episodeNumber" : "13",
  "title" : "Obsession",
  "description" : "Capt. Kirk obsessively hunts for a mysterious cloud creature he encountered in his youth."
}, {
  "imdbId" : "0060028",
  "season" : "2",
  "episodeNumber" : "14",
  "title" : "Wolf in the Fold",
  "description" : "Kirk and the Enterprise Computer become detectives after Scotty is accused of murdering women on a pleasure planet."
}, {
  "imdbId" : "0060028",
  "season" : "2",
  "episodeNumber" : "15",
  "title" : "The Trouble with Tribbles",
  "description" : "To protect a space station with a vital grain shipment, Kirk must deal with Federation bureaucrats, a Klingon battle cruiser and a peddler who sells furry, purring, hungry little creatures as pets."
}, {
  "imdbId" : "0060028",
  "season" : "2",
  "episodeNumber" : "16",
  "title" : "The Gamesters of Triskelion",
  "description" : "Kirk, Uhura and Chekov are trapped on a planet where abducted aliens are enslaved and trained to perform as gladiators for the amusement of bored, faceless aliens."
}, {
  "imdbId" : "0060028",
  "season" : "2",
  "episodeNumber" : "17",
  "title" : "A Piece of the Action",
  "description" : "The crew of Enterprise struggles to cope with a planet of imitative people who have modeled their society on 1920's gangsters."
}, {
  "imdbId" : "0060028",
  "season" : "2",
  "episodeNumber" : "18",
  "title" : "The Immunity Syndrome",
  "description" : "The Enterprise encounters a gigantic energy draining space organism that threatens the galaxy."
}, {
  "imdbId" : "0060028",
  "season" : "2",
  "episodeNumber" : "19",
  "title" : "A Private Little War",
  "description" : "Peaceful, primitive peoples get caught up in the struggle between superpowers, with Kirk unhappily trying to restore the balance of power disrupted by the Klingons."
}, {
  "imdbId" : "0060028",
  "season" : "2",
  "episodeNumber" : "20",
  "title" : "Return to Tomorrow",
  "description" : "The Enterprise is guided to a distant, long-dead world where survivors of an extremely ancient race - existing only as disembodied energy - desiring the bodies of Kirk, Spock and astro-biologist Ann Mulhall so that they may live again."
}, {
  "imdbId" : "0060028",
  "season" : "2",
  "episodeNumber" : "21",
  "title" : "Patterns of Force",
  "description" : "Looking for a missing Federation cultural observer, Kirk and Spock find themselves on a planet whose culture now models the German Nazi Party of old Earth in the 1930's."
}, {
  "imdbId" : "0060028",
  "season" : "2",
  "episodeNumber" : "22",
  "title" : "By Any Other Name",
  "description" : "Galactic alien scouts capture the Enterprise for a return voyage and a prelude to invasion. Kirk's one advantage - they're not used to their adopted human form."
}, {
  "imdbId" : "0060028",
  "season" : "2",
  "episodeNumber" : "23",
  "title" : "The Omega Glory",
  "description" : "Responding to a distress signal, Kirk finds Captain Tracey of the U.S.S. Exeter violating the prime directive and interfering with a war between the Yangs and the Kohms to find the secret of their longevity."
}, {
  "imdbId" : "0060028",
  "season" : "2",
  "episodeNumber" : "24",
  "title" : "The Ultimate Computer",
  "description" : "Kirk and a sub-skeleton crew are ordered to test out an advanced artificially intelligent control system that could potentially render them all redundant."
}, {
  "imdbId" : "0060028",
  "season" : "2",
  "episodeNumber" : "25",
  "title" : "Bread and Circuses",
  "description" : "The Enterprise crew investigates the disappearance of a ship's crew on a planet that is a modern version of the Roman Empire."
}, {
  "imdbId" : "0060028",
  "season" : "2",
  "episodeNumber" : "26",
  "title" : "Assignment: Earth",
  "description" : "While back in time observing Earth in 1968, the Enterprise crew encounters the mysterious Gary Seven who has his own agenda on the planet."
}, {
  "imdbId" : "0060028",
  "season" : "3",
  "episodeNumber" : "1",
  "title" : "Spock's Brain",
  "description" : "The crew of the Enterprise pursues a mysterious woman who has abducted Spock's brain."
}, {
  "imdbId" : "0060028",
  "season" : "3",
  "episodeNumber" : "2",
  "title" : "The Enterprise Incident",
  "description" : "An apparently insane Capt. Kirk has the Enterprise deliberately enter the Romulan Neutral Zone where the ship is immediately captured by the enemy."
}, {
  "imdbId" : "0060028",
  "season" : "3",
  "episodeNumber" : "3",
  "title" : "The Paradise Syndrome",
  "description" : "Trapped on a planet whose inhabitants are descended from Northwestern American Indians, Kirk loses his memory and is proclaimed a God while the crippled Enterprise races back to the planet before it is destroyed by an asteroid."
}, {
  "imdbId" : "0060028",
  "season" : "3",
  "episodeNumber" : "4",
  "title" : "And the Children Shall Lead",
  "description" : "The Enterprise reaches a Federation colony where the adults have all killed themselves but the children play without care."
}, {
  "imdbId" : "0060028",
  "season" : "3",
  "episodeNumber" : "5",
  "title" : "Is There in Truth No Beauty?",
  "description" : "Lovely telepath Miranda is aide to Ambassador Kollos, in a box to stop insanity when humans see Medusans. She rejects Larry, a designer of Enterprise, and senses murderous intent nearby."
}, {
  "imdbId" : "0060028",
  "season" : "3",
  "episodeNumber" : "6",
  "title" : "Spectre of the Gun",
  "description" : "As punishment for ignoring their warning and trespassing on their planet, the Melkot condemn Capt. Kirk and his landing party to the losing side of a surreal recreation of the 1881 historic gunfight at the OK Corral."
}, {
  "imdbId" : "0060028",
  "season" : "3",
  "episodeNumber" : "7",
  "title" : "Day of the Dove",
  "description" : "Both humans and Klingons have been lured to a planet by a formless entity that feeds on hatred and has set about to fashion them into a permanent food supply for itself."
}, {
  "imdbId" : "0060028",
  "season" : "3",
  "episodeNumber" : "8",
  "title" : "For the World Is Hollow and I Have Touched the Sky",
  "description" : "The Enterprise discovers an apparent asteroid that is on a collision course with a planet is actually an ancient populated generation ship."
}, {
  "imdbId" : "0060028",
  "season" : "3",
  "episodeNumber" : "9",
  "title" : "The Tholian Web",
  "description" : "While Capt. Kirk and the derelict USS Defiant apparently lost, the Enterprise grapples with an insanity causing plague and an attack by the Tholians."
}, {
  "imdbId" : "0060028",
  "season" : "3",
  "episodeNumber" : "10",
  "title" : "Plato's Stepchildren",
  "description" : "After Dr. McCoy helps the leader of a planet populated by people with powerful psionic abilities, they decide to force him to stay by torturing his comrades until he submits."
}, {
  "imdbId" : "0060028",
  "season" : "3",
  "episodeNumber" : "11",
  "title" : "Wink of an Eye",
  "description" : "A group of aliens who exist in a state of incredible acceleration invade the Enterprise and abduct Capt. Kirk."
}, {
  "imdbId" : "0060028",
  "season" : "3",
  "episodeNumber" : "12",
  "title" : "The Empath",
  "description" : "Trapped in an alien laboratory Kirk, Spock and McCoy meet an empath and are involved in a series of experiments."
}, {
  "imdbId" : "0060028",
  "season" : "3",
  "episodeNumber" : "13",
  "title" : "Elaan of Troyius",
  "description" : "While transporting an arrogant princess for a political marriage, Capt. Kirk must cope both with her biochemical ability to force him to love her and sabotage on his ship."
}, {
  "imdbId" : "0060028",
  "season" : "3",
  "episodeNumber" : "14",
  "title" : "Whom Gods Destroy",
  "description" : "Kirk and Spock are taken prisoners by a former starship captain named Garth, who now resides at, and has taken over, a high security asylum for the criminally insane."
}, {
  "imdbId" : "0060028",
  "season" : "3",
  "episodeNumber" : "15",
  "title" : "Let That Be Your Last Battlefield",
  "description" : "The Enterprise encounters two duo-chromatic and mutually belligerent aliens who put the ship in the middle of their old conflict."
}, {
  "imdbId" : "0060028",
  "season" : "3",
  "episodeNumber" : "16",
  "title" : "The Mark of Gideon",
  "description" : "Kirk beams down to the planet Gideon and appears to find himself trapped on a deserted Enterprise. Spock on the real Enterprise must use his diplomatic skills to deal with the uncooperative inhabitants of Gideon and find the Captain."
}, {
  "imdbId" : "0060028",
  "season" : "3",
  "episodeNumber" : "17",
  "title" : "That Which Survives",
  "description" : "After the Enterprise landing party beams down to investigate a geologically interesting planet, their ship is hurled across the galaxy. Kirk and company find a deserted outpost guarded by the deadly image of a beautiful woman."
}, {
  "imdbId" : "0060028",
  "season" : "3",
  "episodeNumber" : "18",
  "title" : "The Lights of Zetar",
  "description" : "A mysterious, twinkling mass of sapient energy ravages an important archive and Scotty's new girlfriend may be linked to it."
}, {
  "imdbId" : "0060028",
  "season" : "3",
  "episodeNumber" : "19",
  "title" : "Requiem for Methuselah",
  "description" : "On a planet, looking for an urgent medicinal cure, Kirk, Spock and McCoy come across a dignified recluse living privately but in splendor with his sheltered ward and a very protective robot servant."
}, {
  "imdbId" : "0060028",
  "season" : "3",
  "episodeNumber" : "20",
  "title" : "The Way to Eden",
  "description" : "A group of idealistic hippies, led by an irrational leader, come aboard the U.S.S. Enterprise."
}, {
  "imdbId" : "0060028",
  "season" : "3",
  "episodeNumber" : "21",
  "title" : "The Cloud Minders",
  "description" : "Kirk and Spock are caught up in a revolution on a planet where intellectuals and artists live on a utopian city in the sky while the rest of the population toils in mines on the barren surface below."
}, {
  "imdbId" : "0060028",
  "season" : "3",
  "episodeNumber" : "22",
  "title" : "The Savage Curtain",
  "description" : "Kirk, Spock, Abraham Lincoln, and Surak are pitted in battle against four notorious villains from history for the purpose of helping a molten rock creature's understanding of a concept he does not understand, 'good verses evil'."
}, {
  "imdbId" : "0060028",
  "season" : "3",
  "episodeNumber" : "23",
  "title" : "All Our Yesterdays",
  "description" : "When Kirk, Spock, and McCoy investigate the disappearance of a doomed planet's population, they find themselves trapped in different periods of that world's past."
}, {
  "imdbId" : "0060028",
  "season" : "3",
  "episodeNumber" : "24",
  "title" : "Turnabout Intruder",
  "description" : "An insane woman forcibly switches personalities with Capt. Kirk."
}]