[{
  "imdbId" : "8694364",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Episode #1.1",
  "description" : "One night in 2019, politician Vivienne Rook causes a scandal on live TV. At the same time, the Lyons family is united, as Rosie gives birth to a son."
}, {
  "imdbId" : "8694364",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Episode #1.2",
  "description" : "The world is still reeling from the events of Hong Sha. Daniel tries to build a new life with Viktor, but ex-husband Ralph takes a terrible revenge which will have consequences for the whole family. Badly affected by what happened abroad, Edith returns home for good. With Rosie, she attends Viv Rook's political rally and is amazed by her power and passion. Celeste loses her job, but that's just the start of her problems: when she and Stephen are woken at 4am by a series of urgent texts, they realise their entire life is about to come crashing down."
}, {
  "imdbId" : "8694364",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Episode #1.3",
  "description" : "Daniel uses his birthday party to reveal a dangerous plan. And as Viv Rook rises to power, the Lyons gather for a funeral. But Celeste is left to fight alone as Bethany's obsession."
}, {
  "imdbId" : "8694364",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Episode #1.4",
  "description" : "Daniel embarks on a dangerous quest to bring Viktor home, while Celeste takes a terrible revenge on Stephen. Viv sets her sights on the ultimate prize: 10 Downing Street."
}, {
  "imdbId" : "8694364",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Episode #1.5",
  "description" : "With Viv Rook as prime minister, a new Britain takes shape, and Edith tries to investigate mysterious stories about The Disappeared. While Rosie searches for a solution to Daniel's problems, she finds her estate being fenced off by the privatised police. As the climate worsens, flooding creates British refugees, forcing Muriel to reveal problems of her own."
}, {
  "imdbId" : "8694364",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Episode #1.6",
  "description" : "As Viv Rook's regime tightens its grip, the entire Lyons family is forced to take action. Spurred on by both Muriel and Daniel, Rosie faces up to the troops surrounding her home and takes radical action with Lincoln's help. When Bethany reveals the shocking truth about her father, Edith and Celeste form a secret alliance to stop him. But Stephen is in too deep, as the mysterious Erstwhile Policy turns deadly, forcing Edith and her girlfriend Fran to embark on a reckless, dangerous mission for Viktor's sake. On a long, dark night, the challenge is clear: can one ..."
}]