[{
  "imdbId" : "0199208",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "The Way We Are: It Started with the Greeks",
  "description" : "The Ancient Greece based origins of modern Western Civilization's primary value of individuality driven curiosity that drives it to question and explore reality."
}, {
  "imdbId" : "0199208",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "In the Light of the Above: Medieval Conflict - Faith and Reason",
  "description" : "Introduction of the knowledge from captured Islamic Spanish libraries transforms the Europe's conception of knowledge and the fact that it can advance."
}, {
  "imdbId" : "0199208",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Point of View: Scientific Imagination in the Renaissance",
  "description" : "The introduction of perspective techniques transforms Europe's use of art, architecture, geography and navigation among others with its revolutionary concept of remote positioning."
}, {
  "imdbId" : "0199208",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "A Matter of Fact: Printing Transforms Knowledge",
  "description" : "The introduction of practical mass printing ends Europe's predominate reliance on memory and its related concepts of reality and authority."
}, {
  "imdbId" : "0199208",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Infinitely Reasonable: Science Revises the Heavens",
  "description" : "The publication of Copernicus' theory of a heliocentric universe profoundly challenged Europe's concept of the universe and the authority of the Church."
}, {
  "imdbId" : "0199208",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Credit Where It's Due: The Factory and Marketplace Revolution",
  "description" : "The rise of land enclosure and advances in engineering help transform the West's major economic philosophies."
}, {
  "imdbId" : "0199208",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "What the Doctor Ordered: Social Impacts of New Medical Knowledge",
  "description" : "The advance of modern medicine and public health comes at the cost of the fields becoming depersonalized with their increasing use of statistics and microbiology."
}, {
  "imdbId" : "0199208",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Fit to Rule: Darwin's Revolution",
  "description" : "The introduction of Charles Darwin's theory of evolution undermines the concept of divine creation while providing a rationale for both capitalism and communism."
}, {
  "imdbId" : "0199208",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "Making Waves: The New Physics - Newton Revised",
  "description" : "As modern theoretical physics becomes more ambiguous in nature, the Western lay public increasingly confuses advances in engineering with pure science."
}, {
  "imdbId" : "0199208",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "Worlds Without End: Changing Knowledge, Changing Reality",
  "description" : "James sums up his ideas about the effect of different worldviews on science by showing how different cultures approach it in their own way."
}]