[{
  "imdbId" : "0090410",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Pilot",
  "description" : "Chicago Major Crime Unit, led by no-nonsense lt. Torrello, stops a team of robbers, but the leader escapes. Torrello suspects Ray Luca, a mobster on the rise. He also deals with idealistic public defender Abrams, who opposes his methods."
}, {
  "imdbId" : "0090410",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Final Transmission",
  "description" : "A psycho killer becomes the MCU's top priority case. Luca uses the manpower shift to his advantage by pulling off major heists."
}, {
  "imdbId" : "0090410",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Shadow Dancer",
  "description" : "Lt. Torello and the MCU search for the person responsible for the murder committed during a home invasion. Feeling the heat from the MCU's home invasion investigation Phil Bartoli orders Ray Luca to take care of the problem personally."
}, {
  "imdbId" : "0090410",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "St. Louis Book of Blues",
  "description" : "Luca plans to take over the gambling business and sands one of his men, Holman, to St. Louis. Torello plans to take Holman down, but the local sheriff, who wants publicity gets in MCU's way."
}, {
  "imdbId" : "0090410",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "The War",
  "description" : "Luca's takeover of the gambling business comes to a halt and Torello hits his other operations even harder. However, Torello suffers a major loss in his private life."
}, {
  "imdbId" : "0090410",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Abrams for the Defense",
  "description" : "A pretty female reporter helps public defender Abrams defend a man accused of assaulting a slumlord and he falls for her. Torello, on the other hand, must help his wife get through the tough times."
}, {
  "imdbId" : "0090410",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Pursuit of a Wanted Felon",
  "description" : "Abrams pursues a relationship with Suzanne Terry, the reporter who helped him, but he's condemned by most because she's African-American. Torello and his wife have a rocky vacation. FBI finally locates Holman."
}, {
  "imdbId" : "0090410",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Old Friends, Dead Ends",
  "description" : "Shocked Torello discovers that his old friend is working with the mob. A federal investigator, who's about to indict Luca, suspects Torello is dirty. Luca tries to stop the indictment."
}, {
  "imdbId" : "0090410",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "Justice Hits the Skids",
  "description" : "Angered by the death of his friend, Torello decides to ignore the FBI and goes after Holman himself. Luca goes into fencing business. Abram's girlfriend Suzanne is attacked while investigating street drug dealers for her new piece."
}, {
  "imdbId" : "0090410",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "For Love or Money",
  "description" : "As his marriage disintegrates, Torrello starts a relationship with lovely Inger Thorson, assistant of one of the jewelers Luca's crew murdered. MCU stops a new crew of robbers. Luca makes a deadly move against independent fences."
}, {
  "imdbId" : "0090410",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "Crime Pays",
  "description" : "A clip show recapping the story thus far. All major plot events and character development moments are covered and some previously cut scenes shown for the first time."
}, {
  "imdbId" : "0090410",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "Hide and Go Thief",
  "description" : "MCU faces an armed robbery that turns into a hostage situation. Holman is caught, but overly ambitious Federal prosecutor Harry Breitel asks him to testify against Luca's crew as well as Torello's team."
}, {
  "imdbId" : "0090410",
  "season" : "1",
  "episodeNumber" : "13",
  "title" : "Strange Bedfellows",
  "description" : "Luca gets indicted and Torello is next, so his boss orders him to take a vacation. Luca tries to find someone to take out Holman in jail, before he testifies. He also asks naive Abrams for legal advice without disclosing the details."
}, {
  "imdbId" : "0090410",
  "season" : "1",
  "episodeNumber" : "14",
  "title" : "Fatal Crossroads",
  "description" : "Mike is indicted and used by Luca to destroy Holman's testimony. However, Abrams, feeling guilty for being foolish, helps Mike. Mike breaks up with Inger to protect her from scandal. The Dancer, an ex fence and Abrams' dad, shows up."
}, {
  "imdbId" : "0090410",
  "season" : "1",
  "episodeNumber" : "15",
  "title" : "Torello on Trial",
  "description" : "Torello testifies in court to prove his innocence, but emotions in the courtroom heat up quickly. Local boss Dominic Tranchita breaks the mob's golden rule and starts dealing drugs. He even clashes with the mob council over the issue."
}, {
  "imdbId" : "0090410",
  "season" : "1",
  "episodeNumber" : "16",
  "title" : "The Kingdom of Money",
  "description" : "The mob makes its move to take over Las Vegas casinos. Abrams and Torello gather a team and set up an undercover operation in the strip club that Luca's men frequently visit."
}, {
  "imdbId" : "0090410",
  "season" : "1",
  "episodeNumber" : "17",
  "title" : "The Battle of Las Vegas",
  "description" : "A general strike hits Las Vegas casinos. Luca decides to get the strike leaders on his side one way or the other. Meanwhile, Torello's team must track down a gang that bombing and setting fires to both casinos and the picket lines."
}, {
  "imdbId" : "0090410",
  "season" : "1",
  "episodeNumber" : "18",
  "title" : "The Survivor",
  "description" : "Torrello falls for Lisa, ex-wife of Abrams's assistant, Steve Altman, but Altman is psychotic and possessive and tries to get Lisa and her daughter Tracy back by any means necessary. Also, FBI undercover agent infiltrates Luca's casino."
}, {
  "imdbId" : "0090410",
  "season" : "1",
  "episodeNumber" : "19",
  "title" : "The Pinnacle",
  "description" : "Luca forces the owner of Palladium, the biggest Las Vegas casino still not controlled by the mob, to give in. Meanwhile, Jack Claymore, the undercover FBI agent who's infiltrated Luca's casino meats Torello and becomes compromised."
}, {
  "imdbId" : "0090410",
  "season" : "1",
  "episodeNumber" : "20",
  "title" : "Top of the World",
  "description" : "The case against Luca is dropped, so Luca gives in to his inner demons to celebrate the fact that he now owns Vegas and the cops can't touch him. Torello uses these Luca's personal flaws and violent tendencies against him."
}, {
  "imdbId" : "0090410",
  "season" : "1",
  "episodeNumber" : "21",
  "title" : "Ground Zero",
  "description" : "Luca's closest friend and associate Paulie Taglia testifies against him, after out of control Luca rapes his girlfriend. L.A. crime boss Nat Martino tries to push Luca out of Vegas. Luca learns Martino's big secret and fights back."
}, {
  "imdbId" : "0090410",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "The Senator, the Movie Star, and the Mob",
  "description" : "Torello's team must protect a US Senator, the head of the Senate subcommittee that will investigates the mob, a glamorous actress, who wants to cut her ties to the mob, and a lusty, sleazy politician with a serious gambling addiction."
}, {
  "imdbId" : "0090410",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "Blast from the Past",
  "description" : "Torello's ex is in Vegas with her new man. When they were at a robbery he is taken by the robbers. When she sees the local police are not doing anything, she calls Torello who clashes with the cop in charge."
}, {
  "imdbId" : "0090410",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "Always a Blonde",
  "description" : "The Senterros, a family of Mexican cattle ranchers, controls the marijuana trade, so Torello's unit sets up a sting operation, but detective Joey Indelli leaves to try to save a callgirl from her sadistic pimp."
}, {
  "imdbId" : "0090410",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "Atomic Fallout",
  "description" : "Torello's after a killer, who might be a federal employee. Following the killer's trail, Mike ends up in Mexico, where he witnesses a drug smuggling operation lead by Luca."
}, {
  "imdbId" : "0090410",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "Shockwaves",
  "description" : "Torello's ordered by the government to leave Luca alone, since he's now their asset. Abrams quits his job immediately in disgust. Luca's former associates start to fear for their future in the crime business."
}, {
  "imdbId" : "0090410",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "Robbery, Armed",
  "description" : "Torello's having a birthday party in a restaurant. His best friend and partner Sgt. Danny Krychek is shot in the bathroom. He whispers a clue to who the shooter is and heads for surgery. Mike must beat the clock to catch the assassin."
}, {
  "imdbId" : "0090410",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "Little Girl Lost",
  "description" : "A man hires a private detective to find his girlfriend, who turns out to be the daughter of a mobster. Things don't go well. Meanwhile, Abrams has become an addict, so sympathetic Torello offers him a place in his team."
}, {
  "imdbId" : "0090410",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "Love Hurts",
  "description" : "Luca is financing a movie and falls for the provocative leading lady. She turns out to be more than even he can chew."
}, {
  "imdbId" : "0090410",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "Mig 21",
  "description" : "A Russian pilot defects by flying his plane into the U.S. and landing in Nevada. Torello and his men are assigned to protect him. They become friends. But Torello learns that the government is considering trading him for the U2 pilot being held in the Soviet Union. And they try to stop it from happening. Abrams who now works for Luca helps him get something on a guy whose business he wants to buy."
}, {
  "imdbId" : "0090410",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "Moulin Rouge",
  "description" : "A casino owned by an African American is being hit with everything, from threats to bombs. Reporter Suzanne Terry's back to investigate the attacks and runs into her old flame, Abrams."
}, {
  "imdbId" : "0090410",
  "season" : "2",
  "episodeNumber" : "11",
  "title" : "Seize the Time",
  "description" : "Torello tries to prove Iris, the African-American owner of the casino Moulin Rouge, that her partner might be using the place for money-laundering."
}, {
  "imdbId" : "0090410",
  "season" : "2",
  "episodeNumber" : "12",
  "title" : "Femme Fatale",
  "description" : "Torello helps a pretty Asian girl find her missing father, who's been owing money to some loan sharks. What he doesn't know is that she's actually a secret agent of communist China on a radioactive mission."
}, {
  "imdbId" : "0090410",
  "season" : "2",
  "episodeNumber" : "13",
  "title" : "Protected Witness",
  "description" : "A Chicago mobster with a contract on his head becomes the target of Torello, who wants him alive, and Luca, who wants him dead."
}, {
  "imdbId" : "0090410",
  "season" : "2",
  "episodeNumber" : "14",
  "title" : "Last Rites",
  "description" : "One of Luca's former bosses Manny Weisbord suffers a heart-attack. Luca tries to get him a new heart, so mobsters Max Goldman and Steve Kordoa, Luca's former associates put a contract on Luca."
}, {
  "imdbId" : "0090410",
  "season" : "2",
  "episodeNumber" : "15",
  "title" : "Pauli Taglia's Dream",
  "description" : "How Paulie and Luca survived the atomic blast that seemingly killed them both at the end of season 1, how they made a deal with the government and how, with a little help from their mob friends, they got back in the business."
}, {
  "imdbId" : "0090410",
  "season" : "2",
  "episodeNumber" : "16",
  "title" : "Roadrunner",
  "description" : "Torello goes into the desert after an escaped convict and his girlfriend. However, a corrupt local cop wants them both dead, even if he has to kill Torello to get them."
}, {
  "imdbId" : "0090410",
  "season" : "2",
  "episodeNumber" : "17",
  "title" : "Brothel Wars",
  "description" : "Pauli's girlfriend, who's a hooker, ends up being the latest casualty in a violent war between competing brothels."
}, {
  "imdbId" : "0090410",
  "season" : "2",
  "episodeNumber" : "18",
  "title" : "Byline",
  "description" : "Torello's friend, a reporter, promises he'll expose Luca in his latest article. He goes to Vegas and indulges himself in the local vices as a cover."
}, {
  "imdbId" : "0090410",
  "season" : "2",
  "episodeNumber" : "19",
  "title" : "The Hearings",
  "description" : "Luca's connections to the government are questioned in a Senate hearing and charges are about to be brought up against him, but the Vietnam War changes everything."
}, {
  "imdbId" : "0090410",
  "season" : "2",
  "episodeNumber" : "20",
  "title" : "Pursuit",
  "description" : "Torello and his crew are after Luca, so he hides in Mexico. They go after him, even though the US government refuses to help them track him down there. However, this time Torello has a contact there who can help."
}, {
  "imdbId" : "0090410",
  "season" : "2",
  "episodeNumber" : "21",
  "title" : "Escape",
  "description" : "Danny ends up in Mexican prison. Torello manages to fins allies among mobsters who hate Luca, to get Danny out before he gets shanked. Luca demands respect from a corrupt local general, but he gets none."
}, {
  "imdbId" : "0090410",
  "season" : "2",
  "episodeNumber" : "22",
  "title" : "Going Home",
  "description" : "Luca gets hold of Abrams and forces Torello to give him back his captured heroin shipment in exchange. However, Mike's not going to let him escape this time and goes after him anyway, with tragic consequences all around."
}]