[{
  "imdbId" : "4052886",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Pilot",
  "description" : "Lucifer has left Hell to take up a life on Earth. When a friend of his is murdered Lucifer joins forces with the good side of the law to discover who the perpetrators are and to give them what they rightfully deserve."
}, {
  "imdbId" : "4052886",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Lucifer, Stay. Good Devil.",
  "description" : "When a movie star's son is killed after being chased by the paparazzi, Chloe takes a deep look into the case with a little help from Lucifer. Meanwhile, Maze and Amenadiel continue to encourage Lucifer to go back to hell."
}, {
  "imdbId" : "4052886",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "The Would-Be Prince of Darkness",
  "description" : "An up-and-coming quarterback calls Lucifer after finding a corpse in his pool; Lucifer asks Chloe to help investigate, which leads them into the world of big-money sports."
}, {
  "imdbId" : "4052886",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Manly Whatnots",
  "description" : "In an effort to get over his infatuation with Chloe, Lucifer decides that he must seduce her. Meanwhile, the two team up on a missing girl case and Amenadiel confronts Maze about his concerns about Lucifer."
}, {
  "imdbId" : "4052886",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Sweet Kicks",
  "description" : "When Lucifer is attending a fashion show, a girl gets murdered. He then volunteers to help Detective Decker solve the homicide. Mazikeen goes behind Lucifer's back."
}, {
  "imdbId" : "4052886",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Favorite Son",
  "description" : "A robbery gone bad leads to Lucifer and Chloe working together. Dan has an unusual encounter with Mazikeen. Chloe suspects Lucifer might be a criminal. Linda chooses to play Lucifer's game."
}, {
  "imdbId" : "4052886",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Wingman",
  "description" : "Lucifer gets help from an unlikely source while trying to find the contents of his stolen container; Chloe uncovers a vital clue."
}, {
  "imdbId" : "4052886",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Et Tu, Doctor?",
  "description" : "The murder of a therapist prompts Lucifer to enlist the help of Dr. Linda to search for a suspect."
}, {
  "imdbId" : "4052886",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "A Priest Walks Into a Bar",
  "description" : "A priest seeks out Lucifer's help when he suspects an underground drug operation has set up shop at a neighborhood youth center. Meanwhile, Malcolm manipulates a way to keep an eye on Dan."
}, {
  "imdbId" : "4052886",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "Pops",
  "description" : "Lucifer and Chloe suspect a restaurateur's son played a part in his death; the return of Chloe's mother sends her life into upheaval."
}, {
  "imdbId" : "4052886",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "St. Lucifer",
  "description" : "When philanthropist Tim Dunlear is found dead, Lucifer explores his good side by becoming a benefactor for Tim's glitzy Los Angeles charity."
}, {
  "imdbId" : "4052886",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "#TeamLucifer",
  "description" : "The team investigates the death of a woman whose body with \"Hail Lucifer\" message was found lying in a pentagram."
}, {
  "imdbId" : "4052886",
  "season" : "1",
  "episodeNumber" : "13",
  "title" : "Take Me Back to Hell",
  "description" : "When Lucifer is framed for murder, he and Chloe must work together to clear his name and prove the identity of the true killer."
}, {
  "imdbId" : "4052886",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "Everything's Coming Up Lucifer",
  "description" : "Lucifer and Chloe look into the murder of a stand-in actress; Chloe's faith in Lucifer is tested."
}, {
  "imdbId" : "4052886",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "Liar, Liar, Slutty Dress on Fire",
  "description" : "Lucifer suspects his mother may be involved in a ghastly murder for which she claims she's innocent."
}, {
  "imdbId" : "4052886",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "Sin-Eater",
  "description" : "Lucifer and Chloe investigate a gruesome murder after a video of the crime surfaces on social media. When a second video appears, they realize they have a serial killer on their hands."
}, {
  "imdbId" : "4052886",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "Lady Parts",
  "description" : "After the bodies of two young L.A. transplants are found poisoned, Chloe and Lucifer hunt for the killer. Upon Maze convincing Chloe to go out for drinks, which the detective perceives as an act of friendship, but is actually part of a bet between Maze and Lucifer, the two make a shocking decision."
}, {
  "imdbId" : "4052886",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "Weaponizer",
  "description" : "Lucifer's brother Uriel shows up as he investigates the murder of his favorite action hero."
}, {
  "imdbId" : "4052886",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "Monster",
  "description" : "Guilty and self-destructive, Lucifer clashes with Chloe during an investigation, leading her to team up with Dan instead. Meanwhile, Amenadiel bonds with Charlotte, and Maze takes Trixie trick-or-treating."
}, {
  "imdbId" : "4052886",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "My Little Monkey",
  "description" : "After the man convicted of killing Chloe's father is murdered, new clues suggests he was framed; Maze looks for a job; Lucifer tries to learn how to be normal by watching Dan."
}, {
  "imdbId" : "4052886",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "Trip to Stabby Town",
  "description" : "Lucifer seeks Azrael's blade when he discovers it's been used in a string of violent stabbings linked to a local yoga studio."
}, {
  "imdbId" : "4052886",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "Homewrecker",
  "description" : "Lucifer goes to great lengths to protect his home when the owner is murdered and the new owner wants it demolished."
}, {
  "imdbId" : "4052886",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "Quid Pro Ho",
  "description" : "Charlotte is determined to get Lucifer to leave Earth by turning Chloe against him. Meanwhile, Amenadiel has begun working as Charlotte's soldier, which makes Maze question his loyalty."
}, {
  "imdbId" : "4052886",
  "season" : "2",
  "episodeNumber" : "11",
  "title" : "Stewardess Interruptus",
  "description" : "The tension between Lucifer and Chloe makes it difficult for them to investigate the murder of two victims who happen to be Lucifer's old flames."
}, {
  "imdbId" : "4052886",
  "season" : "2",
  "episodeNumber" : "12",
  "title" : "Love Handles",
  "description" : "Lucifer and Chloe investigate a mysterious masked killer who is poisoning college students. They also try to make sense of their new relationship, after a long-awaited kiss. Meanwhile, Charlotte visits Linda for advice on a touchy subject."
}, {
  "imdbId" : "4052886",
  "season" : "2",
  "episodeNumber" : "13",
  "title" : "A Good Day to Die",
  "description" : "Lucifer returns to hell to find an antidote for Chloe and his mother goes to hell to bring him back."
}, {
  "imdbId" : "4052886",
  "season" : "2",
  "episodeNumber" : "14",
  "title" : "Candy Morningstar",
  "description" : "Lucifer has gone off the grid and cut off all contact from his family and the police department, following Chloe's near-death. But the murder of an up-and-coming guitarist causes him to resurface - with a new mystery woman. Meanwhile, Lucifer's mom realizes she may have found a way to finally get them back to Heaven."
}, {
  "imdbId" : "4052886",
  "season" : "2",
  "episodeNumber" : "15",
  "title" : "Deceptive Little Parasite",
  "description" : "Lucifer attempts to control his emotions when he learns the flaming sword is the only way the family can return home. In the meantime, a therapist and head of admissions at a prestigious private school is found dead."
}, {
  "imdbId" : "4052886",
  "season" : "2",
  "episodeNumber" : "16",
  "title" : "God Johnson",
  "description" : "When a grisly murder takes place at an insane asylum, the prime suspect calls himself God. Lucifer, unsure this may be his father, tries to find the real killer."
}, {
  "imdbId" : "4052886",
  "season" : "2",
  "episodeNumber" : "17",
  "title" : "Sympathy for the Goddess",
  "description" : "Charlotte helps Lucifer and Chloe find out who killed the man who had the last piece of the Flaming Sword."
}, {
  "imdbId" : "4052886",
  "season" : "2",
  "episodeNumber" : "18",
  "title" : "The Good, the Bad, and the Crispy",
  "description" : "Charlotte accidentally burns a man to death, leaving Lucifer to keep Chloe from figuring what really happened, so he puts Maze in charge of locating Charlotte and Amenadiel, who have both gone missing. Meanwhile, Lucifer seeks a permanent solution for the ticking-time-bomb that is his mother."
}, {
  "imdbId" : "4052886",
  "season" : "3",
  "episodeNumber" : "1",
  "title" : "They're Back, Aren't They?",
  "description" : "Lucifer enlists Chloe to figure out how he wound up in the desert with his wings back."
}, {
  "imdbId" : "4052886",
  "season" : "3",
  "episodeNumber" : "2",
  "title" : "The One with the Baby Carrot",
  "description" : "Lucifer takes a sudden interest in a case while continuing to track down the Sinnerman."
}, {
  "imdbId" : "4052886",
  "season" : "3",
  "episodeNumber" : "3",
  "title" : "Mr. and Mrs. Mazikeen Smith",
  "description" : "Maze heads to Canada to get more out of life, but Chloe suspects she's being deceived by a conman."
}, {
  "imdbId" : "4052886",
  "season" : "3",
  "episodeNumber" : "4",
  "title" : "What Would Lucifer Do?",
  "description" : "Lucifer and Chloe investigate the murder of a youth counselor."
}, {
  "imdbId" : "4052886",
  "season" : "3",
  "episodeNumber" : "5",
  "title" : "Welcome Back, Charlotte Richards",
  "description" : "When a food chemist is found dead, Lucifer and Chloe's investigation pits them against an unexpected face - criminal defense attorney Charlotte Richards. Everyone is caught off guard when they see her back in the precinct. As Lucifer tries to understand her return, he makes a shocking discovery that helps solve the case."
}, {
  "imdbId" : "4052886",
  "season" : "3",
  "episodeNumber" : "6",
  "title" : "Vegas With Some Radish",
  "description" : "When Lucifer discovers Candy has gone missing, he hightails it to Las Vegas with Ella in tow. They work to find her, but interesting secrets could compromise the investigation. Meanwhile, Chloe is upset that Lucifer left on her birthday."
}, {
  "imdbId" : "4052886",
  "season" : "3",
  "episodeNumber" : "7",
  "title" : "Off The Record",
  "description" : "A reporter seeks revenge after he discovers that Lucifer has been sleeping with his estranged wife. However, when it's revealed that Linda is the reporter's estranged wife, things get messy. Lucifer's reputation and safety are on the line, especially when a serial killer from the past resurfaces."
}, {
  "imdbId" : "4052886",
  "season" : "3",
  "episodeNumber" : "8",
  "title" : "Chloe Does Lucifer",
  "description" : "When a murder is connected to a celebrity dating app, Lucifer and Chloe question all they know about the world of social media in order to solve the case. Meanwhile, Amenadiel helps Linda deal with the death of her ex-husband."
}, {
  "imdbId" : "4052886",
  "season" : "3",
  "episodeNumber" : "9",
  "title" : "The Sinnerman",
  "description" : "Lucifer and Chloe come face-to-face with the Sinnerman."
}, {
  "imdbId" : "4052886",
  "season" : "3",
  "episodeNumber" : "10",
  "title" : "The Sin Bin",
  "description" : "With the Sinnerman in custody, Lucifer is determined to get his devil face back, but his conscience is in question when another victim's life is on the line."
}, {
  "imdbId" : "4052886",
  "season" : "3",
  "episodeNumber" : "11",
  "title" : "City of Angels?",
  "description" : "A flashback episode about Lucifer's first days on Earth."
}, {
  "imdbId" : "4052886",
  "season" : "3",
  "episodeNumber" : "12",
  "title" : "All About Her",
  "description" : "Lucifer tries to earn Chloe's assistance in his investigation of Pierce. Meanwhile, Amenadiel deals with a personal health issue."
}, {
  "imdbId" : "4052886",
  "season" : "3",
  "episodeNumber" : "13",
  "title" : "Til Death Do Us Part",
  "description" : "When there's a murder in a suburban neighborhood Lucifer and Pierce have to go undercover to find the killer."
}, {
  "imdbId" : "4052886",
  "season" : "3",
  "episodeNumber" : "14",
  "title" : "My Brother's Keeper",
  "description" : "One of Ella's brothers is suspected of being a diamond thief."
}, {
  "imdbId" : "4052886",
  "season" : "3",
  "episodeNumber" : "15",
  "title" : "High School Poppycock",
  "description" : "Lucifer fights a mental block, Chloe has silly fun while solving a murder, and Maze helps her friends get some resolve."
}, {
  "imdbId" : "4052886",
  "season" : "3",
  "episodeNumber" : "16",
  "title" : "Infernal Guinea Pig",
  "description" : "A murder investigation reveals the dark side of Hollywood. Chloe puts her life on the line."
}, {
  "imdbId" : "4052886",
  "season" : "3",
  "episodeNumber" : "17",
  "title" : "Let Pinhead Sing!",
  "description" : "When a superstar singer's life is threatened, the team is thrust into the world of big-ticket stadium shows, crazed fans and divas, giving Lucifer a run for his money. Meanwhile, Charlotte tries to help Linda and Maze repair their friendship."
}, {
  "imdbId" : "4052886",
  "season" : "3",
  "episodeNumber" : "18",
  "title" : "The Last Heartbreak",
  "description" : "Chloe and Lucifer track down a serial killer targeting couples in love and Pierce realizes the case is connected to a murder he solved in 1958."
}, {
  "imdbId" : "4052886",
  "season" : "3",
  "episodeNumber" : "19",
  "title" : "Orange Is the New Maze",
  "description" : "Lucifer and Chloe enter the world of bounty hunting to investigate a murder."
}, {
  "imdbId" : "4052886",
  "season" : "3",
  "episodeNumber" : "20",
  "title" : "The Angel of San Bernardino",
  "description" : "Lucifer and Chloe investigate a murder where a witness claims a winged guardian angel saved her life; Pierce and Chloe's relationship takes an interesting turn; Lucifer discovers something that could change everything."
}, {
  "imdbId" : "4052886",
  "season" : "3",
  "episodeNumber" : "21",
  "title" : "Anything Pierce Can Do I Can Do Better",
  "description" : "When a ballerina is brutally murdered, Lucifer helps Chloe solve the case; Amenadiel begs Charlotte to help him with an important plan; Maze remains devoted to a task from which Pierce asked her to back away."
}, {
  "imdbId" : "4052886",
  "season" : "3",
  "episodeNumber" : "22",
  "title" : "All Hands on Decker",
  "description" : "When Chloe takes some time off, Lucifer is forced to work with Dan on a murder case involving a dog show. Meanwhile, Charlotte and Maze have differing ideas for Chloe's party and after a wild night, Chloe rethinks a life-changing decision."
}, {
  "imdbId" : "4052886",
  "season" : "3",
  "episodeNumber" : "23",
  "title" : "Quintessential Deckerstar",
  "description" : "When Lucifer and Chloe investigate the death of a woman, they discover that they may be pursuing the wrong suspect. Then, Charlotte risks her safety when she decides to take matters into her own hands, and just as Lucifer makes a huge confession, Chloe gets a tragic phone call that changes everything."
}, {
  "imdbId" : "4052886",
  "season" : "3",
  "episodeNumber" : "24",
  "title" : "A Devil of My Word",
  "description" : "Shocked by someone's death, Chloe, Lucifer and the rest of the team work together to investigate and take down the killer. Then, Lucifer has an epiphany, Maze decides to mend a broken friendship and Chloe finally sees the truth."
}, {
  "imdbId" : "4052886",
  "season" : "3",
  "episodeNumber" : "25",
  "title" : "Boo Normal",
  "description" : "As Lucifer and the team investigate the murder of a child psychiatrist, Ella thinks about a big childhood secret that she's been hiding."
}, {
  "imdbId" : "4052886",
  "season" : "3",
  "episodeNumber" : "26",
  "title" : "Once Upon a Time",
  "description" : "Set in an alternate universe where God changed one little thing, which affects Lucifer, Chloe and the people around them."
}]