[{
  "imdbId" : "3475734",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Now Is Not the End",
  "description" : "In 1946, Peggy Carter is now a secretary for the Strategic Scientific Reserve. Howard Stark asks her for help when the country believes that he is selling deadly weapons to their enemies."
}, {
  "imdbId" : "3475734",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Bridge and Tunnel",
  "description" : "Howard Stark's deadliest weapon has fallen into enemy hands, and only Agent Carter can recover it. But can she do so before her undercover mission is discovered by SSR Chief Dooley and Agent Thompson?"
}, {
  "imdbId" : "3475734",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Time and Tide",
  "description" : "As Agent Carter closes in on Howard Stark's stolen technology, Peggy's secret mission could unravel when the SSR arrests Jarvis and a secret is revealed."
}, {
  "imdbId" : "3475734",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "The Blitzkrieg Button",
  "description" : "Peggy may be in more trouble than usual when fugitive Howard Stark suddenly returns for mysterious reasons. And Chief Dooley chases a new clue all the way to Europe that threatens to destroy Peggy's future at the SSR."
}, {
  "imdbId" : "3475734",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "The Iron Ceiling",
  "description" : "Carter finally gets a chance to prove herself as she is sent on a mission in Russia with Agent Thompson and the Howling Commandos. Meanwhile, Agent Sousa makes an important discovery."
}, {
  "imdbId" : "3475734",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "A Sin to Err",
  "description" : "Carter believes that the spy that stole Stark's technology is a woman. The SSR now knows that Carter is helping Stark. There's a new spy in the agency."
}, {
  "imdbId" : "3475734",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "SNAFU",
  "description" : "Peggy is cornered and more vulnerable than ever as Leviathan makes their move against her. As the SSR zeroes in on Howard Stark, they may pay the ultimate price as they find their true enemy is closer than they realized."
}, {
  "imdbId" : "3475734",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Valediction",
  "description" : "Peggy faces the full fury of Leviathan, as Howard Stark makes his return."
}, {
  "imdbId" : "3475734",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "The Lady in the Lake",
  "description" : "Dedicated to the fight against new Atomic Age threats in the wake of World War II, Agent Carter journeys from New York City to Los Angeles for her most dangerous and bizarre assignment yet."
}, {
  "imdbId" : "3475734",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "A View in the Dark",
  "description" : "Peggy discovers her murder investigation has huge ramifications that can destroy her career, as well as everyone near and dear to her."
}, {
  "imdbId" : "3475734",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "Better Angels",
  "description" : "Peggy's pursuit of the truth about Zero Matter places her on a collision course with her superiors."
}, {
  "imdbId" : "3475734",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "Smoke & Mirrors",
  "description" : "Peggy and the SSR discover that beautiful Hollywood star Whitney Frost harbors a dangerous secret, and that she's more than just a pretty face."
}, {
  "imdbId" : "3475734",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "The Atomic Job",
  "description" : "As Jarvis' precision and quick-thinking skills are put to the ultimate test, Peggy must find a way to stop an atomic explosion that threatens to destroy all of California."
}, {
  "imdbId" : "3475734",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "Life of the Party",
  "description" : "When Peggy realizes she cannot save Wilkes on her own, she turns to her most unexpected adversary for help while Whitney makes a move to control the deadly Zero Matter."
}, {
  "imdbId" : "3475734",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "Monsters",
  "description" : "As Peggy plots a rescue mission, Whitney hunts for even more dark power; and Jarvis learns he should not make promises he cannot keep."
}, {
  "imdbId" : "3475734",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "The Edge of Mystery",
  "description" : "Peggy and Sousa propose a trade with Whitney Frost, while the SSR gets help from Howard Stark that may be the key to eliminating Zero Matter."
}, {
  "imdbId" : "3475734",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "A Little Song and Dance",
  "description" : "Peggy desperately tries to save Dr. Wilkes with a dangerous plan to stop Whitney Frost. But Thompson makes a surprising move that could destroy them all."
}, {
  "imdbId" : "3475734",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "Hollywood Ending",
  "description" : "Peggy needs Howard Stark to eliminate Zero Matter as they are faced with a mission none of them could come back."
}]