[{
  "imdbId" : "0318218",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Darwin's Dangerous Idea",
  "description" : "Interweaving key moments of drama in Darwin's life with current research, Darwin s Dangerous Idea explores why his theory of evolution might matter even more today than it did in his own time."
}, {
  "imdbId" : "0318218",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Great Transformations",
  "description" : "From the development of the four-limbed body plan, the journey of animal life from water to land, and the emergence of humans, Great Transformations focuses on the important evolutionary changes that triggered the earth s incredible diversity."
}, {
  "imdbId" : "0318218",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Extinction!",
  "description" : "Some 99.9 percent of all species that have ever lived on earth are now extinct. Extinction! explores why, then confronts a frightening notion: Are humans causing the next mass extinction the sixth in the history of life on earth?"
}, {
  "imdbId" : "0318218",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "The Evolutionary Arms Race",
  "description" : "Survival of the fittest: Is it raw competition, a level of cooperation indispensable to life, or both? Explore our own spiraling arms race with microorganisms the only real threat to our existence and trace the alarming spread of resistance among pathogens that cause disease."
}, {
  "imdbId" : "0318218",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Why Sex?",
  "description" : "Investigate the endless variety of sexual expression and the powerful hold sex exerts over almost all living things. And discover why, in evolutionary terms, sex is more important than life itself."
}, {
  "imdbId" : "0318218",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "The Mind's Big Bang",
  "description" : "Between 100,000 and 50,000 years ago, something happened that triggered a creative, technological, and social explosion, allowing humans to dominate the planet. What forces may have contributed to the emergence of the modern human mind?"
}, {
  "imdbId" : "0318218",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "What About God?",
  "description" : "Of all the species on earth, only humans try to explain who they are and how they came to be. Encounter real human stories of people struggling to find a balance between religion and science, realms that play very different roles in assigning order to the universe and a purpose to life."
}]
