[{
  "imdbId" : "2431022",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Inventors",
  "description" : "On a unique planet, a unique species takes its first steps: Mankind begins. But it's a world full of danger."
}, {
  "imdbId" : "2431022",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Iron Men",
  "description" : "A mysterious band of pirates plunders the Mediterranean coast - leaving destruction in its wake. Empires fall, but out of the chaos, we discover iron. Armed with this wonder metal, ordinary folk can overthrow tyrants and build a new world order."
}, {
  "imdbId" : "2431022",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Empires",
  "description" : "In the city of Jerusalem, a man is crucified - Jesus of Nazareth. His death gives birth to a global religion. But Christianity may never have happened without the Roman Empire."
}, {
  "imdbId" : "2431022",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Warriors",
  "description" : "When Rome is sacked by barbarians, Europe enters a Dark Age. But from the fringes of the old empire, two new forces remake the world. The Arabs, funded by a gold rush, unite under the banner of Islam."
}, {
  "imdbId" : "2431022",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Plague",
  "description" : "Genghis Khan, the bloodiest warlord in history, sweeps south from Mongolia into China and creates a mighty empire. He leaves 40 million dead bodies in his wake. But a greater killer stalks Mankind - the Plague."
}, {
  "imdbId" : "2431022",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Survivors",
  "description" : "Gold from Africa kickstarts the rebirth of Europe. Money flows into Venice, creating new opportunities for entrepreneurs willing to take risks. In China, a new weapon, the gun, allows a peasant uprising to unify the country."
}, {
  "imdbId" : "2431022",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "New World",
  "description" : "The Aztecs have built a mighty empire that dominates Central America. But it will be destroyed because of a domino effect. 7,000 miles away in modern-day Turkey, the great trading center of Constantinople is overrun by an Islamic army."
}, {
  "imdbId" : "2431022",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Treasure",
  "description" : "In the Andes, the Spanish open up the largest silver mine in the world and mint millions of pesos de ocho (pieces of eight). These coins transform the global economy. They fill the treasure chests of pirates."
}, {
  "imdbId" : "2431022",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "Pioneers",
  "description" : "Mankind embarks on a new age of exploration and tames the wilderness. In North America, Siberia and Australia ancient traditions are swept away in the name of commerce and science."
}, {
  "imdbId" : "2431022",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "Revolutions",
  "description" : "Two great revolutions entwine. The American Revolution inspires dreams of political and personal liberty. The Industrial Revolution replaces muscle power with machines, freeing Mankind from nature's limits."
}, {
  "imdbId" : "2431022",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "Speed",
  "description" : "The end of the Civil War allows mankind to go into overdrive. This is an age of innovation, transformation and mass production. People believe that anything, everything, is possible."
}, {
  "imdbId" : "2431022",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "New Frontiers",
  "description" : "Mankind takes on godlike powers: to feed billions of people, reshape the landscape, re-engineer the human body. The greatest power of all was unleashed over Hiroshima on August 6, 1945."
}]