[{
  "imdbId" : "0092455",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Encounter at Farpoint",
  "description" : "On the maiden mission of a new Enterprise, the God-like being known as Q challenges the crew to discover the secret of a mysterious base in a truly intelligent & civilized fashion."
}, {
  "imdbId" : "0092455",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "The Naked Now",
  "description" : "The crew of the Enterprise is infected with a virus that causes them to behave as though they were intoxicated."
}, {
  "imdbId" : "0092455",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Code of Honor",
  "description" : "When the leader of an alien culture takes a romantic interest in Lt. Yar, he claims her for his own, to the dismay of his own wife, who, in turn, challenges Tasha in a fight to the death."
}, {
  "imdbId" : "0092455",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "The Last Outpost",
  "description" : "At the Federation's first encounter with the hostile, thievish Ferengi race, both the Enterprise and their 'daimon' (captain) Tarr's spaceship are immobilized by a force field from a dead-presumed planet. It turns out to be the 'portal', a gatekeeper, last survivor of a superior civilization wiped out by their star's supernova. He captures both races' scouting teams and test if they deserve to be spared or put down as hopeless barbarians. The Ferengi try blaming the humans, Riker brutal, yet noble honesty."
}, {
  "imdbId" : "0092455",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Where No One Has Gone Before",
  "description" : "Although Riker considers maverick federation scientist Kosinski's project to vastly boast the propulsion absurd, Picard obeys the admiralty orders. Fascinated, Wesley sits with his alien assistant and wins his confidence. the results surpass eve Kosinski's wildest dreams, jumping into a galaxy far beyond the explored part of the universe. Deciding against immediate study, Picard orders Kosinski to get them back. Only Wesley noticed that his assistant, who 'faded' supernaturally, is the real key. The next jump brings to where the crew's deepest hopes and fears come ..."
}, {
  "imdbId" : "0092455",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Lonely Among Us",
  "description" : "The Enterprise is transporting to the neutral planet parliament peace delegates from two races which can't stand each other long enough to occupy neighboring suites, yet both want to join the Federation. Traveling trough a mysterious energy cloud, some gets aboard and keeps jumping from crew members to machinery and vice versa, as if seeking a suitable host and learning about the ship, without revealing itself. The crew catches on slowly, as nobody seems seriously affected, except Wesley's engineering mentor Singh, who is killed in a warp technology accident, but '..."
}, {
  "imdbId" : "0092455",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Justice",
  "description" : "After exhausting activities to help a human colony settle, the Enterprise crew is delighted to take their first-ever shore leave on Edo, an extremely friendly planet. Half in jest, Picard says it seems to too good to be true, an Eden-like playground. Alas, it is, for while teaching native adolescents football, Wesley unwittingly commits a minor transgression in the zone where all errors suffer the single punishment: death by painless injection. Back aboard Enterprise, the senior officers struggle with an entity defying even the known laws of nature, which is facing ..."
}, {
  "imdbId" : "0092455",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "The Battle",
  "description" : "The Enterprise is kept waiting for days on a mysterious rendezvous with Ferenge 'daimon' (captain) Bok's spaceship, then receives a gift which stuns Picard: the USS Stargazer, the lost vessel he commanded in a legendary battle, won by inventing a now classic maneuver. He goes aboard to recover some belongings and takes it in tow, but suffers worrying headaches and starts behaving erratically, until he leaves the Enterprise for it. Data works out Bok's motivation for the gift against his race's mercantile attitude, which even gets him removed from command. Wesley ..."
}, {
  "imdbId" : "0092455",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "Hide and Q",
  "description" : "The Enterprise encounters Q again, and he tempts Riker by endowing him with the powers of the Q."
}, {
  "imdbId" : "0092455",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "Haven",
  "description" : "While on a mission to a planet called Haven, Counselor Troi meets her husband to be, a marriage arranged by her father years before, as the Enterprise encounters a ship far deadlier than any combat could provide."
}, {
  "imdbId" : "0092455",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "The Big Goodbye",
  "description" : "Captain Picard and some of his crew are caught in a deadly trap in the holodeck as the result of a ship-wide scan from an alien race."
}, {
  "imdbId" : "0092455",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "Datalore",
  "description" : "The Enterprise visits the planet where Data was created and discovers another android like him, but when he's assembled, he's not EXACTLY like him."
}, {
  "imdbId" : "0092455",
  "season" : "1",
  "episodeNumber" : "13",
  "title" : "Angel One",
  "description" : "Riker, Troi, Data and Yar beam down to a planet ruled by a matriarchal government in the hopes of locating a missing freighter crew."
}, {
  "imdbId" : "0092455",
  "season" : "1",
  "episodeNumber" : "14",
  "title" : "11001001",
  "description" : "The Enterprise docks at a starbase for repairs where it is commandeered by a race of technologically-linked aliens intent on using the vessel for their own purposes."
}, {
  "imdbId" : "0092455",
  "season" : "1",
  "episodeNumber" : "15",
  "title" : "Too Short a Season",
  "description" : "The Enterprise transports an elderly Starfleet Admiral to negotiate a hostage crisis. When the Admiral takes a de-aging drug, he endangers both his life and the mission."
}, {
  "imdbId" : "0092455",
  "season" : "1",
  "episodeNumber" : "16",
  "title" : "When the Bough Breaks",
  "description" : "A planet that was able to cloak itself for thousands of years suddenly reveals itself, with its inhabitants proposing peace. But, after initial negotiations, children of the Enterprise are kidnapped due to the impotence of the inhabitants."
}, {
  "imdbId" : "0092455",
  "season" : "1",
  "episodeNumber" : "17",
  "title" : "Home Soil",
  "description" : "On Velara III, Geordi and Data discover a microscopic life form responsible for the death of an engineer stationed on the base."
}, {
  "imdbId" : "0092455",
  "season" : "1",
  "episodeNumber" : "18",
  "title" : "Coming of Age",
  "description" : "Picard finds himself facing a strenuous test of his loyalty to Starfleet, one which the other members of the crew are struggling to cope with, whilst Wesley faces an equally challenging entrance exam at Starfleet Academy."
}, {
  "imdbId" : "0092455",
  "season" : "1",
  "episodeNumber" : "19",
  "title" : "Heart of Glory",
  "description" : "The Enterprise searches for answers as to why 3 Klingon warriors were the only survivors aboard a freighter just inside the neutral zone that was attacked by what seemed to be Ferengi ship."
}, {
  "imdbId" : "0092455",
  "season" : "1",
  "episodeNumber" : "20",
  "title" : "The Arsenal of Freedom",
  "description" : "The Enterprise encounters a planet long dead, but technical equipment still functions for the purpose of selling off its arsenal, along with self sufficiency."
}, {
  "imdbId" : "0092455",
  "season" : "1",
  "episodeNumber" : "21",
  "title" : "Symbiosis",
  "description" : "While observing a solar flare, the Enterprise happens to pick up distress calls from a breaking-down freighter. Two of the six people aboard get killed as there's no time left to beam aboard properly because the cargo was sent first, yet the other two crew members seem to care only for the freight. Their passengers, from their neighbor planet, contest ownership because their agreed payment aboard the freighter was lost. It's their only produce, vital for the other planet since it was struck by a general plague. Yet Dr. Crusher soon realizes it's not really medicine as..."
}, {
  "imdbId" : "0092455",
  "season" : "1",
  "episodeNumber" : "22",
  "title" : "Skin of Evil",
  "description" : "The shuttle bringing Troi back to the Enterprise from an individual mission crashes on a near-unknown planet. It was presumed uninhabited, but shows atypical, live-like activity. Riker leads an away-team, including Data, which discovers the shuttle is controlled and access barred by a shape-shifting, oily slick of hostile, almost sadistic nature, with immense powers. Attempts to pass it cause Riker to be temporarily swallowed, Yar to be killed. Picard beams down to take command while Deana works out it's acting out of deep frustration, which they must tap into."
}, {
  "imdbId" : "0092455",
  "season" : "1",
  "episodeNumber" : "23",
  "title" : "We'll Always Have Paris",
  "description" : "Puzzled, the Enterprise follows the enigmatic trail of distress messages left behind by the vessel of reputed time-space-continuum researcher Dr. Paul Manheim, which went missing years ago during his last experiment. It went terribly wrong, causing a time-distorting ripple to spread from a binary star system and pulsar's tapped-into unimaginable energy, which already affects the Enterpise crew. To prevent the galaxy being ripped open, the process must be reversed, although gravely, maybe fatally, injured Mannheim can only give unreliable instructions to Data. Picard ..."
}, {
  "imdbId" : "0092455",
  "season" : "1",
  "episodeNumber" : "24",
  "title" : "Conspiracy",
  "description" : "After diverting to a secret meeting with an old friend and some of Starfleet's finest commanders, Picard finds the Horatio blown to bits just hours after the meeting and he returns the Enterprise to Earth looking for answers."
}, {
  "imdbId" : "0092455",
  "season" : "1",
  "episodeNumber" : "25",
  "title" : "The Neutral Zone",
  "description" : "\"Days of Yesteryear\" would be a more appropriate title, as Data finds an old ship in space that's been there for years, with 3 people who've been frozen for over 400 years. Meanwhile, Starfleet sends the Enterprise to the edge of the Romulan neutral zone, where star bases and their personnel have disappeared after decades of no contact between the Federation and the Romulans."
}, {
  "imdbId" : "0092455",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "The Child",
  "description" : "Deanna is impregnated by a unknown alien life-form, and Dr. Katherine Pulaski joins the Enterprise as the ship's new Chief Medical Officer."
}, {
  "imdbId" : "0092455",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "Where Silence Has Lease",
  "description" : "The Enterprise encounters a mysterious void in space and when they move in closer to investigate further, it envelops them and they can't get out."
}, {
  "imdbId" : "0092455",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "Elementary, Dear Data",
  "description" : "An attempt to provide Data with a challenging Sherlock Holmes holodeck RPG scenario backfires when its Prof. Moriarty character accidentally becomes self-aware."
}, {
  "imdbId" : "0092455",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "The Outrageous Okona",
  "description" : "The Enterprise rescues the captain of a broken-down freighter, only to become involved in a dispute between feuding worlds--each demanding custody of their guest. Data seeks help from Guinan in understanding humor."
}, {
  "imdbId" : "0092455",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "Loud as a Whisper",
  "description" : "The crew ferries a deaf mediator to Solais V to negotiate an end to a civil war."
}, {
  "imdbId" : "0092455",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "The Schizoid Man",
  "description" : "The Enterprise respond to a request for medical assistance from Dr. Ira Graves, considered by many to be the greatest living mind in the universe. Graves didn't want any help and the Enterprise was summoned by his assistant Kareen. He is a crotchety old man who doesn't really like people but is now in the terminal stages of his illness. He taught Data's creator, Dr. Soong, everything he knows and describes himself as the android's grandfather. Knowing that the end is near, he transfers all of his knowledge and intellect into Data. As a result, Data begins to act ..."
}, {
  "imdbId" : "0092455",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "Unnatural Selection",
  "description" : "The Enterprise is en route to Star Station India when receive a distress signal from the USS Lantree, a Federation supply ship. When they arrive, they find everyone aboard the Lantree dying of what seems to be old age. They proceed to the Lantree's last port of call, the Darwin genetic research facility on Gagarin IV only to find that they too are suffering from rapid aging. Picard and Dr. Pulaski clash when she brings aboard one of the children from the station and in order to complete her examination, takes him aboard a shuttle craft in order to isolate him from the..."
}, {
  "imdbId" : "0092455",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "A Matter of Honor",
  "description" : "When the Federation promotes an officer exchange program, Commander Riker decides to accept an assignment aboard a Klingon war ship. As the first Federation officer to serve aboard a Klingon vessel, Riker has to gain the trust of his new shipmates and particularly that of his irascible captain. As part of the same exchange program, the Enterprise welcomes aboard Ensign Mendon from a culture that is forever seeking to improve operational efficiency. When he discovers a bacteria attacking the integrity of the ship's hull, he searches for a solution on his own rather ..."
}, {
  "imdbId" : "0092455",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "The Measure of a Man",
  "description" : "When Data resigns his commission rather than be dismantled for examination by an inadequately skilled scientist, a formal hearing is convened to determine whether Data is considered property without rights or is a sentient being."
}, {
  "imdbId" : "0092455",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "The Dauphin",
  "description" : "Ens. Wesley Crusher suffers from the pangs of first love when the Enterprise is tasked to transport a young woman, Salia, back to her home where she is to become the leader of her people. Traveling with her is her guardian and teacher, Anya, who is more that just a bit overprotective. Wesley very much wants to be with her - and her likewise with him - but there are few opportunities and Anya continually interferes. Guinan and others provide him with advice. When Salia reveals her true self to him, he re-evaluates his feelings."
}, {
  "imdbId" : "0092455",
  "season" : "2",
  "episodeNumber" : "11",
  "title" : "Contagion",
  "description" : "Picard and the Enterprise respond to a distress call from its sister ship the USS Yamato. It has been facing a number of serious technical glitches and they lost 18 crew members when the computer turned off the force field on an open shuttle bay. Before the Enterprise can assist however, the Yamato is destroyed with all lives lost. The explosion is apparently the result of a failure in their matter/anti-matter pods but Picard suspects it may have something to do with a relic the Yamato's captain obtained on an archaeological dig on a nearby planet. They are in the ..."
}, {
  "imdbId" : "0092455",
  "season" : "2",
  "episodeNumber" : "12",
  "title" : "The Royale",
  "description" : "When the Enterprise is advised by a passing Klingon vessel that there is strange debris in orbit around a nearby planet, they investigate only to find a piece of a NASA spacecraft emblazoned with the US flag. The planet below has severe weather and an unbreathable atmosphere except for one small area that appears to be inhabitable by humans. Riker, Data and Worf beam down to the surface only to find a single revolving door leading them to the casino floor in the Hotel Royale. They soon find that they are trapped there and cannot exit. As they explore the hotel, they ..."
}, {
  "imdbId" : "0092455",
  "season" : "2",
  "episodeNumber" : "13",
  "title" : "Time Squared",
  "description" : "Deep in space, the Enterprise comes across a Federation shuttle craft that is floating in space and without much power but which does exhibit the life signs of one human aboard. They bring the craft aboard only to find that it is one of their own shuttle craft and to their amazement find a duplicate, but unconscious, Captain Picard aboard. Data and Geordi Laforge manage to restore power and determine that the craft actually comes from 6 hours into the future and the shuttle's log reveals that the Enterprise will be destroyed. As the Enterprise enters a dangerous ..."
}, {
  "imdbId" : "0092455",
  "season" : "2",
  "episodeNumber" : "14",
  "title" : "The Icarus Factor",
  "description" : "Riker's delight at being offered a command of the USS Aries turns to frustration when the man sent to prepare him for his mission is his estranged father; Worf's behavior leads Wesley to delve into Klingon tradition."
}, {
  "imdbId" : "0092455",
  "season" : "2",
  "episodeNumber" : "15",
  "title" : "Pen Pals",
  "description" : "On arriving at a newly identified planetary group, the crew finds that the entire system is unstable. As the person in charge of Wesley Crusher's training and education, Commander Riker wants to put him in charge of the planetary mineral survey, the results of which should explain why the system has become so unstable. He has to command a team for the first time, all of whom are older than himself. Data meanwhile has a pen pal of sorts when he establishes radio contact with Sarjenka, a young girl from a nearby planet. They exchange information for several weeks when ..."
}, {
  "imdbId" : "0092455",
  "season" : "2",
  "episodeNumber" : "16",
  "title" : "Q Who?",
  "description" : "Q tries to prove that Picard needs him as part of their crew by hurling the Enterprise 7,000 light years away where they encounter the Borg for the first time."
}, {
  "imdbId" : "0092455",
  "season" : "2",
  "episodeNumber" : "17",
  "title" : "Samaritan Snare",
  "description" : "With Picard away for routine surgery, the Enterprise responds to an apparent distress call from a Pakled vessel."
}, {
  "imdbId" : "0092455",
  "season" : "2",
  "episodeNumber" : "18",
  "title" : "Up the Long Ladder",
  "description" : "When Starfleet receives an Earth-like distress signal from deep in space, the Enterprise is sent to investigate. Picard suspects the Earthlings in question may have originated with SS Mariposa which carried a group of Utopians hundreds of years before. He is intrigued at the odd mix of equipment they carry. When they arrive, they realize that solar flares from the planet's sun will kill them and the Captain orders the colonists removed to the Enterprise for their safety. When the refugees mention there is another group from which they've separated for hundreds of ..."
}, {
  "imdbId" : "0092455",
  "season" : "2",
  "episodeNumber" : "19",
  "title" : "Manhunt",
  "description" : "The Enterprise is transporting delegates to a diplomatic conference dealing with Federation membership. Counselor Troi is more than just a bit embarrassed when her mother Lwaxanna, as outrageous as ever, arrives on board the Enterprise. She is the official Ambassador from Betazed but that isn't the only reason she is there. She is going through 'The Phase', a time in her life when her sexual drive increases fourfold. She's clearly got her eyes on the Captain who decides to take refuge on the holodeck as private detective Dixon Hill. With him away, she announces that ..."
}, {
  "imdbId" : "0092455",
  "season" : "2",
  "episodeNumber" : "20",
  "title" : "The Emissary",
  "description" : "The Enterprise is ordered to proceed to an emergency rendez-vous to collect a special envoy who is traveling from Starbase 153 to meet them. They are given no information about the nature of the emergency, just that they will be briefed by the emissary on arrival. She is K'Ehlyar, a Klingon who has been sent to deal with a Klingon ship, the T'Ong, that has been found in deep space with a crew in long term stasis. They pre-date the current peaceful co-existence Between the Federation and Klingon Empire and as far as they are concerned, the Klingon warriors aboard the ..."
}, {
  "imdbId" : "0092455",
  "season" : "2",
  "episodeNumber" : "21",
  "title" : "Peak Performance",
  "description" : "The crew of the Enterprise participates in war games."
}, {
  "imdbId" : "0092455",
  "season" : "2",
  "episodeNumber" : "22",
  "title" : "Shades of Gray",
  "description" : "Riker returns from an away team mission wounded and infected with microbes from the planet below. He is soon in a coma in sick bay, the microbes having fused itself to his sciatic nerve and impeding his normal functions. Dr. Pulaski cannot find a cure and although she can kill the microbes, it would also likely kill Riker. With only a hour or so before the spreading disease reaches his brain, Pulaski stimulates his neural impulses leading Riker to recall previous events aboard the Enterprise. The Doctor realizes that negative emotions are what will defeat the the ..."
}, {
  "imdbId" : "0092455",
  "season" : "3",
  "episodeNumber" : "1",
  "title" : "Evolution",
  "description" : "The Enterprise is carrying an eminent scientist, Dr. Paul Stubbs, to the site of a binary star where they are expecting a massive stellar explosion to occur in a few hours. He has been waiting many years for this to occur and has devoted his entire life to its study. The Enterprise however begins to suffer from a series of malfunctions, some minor but others far more serious. Meanwhile, Dr. Beverly Crusher has returned to the Enterprise after a year at Starfleet Medical. She's concerned however if her presence may be limiting son Wesley's development. Can a 17 ..."
}, {
  "imdbId" : "0092455",
  "season" : "3",
  "episodeNumber" : "2",
  "title" : "The Ensigns of Command",
  "description" : "After a century of silence, the Enterprise receives a message from the Sheliac system informing them that they have discovered a human colony on a world in their sector. As they will be colonizing the planet themselves in four days time, the want the Enterprise to evacuate all humans from their territory. The planet in question is in a high radiation zone and no one can understand how any human could be living there. As Data is immune to the radiation he is sent to the planet to arrange for the inhabitants departure. Once there however, he finds there is a population ..."
}, {
  "imdbId" : "0092455",
  "season" : "3",
  "episodeNumber" : "3",
  "title" : "The Survivors",
  "description" : "The Enterprise responds to a distress call from Rana IV, a Federation colony that is under attack from an unknown alien ship. When they arrive, they find the entire surface of the planet destroyed, save for a single house and two occupants."
}, {
  "imdbId" : "0092455",
  "season" : "3",
  "episodeNumber" : "4",
  "title" : "Who Watches the Watchers",
  "description" : "A proto-Vulcan culture worships Captain Picard and prepares to offer Counselor Troi as a sacrifice."
}, {
  "imdbId" : "0092455",
  "season" : "3",
  "episodeNumber" : "5",
  "title" : "The Bonding",
  "description" : "A startling surprise awaits the crew of the Enterprise when a mission costs the life of a crew member, who left her son behind."
}, {
  "imdbId" : "0092455",
  "season" : "3",
  "episodeNumber" : "6",
  "title" : "Booby Trap",
  "description" : "The Enterprise picks up ancient radio signal code from the ruined planet Aurelius 9, remnant of the total war over 1,000 years ago between Mentaurs and Promelians which caused both races' extinction. They find a Promelian battle-cruiser still floats in an asteroid field, so Picard, Data and Lieutenant Worf beam inside, finding a message from the captain he alone takes blame for all casualties. Barely back on board, they learn the Enterprise is immobilized by an energy-draining radiation field, the very booby trap that killed the Promelian ship's crew, which will ..."
}, {
  "imdbId" : "0092455",
  "season" : "3",
  "episodeNumber" : "7",
  "title" : "The Enemy",
  "description" : "LaForge gets left behind on a storm-plagued planet when the rest of his team encounters a Romulan warrior."
}, {
  "imdbId" : "0092455",
  "season" : "3",
  "episodeNumber" : "8",
  "title" : "The Price",
  "description" : "While the Enterprise hosts negotiations for control of a stable wormhole, Troi forms a personal relationship with an opposing negotiator, unaware of his true being."
}, {
  "imdbId" : "0092455",
  "season" : "3",
  "episodeNumber" : "9",
  "title" : "The Vengeance Factor",
  "description" : "The Enterprise pursues a race of \"gatherers\" who continue to raid Federation outposts, unaware of the dangers lurking among them."
}, {
  "imdbId" : "0092455",
  "season" : "3",
  "episodeNumber" : "10",
  "title" : "The Defector",
  "description" : "When a Romulan officer defects to the Federation with a warning of a impending invasion, Capt. Picard struggles to decide if he is to be believed."
}, {
  "imdbId" : "0092455",
  "season" : "3",
  "episodeNumber" : "11",
  "title" : "The Hunted",
  "description" : "Investigating a planet applying for membership into the Federation, the crew of the Enterprise finds a group of inhabitants who used to be soldiers, but now fight for their very existence."
}, {
  "imdbId" : "0092455",
  "season" : "3",
  "episodeNumber" : "12",
  "title" : "The High Ground",
  "description" : "While visiting a planet under civil war, Dr. Crusher is taken hostage by an opposing faction of the planet's ruling government."
}, {
  "imdbId" : "0092455",
  "season" : "3",
  "episodeNumber" : "13",
  "title" : "Déjà Q",
  "description" : "Much to Picard's displeasure, Q reappears on the Enterprise, claiming to have been ejected from the Q Continuum, and therefore, lost his powers."
}, {
  "imdbId" : "0092455",
  "season" : "3",
  "episodeNumber" : "14",
  "title" : "A Matter of Perspective",
  "description" : "The widow of respected scientist Dr. Nel Apgar accuses Riker of seducing her and killing her husband. Rather than turn Riker over for unfavorable trial, the Enterprise reconstructs the facts."
}, {
  "imdbId" : "0092455",
  "season" : "3",
  "episodeNumber" : "15",
  "title" : "Yesterday's Enterprise",
  "description" : "The Enterprise C enters the Enterprise D's time and space continuum, where they find Picard and crew in a constant state of war with the Klingons, and only Guinan knows it."
}, {
  "imdbId" : "0092455",
  "season" : "3",
  "episodeNumber" : "16",
  "title" : "The Offspring",
  "description" : "After returning from a cybernetics conference to the Enterprise, Data creates his own \"child,\" much to the chagrin of his captain, and without regards to the ramifications with Starfleet."
}, {
  "imdbId" : "0092455",
  "season" : "3",
  "episodeNumber" : "17",
  "title" : "Sins of the Father",
  "description" : "A Klingon commander boards the Enterprise in an officer exchange program initiated by Starfleet, much to the chagrin of the crew."
}, {
  "imdbId" : "0092455",
  "season" : "3",
  "episodeNumber" : "18",
  "title" : "Allegiance",
  "description" : "Picard is kidnapped and held with three different aliens and meanwhile replaced with a replica as impostor captain."
}, {
  "imdbId" : "0092455",
  "season" : "3",
  "episodeNumber" : "19",
  "title" : "Captain's Holiday",
  "description" : "After mediating a difficult trade agreement, Captain Picard is encouraged to take a much needed rest on a vacationing planet, where he's visited by a strange race from the future, in search of a dangerous weapon."
}, {
  "imdbId" : "0092455",
  "season" : "3",
  "episodeNumber" : "20",
  "title" : "Tin Man",
  "description" : "The Enterprise reaches out to an alien being, while dancing around with the Romulans, who want to attack it in an act of vengeance."
}, {
  "imdbId" : "0092455",
  "season" : "3",
  "episodeNumber" : "21",
  "title" : "Hollow Pursuits",
  "description" : "A shy member of the \"Enterprise\" crew becomes addicted to the holodeck, where relationships are easier there than in real life, when his knowledge is needed in engineering."
}, {
  "imdbId" : "0092455",
  "season" : "3",
  "episodeNumber" : "22",
  "title" : "The Most Toys",
  "description" : "When transporting a dangerous material to the Enterprise, Data is kidnapped and the crew is led to believe he is dead when the shuttlecraft he was piloting explodes enroute."
}, {
  "imdbId" : "0092455",
  "season" : "3",
  "episodeNumber" : "23",
  "title" : "Sarek",
  "description" : "Legendary Federation ambassador Sarek visits the Enterprise to conclude peace talks with a race called the Legarans. His arrival is accompanied with a rash of unusual emotional outbursts among the crew."
}, {
  "imdbId" : "0092455",
  "season" : "3",
  "episodeNumber" : "24",
  "title" : "Ménage à Troi",
  "description" : "When Deanna's mother spurns advances made by a Ferengi Daimon, he takes it upon himself to kidnap the two of them, along with Commander Riker and steal them away aboard his ship."
}, {
  "imdbId" : "0092455",
  "season" : "3",
  "episodeNumber" : "25",
  "title" : "Transfigurations",
  "description" : "The Enterprise finds a deserted planet where a ship has crashed, and, with it, the lone survivor with no memory, but extraordinary healing powers."
}, {
  "imdbId" : "0092455",
  "season" : "3",
  "episodeNumber" : "26",
  "title" : "The Best of Both Worlds: Part 1",
  "description" : "Responding to a distress call on one of the Federation's outer-most colonies, the Enterprise arrives...only to find a big hole in the ground where the town used to be, and discovers the Borg are behind the attack."
}, {
  "imdbId" : "0092455",
  "season" : "4",
  "episodeNumber" : "1",
  "title" : "The Best of Both Worlds: Part 2",
  "description" : "Commander Riker had no choice as acting captain but fire full force on the Borg starship, despite Picard being on board of it, altered to a Borg calling himself Locutus, both ships are damaged. Emergency repairs shouldn't take too long to make the appointment with Admiral J. P. Hanson, who announces Klingons coming to the rescue, but Picard seems lost forever: Riker is granted full command. Technology is adapted to render it unpredictable, such as randomized phaser settings. Hanson's communications are cut, the war must be going badly. To avoid musical chairs, Borg ..."
}, {
  "imdbId" : "0092455",
  "season" : "4",
  "episodeNumber" : "2",
  "title" : "Family",
  "description" : "After defeating the Borg, the crew of the Enterprise experiences shore leave in various ways. Captain Picard's return to his family's vineyard in France has some extraordinary repercussions following his time spent as a member of the Borg collective."
}, {
  "imdbId" : "0092455",
  "season" : "4",
  "episodeNumber" : "3",
  "title" : "Brothers",
  "description" : "After an accident aboard the Enterprise leaves one of its children in grave danger, Data commandeers the Enterprise, driven to take him to an unknown origin, where an interesting figures awaits."
}, {
  "imdbId" : "0092455",
  "season" : "4",
  "episodeNumber" : "4",
  "title" : "Suddenly Human",
  "description" : "On a rescue mission to an alien shipwrecked training mission, they discover one of its trainees to be a human."
}, {
  "imdbId" : "0092455",
  "season" : "4",
  "episodeNumber" : "5",
  "title" : "Remember Me",
  "description" : "Dr. Crusher's fear of losing loved ones becomes real when her worries create an alternate reality."
}, {
  "imdbId" : "0092455",
  "season" : "4",
  "episodeNumber" : "6",
  "title" : "Legacy",
  "description" : "The crew of the Enterprise enters into orbit around the home planet of their former crew-mate, Tasha Yar, where they encounter her sister."
}, {
  "imdbId" : "0092455",
  "season" : "4",
  "episodeNumber" : "7",
  "title" : "Reunion",
  "description" : "When the head of the Klingon high council passes on, Picard finds himself in the middle of the struggle for the now-vacant position. Meanwhile, Worf re-unites with a past love, only to find he now has a son."
}, {
  "imdbId" : "0092455",
  "season" : "4",
  "episodeNumber" : "8",
  "title" : "Future Imperfect",
  "description" : "Riker has to quit his birthday party during a so far uneventful patrol voyage at the Neutral Zone to head an away team when a Romulan secret base is found on a planet which was believed uninhabited. He awakes 16 years later, as widowed captain of the Enterprise, just cured after 9 years of viral amnesia, with a son Jean-Luc. Even Picard, now an admiral who came to conduct with Riker, given his forgotten dealing with them, historical peace negotiations with the Romulans, loses all authority over him when he finally finds his late wife's image on the strangely ..."
}, {
  "imdbId" : "0092455",
  "season" : "4",
  "episodeNumber" : "9",
  "title" : "Final Mission",
  "description" : "Before leaving for Starfleet Academy, Wesley Crusher accompanies Captain Picard on a dangerous mission."
}, {
  "imdbId" : "0092455",
  "season" : "4",
  "episodeNumber" : "10",
  "title" : "The Loss",
  "description" : "As an unknown force drags the Enterprise, Deanna Troi struggles with the loss of her powers."
}, {
  "imdbId" : "0092455",
  "season" : "4",
  "episodeNumber" : "11",
  "title" : "Data's Day",
  "description" : "Data tries to comprehend the complex emotions between O'Brien and Keiko, who are about to be married."
}, {
  "imdbId" : "0092455",
  "season" : "4",
  "episodeNumber" : "12",
  "title" : "The Wounded",
  "description" : "After being fired upon by a Cardassian vessel, Picard races against time to find out the facts behind the Cardassian commander's claim that the Federation attacked one of their outposts."
}, {
  "imdbId" : "0092455",
  "season" : "4",
  "episodeNumber" : "13",
  "title" : "Devil's Due",
  "description" : "While answering a distress call, Picard finds himself not sure of exactly who he is dealing with, but he's sure he's NOT dealing with the planet's version of The Devil, as she claims to be."
}, {
  "imdbId" : "0092455",
  "season" : "4",
  "episodeNumber" : "14",
  "title" : "Clues",
  "description" : "Effects of passing through a wormhole give the Enterprise crew a sense that they were unconscious for more than the thirty seconds they've been led to believe."
}, {
  "imdbId" : "0092455",
  "season" : "4",
  "episodeNumber" : "15",
  "title" : "First Contact",
  "description" : "Commander William Riker has been on an acculturation mission under an alias for months on the Arkonian planet, surgically altered to appear like a local, but he gets badly wounded, beyond their medical skills because his internal organs are unknown to them. Captain Jean-Luc Picard decides to speed up his official diplomatic approach, formally the First Contact, and intercede on Riker's behalf, but they are told by a fascinated open-minded Atkonian scientist that her planet's culture is particularly xenophobic so they reject any alien being as being unequal to them. ..."
}, {
  "imdbId" : "0092455",
  "season" : "4",
  "episodeNumber" : "16",
  "title" : "Galaxy's Child",
  "description" : "While the Enterprise is in a star-base, Lt. Commander Geordi La Forge gets a very special visitor, brilliant engineering designer Dr. Leah Brahms, who he feels to know almost intimately as a 'hologram version' of herself with 'whom' he bonded. However the real Brahms proves icy and arrogantly unwilling to consider any of Gordi's empirical findings could conceivably stand against her theoretically impermeable truth. They take on the challenge to collaborate and learn to know each-other better, but when Gordi shows her his hologram version of her, Brahms feels almost ..."
}, {
  "imdbId" : "0092455",
  "season" : "4",
  "episodeNumber" : "17",
  "title" : "Night Terrors",
  "description" : "The Enterprise has finally tracked the missing starship USS Brittain. Counselor Deanna Troi senses trouble with the life on board and joins Riker's boarding party. The crew was slashed to death; the only survivor, Betazoid Counselor Andrus Hagan, is in shock. Doctor Beverly Crusher 's autopsy concludes 34 crewmen killed each other with phasers and other weapons, even bare hands; a tape recorded a paranoiac fear among them. While the Enterprise tows the Brittain to the nearest starbase, its own crewmen starts sensing another presence and experiencing rising fear, ..."
}, {
  "imdbId" : "0092455",
  "season" : "4",
  "episodeNumber" : "18",
  "title" : "Identity Crisis",
  "description" : "Lt. Commander Geordi La Forge and an old friend fight to defeat a parasite that is trying to transform them into another species."
}, {
  "imdbId" : "0092455",
  "season" : "4",
  "episodeNumber" : "19",
  "title" : "The Nth Degree",
  "description" : "When assigned to investigate an unknown probe, Lt. Barclay is electrocuted through a shuttlecraft's computer, where he receives an unexplainable boost of confidence and a vast increase in his knowledge."
}, {
  "imdbId" : "0092455",
  "season" : "4",
  "episodeNumber" : "20",
  "title" : "Qpid",
  "description" : "The Enterprise is at Tegus 3, to host the Federation archaeologists council's annual symposium, where Picard is to give the key-note lecture on its enigmatic ruins, now forbidden to outsiders. To his surprise he's visited by Vash, a flirtatious girl-friend, displeased to learn he never mentioned her to any crew-member, who is now on the council. Another visit gets the coldest welcome: almost almighty Q, who ridicules Picard's speech and decides to 'repay' saving his life and Continuum membership by transforming Picard and his accompanying crew-members during the ..."
}, {
  "imdbId" : "0092455",
  "season" : "4",
  "episodeNumber" : "21",
  "title" : "The Drumhead",
  "description" : "A retired admiral boards the Enterprise in an effort to determine the actions aboard the ship surrounding an act of sabotage and possible treason."
}, {
  "imdbId" : "0092455",
  "season" : "4",
  "episodeNumber" : "22",
  "title" : "Half a Life",
  "description" : "Counselor Troi's mother visits the Enterprise and becomes infatuated with a man whose culture forces him into a suicidal ritual called \"The Resolution.\""
}, {
  "imdbId" : "0092455",
  "season" : "4",
  "episodeNumber" : "23",
  "title" : "The Host",
  "description" : "Dr. Crusher falls for someone who's not at all what she expects him to be."
}, {
  "imdbId" : "0092455",
  "season" : "4",
  "episodeNumber" : "24",
  "title" : "The Mind's Eye",
  "description" : "Geordi is brainwashed by the Romulans to assassinate a Klingon ambassador."
}, {
  "imdbId" : "0092455",
  "season" : "4",
  "episodeNumber" : "25",
  "title" : "In Theory",
  "description" : "When a female crew member is infatuated with Lieutenant Commander Data, he decides to give a romantic relationship a try. Also, the Enterprise finds itself having to maneuver through a dangerous nebula."
}, {
  "imdbId" : "0092455",
  "season" : "4",
  "episodeNumber" : "26",
  "title" : "Redemption",
  "description" : "Both Capt. Picard and Lt. Worf must decide where their priorities lie as the Klingon Empire descends into civil war."
}, {
  "imdbId" : "0092455",
  "season" : "5",
  "episodeNumber" : "1",
  "title" : "Redemption II",
  "description" : "As Worf fights in the Klingon Civil War, Capt. Picard and his crew must stop the Romulans from helping their pawns win it."
}, {
  "imdbId" : "0092455",
  "season" : "5",
  "episodeNumber" : "2",
  "title" : "Darmok",
  "description" : "Picard must learn to communicate with a race that speaks in metaphor under a difficult set of circumstances."
}, {
  "imdbId" : "0092455",
  "season" : "5",
  "episodeNumber" : "3",
  "title" : "Ensign Ro",
  "description" : "Captain Picard foils a plot against the Bajorians with his new Bajorian officer, Ensign Ro."
}, {
  "imdbId" : "0092455",
  "season" : "5",
  "episodeNumber" : "4",
  "title" : "Silicon Avatar",
  "description" : "While Riker, Data, Crusher and various other crew enjoy a recreational day on an earth-like human colony, they are hit by an electrical storm but succeed in hiding safely in a cave they make collapse after Riker recognizes it's an attack of the feared crystalline entity. After their release, xenologist Dr. Kila Marr is brought in, who specializes in studying the creature which needs to destroy an entire community to feed on given its immense energy consumption. Picard forces her to take Data in the investigatory team, although she suspects he might be in league with ..."
}, {
  "imdbId" : "0092455",
  "season" : "5",
  "episodeNumber" : "5",
  "title" : "Disaster",
  "description" : "While the Enterprise enjoys a rest, just when elementary school science prize winners Patterson Supera, Jay Gordon Graas and Marissa Flores visit the ship, it's reduced to impulse power by hitting a quantum filament, so people are trapped in different compartments and face various damage there needing attention. Geordi and Dr. Crusher have to deal with a corrosion threat by damage to the ship's skin, which starts a very toxic chemical reaction on the hole; Data and Riker face an electric field blocking their way which Data passes at the price of decapitation, and must..."
}, {
  "imdbId" : "0092455",
  "season" : "5",
  "episodeNumber" : "6",
  "title" : "The Game",
  "description" : "Wesley Crusher returns to the Enterprise on vacation from the Academy only to discover a mysterious alien game infiltrating and controlling the crew."
}, {
  "imdbId" : "0092455",
  "season" : "5",
  "episodeNumber" : "7",
  "title" : "Unification I",
  "description" : "Picard and Data follow Spock into Romulan space on a dangerous mission."
}, {
  "imdbId" : "0092455",
  "season" : "5",
  "episodeNumber" : "8",
  "title" : "Unification II",
  "description" : "Picard is found on Romulus by senator Pardek, who brings him to ambassador Spock, who explains his secret 'cowboy diplomacy' is about the off chance of a Vulcan-Romulan reunification thanks to an old, recently significantly grown philosophically friendly Romulan underground party, which includes the rising new proconsul Neral, who claims the Romulan senate itself can no longer resist the people's outcry for peace, but is actually in league with Sela. Klingon captain K'Vada isn't amused when Data claims he may be able to crack the Romulan encryption log. Vulcan-human ..."
}, {
  "imdbId" : "0092455",
  "season" : "5",
  "episodeNumber" : "9",
  "title" : "A Matter of Time",
  "description" : "Reaching Panthera IV after an asteroid wreaks havoc of catastrophic proportions, the Enterprise crew deals with trying to save the planet as well as deal with someone who claims to be a historian from the future."
}, {
  "imdbId" : "0092455",
  "season" : "5",
  "episodeNumber" : "10",
  "title" : "New Ground",
  "description" : "Geordi can barely curtail his enthusiasm at being able to test out a new theory of transportation, as Worf's mother boards the Enterprise with his son and news that Worf's Earthly parents can no longer care for him."
}, {
  "imdbId" : "0092455",
  "season" : "5",
  "episodeNumber" : "11",
  "title" : "Hero Worship",
  "description" : "Data rescues a boy, and in a way to repress his own pain, the boy begins to mimic Data's \"personality\""
}, {
  "imdbId" : "0092455",
  "season" : "5",
  "episodeNumber" : "12",
  "title" : "Violations",
  "description" : "Transporting three Ullian mind-probing historians, the Enterprise crew is stymied when some of its members fall into a coma. Deanna Troi, the first crew member to come through it, cannot recall anything surrounding the incident."
}, {
  "imdbId" : "0092455",
  "season" : "5",
  "episodeNumber" : "13",
  "title" : "The Masterpiece Society",
  "description" : "The Enterprise is on a mission to warn the human colony of an artificial paradisiac biosphere on planet Moab 4's southern colony of the approach of a massive stellar fragment, which will impact with seismic force causing a tectonic disaster. However its competent, considerate leader Aaron Conor refuses to evacuate, confident their biosphere can withstand earthquakes. He does allow a small Enterprise party to visit their society, which they believe far superior after eight generations of selective breeding which nearly eliminated the remaining human risk factors. ..."
}, {
  "imdbId" : "0092455",
  "season" : "5",
  "episodeNumber" : "14",
  "title" : "Conundrum",
  "description" : "When an approaching alien ship wipes their memory, the crew struggles to put back together what happened."
}, {
  "imdbId" : "0092455",
  "season" : "5",
  "episodeNumber" : "15",
  "title" : "Power Play",
  "description" : "A long-lost ship is found on a planet where cosmic storms prevented detection for 200 years. When a surface landing goes wrong, the away team is beamed back...with a few extra surprises."
}, {
  "imdbId" : "0092455",
  "season" : "5",
  "episodeNumber" : "16",
  "title" : "Ethics",
  "description" : "After an accident that leaves him no longer able to walk, Worf asks Riker to help him commit suicide."
}, {
  "imdbId" : "0092455",
  "season" : "5",
  "episodeNumber" : "17",
  "title" : "The Outcast",
  "description" : "While aiding an androgynous race who lost a couple of members in an unmapped region of space, Riker falls for one of them, which can lead to trouble if detected, since the alien race does not endorse gender specificity."
}, {
  "imdbId" : "0092455",
  "season" : "5",
  "episodeNumber" : "18",
  "title" : "Cause and Effect",
  "description" : "The Enterprise gets caught in a time loop which always has one result: total destruction of the ship, itself."
}, {
  "imdbId" : "0092455",
  "season" : "5",
  "episodeNumber" : "19",
  "title" : "The First Duty",
  "description" : "Wesley Crusher's team has an accident at Starfleet Aacademy. Picard offers to help a Starfleet investigation as to what happened, and begins to suspect they are hiding something."
}, {
  "imdbId" : "0092455",
  "season" : "5",
  "episodeNumber" : "20",
  "title" : "Cost of Living",
  "description" : "Shortly after the Enterprise saves a planet from an asteroid impact by exploding it, the ship experiences strange break-downs which are ultimately attributed to an impossible to detect timely metal parasite, which will destroy it unless eliminated, so Data suggests luring it to an asteroid. Deanna Troi counsels Worf to deal with his son Alexander's authority problems by drawing up a two-ways contract on paternal and filial rights and obligations, but is still practically terrified to hear her overbearing and impulsive mother, ambassador Lwaxana, announces her own ..."
}, {
  "imdbId" : "0092455",
  "season" : "5",
  "episodeNumber" : "21",
  "title" : "The Perfect Mate",
  "description" : "On a diplomatic mission to bring Ambassador Briam and his Kryotion planet's gift to a reconciliation ceremony with its rival, even warring planet, ruled by rivaling brothers' dynasties, the Enterprise beams suspiciously cheerful Ferengi traders Par Lenor and Qol aboard just before a containment field collapse makes their ship explode. One of them brings the gift 'accidentally' out of cryostasis, to the crew's horror a live 'gift', 'metamore' (empath) Kamala, whose destiny is to vow her entire existence to a mate's happiness, but alas bestows her enchanting love not on..."
}, {
  "imdbId" : "0092455",
  "season" : "5",
  "episodeNumber" : "22",
  "title" : "Imaginary Friend",
  "description" : "Young Clara Sutter, like many girls her age, has an imaginary friend. She recently come on board with her father, an engineering officer, and hasn't yet made any real friends. Counselor Troi assures Clara's father that it's perfectly normal and he has nothing to worry about. While playing one day, Clara is shocked to see her friend Isabella suddenly appear before her. In fact, Isabella is a sentient being that has taken human form only to scout the ship and learn more about it. For Picard and the crew, determining the being's intent is key to determining the next step."
}, {
  "imdbId" : "0092455",
  "season" : "5",
  "episodeNumber" : "23",
  "title" : "I Borg",
  "description" : "The Enterprise finds a lone Borg drone, separated from the collective, and brings him aboard. The drone begins to reassert his individuality, but his presence causes differing levels of fear and sympathy from various crew members."
}, {
  "imdbId" : "0092455",
  "season" : "5",
  "episodeNumber" : "24",
  "title" : "The Next Phase",
  "description" : "A transporter malfunction, combined with a Romulan ship under stress and a damaged cloaking device, creates the illusion that Ensign Ro and Geordi are dead, but Geordi doesn't believe it to be so, and he acts accordingly."
}, {
  "imdbId" : "0092455",
  "season" : "5",
  "episodeNumber" : "25",
  "title" : "The Inner Light",
  "description" : "Picard awakes to find himself living in a small village where he is a well-known member of the community who is suffering from a delusion of being a starship captain."
}, {
  "imdbId" : "0092455",
  "season" : "5",
  "episodeNumber" : "26",
  "title" : "Time's Arrow: Part 1",
  "description" : "Captain Picard and his archaeological curiosity are called upon by scientists from Earth when they find evidence to support beliefs that aliens had visited Earth in the late 1800s."
}, {
  "imdbId" : "0092455",
  "season" : "6",
  "episodeNumber" : "1",
  "title" : "Time's Arrow: Part 2",
  "description" : "Captain Picard and crew follow Data back to the late 1800s to get him back, only to find the suspected alien visitors killing people of that time."
}, {
  "imdbId" : "0092455",
  "season" : "6",
  "episodeNumber" : "2",
  "title" : "Realm of Fear",
  "description" : "Overcoming his fear of transporter, Lt. Barclay joins an away team, only to find something in the beam with him."
}, {
  "imdbId" : "0092455",
  "season" : "6",
  "episodeNumber" : "3",
  "title" : "Man of the People",
  "description" : "When the Enterprise comes to the rescue of an ambassador and his \"mother\", Deanna finds herself attracted to him, and seeks to comfort him upon her death."
}, {
  "imdbId" : "0092455",
  "season" : "6",
  "episodeNumber" : "4",
  "title" : "Relics",
  "description" : "The Enterprise stumbles upon a Dyson sphere, with a ship crashed on the outer surface. An away team finds some systems still powered up and the chief engineer from the old Enterprise, Montgomery Scott, locked in the transporter cycle."
}, {
  "imdbId" : "0092455",
  "season" : "6",
  "episodeNumber" : "5",
  "title" : "Schisms",
  "description" : "Commander Riker's inability to fall asleep begins to show in other members of the crew in other forms, putting the Enterprise on the trail of a mystery."
}, {
  "imdbId" : "0092455",
  "season" : "6",
  "episodeNumber" : "6",
  "title" : "True Q",
  "description" : "When an honor student in the medical field is assigned to the Enterprise in an internship manner, she begins to demonstrate powers of the Q, prompting you-know-who to show up."
}, {
  "imdbId" : "0092455",
  "season" : "6",
  "episodeNumber" : "7",
  "title" : "Rascals",
  "description" : "Captain Picard, Ensign Ro, Keiko and Guinan are returning to the Enterprise aboard a shuttlecraft when they encounter a deadly energy field. They are all safely beamed aboard the ship but are transformed in the process - their minds are unchanged but their bodies have resorted to those of 12 year-olds. Dr. Crusher finds that their DNA has been slightly altered but may be able to returns them to their normal selves. Meanwhile, the Enterprise is on a mission to rescue a large Federation science team but come under attack by a group of rogue Ferengi."
}, {
  "imdbId" : "0092455",
  "season" : "6",
  "episodeNumber" : "8",
  "title" : "A Fistful of Datas",
  "description" : "While the crew is experiencing some much needed down time, Worf and his son go on an Old West excursion in the holodeck, where they meet several versions of Data serving as the bad guy after an experiment in Engineering goes wrong."
}, {
  "imdbId" : "0092455",
  "season" : "6",
  "episodeNumber" : "9",
  "title" : "The Quality of Life",
  "description" : "When Geordi is assigned to survey a new mining development with Dr. Farallon, who invented an experimental mining technology, she uses a new sophisticated robot called an Exocomp to repair a power grid."
}, {
  "imdbId" : "0092455",
  "season" : "6",
  "episodeNumber" : "10",
  "title" : "Chain of Command: Part 1",
  "description" : "Picard is replaced as captain of the Enterprise so he, Lt. Worf and Dr. Crusher go on a secret mission into Cardassian space. Meanwhile, his replacement, Capt. Jellico, meets his new command with some resistance from the crew."
}, {
  "imdbId" : "0092455",
  "season" : "6",
  "episodeNumber" : "11",
  "title" : "Chain of Command: Part 2",
  "description" : "While the humorless Capt. Jellico leads the effort to prevent a Cardassian invasion, the captured Picard is tortured by an interrogation expert in an attempt to break him."
}, {
  "imdbId" : "0092455",
  "season" : "6",
  "episodeNumber" : "12",
  "title" : "Ship in a Bottle",
  "description" : "Diagnosing anomalies in the recreative Sherlock Holmes hologram game programs, Lieutenant Reginald 'Reg' Barclay III discovers protected memory contains the arch-villain character professor James Moriarty, who has become self-conscious and demands fulfillment of a recent promise by the crew that they would think up a way for him to leave the holodeck . To Picard's astonishment, Moriarty proves empirically his will suffices to leave the Holodeck, he even retains a physical body. Picard grants him the benefit of the doubt despite his crimes in fiction, but refuses to ..."
}, {
  "imdbId" : "0092455",
  "season" : "6",
  "episodeNumber" : "13",
  "title" : "Aquiel",
  "description" : "Murderous intrigue abounds for the Enterprise when one of the crew aboard a subspace station is believed dead, and suspected to have taken part in it until the Klingons show up with the young lieutenant, to Geordi's taste."
}, {
  "imdbId" : "0092455",
  "season" : "6",
  "episodeNumber" : "14",
  "title" : "Face of the Enemy",
  "description" : "Deanna awakes to find herself altered to look like a Romulan, immediately unaware she's involved in a cat-and-mouse game as a member of their intelligence agency."
}, {
  "imdbId" : "0092455",
  "season" : "6",
  "episodeNumber" : "15",
  "title" : "Tapestry",
  "description" : "Captain Picard incurs serious wounds in a fight, even his artificial heart is gravely damaged. While Dr. Crusher wrestles with the medical consequences, his mind meets Q, who presents him to a parade of people who fell victim to Picard's actions and neglects, from his father and fellow cadets to himself, and offers him the possibility to have a 'second chance' without causing disaster by upsetting time. After Picard's initial refusal claim to have no regrets, Q forces him to acknowledge he made stupid mistakes and fix at least the adolescent one that got him stabbed ..."
}, {
  "imdbId" : "0092455",
  "season" : "6",
  "episodeNumber" : "16",
  "title" : "Birthright: Part 1",
  "description" : "While the Enterprise helps repair Cardassian damages to space station Deep Space Nine, Worf is offered coordinates by a Eurydian who claims his father didn't die in the battle of Kitomir decades ago but is still in a Romulan prison camp. Initially he refuses to consider his family could thus be dishonored for three generations, but changes his mind after talking to Troi and Data consulting him about the importance of one's father after a serious accidental plasma shock during an experiment with an alien device Geordi and the android helped brilliant station scientist ..."
}, {
  "imdbId" : "0092455",
  "season" : "6",
  "episodeNumber" : "17",
  "title" : "Birthright: Part 2",
  "description" : "Having discovered survivors from the Romulan attack on Kittomer (the famed attack that established peace between the Klingons and the Federation), Worf resists becoming one of them, even though he becomes a prisoner, himself. Instead, he begins to teach the younger Klingons about their ancestry and the proud tradition that exists among them, much to the chagrin of the Elders."
}, {
  "imdbId" : "0092455",
  "season" : "6",
  "episodeNumber" : "18",
  "title" : "Starship Mine",
  "description" : "When the Enterprise puts in to space dock for a energy sweep of the ship which is lethal to humans, Picard gets trapped on board with technicians who are not what they appear to be."
}, {
  "imdbId" : "0092455",
  "season" : "6",
  "episodeNumber" : "19",
  "title" : "Lessons",
  "description" : "Picard falls for the new head of the stellar science services department, but has feelings of misgivings when he's forced to assign her to a dangerous mission."
}, {
  "imdbId" : "0092455",
  "season" : "6",
  "episodeNumber" : "20",
  "title" : "The Chase",
  "description" : "The crew of the Enterprise must race against various rival powers to uncover an archaeological secret that explains the predominance of humanoid life forms in the galaxy."
}, {
  "imdbId" : "0092455",
  "season" : "6",
  "episodeNumber" : "21",
  "title" : "Frame of Mind",
  "description" : "Riker begins to question reality when he finds himself in an alien insane asylum and faces the prospect his life on the Enterprise has been a delusion."
}, {
  "imdbId" : "0092455",
  "season" : "6",
  "episodeNumber" : "22",
  "title" : "Suspicions",
  "description" : "Dr. Crusher puts her career on the line to prove a scientist's theoretical new shielding technology which may have cost him his life."
}, {
  "imdbId" : "0092455",
  "season" : "6",
  "episodeNumber" : "23",
  "title" : "Rightful Heir",
  "description" : "After being involved with dereliction of duty, Worf is placed on leave and given time to get his personal affairs in order. In the process of doing so, he summons forth Kahless, the ancient Klingon whom the legends claim will bring the Klingon empire together as one, even though the ancient leader splits the Empire into two."
}, {
  "imdbId" : "0092455",
  "season" : "6",
  "episodeNumber" : "24",
  "title" : "Second Chances",
  "description" : "A distortion field surrounds a planet, giving one chance every eight years to visit the surface. Riker once had a mission there and their equipment was deserted in an effort to flee from the planet before the distortion returned. Having returned to the planet, he runs into another version of himself...marooned there eight years previous."
}, {
  "imdbId" : "0092455",
  "season" : "6",
  "episodeNumber" : "25",
  "title" : "Timescape",
  "description" : "Picard, LaForge, Data and Troi return from a sadly boring scientific conference to the Enterprise. They experience weird instances where either one or several of them are perceived to seem frozen in time by the other(s), although both biometrics and technical shuttle diagnostics check out perfectly normal. It soon turns out there is a whole spray of tiny local occurrences of time-space-continuum distortions, most worrying in a pattern pointing at the Enterprise, which they find frozen as well as a Romulan war-bird, which seems to be frozen during an invasion, but once..."
}, {
  "imdbId" : "0092455",
  "season" : "6",
  "episodeNumber" : "26",
  "title" : "Descent: Part 1",
  "description" : "After an encounter with the Borg, Data feels his first emotion when he gets angry with the Borg. Data then tries to find ways to recreate the situation in order to feel emotions again, whilst the Enterprise investigates the Borg activity, and are bewildered as to why they feel emotions too."
}, {
  "imdbId" : "0092455",
  "season" : "7",
  "episodeNumber" : "1",
  "title" : "Descent: Part 2",
  "description" : "Picard, Geordi and Troi try to find a way to escape their cell after being imprisoned by Lore, whilst attempting to convince Data to do what is right as opposed to what his negative emotions (which Lore is feeding him) are compelling him to do. Meanwhile, Riker and Worf attempt to lead a rebellion against the self-aware Borg with help from an old friend..."
}, {
  "imdbId" : "0092455",
  "season" : "7",
  "episodeNumber" : "2",
  "title" : "Liaisons",
  "description" : "The Enterprise is on a diplomatic mission to open relations the the Ilarians. While two of their ambassador's have joined him on the ship, Captain Picard is to travel by shuttle craft their home world. Counselor Troi takes charge of Ambassador Loquel, who takes delight in the many pleasures, especially chocolate, which can be found on board the ship. Lt. Worf is assigned to Ambassador Byleth whose gruff and demanding behavior drives the Klingon to the edge of losing his temper. Picard doesn't quite make it to the Ilarian home world as the malfunctioning shuttle craft ..."
}, {
  "imdbId" : "0092455",
  "season" : "7",
  "episodeNumber" : "3",
  "title" : "Interface",
  "description" : "Geordi is distracted by the news of the possible loss of his mother while he uses a new remote probe technology to search for a downed spacecraft."
}, {
  "imdbId" : "0092455",
  "season" : "7",
  "episodeNumber" : "4",
  "title" : "Gambit: Part 1",
  "description" : "While investigating the apparent death of Capt. Picard, Riker is abducted by a group of intergalactic archaeological thieves, only to find Picard has apparently joined their ranks."
}, {
  "imdbId" : "0092455",
  "season" : "7",
  "episodeNumber" : "5",
  "title" : "Gambit: Part 2",
  "description" : "Riker and Picard must find out why this intergalactic gang is looting archaeological sites."
}, {
  "imdbId" : "0092455",
  "season" : "7",
  "episodeNumber" : "6",
  "title" : "Phantasms",
  "description" : "Data deals with his new ability to experience nightmares as the Enterprise deals with the installation of a new warp core that won't work as expected."
}, {
  "imdbId" : "0092455",
  "season" : "7",
  "episodeNumber" : "7",
  "title" : "Dark Page",
  "description" : "While establishing diplomatic relations with an alien race called the Cairn, Deanna's mother experiences a mental breakdown and falls into a coma, and it seems like Deanna is the only one who is able to help her, even if her mother doesn't want it."
}, {
  "imdbId" : "0092455",
  "season" : "7",
  "episodeNumber" : "8",
  "title" : "Attached",
  "description" : "Captain Picard & Dr. Crusher discover things about one another when they are captured by a opposing alien race, due to the fact that the Enterprise has come to allow the planet's other civilization the choice of being part of the Federation."
}, {
  "imdbId" : "0092455",
  "season" : "7",
  "episodeNumber" : "9",
  "title" : "Force of Nature",
  "description" : "While searching for a missing Federation medical transport, the Enterprise is accosted by two scientists from a nearby planet who claim that cumulative exposure to warp energy is weakening the fabric of space."
}, {
  "imdbId" : "0092455",
  "season" : "7",
  "episodeNumber" : "10",
  "title" : "Inheritance",
  "description" : "On Federation planet Atrea IV, Data encounters the former wife of his creator Noonian Soong who claims to be his \"mother\"."
}, {
  "imdbId" : "0092455",
  "season" : "7",
  "episodeNumber" : "11",
  "title" : "Parallels",
  "description" : "On his return from a bat'leth competition in the Klingon Empire, Worf finds himself shifting realities where events and details are in a constant state of flux and only he is aware of the changes."
}, {
  "imdbId" : "0092455",
  "season" : "7",
  "episodeNumber" : "12",
  "title" : "The Pegasus",
  "description" : "Riker finds out his former commander from the starship \"Pegasus\" has orders that entail more than what is revealed to Picard, who thinks the Enterprise is en route to recover the lost ship. And Riker is ordered to secrecy."
}, {
  "imdbId" : "0092455",
  "season" : "7",
  "episodeNumber" : "13",
  "title" : "Homeward",
  "description" : "In an effort to preserve a race of people on a planet being bombarded by storms that would kill them, Worf's foster brother violates the Prime Directive, leaving the Enterprise crew in a difficult position."
}, {
  "imdbId" : "0092455",
  "season" : "7",
  "episodeNumber" : "14",
  "title" : "Sub Rosa",
  "description" : "Dr. Crusher meets the man in her dead grandmother's life when she tries to put her affairs in order, whom one of the local people warn her to stay away from by not lighting a candle that has been lit for generations."
}, {
  "imdbId" : "0092455",
  "season" : "7",
  "episodeNumber" : "15",
  "title" : "Lower Decks",
  "description" : "A mission of the Enterprise as seen through some junior officers who are up for promotions, as questions of duty and honor arise among some of them, such as a Bajoran whom Worf has designated to be promoted to operations."
}, {
  "imdbId" : "0092455",
  "season" : "7",
  "episodeNumber" : "16",
  "title" : "Thine Own Self",
  "description" : "Data is sent to follow a probe that has drifted off course and crashed on a primitive planet, only to crash on the planet, himself, with no memory of any event prior to crashing on the planet's surface."
}, {
  "imdbId" : "0092455",
  "season" : "7",
  "episodeNumber" : "17",
  "title" : "Masks",
  "description" : "Investigating a rogue comet that's been traveling throughout the universe for over 87 million years, Picard discovers alien beings within the comet, which infest the computer systems on the Enterprise, as well as Data."
}, {
  "imdbId" : "0092455",
  "season" : "7",
  "episodeNumber" : "18",
  "title" : "Eye of the Beholder",
  "description" : "As a young lieutenant aboard the Enterprise commits suicide, his ship mates deal with the loss and Deanna deals with feelings surrounding her as she and Worf begin to form a relationship."
}, {
  "imdbId" : "0092455",
  "season" : "7",
  "episodeNumber" : "19",
  "title" : "Genesis",
  "description" : "When a new torpedo guidance system malfunctions, Picard and Data go chasing after it into an asteroid field, while the crew is left behind to deal with their own strange behaviors."
}, {
  "imdbId" : "0092455",
  "season" : "7",
  "episodeNumber" : "20",
  "title" : "Journey's End",
  "description" : "After the Federation grants access by the Cardassians to a planet already inhabited by Native American Indians, Picard has the daunting task of relocating them."
}, {
  "imdbId" : "0092455",
  "season" : "7",
  "episodeNumber" : "21",
  "title" : "Firstborn",
  "description" : "In an effort to help him accept his Klingon heritage, Worf and his son, Alexander, attend an ancient Klingon ceremony."
}, {
  "imdbId" : "0092455",
  "season" : "7",
  "episodeNumber" : "22",
  "title" : "Bloodlines",
  "description" : "Picard races the Ferengi in an effort to track down the son he never knew he had."
}, {
  "imdbId" : "0092455",
  "season" : "7",
  "episodeNumber" : "23",
  "title" : "Emergence",
  "description" : "Strange images begin appearing throughout the ship's decks and holodecks. Data and the rest of the crew begin to investigate only to discover that the ship's computer itself is exhibiting the strange behavior as it begins to become self-aware."
}, {
  "imdbId" : "0092455",
  "season" : "7",
  "episodeNumber" : "24",
  "title" : "Preemptive Strike",
  "description" : "Following her return from Advanced Tactical Training, Ro is sent to infiltrate the Maquis and finds herself torn between her loyalty to Picard and Starfleet and to her sympathy with the Maquis fighting \"the good fight\"."
}, {
  "imdbId" : "0092455",
  "season" : "7",
  "episodeNumber" : "25",
  "title" : "All Good Things...",
  "description" : "Capt. Picard finds himself shifting continually into the past, future and present and must use that to discover a threat to humanity's existence."
}]