[{
  "imdbId" : "0060009",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Pilot",
  "description" : "Dan Briggs apparently rejoins the Impossible Missions Force after some sort of sabbatical. His recorded instructions include the words, \"Welcome back, Dan. It's been some time.\" Briggs assembles a team that includes a master of disguise, a femme fatale, an electronics whiz, an incredibly strong man and a safecracker. Briggs will need all their skills to steal two atomic bombs from a hostile South American country."
}, {
  "imdbId" : "0060009",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Memory",
  "description" : "The IMF's target is Janos Karq, a top official of an unnamed Soviet Bloc country. Briggs enlists the help of Joseph Baresh, an alcoholic performer who has a photographic memory. Baresh will pose as an agent code-named Sparrow, who has never been apprehended by the authorities of Karq's country. (The real Sparrow has died, a fact not generally known.) The idea is that Baresh will be captured and provide information implicating Karq as a traitor. Barney, Cinnamon and Willy, along with Briggs, will engage in an unsuccessful (and fake) attempt to free Sparrow. That move ..."
}, {
  "imdbId" : "0060009",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Operation Rogosh",
  "description" : "Rogosh is an operative for a country hostile to the United States. When he strikes, he typically leaves dozens, if not hundreds, of bodies in his wake. Rogosh has been spotted in Los Angeles. But he will not crack under normal interrogation methods. Briggs comes up with an unusual plan. The IMF stages an accident where pedestrian Rogosh is struck by a car. When he awakes, he appears to be in a prison in his home country -- three years later."
}, {
  "imdbId" : "0060009",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Old Man Out: Part 1",
  "description" : "An elderly cardinal has been taken prisoner by an Eastern European country because the clergyman is a leader of the political opposition. He is being held in a prison where no escape has ever occurred. Briggs recruits an old flame who is also a trapeze artist. She accompanies Briggs and the IMF, who pose as a small circus. The \"circus\" has set up in a park that is next to the prison. Rollin, posing as a member of the circus, is arrested after stealing the wallet of an audience member. Rollin is taken to the prison and manages to smuggle in a lock-pick that enables him..."
}, {
  "imdbId" : "0060009",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Old Man Out: Part 2",
  "description" : "The IMF breaks off its attempt to free an elderly cardinal. Now, Briggs & Co. must regroup and Briggs must alter his plans. On top of that, a colonel in the unnamed Eastern European country is becoming suspicious of the IMF's \"circus.\" Briggs manages to use the man's suspicions to the IMF's advantage. Crystal, the trapeze artist recruited by Briggs, performs a dangerous diversion while Briggs and Rollin attempt to free the cardinal."
}, {
  "imdbId" : "0060009",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Odds on Evil",
  "description" : "A prince, the absolute ruler of a principality, has $1.5 million which he plans to use for arms to wage war on a neighboring, oil-rich country. Briggs devices a scheme that involves breaking the bank of the prince's casino. First, the IMF will utilize a computer to take $200,000 at roulette. That will provide the stake the IMF needs to take the prince at a high-stakes game of baccarat."
}, {
  "imdbId" : "0060009",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Wheels",
  "description" : "The IMF Team is tasked to \"unfix\" a crooked election by thwarting plans to use a crooked voting machine in a crucial voting district in a South American country. \"The Wheels\" are the tally counters in the voting machine"
}, {
  "imdbId" : "0060009",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "The Ransom",
  "description" : "Egan, a criminal, has kidnapped the daughter of a friend of Briggs. One of Egan's confederates will testify against him the next day before a grand jury. Egan's message to Briggs is clear: exchange the witness for his friend's daughter. At this point, Briggs's friend doesn't even know his daughter has been abducted. Briggs begins an emergency operation in which the IMF will snatch the witness out of a heavily guarded hotel room. But Briggs is determined that Egan won't get a chance to kill the witness."
}, {
  "imdbId" : "0060009",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "A Spool There Was",
  "description" : "Rollin Hand and Cinnamon Carter are sent on a mission to locate and retrieve a wire recording, which was hidden by an agent fleeing from guards in such a clever way that no one has been able to find it."
}, {
  "imdbId" : "0060009",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "The Carriers",
  "description" : "Two-hundred trainees are learning how to act like typical Americans in an enemy plot that involves bacterial warfare. Four IMF agents infiltrate this group and wind up in a recreation of a typical American town."
}, {
  "imdbId" : "0060009",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "Zubrovnik's Ghost",
  "description" : "Rollin Hand and Barney Collier are sent to investigate the case of a female scientist who believes her dead husband's ghost is giving her orders on how to complete her important work."
}, {
  "imdbId" : "0060009",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "Fakeout",
  "description" : "The IMF's target is Poltroni, an international drug dealer. Poltroni, alias Ted Carson, is in a country with no extradition treaty with the United States. Briggs devises a plan to lure Poltroni to a neighboring country where he can be arrested and sent to the U.S. To execute the scheme, Barney will have to fight for his life against one of Poltroni's thugs while Cinammon will be bait for Poltroni. Also, getting Poltroni to the border won't be easy. It's about 100 miles away."
}, {
  "imdbId" : "0060009",
  "season" : "1",
  "episodeNumber" : "13",
  "title" : "Elena",
  "description" : "Rollin Hand is sent to investigate the case of a beautiful Latin American spy who has suddenly started to act suspiciously. Is she still on the right side - and is she losing her sanity?"
}, {
  "imdbId" : "0060009",
  "season" : "1",
  "episodeNumber" : "14",
  "title" : "The Short Tail Spy",
  "description" : "Cinnamon does her job all too well when the latest mission requires her to feign love for a vain assassin. Meanwhile, Briggs and Barney work to get an over-the-hill terrorist out of the way."
}, {
  "imdbId" : "0060009",
  "season" : "1",
  "episodeNumber" : "15",
  "title" : "The Legacy",
  "description" : "The IMF must thwart four young Nazis from claiming Hitler's fortune, which they plan to use to finance a Fourth Reich."
}, {
  "imdbId" : "0060009",
  "season" : "1",
  "episodeNumber" : "16",
  "title" : "The Reluctant Dragon",
  "description" : "The IMF seeks to smuggle an important scientist, with the help of his wife, out from behind the Iron Curtain. They discover belatedly that he doesn't want to leave."
}, {
  "imdbId" : "0060009",
  "season" : "1",
  "episodeNumber" : "17",
  "title" : "The Frame",
  "description" : "The Impossible Missions Force mixes dinner and danger at a crime czar's private party. Jack Wellman has arranged the deaths of four Government officials so he can fill the vacancies with men he controls."
}, {
  "imdbId" : "0060009",
  "season" : "1",
  "episodeNumber" : "18",
  "title" : "The Trial",
  "description" : "Briggs poses as an American tourist and subjects himself to a show trial in order to discredit a public prosecutor attempting to seize absolute power in his country."
}, {
  "imdbId" : "0060009",
  "season" : "1",
  "episodeNumber" : "19",
  "title" : "The Diamond",
  "description" : "Briggs and company pretend to have found a means of synthesizing diamonds in order to con a dictator out of a priceless uncut diamond that will finance his government and secure his power."
}, {
  "imdbId" : "0060009",
  "season" : "1",
  "episodeNumber" : "20",
  "title" : "The Legend",
  "description" : "The IMF team infiltrates a top-secret meeting of Nazis in South America and is shocked to learn that their leader is the legendary war criminal Martin Bormann."
}, {
  "imdbId" : "0060009",
  "season" : "1",
  "episodeNumber" : "21",
  "title" : "Snowball in Hell",
  "description" : "Barney faces the cat o' nine tails and a cruel ex-guard at a former penal colony as the other IMF members work to trick the sadist out of a cheap substance that can be used for nuclear weapons."
}, {
  "imdbId" : "0060009",
  "season" : "1",
  "episodeNumber" : "22",
  "title" : "The Confession",
  "description" : "A Communist Bloc operative has been arrested for the assassination of U.S. Senator William Townsend. Briggs & Co.'s mission is to prove the operative did NOT kill the senator on behalf of his government. The prime suspect is businessman R.J. McMillian, Townsend's primary backer. The Secretary believes McMillian killed Townsend to create a martyr and to create momentum for a preemptive war with the Soviet Bloc. Briggs concocts an elaborate scheme which calls for Rollin to play the role of a con who springs the operative from jail, Cinammon to pretend to be a journalist..."
}, {
  "imdbId" : "0060009",
  "season" : "1",
  "episodeNumber" : "23",
  "title" : "Action!",
  "description" : "Miklos Klaar runs a movie studio in the Communist Bloc. He is preparing a film, combining documentary footage with scenes he has shot on a sound stage, to make it appear U.S. troops have committed an atrocity. The Impossible Missions Force -- minus Dan Briggs, who is absent this episode -- runs a typically complicated operation. First, the IMF will ruin Klaar's existing film and negative, forcing him to do a re-shoot. Next, the IMF's plan calls for publicly ruining Klaar just as he's at his moment of triumph."
}, {
  "imdbId" : "0060009",
  "season" : "1",
  "episodeNumber" : "24",
  "title" : "The Train",
  "description" : "The dying leader of a European nation has a protégé ready to assume power. What the leader doesn't know is his protégé has plans to crack down on liberty and execute his enemies. Briggs, in addition to his normal IMF operatives, enlists the help of a physician and an Academy Award-winning art director, as part of his plan. Eventually, the IMF runs an elaborate con, including a phony train ride, aimed at causing the protégé to show his true intentions."
}, {
  "imdbId" : "0060009",
  "season" : "1",
  "episodeNumber" : "25",
  "title" : "Shock",
  "description" : "Wilson, a U.S. ambassador stationed in a neutral country, has been abducted by an intelligence operative of an Eastern Bloc nation. An impostor has been put in Wilson's place. Briggs & Co. have a short amount of time to get Wilson back and foil whatever plot is underway. The IMF, in turn, abducts the impostor. A disguised Briggs takes his place. The impostor, Josef Gord, awakens to find himself in an IMF-manufactured mental hospital. The question is whether the IMF can break him in time to save Wilson."
}, {
  "imdbId" : "0060009",
  "season" : "1",
  "episodeNumber" : "26",
  "title" : "A Cube of Sugar",
  "description" : "A U.S. intelligence operative, posing as a jazz musician, has been captured behind the Iron Curtain. In his possession is a new micro circuit hidden in one of several sugar cubes soaked in psychedelic drugs. Briggs devises a plan where Rollin will be arrested and put in the same prison. To execute the plan, Rollin will need to shed a strait jacket and inject the arrested intelligence agent with a drug making it appear he has died. Barney, Willy and Cinammon will also play key roles in the IMF leader's plan."
}, {
  "imdbId" : "0060009",
  "season" : "1",
  "episodeNumber" : "27",
  "title" : "The Traitor",
  "description" : "A U.S. intelligence operative has defected to an Eastern Bloc country and is currently housed at that nation's embassy in Washington. Briggs devises a plan in which a contortionist is needed to navigate through the ventilation system of the embassy and break into a top-security portion of the facility. What's more, Rollin will pose as an official of the nation while Barney, Willy and Cinnamon also play key roles."
}, {
  "imdbId" : "0060009",
  "season" : "1",
  "episodeNumber" : "28",
  "title" : "The Psychic",
  "description" : "Cinnamon poses as a psychic as part of a typically complicated plan devised by Briggs. The IMF's target is a U.S. businessman who has fled to South America, where he can't be touched legally. He has taken control of a company that holds patents vital to U.S. security interests. The businessman intends to sell the patents to an intelligence operative of an Eastern Bloc nation. The IMF intends to get control of the company back from the businessman. The plan calls for Rollin to impersonate a gangster, Barney to use slight of hand and the help of a respected judge."
}, {
  "imdbId" : "0060009",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "The Widow",
  "description" : "Jim Phelps is the new leader of the Impossible Missions Force, with no explanation, or even reference made, about the departure of predecessor Dan Briggs. First up for Phelps is a mission involving the drug trade. Cresnik and Walters have cornered the heroin market and sell it at a handsome profit to gangs around the world. Phelps devises an operation which will drive a wedge between the heroin dealers and their customers."
}, {
  "imdbId" : "0060009",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "Trek",
  "description" : "Jack Cole was arrested and imprisoned for stealing art treasures of a Latin nation. The mission for Phelps and his crew is to get the precious objects back. But that won't be easy. Cole is being tortured by the colonel who heads the prison -- and the colonel is a traitor who wants the treasure for himself. The IMF plans calls for playing the two men, each deadly, off each other. A further complication occurs as Cole begins to go blind after being forced to stare at the sun as part of being tortured."
}, {
  "imdbId" : "0060009",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "The Survivors",
  "description" : "An enemy agent has kidnapped two scientists and their wives and is holding them in San Francisco. He wants a third scientist, who can help develop an \"ultimate weapon.\" Phelps devises a plan where he'll pose as the scientist being sought and the rest of the IMF fakes an earthquake."
}, {
  "imdbId" : "0060009",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "The Bank",
  "description" : "Belzig, head of a bank in East Berlin, tricks unwary people anxious to escape to the West that he will help them. Instead, he steals their money and kills them. He is amassing a fortune to launch a new Nazi movement. The mission for Phelps and the IMF is to put him out of business. Belzig keeps the stolen money in the high-security vault of his own bank. The vault also has a passageway. Belzig tells his victims to stay to the left and they'll find freedom. Instead they end up falling to their deaths. Phelps devises a plan where that passageway will be Belzig's undoing."
}, {
  "imdbId" : "0060009",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "The Slave: Part 1",
  "description" : "The Impossible Missions Force takes on the absolute ruler of a Middle East nation who is running a secret slave market. Barney poses as a slave, part of an effort to construct a replica of the slave cells, before escaping. Phelps poses as a slave trader and Rollin as an Interpol investigator. Finally, Cinnamon will be the bait for the trap. The ruler of the country has a brother who married a British wife, Amara. The brother, if he assumed power, would abolish slavery in the country -- but he has accepted assurances that slavery doesn't exist there. As part of the ..."
}, {
  "imdbId" : "0060009",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "The Slave: Part 2",
  "description" : "Phelps & Co. continue their plan to smash the renegade slavery operation of the absolute ruler of a Middle Eastern nation. Phelps, posing as a slave trader, works his way into the confidence of the ruler. In that role, Phelps \"sells\" Cinnamon into slavery. Meanwhile, the rest of the IMF team is preparing to pull a switch that will force the ruler's brother to confront the situation and force the end of slavery in his nation."
}, {
  "imdbId" : "0060009",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "Operation 'Heart'",
  "description" : "Cinnamon poses as the wife of an archaeologist with a serious heart condition. He needs to be rescued, and an assassination plot needs to be foiled."
}, {
  "imdbId" : "0060009",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "The Money Machine",
  "description" : "The IMF's target is DuBruis, a corrupt financial speculator in an African nation. Phelps & Co. get DuBruis's attention with counterfeit money, virtually the same as the nation's currency except for the quality of the paper. The elaborate game plan calls for Cinnamon to tempt DuBruis with supposed insider information about a mining company and Phelps and Rollin posing as criminals who've developed computerized counterfeiting. Barney is also on hand to make the \"computer\" work."
}, {
  "imdbId" : "0060009",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "The Seal",
  "description" : "Taggert, a U.S. industrialist, has acquired a jade figure, which has great religious significance to Kuala Rokat. That nation is a small but strategically located nation which borders China. Taggert's acquisition threatens to undo years of sensitive U.S. diplomacy but there is no legal way to force him to give the figure back. Phelps devises a plan which, among other things, calls for causing havoc with Taggert's mainframe computer, Rollin impersonating an academic from Kuala Rokat and using a highly trained cat in getting the jade away from Taggert."
}, {
  "imdbId" : "0060009",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "Charity",
  "description" : "The Hagars (Fritz Weaver and Hazel Court), a married couple, collect money for charity, but keep it for themselves in the form of platinum bars they keep hidden under their pool table. Phelps and his \"Impossible Mission Force\" must retrieve the platinum and put an end to the Hagars' scam once and for all."
}, {
  "imdbId" : "0060009",
  "season" : "2",
  "episodeNumber" : "11",
  "title" : "The Council: Part 1",
  "description" : "A top mob leader, Frank Wayne, is endangering the U.S. economy. Phelps's plan attacks Wayne on various fronts. First the IMF watches as Jimmy Bibo, one of Wayne's associates is forced to dig his own grave. The IMF has a doctor ready to revive Bibo -- if Wayne's killer leaves the scene in time. Second, Phelps has a cover as an ambitious prosecutor on Wayne's trail. Finally, Rollin is ready to take Wayne's place. But once Rollin has made the switch, other mob bosses want \"Wayne\" to leave the country -- which will ruin the complicated plan."
}, {
  "imdbId" : "0060009",
  "season" : "2",
  "episodeNumber" : "12",
  "title" : "The Council: Part 2",
  "description" : "IMF agent Rollin Hand, impersonating mobster Frank Wayne, has a counter-proposal for the other mob bosses. He says he'll undergo plastic surgery to look like a different man. In comes Cinnamon. In reality, she is undoing Rollin's makeup; she can afford no mistakes because the other mob bosses are watching the entire time. Meanwhile, a doctor working for the IMF is performing plastic surgery on the real Wayne -- making him to look like Rollin. All of this is part of Phelps's plan aimed at getting access to Wayne's records. But Phelps himself will face an attempted hit ..."
}, {
  "imdbId" : "0060009",
  "season" : "2",
  "episodeNumber" : "13",
  "title" : "The Astrologer",
  "description" : "An opposition leader of an Eastern Bloc nation has been captured by the chief of the country's secret police. Also seized was microfilm with a list of people who secretly support the opposition. Phelps develops a plan that plays upon the astrology obsession the nation's leader has. Cinnamon poses as a famous astrologer while Barney and Rollin will have to operate from the cargo compartment of a plane transporting the captured opposition leader."
}, {
  "imdbId" : "0060009",
  "season" : "2",
  "episodeNumber" : "14",
  "title" : "Echo of Yesterday",
  "description" : "Cinnamon works to stop a munitions magnate who is supplying arms to neo-nazis. She reawakens memories of his late wife, who was murdered by Hitler."
}, {
  "imdbId" : "0060009",
  "season" : "2",
  "episodeNumber" : "15",
  "title" : "The Photographer",
  "description" : "The team's latest mission has them trying to root out a network of spies, who were brought in by an American photographer. The problem is the code that he and his handlers communicate with is unbreakable. So they devise a plan to get him to reveal the method of decoding his communications. And their plan has him asking for Cinnamon to pose for him. During their photo shoot she displays knowledge of bio chemistry which the photographer decides to exploit."
}, {
  "imdbId" : "0060009",
  "season" : "2",
  "episodeNumber" : "16",
  "title" : "The Spy",
  "description" : "The exact rendering of a map is duplicated in order to fool a female spy. It's the second part of an overlay that details NATO's missile defense system."
}, {
  "imdbId" : "0060009",
  "season" : "2",
  "episodeNumber" : "17",
  "title" : "A Game of Chess",
  "description" : "The IMF's target is an international chess grandmaster who also is planning to steal gold seized from the opposition movement of an unnamed Soviet Bloc country. Rollin poses as an amateur chess player, helped by a computer Barney is running that is unbeatable at chess. The plan, devised by Phelps, also calls for a devious way of snatching the gold from both the chess player and the authorities."
}, {
  "imdbId" : "0060009",
  "season" : "2",
  "episodeNumber" : "18",
  "title" : "The Emerald",
  "description" : "An emerald, with vital U.S. security information attached and hidden on it, has fallen into the hands of an arms dealer. What's more, a Soviet Bloc agent is determined to secure the emerald. Both will be on a cruise ship. Phelps and the IMF must both get the emerald and neutralize the opposition agent. Phelps' plan involves a high stakes poker game utilizing Barney's technology and Rollin's sleight of hand. But that's only the beginning."
}, {
  "imdbId" : "0060009",
  "season" : "2",
  "episodeNumber" : "19",
  "title" : "The Condemned",
  "description" : "A childhood friend of Phelps' is on death row in a Latin American country. He asks the \"Impossible Mission Force\" to help him spring him. Even though this is a personal mission, the \"Force\" agrees."
}, {
  "imdbId" : "0060009",
  "season" : "2",
  "episodeNumber" : "20",
  "title" : "The Counterfeiter",
  "description" : "Halder, who runs respectable medical clinics, is really a counterfeiter of drugs responsible for many deaths. The Impossible Missions Force aims to prove Halder's involvement in the production of the counterfeit drugs. As part of the plan, Phelps will pose as a federal drug enforcement agent who's willing to go on the take."
}, {
  "imdbId" : "0060009",
  "season" : "2",
  "episodeNumber" : "21",
  "title" : "The Town",
  "description" : "Jim Phelps is kidnapped by townspeople after learning they are part of an assassination network. The clock is ticking as a pair of assassins are en route to a perform a hit. The 'Force' must find and save Jim, then try to stop the impending assassination."
}, {
  "imdbId" : "0060009",
  "season" : "2",
  "episodeNumber" : "22",
  "title" : "The Killing",
  "description" : "Bert Gordon has created a criminal organization that will get rid of anyone, anywhere -- no bodies are ever found. Gordon is untouchable through conventional means of investigation and prosecution. Phelps devises a plan that takes advantage of Gordon's superstitions. Phelps and Cinnamon pose as a bickering couple, where the wife is eager to employ Gordon's services. The IMF will also make it appear that the dead are trying to reach people in the world of the living. The goal is to manipulate Gordon into a fix where even he cannot escape from the law."
}, {
  "imdbId" : "0060009",
  "season" : "2",
  "episodeNumber" : "23",
  "title" : "The Phoenix",
  "description" : "When the curator of a museum plans to turn an experimental alloy over to a foreign power, the IMF creates a diversion - an attempt on his life."
}, {
  "imdbId" : "0060009",
  "season" : "2",
  "episodeNumber" : "24",
  "title" : "Trial by Fury",
  "description" : "The IMF goes to a prison camp inside a totalitarian Latin American country. At the camp, an opposition leader is kept in isolation. One of his followers arranged to be arrested and has become a trustee, helping to get the opposition leader's messages out to his countrymen. Prisoners believe the trustee to be an informer. Phelps and Barney arrive as prisoners, aiming to expose the real informer. They're aided by Cinnamon (posing as a Red Cross official) and Rollin (as a guard). The question is whether Phelps can work fast enough to save an innocent man's life."
}, {
  "imdbId" : "0060009",
  "season" : "2",
  "episodeNumber" : "25",
  "title" : "Recovery",
  "description" : "A U.S. bomber crashes behind the Iron Curtain. Its Fail-Safe device, however, failed to self destruct. A brilliant U.S. scientist who defected to the unnamed country is supervising efforts to take the device apart, which will yield valuable information about the entire U.S. defense system. The IMF must recover the Fail-Safe device and abduct the scientist. As part of the plan devised by Phelps, Rollin and Cinnamon will pose as U.S. scientists on a tour."
}, {
  "imdbId" : "0060009",
  "season" : "3",
  "episodeNumber" : "1",
  "title" : "The Heir Apparent",
  "description" : "Cinnamon plays a long lost princess to prevent a regent from taking over in 'a small Baltic monarchy.' Of course, IMF's mission is to prevent a dictator from taking over a 'free' monarchy!"
}, {
  "imdbId" : "0060009",
  "season" : "3",
  "episodeNumber" : "2",
  "title" : "The Contender: Part 1",
  "description" : "Phelps & Co. go after a crooked fight promoter who has gained a stranglehold over boxing and wants to extend the Syndicate's influence into other sports worldwide. The promoter is ruthless, as demonstrated when he orders a boxer killed because he would not take a dive. The IMF recruits a former fighter whose hands were ruined for boxing because of his military service. Barney trains as a boxer, assuming the former fighter's identity. Barney attracts the interest of the crooked promoter and is scheduled to box in a demonstration fight. Phelps, who is installing \"..."
}, {
  "imdbId" : "0060009",
  "season" : "3",
  "episodeNumber" : "3",
  "title" : "The Contender: Part 2",
  "description" : "Phelps narrowly avoids discovery by hoods (thanks to Rollin) and is able to complete installing special devices that will enable Barney to win his demonstration fight. Barney now becomes a contender for the title. Phelps & Co. also work to create doubt among the Syndicate backers of the crooked fight promoter being targeted by the IMF. But the job won't be easy. Before the mission is completed, Rollin's life will be endangered and Barney will be involved in a savage boxing match."
}, {
  "imdbId" : "0060009",
  "season" : "3",
  "episodeNumber" : "4",
  "title" : "The Mercenaries",
  "description" : "A mercenary army in Central Africa led by Krim is destabilizing the region, and stockpiling stolen gold. Phelps and the IMF capitalize on Krim's greed, and manipulate him into arranging the theft of his own gold bullion stored in a seemingly impenetrable vault."
}, {
  "imdbId" : "0060009",
  "season" : "3",
  "episodeNumber" : "5",
  "title" : "The Execution",
  "description" : "A local mobster has taken over control of the food distribution throughout the U.S. In order to nail him, the IMF must get to his contract killer. So, an elaborate scheme is put into place where a prison is set up in a warehouse, and the killer is made to believe that he is going to be executed within the next 2 hours unless he turns informant on his boss."
}, {
  "imdbId" : "0060009",
  "season" : "3",
  "episodeNumber" : "6",
  "title" : "The Cardinal",
  "description" : "Behind the Iron Curtain, an ambitious general has imprisoned a Cardinal who is his nation's spiritual leader. The general has replaced the Cardinal with a double. All the monks and nuns at a monastery where the Cardinal is staying are really troopers commanded by the general. The plot calls for the double to make a televised speech endorsing a takeover by the general. Phelps & Co. must rescue the Cardinal. The IMF's plan includes Rollin impersonating another Cardinal and Phelps pretending to be a doctor."
}, {
  "imdbId" : "0060009",
  "season" : "3",
  "episodeNumber" : "7",
  "title" : "The Elixir",
  "description" : "Riva Santel is the center of a national personality cult. She plans to suspend the upcoming elections and rule as a dictator. Craving eternal beauty even more than power, the IMF lead Santel to believe that Cinnamon is actually a woman in her late 60s. While Santel is preoccupied with the IMF rejuvenation procedure, Barney and Willy edit her national speech into a farewell address. In the end, an extremely youthful looking Riva Santel is kicked out of her own home by security personnel who don't recognize her."
}, {
  "imdbId" : "0060009",
  "season" : "3",
  "episodeNumber" : "8",
  "title" : "The Diplomat",
  "description" : "Information vital to the defense of the U.S. has fallen into the hands of an enemy power. With no hope of retrieving it, the IMF stages an elaborate plot to try to make the foreign country's diplomats believe that the information is true -- hoping that if they discover that the U.S. is behind this plan, this knowledge will ironically cause them to disbelieve the information."
}, {
  "imdbId" : "0060009",
  "season" : "3",
  "episodeNumber" : "9",
  "title" : "The Play",
  "description" : "Milos Kuro, the Minister of Culture of the UCR, a country behind the Iron Curtain, bombards his country with anti-American propaganda, hoping to undermine the pro-Western Premier Leon Vados. The IMF tries to discredit Kuro by enticing him with an anti-American play that they hope he will stage in his home country -- then using some classic IMF techniques to make a few carefully calculated changes to the text of the play."
}, {
  "imdbId" : "0060009",
  "season" : "3",
  "episodeNumber" : "10",
  "title" : "The Bargain",
  "description" : "A former dictator, now in exile in Miami, plans to make a deal with the Syndicate -- they will finance the coup that will return him to rule his homeland in exchange for his promise to legalize gambling in the country once he regains power. The IMF agents use the dictator's fondness for gourmet food to gain entry to his house in order to make sure that the bargain never takes place."
}, {
  "imdbId" : "0060009",
  "season" : "3",
  "episodeNumber" : "11",
  "title" : "The Freeze",
  "description" : "Raymond Barret was the mastermind behind the robbery of an armored truck several years ago. He has changed his identity and is now serving a lesser charge in a federal prison waiting out the statute of limitations. When he's released he'll be able to recover the stolen cash. The IMF convinces Barret that he's suffering from a terminal illness. In desperation he turns to a doctor of cryogenics (Phelps) and blackmails him into freezing him until a cure can be found. Barret wakes up in \"the future\" but quickly discovers the ruse. Even though everything seems to have gone..."
}, {
  "imdbId" : "0060009",
  "season" : "3",
  "episodeNumber" : "12",
  "title" : "The Exchange",
  "description" : "The episode opens with a mission already underway in a foreign country. But an unforeseeable accident causes Cinnamon Carter to be captured by the foreign government just as she completes the original mission successfully. With time running out as she's being interrogated by her captors, the rest of the IMF hatches a desperate plan to regain her freedom: break the other country's top spy out of prison in the West, try to trick him out of the information he's holding, and then offer to exchange him for Cinnamon."
}, {
  "imdbId" : "0060009",
  "season" : "3",
  "episodeNumber" : "13",
  "title" : "The Mind of Stefan Miklos",
  "description" : "Walter Townsend, an enemy agent working in the U.S., has been allowed to obtain false information that, if believed by his home country, will cause its leaders grave embarrassment (and discredit Townsend). But another spy from Townsend's home country also working in the U.S., George Simpson, tells his superiors that the information supplied to Townsend is false. Because Simpson and Townsend are known to be rivals, their home country sends its most brilliant agent, Stefan Miklos, to determine the truth or falsity of the information Townsend supplied. The IMF's job is ..."
}, {
  "imdbId" : "0060009",
  "season" : "3",
  "episodeNumber" : "14",
  "title" : "The Test Case",
  "description" : "Rollin takes the place of a human test subject for a type of meningitis being developed into a weapon. Cinnamon approaches Dr. Beck, the mercenary scientist in charge of the project, with a better offer if he'll work for her. Meanwhile, Phelps and Barney work to convince Beck's government monitor (Captain Onli) that the scientist has already accepted the counteroffer and has decided to kill him and a military representative with his bio-weapon."
}, {
  "imdbId" : "0060009",
  "season" : "3",
  "episodeNumber" : "15",
  "title" : "The System",
  "description" : "The key witness in the trial against mob boss Constantine Victor, aka \"Mr. V,\" has been killed. Only Victor's close friend, casino manager Johnny Costa knows enough to send Victor to prison for life. The IMF have 24 hours to convince Costa that he's the next name on Mr. V's hit list."
}, {
  "imdbId" : "0060009",
  "season" : "3",
  "episodeNumber" : "16",
  "title" : "The Glass Cage",
  "description" : "The IMF infiltrate a high tech maximum security prison behind the Iron Curtain to free a resistance leader being held in a glass cell that's continually monitored. Cinnamon's persona of a neurotic bureaucrat distracts the prison commandant, while Barney and Willy stage an abortive prison escape. It's all part of an elaborate scheme to convince prison officials that the freedom fighter in their cell is an imposter."
}, {
  "imdbId" : "0060009",
  "season" : "3",
  "episodeNumber" : "17",
  "title" : "Doomsday",
  "description" : "Industrialist Carl Vandaam claims to have a hydrogen bomb for sale. He invites representatives from a variety of countries and factions to participate in an auction for the device at his company's headquarters. As the bargaining goes on, Barney performs one of his tunnel-crawling assignments, climbing up and down an elevator shaft and then through some lateral access-points to get access to the room where the bomb is housed -- hoping to substitute a dummy unit for a critical part of the bomb's hardware before the sale to an enemy power is completed."
}, {
  "imdbId" : "0060009",
  "season" : "3",
  "episodeNumber" : "18",
  "title" : "Live Bait",
  "description" : "The IMF manipulates a naive intelligence officer in order to free an agent who can expose a deep-cover mole. In addition to rescuing the agent, they create an elaborate ruse to neutralize the Machiavellian security chief who is on the verge of discovering the mole's identity."
}, {
  "imdbId" : "0060009",
  "season" : "3",
  "episodeNumber" : "19",
  "title" : "The Bunker: Part 1",
  "description" : "In the first of two parts, Dr. Erich Rojak, a brilliant scientist, is being held in an underground bunker containing a laboratory where he is forced to work on a small but extremely powerful long-range missile. If he succeeds, the missile has the potential to change the balance of power between the East and the West. Rojak is cooperating only because his totalitarian government is holding his wife, Anna, and threatens to kill her unless he completes the missile. The IMF's assignment is to rescue Rojak and his wife and to destroy his missile research. But another ..."
}, {
  "imdbId" : "0060009",
  "season" : "3",
  "episodeNumber" : "20",
  "title" : "The Bunker: Part 2",
  "description" : "In the conclusion of the two-part episode, Jim Phelps has taken a position as a security officer at the underground bunker where Dr. Erich Rojak is working on a long-range missile that may change the balance of world power. Unbeknown to the IMF, however, Alexander Ventlos, a professional killer sent by another unfriendly government to kill Dr. Rojak, has already used his disguise talents to infiltrate the bunker. In the meantime, hoping to free Rojak's wife Anna, the IMF has managed to plant Cinnamon Carter in a holding cell near Anna, while Phelps uses a miniature ..."
}, {
  "imdbId" : "0060009",
  "season" : "3",
  "episodeNumber" : "21",
  "title" : "Nitro",
  "description" : "General Zek, a military officer of a Middle Eastern kingdom, bitterly opposes the peace treaty signed by the progressive young king of his nation and a neighboring republic. Zek conspires with a munitions maker to use nitroglycerin to blow up the kingdom's Government House, thereby eliminating the peace-minded king and also provoking war with the republic. The IMF's mission: prevent this terrorist plot, and do so in a way that will ensure General Zek never again threatens the peace."
}, {
  "imdbId" : "0060009",
  "season" : "3",
  "episodeNumber" : "22",
  "title" : "Nicole",
  "description" : "Anton Valdas, the highest ranking intelligence agent for an enemy power, is believed to possess a master list of Western agents who have defected to his government. Jim Phelps and Rollin Hand take on the mission of retrieving the list. While doing so, however, Phelps is shot and Rollin forced to flee without Phelps. Phelps' recovery and his plans to escape receive an unexpected boost from Nicole Vedette, another enemy agent who risks her own safety to help him escape -- and with whom Phelps uncharacteristically begins to fall in love."
}, {
  "imdbId" : "0060009",
  "season" : "3",
  "episodeNumber" : "23",
  "title" : "The Vault",
  "description" : "When a benevolent President plans to use the 40 million he has saved to help his country, he entrusts the money to the country's finance minister who is his confidante. But what the President doesn't know is that the minister kept the money for himself and is planning to use its disappearance as a means to have the President removed from office. So IMF must stop the minister but it won't be easy cause the President trusts the man so much that merely telling him what the minister is planning won't be enough. So they try to get the man to implicate himself."
}, {
  "imdbId" : "0060009",
  "season" : "3",
  "episodeNumber" : "24",
  "title" : "Illusion",
  "description" : "Cinnamon goes undercover as a sexy nightclub entertainer to expose a homicidal bureaucrat, and eliminate his ruthless rival."
}, {
  "imdbId" : "0060009",
  "season" : "3",
  "episodeNumber" : "25",
  "title" : "The Interrogator",
  "description" : "Only Norvan Kruger knows the location of a submarine that will launch nuclear missiles against the United States. To complicate matters Kruger has been captured by a third party also hostile to the United States. After spiriting Kruger from his captors, and injecting him with a drug that causes temporary retrograde amnesia, The IMF make Kruger Rollin's interrogator. Kruger's assignment: force Rollin to reveal the location of a submarine that will launch nuclear missiles against the United States."
}, {
  "imdbId" : "0060009",
  "season" : "4",
  "episodeNumber" : "1",
  "title" : "The Code",
  "description" : "Paris poses as a legendary and colorful revolutionary leader to get close to two conspirators planning an invasion and takeover of the democratic nation of San Cristobal and turn them against each other. Meanwhile, the rest of the IMF team hurries to obtain the invasion plans, decode them and relay the plans to the San Cristobal defense forces before the invasion begins."
}, {
  "imdbId" : "0060009",
  "season" : "4",
  "episodeNumber" : "2",
  "title" : "The Numbers Game",
  "description" : "The IMF stages World War III complete with a nuclear holocaust, all for the benefit of one man, a former dictator who plans to return to power through an invasion funded by $600,000,000 he secreted away. With his invasion made pointless by the fictitious war, will he give up his booty to save his skin?"
}, {
  "imdbId" : "0060009",
  "season" : "4",
  "episodeNumber" : "3",
  "title" : "The Controllers: Part 1",
  "description" : "An Eastern Bloc nation is trying to develop a mind-controlling drug, a project led by Dr. Karl Turek. Phelps devises a plan to play Turek off against a rival, Colonel Borodin. Phelps and Meredyth pose as a pair of defecting U.S. scientists, who supposedly have developed an alternative drug to the one that Turek is working on. The IMF's scheme calls for Turek to try to kill Borodin, which will result in a trial where Turek will be discredited. But the complicated plan goes awry and the episode ends with Phelps under fire by guards."
}, {
  "imdbId" : "0060009",
  "season" : "4",
  "episodeNumber" : "4",
  "title" : "The Controllers: Part 2",
  "description" : "Phelps escapes but Borodin, who had been unconscious in the trunk of the car driven by the IMF driver, is killed by a shot fired by guards. This is a major setback to the IMF because Phelps' plan called for Borodin to denounce Turek at a trial. Now, Phelps & Co. must scramble to get the plan back on track. Meanwhile, Turek continues to make progress in perfecting his mind-controlling drug."
}, {
  "imdbId" : "0060009",
  "season" : "4",
  "episodeNumber" : "5",
  "title" : "Fool's Gold",
  "description" : "To thwart a counterfeiter who has printed enough currency to claim a pro-western democracy's entire gold reserve and thus topple the government, Paris must penetrate a lethal security system to substitute defective printing plates. Meanwhile Barney and Willy must subtly destroy a vault filled with currency and substitute easily detectable counterfeits made with the substituted plates to catch the counterfeiter red-handed."
}, {
  "imdbId" : "0060009",
  "season" : "4",
  "episodeNumber" : "6",
  "title" : "Commandante",
  "description" : "An enemy nation has hijacked a US supported revolutionary movement trying to overturn a dictatorship. The IMF posses as a religious organization seeking the release of the priest who is the true leader of the revolution. But the enemy sees through this cover and demands a shipment of guns in exchange. Further they plan to manipulate the IMF to provide an excuse to kill the priest without alienating the revolutionaries. But what's that Barney is building in an isolated location? Did Jim anticipate a double cross and plan an escape route?"
}, {
  "imdbId" : "0060009",
  "season" : "4",
  "episodeNumber" : "7",
  "title" : "Submarine",
  "description" : "Kruger Schtelman an ex-SS officer serving time in a communist prison is kidnapped by the IMF and made to believe he is on board a submarine. The team must get Schtelman to reveal the location of funds stolen by the Nazis before the military police close in on the IMF operation."
}, {
  "imdbId" : "0060009",
  "season" : "4",
  "episodeNumber" : "8",
  "title" : "Mastermind",
  "description" : "The team is sent to stop a criminal who has obtained information on high ranking government officials that the Syndicate can use to coerce them. So they use the man's eagerness to be the new head of the Syndicate and a rival's dislike for him to get him."
}, {
  "imdbId" : "0060009",
  "season" : "4",
  "episodeNumber" : "9",
  "title" : "Robot",
  "description" : "Premier Pavel Zagov's death has been covered up by Deputy Premier Gregor Kamirov. He is using an actor to take Zagov's place, and endorse Kamirov as his successor. The team convinces Kamirov that another official is planning a similar coup with the help of a lookalike mechanical Zagov. Led to believe that his co-conspirators are unreliable, Kamirov takes over the alternate (IMF provided) plan which ends with him exposing his deception on national television."
}, {
  "imdbId" : "0060009",
  "season" : "4",
  "episodeNumber" : "10",
  "title" : "The Double Circle",
  "description" : "The IMF team tempts an art lover, who stole a secret missile fuel formula, to return the formula in exchange for a one of a kind art object. But he declines. So Jim begins a complex deception to convince his partner he has been double crossed. But the formula is still locked in a safe rigged to explode when enemy agents arrive."
}, {
  "imdbId" : "0060009",
  "season" : "4",
  "episodeNumber" : "11",
  "title" : "The Brothers",
  "description" : "The IMF team is charged with the overthrow of the leader of an oil rich Arab nation to be replaced by his twin brother being held captive in an unknown location. The IMFs team of crack medical pretenders stages an emergency organ transplant to create an opportunity to switch the brothers. But the ruthless head of the nation's military sees an opportunity to dispose of both brothers and seize power for himself."
}, {
  "imdbId" : "0060009",
  "season" : "4",
  "episodeNumber" : "12",
  "title" : "Time Bomb",
  "description" : "Anton Malek is a mole sent years ago to monitor the nuclear program of an Iron Curtain nation. Suffering from a terminal illness, Malek has become a rogue agent and rigged a nuclear reactor to explode. Convinced by the team that his illness can be cured, Malek (unknowingly) disassembles an IMF replica of the bomb while Barney mimics his procedure on the real device. But, Phelps suddenly realizes that Malek has discovered the deception; forcing the team to rely on intuition alone in disarming the bomb."
}, {
  "imdbId" : "0060009",
  "season" : "4",
  "episodeNumber" : "13",
  "title" : "The Amnesiac",
  "description" : "Two years earlier, a rare metal isotope important in nuclear weapons development was stolen from the U.S. and hidden in the United People's Republic. Otto Silff, one of three men involved in the theft, was killed by his co-conspirator, Major Paul Johan. Johan is planning to sell the isotope to an Asian nation that is also an enemy of the U.S. To recover the isotope before the sale takes place, Paris poses as Silff, supposedly having had a disfiguring injury coupled with plastic surgery, and suffering from amnesia -- but \"unconsciously\" displaying characteristics of ..."
}, {
  "imdbId" : "0060009",
  "season" : "4",
  "episodeNumber" : "14",
  "title" : "The Falcon: Part 1",
  "description" : "Prince Stephan's death has been faked by General Sabattini; leaving Stephan's childlike cousin Nicolai as sovereign. Sabattini is forcing Stefan's fiancée Francesca into marrying him, placing him in line to the throne. Phelps joins a group of Dutch tourists while the rest of the team infiltrate the royal palace as a magic act led by Paris. Before the show begins Barney loots the royal vault. It's the beginning of a complex scheme to rescue Stephan, Nicolai, Francesca and simultaneously eliminate Sabatini."
}, {
  "imdbId" : "0060009",
  "season" : "4",
  "episodeNumber" : "15",
  "title" : "The Falcon: Part 2",
  "description" : "Paris switches identities with Nicolai during a magic show and the real sovereign is taken to safety. Francesca, cooperating with the IMF plan, fakes her own suicide cutting off Sabattini's route to power. The theft of the royal vault is discovered, and Phelps contacts Sabattini as a former partner of Stephan's claiming that he can force the price to reveal the location of the royal treasure."
}, {
  "imdbId" : "0060009",
  "season" : "4",
  "episodeNumber" : "16",
  "title" : "The Falcon: Part 3",
  "description" : "Barney and Phelps use an optical illusion to help them free Stephan from his cell. But, everything goes haywire when an assassination attempt against Sabattini fails and unmasks Paris in the process. Sabattini and his men begin to figure out the plan. Phelps must stay one step ahead if he's to get everyone out alive."
}, {
  "imdbId" : "0060009",
  "season" : "4",
  "episodeNumber" : "17",
  "title" : "Chico",
  "description" : "The IMF must rely on a trained terrier, named Chico, to retrieve a list of undercover agents from a drug lord's underground vault."
}, {
  "imdbId" : "0060009",
  "season" : "4",
  "episodeNumber" : "18",
  "title" : "Gitano",
  "description" : "The teen-aged king of a small central European principality has been convinced, falsely, that his regent intends to harm him, and so he has taken refuge in a neighboring country where he is under the \"protection\" of strongman General Aragas. But Aragas in fact is the one who intends to kill the young ruler. The IMF arranges for an attempted \"kidnapping\" of the boy during a journey, and then to have him be \"found\" by a traveling group of gypsies -- putting him temporarily out of Gen. Aragas' hands, so that the IMF can show the boy that Aragas in fact intends to kill ..."
}, {
  "imdbId" : "0060009",
  "season" : "4",
  "episodeNumber" : "19",
  "title" : "Phantoms",
  "description" : "Leo Vorka, the aging Stalin-like dictator of a Communist nation, is about to begin another purge, led by the infamous head of his secret police Georgi Kull. Phelps posing as a writer, Barney's technical know-how, and Paris' make-up skills convince Vorka's aides, that the dictator's murderous past has finally driven him mad; it's time for him to retire."
}, {
  "imdbId" : "0060009",
  "season" : "4",
  "episodeNumber" : "20",
  "title" : "Terror",
  "description" : "A notorious terrorist serving a life sentence has used a secret supporter within his nation's government to secure a pardon. The IMF must prevent his release and expose the traitor."
}, {
  "imdbId" : "0060009",
  "season" : "4",
  "episodeNumber" : "21",
  "title" : "Lover's Knot",
  "description" : "The IMF's task is to find out who is running a U.K. spy ring. The team's lead is Lady Cora Weston, who seduces men in sensitive intelligence positions. Phelps' plan calls for him to pose as a U.S. naval officer who will be Lady Cora's next target. The plan is complicated when Lady Cora falls for Paris, posing as another U.S. official. Paris also falls for Lady Cora. These entanglements become even more complicated when the IMF discovers the identify of the spy ring's leader."
}, {
  "imdbId" : "0060009",
  "season" : "4",
  "episodeNumber" : "22",
  "title" : "Orpheus",
  "description" : "In order to expose an assassin who will strike an unknown target within 48 hours, Phelps poses as a drug addicted intelligence officer who wants to sell information to the assassin's contact: Bergman. Meanwhile, IMF operative Valerie, approaches Bergman as an investigator sent to look for a traitor inside his organization."
}, {
  "imdbId" : "0060009",
  "season" : "4",
  "episodeNumber" : "23",
  "title" : "The Crane",
  "description" : "The team finds inspiration from Poe's \"The Purloined Letter\" in their plan to rescue a resistance fighter, and sow discord among the leaders of the military junta hunting him."
}, {
  "imdbId" : "0060009",
  "season" : "4",
  "episodeNumber" : "24",
  "title" : "Death Squad",
  "description" : "Jim and Barney vacation together in a Latin American country. While there, Barney falls in love with artist Alma Ross. But the brother of the local police chief obsesses over Alma and is enraged that she and Barney are dating. He goes into her room with a knife. Barney defends Alma but in the process sidesteps the jealous man, who lunges through the window, landing on the knife. Barney is now arrested and ticketed for execution by the police chief, who is operating a secret death squad. Phelps summons Paris and Willy and the IMF must act fast before Barney becomes the..."
}, {
  "imdbId" : "0060009",
  "season" : "4",
  "episodeNumber" : "25",
  "title" : "The Choice",
  "description" : "The Grand Duchess Theresa of the European duchy of Trent has come under the sway of a self-proclaimed mystic, the Rasputin-like Emile Vautrain. The IMF's assignment is to prevent Vautrain from using his influence over the Grand Duchess to make himself ruler of Trent, turning it into a dictatorship that will ally itself with the enemies of the U.S. To stop Vautrain, the IMF relies on Vautrain's amazing resemblance to the IMF's agent, Paris, in order to reveal Vautrain's true nature to the Grand Duchess."
}, {
  "imdbId" : "0060009",
  "season" : "4",
  "episodeNumber" : "26",
  "title" : "The Martyr",
  "description" : "Premier Anton Rojek, the anti-Western head of an East Bloc state, plans to hold a \"youth congress,\" hoping to get the young people of his country to endorse his repressive regime. The IMF's plan to prevent this involves the talents of folk singer Roxy, as well as having Paris pose as the missing son of the country's late President, Eduard Malik, whom many young people there still idolize."
}, {
  "imdbId" : "0060009",
  "season" : "5",
  "episodeNumber" : "1",
  "title" : "The Killer",
  "description" : "The IMF is up against a contract killer who makes decisions at random at the last minute to ensure his moves are unpredictable. As Barney stands in for the intended victim, the IMF must prepare for every eventuality to get close to the killer, thwart his plans, turn him against his client and stop their killing spree."
}, {
  "imdbId" : "0060009",
  "season" : "5",
  "episodeNumber" : "2",
  "title" : "Flip Side",
  "description" : "Mel Bracken is one of the largest distributors of illegal drugs on the West Coast. Pharmaceutical magnate Cameron legally sells drugs to a middleman's laboratory in Mexico who then smuggles it to Bracken in Los Angeles. In order to expose the operation the IMF forces Cameron to deal directly with Bracken on U.S. soil."
}, {
  "imdbId" : "0060009",
  "season" : "5",
  "episodeNumber" : "3",
  "title" : "The Innocent",
  "description" : "Barney has been captured infiltrating an enemy laboratory in the Middle East. To make matters worse he has been exposed to the chemical weapon being manufactured at the lab. Phelps devises a plan to rescue Barney and destroy the chemical. However, in order for the mission to succeed the IMF needs the assistance of a computer genius who wants nothing to do with the plan."
}, {
  "imdbId" : "0060009",
  "season" : "5",
  "episodeNumber" : "4",
  "title" : "Homecoming",
  "description" : "This time it's personal as Jim returns home to uncover who is killing his childhood friends; with the aid of the rest of the IMF team of course. But what will be worse, the death of another friend or finding that a friend is the killer."
}, {
  "imdbId" : "0060009",
  "season" : "5",
  "episodeNumber" : "5",
  "title" : "Flight",
  "description" : "The IMF must thwart a coup attempt to be triggered by a presidential assassination. The team apprehends the coup leader and employs an elaborate ruse to convince him to reveal the killer. But government security forces uncover the operation and capture Dana. So begins parallel games of cat and mouse with dire consequences for the losers."
}, {
  "imdbId" : "0060009",
  "season" : "5",
  "episodeNumber" : "6",
  "title" : "My Friend, My Enemy",
  "description" : "While en route to rendezvous with the IMF in Switzerland, Paris is captured by a team of enemy agents, brainwashed, and programmed to kill his control: Phelps. While the enemy team creates a scenario which will trigger Paris' programming, the IMF must figure out exactly what has happened to their fellow agent to save his career and life."
}, {
  "imdbId" : "0060009",
  "season" : "5",
  "episodeNumber" : "7",
  "title" : "Butterfly",
  "description" : "The MI team must exonerate an American businessman framed for the murder of his wife and marked for death in Japan. Undercover in the guise of various masters of Japanese art forms they dupe the true killer into confessing."
}, {
  "imdbId" : "0060009",
  "season" : "5",
  "episodeNumber" : "8",
  "title" : "Decoy",
  "description" : "Brother and sister Alexi and Anna Kerkoska want to defect, and give the U.S. a list of government officials sympathetic to the West. Although Anna believes that the defection is genuine it's really a trap set by Alexi and Police Chief Petrovitch. They hope to get the list and embarrass the West in one fell swoop. Despite the trap the IMF must rescue Anna and recover the list. Meanwhile during the course of the mission Phelps and Anna begin to develop romantic feelings for each other."
}, {
  "imdbId" : "0060009",
  "season" : "5",
  "episodeNumber" : "9",
  "title" : "The Amateur",
  "description" : "A wannabe spy in an eastern European country happens upon an operation of the MI team. But, in a cleaver twist, as this amateur's dreams of becoming a super sleuth turn to greed the MI team manipulates him and government security forces to accomplish their mission and their escape."
}, {
  "imdbId" : "0060009",
  "season" : "5",
  "episodeNumber" : "10",
  "title" : "Hunted",
  "description" : "A picture perfect extraction mission in a white dominated African country goes suddenly awry when an interrogator arrives unexpectedly. A well disguised member of the MI team is wounded but is aided by an angel of mercy with a secret past and reward seeking friend. As their fondness for each other grows, Paris serves as an all too convincing decoy while the rest of the team searches for their lost comrade."
}, {
  "imdbId" : "0060009",
  "season" : "5",
  "episodeNumber" : "11",
  "title" : "The Rebel",
  "description" : "Government security forces surprise the MI team during a routine information exchange with insurgents. Dana and two rebels are captured including the rebel who, unknown to government forces, has the secret \"notebook.\" Jim has a plan but the rebels are skeptical. With the possibility of a traitor in their midst and the help of a local priest of uncertain reliability, the MI must rescue the captives before they break under torture, before the security forces uncover the notebook and before the rebels take matters into their own hands."
}, {
  "imdbId" : "0060009",
  "season" : "5",
  "episodeNumber" : "12",
  "title" : "Squeeze Play",
  "description" : "A drug kingpin, not long for this world, is preparing to turn over his heroin empire to his heir apparent. Paris and Dana go undercover to turn the kingpin against his heir and convince him that Paris is the better candidate to trust with the secrets of his organization."
}, {
  "imdbId" : "0060009",
  "season" : "5",
  "episodeNumber" : "13",
  "title" : "The Hostage",
  "description" : "Paris's cover identify as a wealthy and influential American proves a bit too convincing. He is kidnapped and held for the ransom by rebels demanding the release of three of their comrades. The government agrees to cooperate in Jim's plan to rescue Paris only if he will capture one of the rebel leaders. But the rebels are very careful."
}, {
  "imdbId" : "0060009",
  "season" : "5",
  "episodeNumber" : "14",
  "title" : "Takeover",
  "description" : "The IMF team is charged with bringing down a political manipulator who intends to use a group of student protesters with deadly effect to elevate his political puppet to higher office. Dana is a double threat posing as the puppet's daughter while infiltrating the protesters. Jim play's king maker to manipulate the manipulator."
}, {
  "imdbId" : "0060009",
  "season" : "5",
  "episodeNumber" : "15",
  "title" : "Cat's Paw",
  "description" : "A high tech organized crime group comes to the attention of our favorite IMF team following the murder of Barny's brother. To bring down the organization and the corrupt police captain allied with them Jim turns to his tried and true technique; infiltrate, sow distrust then wait for the fireworks."
}, {
  "imdbId" : "0060009",
  "season" : "5",
  "episodeNumber" : "16",
  "title" : "The Missile",
  "description" : "The IMF fool two foreign agents into gathering intelligence on a bogus missile guidance system. However, the mission is interrupted when a psychotic kidnaps Dana before she can give Phelps the details of the enemy agents' plan to kill him."
}, {
  "imdbId" : "0060009",
  "season" : "5",
  "episodeNumber" : "17",
  "title" : "The Field",
  "description" : "An adversary nation launches a nuclear weapons platform in to orbit. To make matters worse, the weapon's control station is on an impregnable island. That can only mean it's time for Jim to find a way to slip Barney into the station to sabotage the weapon."
}, {
  "imdbId" : "0060009",
  "season" : "5",
  "episodeNumber" : "18",
  "title" : "Blast",
  "description" : "Jim and Dana infiltrate a group of bank robbers, but the IMF's real target is the mysterious leader of the group who uses the thieves' booty to fund anti-American revolutionary activities. Natural conflicts in the robbers' personal agendas play right into Jim's hands."
}, {
  "imdbId" : "0060009",
  "season" : "5",
  "episodeNumber" : "19",
  "title" : "The Catafalque",
  "description" : "In one of the IMF's most audacious plans yet, the team blatantly frames their victim and attempts to snatch the body of a deceased leader literally from under the noses of the honor guards. It's all part of Jim's plan to infuriate an official into revealing a sensitive document the US government wants to get its hands on."
}, {
  "imdbId" : "0060009",
  "season" : "5",
  "episodeNumber" : "20",
  "title" : "Kitara",
  "description" : "Government forces in a racist African country have captured Kitara, the leader of the revolutionary forces, and will torture him to death in their effort to find the gold bullion he has hidden. To rescue Kitara and secure the gold, Jim plans to manipulate the security official interrogating him. What better way to manipulate a racist than to turn him into what he least wants to be and turn his own forces against him?"
}, {
  "imdbId" : "0060009",
  "season" : "5",
  "episodeNumber" : "21",
  "title" : "A Ghost Story",
  "description" : "Barney exploits his technical wizardry to convince a neo-fascist that his son, whom he murdered, wants to be exhumed and cremated. It's all part of the plan to obtain the secret nerve gas formula his son developed before a certain eastern power gets their hands on it. But like any good ghost story, nothing and no one is what they seem."
}, {
  "imdbId" : "0060009",
  "season" : "5",
  "episodeNumber" : "22",
  "title" : "The Party",
  "description" : "Eastern Bloc agent Alexander Vanin is serving time in a federal prison for espionage. Using auto-hypnosis he has blocked all information about the location or contents of a microfilm list he hid just before he was arrested. Vanin's wife is the only person who can remove the mental block and the only one Alexander will confide in. The IMF stage a welcome home party at Vanin's embassy (which has been cleverly vacated) to reunite husband, wife, and the top secret roll of microfilm."
}, {
  "imdbId" : "0060009",
  "season" : "5",
  "episodeNumber" : "23",
  "title" : "The Merchant",
  "description" : "Jim pulls a \"James Bond\" letting himself be captured so he can become beholden to arms dealer Armand Anderssarian who can get Jim released. A classic start to an IMF con. Meanwhile Paris, Barney and Dana gamble on Anderssarian's poker compulsion to bring his overextended debt situation to a crisis. But there's a wild card in the deck; Anderssarian's ditsy mistress who is jealous of the attention he's giving Dana and has a knack for doing the wrong thing at the worst time."
}, {
  "imdbId" : "0060009",
  "season" : "6",
  "episodeNumber" : "1",
  "title" : "Blind",
  "description" : "A doctor temporarily blinds Phelps in order for him to convincingly pose as an alcoholic, washed up, ex- federal agent who's eager to sell information identifying an FBI mole deep within an organized crime boss' inner circle."
}, {
  "imdbId" : "0060009",
  "season" : "6",
  "episodeNumber" : "2",
  "title" : "Encore",
  "description" : "In order to solve a cold case the IMF and scores of actors go to extreme lengths to convince one of the killers, Thomas Kroll, that he is reliving the day of the murder - June 30, 1937."
}, {
  "imdbId" : "0060009",
  "season" : "6",
  "episodeNumber" : "3",
  "title" : "The Tram",
  "description" : "Organized crime bosses from across the country are meeting at a secluded mountain lodge to form an off shore corporation that will launder their money, and allow them to make legitimate investments. The IMF have an afternoon to turn the crooks against each other, and get the number of the Swiss bank account containing $50 million in mob cash."
}, {
  "imdbId" : "0060009",
  "season" : "6",
  "episodeNumber" : "4",
  "title" : "Mindbend",
  "description" : "Criminal mastermind Pierson employs Dr. Burke who brainwashes fugitives to carry out political assassinations. Barney takes the place of the next fugitive to be used by Burke. But, when he can't take the drug to counteract Burke's procedure Barney succumbs to the brainwashing. In addition to completing the assigned mission, the IMF must now find their colleague who's somewhere in the city searching for his target."
}, {
  "imdbId" : "0060009",
  "season" : "6",
  "episodeNumber" : "5",
  "title" : "Shape-Up",
  "description" : "The IMF topple the man who runs a dockyard for organized crime by making it seem that he's losing his mind."
}, {
  "imdbId" : "0060009",
  "season" : "6",
  "episodeNumber" : "6",
  "title" : "The Miracle",
  "description" : "It won't be easy to turn a highly proficient and well-rewarded hit man against his boss. But let's give this a try. After he's gunned down, arrange for a world renowned surgeon, Barney, to give him a heart transplant. Then have his newbie girlfriend, Lisa, provide some not so subtle hints that the new heart has changed his personality and he's all washed up as a hit man. Then have a gangster, Jim, who's trying to muscle in on his boss's operation, make him an offer he can't refuse."
}, {
  "imdbId" : "0060009",
  "season" : "6",
  "episodeNumber" : "7",
  "title" : "Encounter",
  "description" : "Lisa impersonates a mobster's alcoholic wife to raise her prestige from embarrassment to dangerous informant. That puts Lisa as well as her husband at risk of a mob hit which Jim expects to force the mobster into a rash decision to turn against the mob."
}, {
  "imdbId" : "0060009",
  "season" : "6",
  "episodeNumber" : "8",
  "title" : "Underwater",
  "description" : "The mission: intercept an exchange of smuggled diamonds for $75 million cash. Capture the crooks, the cash and the diamonds. A simple job for the IMF except one of the crooks stole the diamonds. Now Jim has to convince a multi-millionaire diamond thief to give up his retirement plan."
}, {
  "imdbId" : "0060009",
  "season" : "6",
  "episodeNumber" : "9",
  "title" : "Invasion",
  "description" : "Defense Department analyst Whitmore Channing has stolen microfilm detailing temporary blind spots in the nation's Defense Early Warning system. The information will be picked up from an unknown dead drop in less than 24 hours. In order to locate the drop, the IMF convinces Channing that the enemy attack has already begun. But, they don't know about an assassin being sent to kill the spy before he can talk."
}, {
  "imdbId" : "0060009",
  "season" : "6",
  "episodeNumber" : "10",
  "title" : "Blues",
  "description" : "The IMF team is charged with getting the goods on a corrupt music producer who murdered a singer he had under contract. After five years of thwarting cold war spies, this one should be easy; especially since the producer has an equally disreputable partner that that can be manipulated to turn against him. So why don't we let Barney and Willy have the fun of playing the mind games this time while Jim coordinates in the background."
}, {
  "imdbId" : "0060009",
  "season" : "6",
  "episodeNumber" : "11",
  "title" : "The Visitors",
  "description" : "Bad guys with eccentric ideas are just too easy. The IMF's next victim believes aliens are visiting the earth. So Jim, Lisa and Willy become aliens to convince him that he is their \"chosen one\" so he will expose candidates running for office that are in the pocket of organized crime."
}, {
  "imdbId" : "0060009",
  "season" : "6",
  "episodeNumber" : "12",
  "title" : "Nerves",
  "description" : "To get close to a vindictive and paranoid criminal who stole a canister of nerve gas, Lisa poses as a career criminal in a jailbreak. A new IMF member, Bill Williams, impersonates the villain's brother to get close to him. Unknown to the criminal the canister is corroding, and will leak if it's not recovered in time. But that would suit him just fine."
}, {
  "imdbId" : "0060009",
  "season" : "6",
  "episodeNumber" : "13",
  "title" : "Run for the Money",
  "description" : "The IMF team play the sport of kings in order to stop a ruthless syndicate. The syndicate is looking to corner the 'off track betting' market by violently disposing of their competitors, and any customers who happen to be in the way. But, with Jim's plan, the IMF is betting on his dark horse to win and there's no horse named Sure Thing."
}, {
  "imdbId" : "0060009",
  "season" : "6",
  "episodeNumber" : "14",
  "title" : "The Connection",
  "description" : "The IMF becomes a heroin manufacturer to sabotage a major drug deal and leave the dealers holding the cellophane bag when the police move in."
}, {
  "imdbId" : "0060009",
  "season" : "6",
  "episodeNumber" : "15",
  "title" : "The Bride",
  "description" : "Lisa plays mail-order corpse bride to frame a money launderer. But if Jim's timing isn't perfect she may finder herself embalmed or cremated."
}, {
  "imdbId" : "0060009",
  "season" : "6",
  "episodeNumber" : "16",
  "title" : "Stone Pillow",
  "description" : "When your game is blackmail you have to protect your trump card, especially when your victim is a mobster. But when the IMF wants a piece of your action just be glad they want the mobster more than you."
}, {
  "imdbId" : "0060009",
  "season" : "6",
  "episodeNumber" : "17",
  "title" : "Image",
  "description" : "Crime boss Emil Gadsen is about to leave the country with a list of corrupt politicians and law enforcement officers in his pay. Barney poses as a mystic who convinces Gadsen that his partner is out to eliminate him. However, he must also deal with Emil's practical minded son, Tony, who doesn't believe any of this nonsense."
}, {
  "imdbId" : "0060009",
  "season" : "6",
  "episodeNumber" : "18",
  "title" : "Committed",
  "description" : "Nora Dawson is the only person willing to testify against underworld boss Leon Chandler. Chandler has used his political connections to have Dawson committed to a corrupt mental institution where she is being drugged to destroy her credibility. The team must rescue Dawson in time for her to testify against Chandler."
}, {
  "imdbId" : "0060009",
  "season" : "6",
  "episodeNumber" : "19",
  "title" : "Bag Woman",
  "description" : "Murphy's Law catches up with the IMF: Casey's handcuffed to a suitcase full of TNT meant to kill her and a politician on the take, and Barney is wounded when his cover is blown. Phelps must quickly improvise a scenario that will give him Casey's location."
}, {
  "imdbId" : "0060009",
  "season" : "6",
  "episodeNumber" : "20",
  "title" : "Double Dead",
  "description" : "The IMF is charged with discouraging the mob's expansion plans. But Murphy's Law makes another unexpected appearance and Willy is captured. Now Jim has to improvise a plan that includes rescuing Willy. Never has Jim so confused his adversaries, but will that make them predictable or just create more chaos?"
}, {
  "imdbId" : "0060009",
  "season" : "6",
  "episodeNumber" : "21",
  "title" : "Casino",
  "description" : "To persuade a casino operator to expose mob connections within the gambling industry, Jim frames him so the mob's rivalries and lethal management methods will do his talking. To get \"inside\" Willy plays a crooked Black Jack dealer for Jim and Casey, a pair of gambling addicts, while Barney heists the take with a collection of gadgets to die for."
}, {
  "imdbId" : "0060009",
  "season" : "6",
  "episodeNumber" : "22",
  "title" : "Trapped",
  "description" : "The impossible mission this time is to recover the multi-million dollar booty stolen by a family of smugglers. But when the action gets hot, Jim sustains a head injury and wakes up with amnesia and nothing but a fake ID to tell him who he is."
}, {
  "imdbId" : "0060009",
  "season" : "7",
  "episodeNumber" : "1",
  "title" : "Break!",
  "description" : "Phelps poses as a pool shark to break up a gambling ring led by Krebbs and Allen, and recover microfilm left behind by a dead agent."
}, {
  "imdbId" : "0060009",
  "season" : "7",
  "episodeNumber" : "2",
  "title" : "Two Thousand",
  "description" : "Before he can sell it to a foreign power, the IMF force must trick a treasonous scientist into revealing the whereabouts of a cache of nuclear material by convincing him he is now living 28 years after nuclear war has devastated the country."
}, {
  "imdbId" : "0060009",
  "season" : "7",
  "episodeNumber" : "3",
  "title" : "The Deal",
  "description" : "Mobsters Larson, and Rogan have made a deal to support Gen. Oliver Hammond in his bid to take over the island nation of Camagua. The IMF capture the mobsters en route, and force them to reveal the location of the safe deposit key before Hammond can apprehend the group."
}, {
  "imdbId" : "0060009",
  "season" : "7",
  "episodeNumber" : "4",
  "title" : "Leona",
  "description" : "In order to rescue a federal agent being tortured by criminals, the IMF create a conflict between the two leading organized crime bosses in the area: Mike Apollo and Joe Epic."
}, {
  "imdbId" : "0060009",
  "season" : "7",
  "episodeNumber" : "5",
  "title" : "TOD-5",
  "description" : "A domestic terror group has sent one of their agents to pick up a container of a deadly biological weapon in a small desert town. But the IMF convinces him that he's already been exposed to the germ, and the military is sealing off the town to contain the leak."
}, {
  "imdbId" : "0060009",
  "season" : "7",
  "episodeNumber" : "6",
  "title" : "Cocaine",
  "description" : "The IMF knows that within 72 hours, drug smuggler and distributor Carl Reid plans to bring the largest shipment of cocaine ever into the U.S. To learn what Reid's plans are for getting the cocaine into the country, the IMF tries to convince Reid's lieutenant, Joseph Conrad, that they've created a machine that can create pure cocaine synthetically. Conrad believes that this \"miracle machine\" is real, and decides to go into business for himself -- driving a wedge between him and his former boss, Reid."
}, {
  "imdbId" : "0060009",
  "season" : "7",
  "episodeNumber" : "7",
  "title" : "Underground",
  "description" : "A gang specializing in smuggling criminals out of the country manages to free Gunther Schell, a Syndicate finance man who knows the location of $27 million in Syndicate money. But this same gang instead tries to use psychological torture methods to get Schell to reveal the location of the money. To recapture Schell and to put a stop to the fugitive smuggling operation, the IMF publicizes that Jim Phelps is a doctor wanted for murder who also needs the services of the fugitive smuggling operation."
}, {
  "imdbId" : "0060009",
  "season" : "7",
  "episodeNumber" : "8",
  "title" : "Movie",
  "description" : "Crime boss Norman Shields runs an operation that has been infiltrating the entertainment industry. His latest takeover target is Pantheon Studios, where the brother of Shields' Syndicate financier, Theo Dane, is coming to take over the movie-making operation. Because Shields and Dane have never met, the IMF comes up with a plan to substitute Jim Phelps for Dane, and then make a movie dramatizing a notorious real-life murder -- that was committed by Norman Shields."
}, {
  "imdbId" : "0060009",
  "season" : "7",
  "episodeNumber" : "9",
  "title" : "Hit",
  "description" : "Syndicate operative Sam Dexter has just been sentenced to a year in prison for income tax evasion. The IMF arranges for Barney to get close to Dexter while he is in prison and then arranges for Dexter to escape with Barney's assistance - all in the hope that a grateful and trusting Dexter will lead him to additional evidence of wrongdoing, allowing both Dexter and his former associates to be put away for good."
}, {
  "imdbId" : "0060009",
  "season" : "7",
  "episodeNumber" : "10",
  "title" : "Ultimatum",
  "description" : "Rogue physicist Dr. Jerome Cooper informs the government that he has planted a 50-megaton bomb in a major American city, which he will detonate unless various members of Congress are replaced and American foreign policy changed to suit his wishes. With less than a day to locate the bomb, the IMF attempts to isolate Dr. Cooper in a rural area, hoping to convince him that the government is acceding to his demands in time to get him to reveal the location of the bomb."
}, {
  "imdbId" : "0060009",
  "season" : "7",
  "episodeNumber" : "11",
  "title" : "Kidnap",
  "description" : "In a sequel to Season Six's \"Casino,\" Jim Phelps is on vacation with Barney when he is recognized by one of the criminals that the IMF outfoxed in the earlier episode. Jim is held hostage while Barney is given an ultimatum: retrieve an incriminating letter from a safe deposit box that a former criminal intends to turn over to the authorities, or Jim Phelps will be killed. Barney enlists Casey and Willy to obtain the letter, but also has a plan to free Jim."
}, {
  "imdbId" : "0060009",
  "season" : "7",
  "episodeNumber" : "12",
  "title" : "Crack-Up",
  "description" : "Law enforcement agencies believe that Peter Cordel is a killer for hire, but no evidence linking him to any killings has been uncovered. The IMF is assigned to obtain the evidence needed to arrest Cordel, and to learn the identity of his Syndicate boss. The IMF's lures Cordel, who is a chess master, into a game where he can be given a drug that induces post-hypnotic suggestions. The IMF is then able to convince Cordel that he's suffering from blackouts during which he kills a number of people close to him -- and that his impending mental breakdown will make the ..."
}, {
  "imdbId" : "0060009",
  "season" : "7",
  "episodeNumber" : "13",
  "title" : "The Puppet",
  "description" : "Crime boss Paul Ostro is reported to have suffered severe facial injuries in a hunting accident, and lies bandaged in bed at his estate. But the IMF suspects that Paul's brother Leo actually killed Paul and substituted a bandaged \"puppet\" in his place, to issue orders to the family's criminal subordinates, with Leo actually making the decisions. With the family reputed to be planning a new criminal enterprise involving over one hundred million dollars, the IMF's mission is to learn the family's new plan -- which they hope to do by unmasking Leo's surrogate for his ..."
}, {
  "imdbId" : "0060009",
  "season" : "7",
  "episodeNumber" : "14",
  "title" : "Incarnate",
  "description" : "Hannah O'Connel and her sons have stolen gold bullion, and hid it somewhere in the US before escaping to an island in the Caribbean. The IMF must force Hannah to make a move for the stash so she can be arrested on US soil."
}, {
  "imdbId" : "0060009",
  "season" : "7",
  "episodeNumber" : "15",
  "title" : "Boomerang",
  "description" : "Syndicate hood Johnny Vayle, on his way to meet his underworld associates, is convinced to land at a rural airport by his wife, Eve, and murdered. She informs Johnny's former associates that she has the documents and blackmails them into paying her off for the rest of her life. The IMF's job is to recover the documents -- which the team plans to do by suggesting to Eve that her husband may still be alive."
}, {
  "imdbId" : "0060009",
  "season" : "7",
  "episodeNumber" : "16",
  "title" : "The Question",
  "description" : "A foreign agent assassin defects to the US, or he may be a foreign mole. It is up to the IMF team to kidnap him from his US safe-house, then uncover if his defection is real or a hoax."
}, {
  "imdbId" : "0060009",
  "season" : "7",
  "episodeNumber" : "17",
  "title" : "The Fountain",
  "description" : "Syndicate hood Thomas Bachman steals two incriminating computer reels, and also tries to kill his rival, Matthew Drake, with a bomb, but only manages to cripple Drake. Bachman is on the run from Drake in northern Mexico when Bachman arranges for a private plane to fly him back to the United States. Barney intercepts and poses as the pilot, setting the stage for the IMF to bring Bachman to an isolated mansion where they hope to dupe him into revealing the location of the hidden computer reels."
}, {
  "imdbId" : "0060009",
  "season" : "7",
  "episodeNumber" : "18",
  "title" : "The Fighter",
  "description" : "The IMF's assignment is to undermine the Syndicate's involvement in the boxing world by driving a wedge between Joe Braddock, a no-nonsense hood, and Paul Mitchell, his more weak-willed partner, who had been honest before Braddock enticed him to become involved in the Syndicate. To do so, the IMF takes advantage of the budding romance between Mitchell's daughter, Susan, and one of Braddock's and Mitchell's contract boxers, Pete Novick."
}, {
  "imdbId" : "0060009",
  "season" : "7",
  "episodeNumber" : "19",
  "title" : "Speed",
  "description" : "Sam Hibbing is the largest dealer of speed on the West Coast, and has recently hijacked several million dollars worth of raw amphetamine powder, which he plans to auction in pill form to the highest bidder. The IMF substitutes Casey for Hibbing's rebellious, motorcycle-riding daughter, Margaret (who is herself hooked on speed). This allows Jim Phelps to insinuate himself close enough to Hibbing for Jim to intercept the speed when it is ready for shipment."
}, {
  "imdbId" : "0060009",
  "season" : "7",
  "episodeNumber" : "20",
  "title" : "The Pendulum",
  "description" : "Gunnar Malstrom is one of the leaders of the Pendulum, a secret terrorist organization seeking to overthrow the United States government. The IMF is informed that the Pendulum is shortly planning a major attack on the government, code-named Nightfall. With no knowledge of other members of the Pendulum, the IMF lures Malstrom to the headquarters of a phony corporate conglomerate, where they learn bits and pieces of the plan -- but fail to uncover that the official who is supposedly the target of Nightfall has already been replaced by a Pendulum double."
}, {
  "imdbId" : "0060009",
  "season" : "7",
  "episodeNumber" : "21",
  "title" : "The Western",
  "description" : "Partners Van Cleve and Matthew Royce have recently looted the Azteca Museum of $5 million dollars in Pre-Columbian art, which they then brought to the United States to hide. Cleve is also thought to have killed his partner, Royce, to keep the entire haul for himself. To recover the treasure, the IMF makes Cleve believe that he has begun to have precognitive visions, culminating in premonitions of a giant earthquake that will destroy a local dam, kill him, and engulf the treasure -- unless he relocates it soon."
}, {
  "imdbId" : "0060009",
  "season" : "7",
  "episodeNumber" : "22",
  "title" : "Imitation",
  "description" : "While being transported to the United Nations, the crown jewels of the nation of Marnsburg are stolen by criminal Jena Cole. Cole plans to sell the jewels for $3 million, and the IMF's assignment is to get them back. The team's plan is to have Barney gain her confidence by posing as the former cellmate of Cole's late brother. Meanwhile, the rest of the team tries to convince Jena that the jewels she has stolen were actually imitations."
}]