[{
  "imdbId" : "0092999",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Awakenings: 1954-1956",
  "description" : "The beginnings of the U.S. Civil rights struggle is profiled, including the Emmett Till murder trial and the Rosa Parks arrest/Montgomery bus boycott."
}, {
  "imdbId" : "0092999",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Fighting Back: 1957-1962",
  "description" : "Following the U.S. Supreme Court's Brown Vs the Board of Education decision, the civil rights movement presses the issue of desegregation in schools. From Little Rock High School and Eisenhower's utilization of the 101st Airborne to Ole Miss and Kennedy's lobbying efforts."
}, {
  "imdbId" : "0092999",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Ain't Scared of Your Jails: 1960-1961",
  "description" : "From PBS - Beginning in 1960, young people on Black college campuses took a more active role in the civil rights movement's leadership and determined their own methods of promoting change."
}, {
  "imdbId" : "0092999",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "No Easy Walk: 1961-1963",
  "description" : "From PBS - This episode depicts major civil rights movement events in three American cities."
}, {
  "imdbId" : "0092999",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Mississippi: Is This America?: 1962-1964",
  "description" : "1964 sees the advent of Freedom Summer. Volunteers from across the country travel to the south to register Negro voters. Despite the disappearance of three volunteers in Mississippi who are later found dead, the Mississippi Freedom Democratic Party is formed after blacks are banned from the regular state Democratic. The summer ends with both democratic parties struggling to be recognized at the national convention in Atlantic City."
}, {
  "imdbId" : "0092999",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Bridge to Freedom: 1965",
  "description" : "From PBS - Ten years after the bus boycott in Montgomery, Alabama, the civil rights leadership has become more sophisticated in its use of protest strategy."
}]
