[{
  "imdbId" : "0374463",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Guadalcanal/Leckie",
  "description" : "Veteran Sergeant John Basilone ships out soon after Pearl Harbor for Guadalcanal while other young enlistees are sent to boot camp."
}, {
  "imdbId" : "0374463",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Basilone",
  "description" : "Outmanned and with supplies low, Basilone and other marines on Guadacanal rally to repel superior Japanese forces."
}, {
  "imdbId" : "0374463",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Melbourne",
  "description" : "After arduous months in Guadalcanal, exhausted marines are given rest and recreation in Melbourne, where they find the girls friendly and the beer cold."
}, {
  "imdbId" : "0374463",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Gloucester/Pavuvu/Banika",
  "description" : "After leaving Melbourne, the weather works against the leathernecks as Lechie falls seriously ill and Sledge gets assigned to New Britain."
}, {
  "imdbId" : "0374463",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Peleliu Landing",
  "description" : "Basilone's fame keeps him in the U.S. selling war bonds, Leckie rejoins his company, and Sledge is reunited with Phillips in Pavuvu."
}, {
  "imdbId" : "0374463",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Peleliu Airfield",
  "description" : "Water is in short supply and the stifling heat takes control on Peleliu as Leckie is wounded and evacuated."
}, {
  "imdbId" : "0374463",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Peleliu Hills",
  "description" : "Sledge finds the carnage and death of his companions on Peleilu increasingly difficult to bear as Basilone continues his bond drive in the States."
}, {
  "imdbId" : "0374463",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Iwo Jima",
  "description" : "Frustrated with his bond selling tour, Basilone goes back to training troupes and after marrying a pretty marine sergeant, leads his men at Iwo Jima."
}, {
  "imdbId" : "0374463",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "Okinawa",
  "description" : "The 1st Marine Division fight a determined Japanese force on Okinawa who prefer death to surrender and are indifferent to the lives of Okinawan civilians."
}, {
  "imdbId" : "0374463",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "Home",
  "description" : "After V-J Day Leckie and Sledge return home and try to readjust to civilian life."
}]