[{
  "imdbId" : "0863046",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Sally",
  "description" : "Transplanted New Zealanders Bret and Jemaine--a.k.a. Flight of the Conchords--search for romance and gigs in New York City. At a bohemian party, Jemaine falls for Sally (who used to date Bret), but Bret spoils the moment back at their apartment."
}, {
  "imdbId" : "0863046",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Bret Gives Up the Dream",
  "description" : "Desperate for cash, Bret and Jemaine decide to get jobs. Only Bret is successful--he gets a job holding up signs. When Murray books them a show, Bret can't get off work, so Jemaine is forced to play with a replacement: a recording of Bret."
}, {
  "imdbId" : "0863046",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Mugged",
  "description" : "Bret loses Jemaine's trust by abandoning him to a 'gang' of two, and fears the worst when Jemaine doesn't come home."
}, {
  "imdbId" : "0863046",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Yoko",
  "description" : "Murray is perturbed when Bret cancels a band tour to be with his girlfriend Coco. Jemaine's dismay, coupled with the betrayal felt by lone fan Mel (who has a crush on Bret), threatens the band's future."
}, {
  "imdbId" : "0863046",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Sally Returns",
  "description" : "A lonely Jemaine runs into Sally, who dumped him (and Bret) earlier in the year. Envisioning a new life with Sally, Jemaine's dreams take a detour when he learns she won't spend time with him until he gets his own place."
}, {
  "imdbId" : "0863046",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Bowie",
  "description" : "Upset when Murray says he's too small during a photo shoot, Bret decides that Jemaine can help him get over his funk. That night, a 1972-era David Bowie advises Bret to wear an eye patch. The plan backfires when Bret has depth-perception problems."
}, {
  "imdbId" : "0863046",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Drive By",
  "description" : "Dissed by a rude fruit vendor, Bret and Jemaine concoct an animated music video in retaliation. But as slights against the boys continue, Bret and Jemaine find themselves in the middle of a race war with anti-Kiwi mutha 'uckas."
}, {
  "imdbId" : "0863046",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Girlfriends",
  "description" : "Brett and Jemaine encounter girlfriend problems in the USA."
}, {
  "imdbId" : "0863046",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "What Goes on Tour",
  "description" : "Using the band's 'emergency fund,' Murray organizes a warm-up tour before a big gig in Central Park. At a bar, the boys get hooked by some 'mermaids' from a women's water-polo team--nearly ruining the tour and their relationship with Murray."
}, {
  "imdbId" : "0863046",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "New Fans",
  "description" : "The Conchords triple their fan base after playing a local world music jam, but Mel is suspicious of the two new fans' motives."
}, {
  "imdbId" : "0863046",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "The Actor",
  "description" : "Bret and Jemaine enlist a semi-pro actor to cheer up Murray after a disappointing gig. Asked to place a good-hearted rejection call, the actor gets carried away, offering Murray and the Conchords a recording deal that's too good to be true."
}, {
  "imdbId" : "0863046",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "The Third Conchord",
  "description" : "Season One Finale. Murray foists a new bongo-playing band member on Bret and Jemaine, triggering angry dances and mutant half-bands."
}, {
  "imdbId" : "0863046",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "A Good Opportunity",
  "description" : "Season Two premiere. After rejecting Murray for spending too much time with another band, Bret and Jemaine find success managing themselves and land a deal to record an ad jingle; Dave shares his 'double-down' deal strategy."
}, {
  "imdbId" : "0863046",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "New Cup",
  "description" : "Bret and Jemaine's fortunes unravel after Bret buys a new tea cup. With emergency band funds unavailable, Jemaine takes desperate measures in hopes of supplementing their income."
}, {
  "imdbId" : "0863046",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "The Tough Brets",
  "description" : "Bret organizes a gang to protect himself from rappers he dissed in a song; Murray and Jemaine get their feelings hurt by Aussie counterparts; Mel paints a portrait Jemaine can't get rid of."
}, {
  "imdbId" : "0863046",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "Murray Takes It to the Next Level",
  "description" : "Murray tries to elevate Bret and Jemaine on his friendship graph, bringing his questioning pal Jim in on the plan; Mel demands an apology from Bret for inappropriate dream behavior."
}, {
  "imdbId" : "0863046",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "Unnatural Love",
  "description" : "Jemaine starts dating an Australian, to Bret's dismay and inconvenience."
}, {
  "imdbId" : "0863046",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "Love Is a Weapon of Choice",
  "description" : "Bret and Jemaine both fall for a woman whose missing dog has epilepsy, triggering a duel, a canine benefit, and a couple of new tunes."
}, {
  "imdbId" : "0863046",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "Prime Minister",
  "description" : "Foiled by the White House, Murray arranges a presidential meeting for the visiting Prime Minister of New Zealand; a tribute gig ends with Jemaine getting mixed up with an Art Garfunkel fanatic."
}, {
  "imdbId" : "0863046",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "New Zealand Town",
  "description" : "Trying to look cool for a gig at the Grand Opening of New York's one-block New Zealand enclave, the Conchords end up getting hooked on hair gel."
}, {
  "imdbId" : "0863046",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "Wingmen",
  "description" : "Bret enlists Jemaine and Dave to help him try to land a girlfriend; Murray regrets making Greg his scapegoat."
}, {
  "imdbId" : "0863046",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "Evicted",
  "description" : "Season Two finale. Unable to pay off their back rent, Bret and Jermaine move in with Mel and Doug; Murray looks to cash in on a stage play about the Conchords' travails."
}]