[{
  "imdbId" : "2375692",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "I.",
  "description" : "1715: The Golden Age of Piracy. New Providence is a lawless island, controlled by history's most notorious pirate captains. The most feared: Captain Flint."
}, {
  "imdbId" : "2375692",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "II.",
  "description" : "Flint unmasks a thief on his crew. Rackham chases a score over Vane's objection. Silver hides with Max in the brothel. Eleanor faces an impossible choice."
}, {
  "imdbId" : "2375692",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "III.",
  "description" : "Flint and Gates seek a partner to hunt the Urca d'Lima. Silver helps Billy with a morale problem. Vane impresses Eleanor by being reasonable. Gates gets a promotion."
}, {
  "imdbId" : "2375692",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "IV.",
  "description" : "An undertaking by The Walrus crew ends in disaster. Silver warns Flint about Billy. Rackham and Bonny try to regain their livelihood. Eleanor needs help from her father. A figure from Vane's past pays a visit."
}, {
  "imdbId" : "2375692",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "V.",
  "description" : "Flint and his crew of the Walrus play a deadly game of naval warfare when they engage Captain Bryson and the Andromache on the open sea to gain precious cargo. Meanwhile, Richard forces his daughter's hand about his business when he makes an announcement to the locals about his assets being liquidated, causing a mob to riot against Eleanor who seeks help from Hornigold."
}, {
  "imdbId" : "2375692",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "VI.",
  "description" : "The costs of chasing the Andromache continue to mount. Eleanor needs Silver's help. Billy wants Gates to confront Flint. Bonny takes a stand."
}, {
  "imdbId" : "2375692",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "VII.",
  "description" : "Flint tells Gates the truth. Randall puts Silver in a bind. Eleanor suffers a loss. Max comes to Rackham's aid. Vane enters the fight of his life."
}, {
  "imdbId" : "2375692",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "VIII.",
  "description" : "Silver gives Flint the last details of the schedule with the location of the ship. Eleanor's situation changes when the supply ships get sunk in the bay. Meanwhile with Mutiny rising up aboard the Walrus, Gates makes a vital decision."
}, {
  "imdbId" : "2375692",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "IX.",
  "description" : "Flint and Silver face judgment before the crew. Vane enjoys his new position on the island. Max confronts Bonny. Eleanor faces a new threat."
}, {
  "imdbId" : "2375692",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "X.",
  "description" : "Flint gives \"advice\" to Dufresne. John Silver works to become indispensable. Eleanor is called upon to remove Vane from power over the fort. Jack becomes envious of Anne and Max's new relationship."
}, {
  "imdbId" : "2375692",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "XI.",
  "description" : "Flint returns to Nassau to plan the retrieval of the gold. Rackham restores his reputation. Ned Low confronts Vane."
}, {
  "imdbId" : "2375692",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "XII.",
  "description" : "Seeing Flint's steady rise up the ranks leaves Vane feeling like he may be a real threat to his position, and while Eleanor determines which side to choose, elsewhere, Silver and a friend from the past are finally reunited."
}, {
  "imdbId" : "2375692",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "XIII.",
  "description" : "Miranda tries to save the island; Eleanor opens old wounds; Vane deals with a problem."
}, {
  "imdbId" : "2375692",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "XIV.",
  "description" : "Eleanor negotiates for peace; Rackham learns a lesson the hard way; Flint breaks a promise."
}, {
  "imdbId" : "2375692",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "XV.",
  "description" : "Max cleans up following a massacre; Flint and Silver receive surprising news from the outside world."
}, {
  "imdbId" : "2375692",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "XVI.",
  "description" : "Flint and Miranda brace for the worst; Eleanor learns Max's secret; Vane makes his move."
}, {
  "imdbId" : "2375692",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "XVII.",
  "description" : "Flint and Miranda deal with their past; Vane claims a massive prize; Eleanor declares war."
}, {
  "imdbId" : "2375692",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "XVIII.",
  "description" : "Flint receives aid from an unlikely ally; Vane's crew seeks a change; Silver makes a sacrifice."
}, {
  "imdbId" : "2375692",
  "season" : "3",
  "episodeNumber" : "1",
  "title" : "XIX.",
  "description" : "Flint and his crew wage war against the world; Eleanor is offered clemency; Vane takes issue with Rackham's methods; one of Nassau's most notorious individuals returns."
}, {
  "imdbId" : "2375692",
  "season" : "3",
  "episodeNumber" : "2",
  "title" : "XX.",
  "description" : "After declining Captain Hornigold's \"pardons\", Captain Flint and his crew will test their fate; Vane runs into an old friend; Eleanor and Woodes Rogers continue their journey."
}, {
  "imdbId" : "2375692",
  "season" : "3",
  "episodeNumber" : "3",
  "title" : "XXI.",
  "description" : "The conflict between Flint and Silver escalates as starvation and dehydration set in; Woodes and Eleanor arrive to troubling circumstances in Nassau; Blackbeard takes charge of an uncertain situation on the island."
}, {
  "imdbId" : "2375692",
  "season" : "3",
  "episodeNumber" : "4",
  "title" : "XXII.",
  "description" : "Change begins to take root in Nassau; on a strange island, Flint, Silver and Billy are unified against a common adversary; Blackbeard and Vane formulate a plan of escape."
}, {
  "imdbId" : "2375692",
  "season" : "3",
  "episodeNumber" : "5",
  "title" : "XXIII.",
  "description" : "Vane finds a new way forward from Teach; Silver urges Flint to make a move or die; Eleanor and Rogers respond to a new threat."
}, {
  "imdbId" : "2375692",
  "season" : "3",
  "episodeNumber" : "6",
  "title" : "XXIV.",
  "description" : "Flint and Teach clash over the future of piracy; Rogers makes an arrest; Rackham finds new purpose. Madi comes to Silver's aid."
}, {
  "imdbId" : "2375692",
  "season" : "3",
  "episodeNumber" : "7",
  "title" : "XXV.",
  "description" : "Captain Flint and Silver returns to Nassau to finish what they started and a legend is born. With Rackham's fate in the hands of Rogers, his future looks grim. Vane's mission evolves while Eleanor confides in Rogers."
}, {
  "imdbId" : "2375692",
  "season" : "3",
  "episodeNumber" : "8",
  "title" : "XXVI.",
  "description" : "Rogers is attacked during a prisoner transport; Vane and Bonny race to save Rackham; the Walrus and her crew come under siege."
}, {
  "imdbId" : "2375692",
  "season" : "3",
  "episodeNumber" : "9",
  "title" : "XXVII.",
  "description" : "Captain Flint prepares for the final battle, while Billy tries to save Captain Vane from being hanged; Max must decide who she can trust; Eleanor Guthrie finds herself in charge of Nassau."
}, {
  "imdbId" : "2375692",
  "season" : "3",
  "episodeNumber" : "10",
  "title" : "XXVIII.",
  "description" : "Hornigold and the British come for the pirates; Rackham and Bonny face impossible odds; Silver demands answers from Flint; Billy crowns a king."
}, {
  "imdbId" : "2375692",
  "season" : "4",
  "episodeNumber" : "1",
  "title" : "XXIX.",
  "description" : "Flint and Silver lead the fight to reclaim Nassau; Jack and Blackbeard seek vengeance; Eleanor attempts to reconcile herself to her new role."
}, {
  "imdbId" : "2375692",
  "season" : "4",
  "episodeNumber" : "2",
  "title" : "XXX.",
  "description" : "Flint submits himself to Billy's authority; Eleanor tries to find a way to save Rogers; Silver is forced to become the leader of the war to reclaim Nassau."
}, {
  "imdbId" : "2375692",
  "season" : "4",
  "episodeNumber" : "3",
  "title" : "XXXI.",
  "description" : "Max runs afoul of the law. Rogers reckons with his past. Flint and Madi reach an understanding. Long John Silver makes his return."
}, {
  "imdbId" : "2375692",
  "season" : "4",
  "episodeNumber" : "4",
  "title" : "XXXII.",
  "description" : "The streets of Nassau become embroiled in violent strife; Silver demands answers from Billy; Eleanor tries to help Max; Bonny and Rackham suffer a traumatic experience."
}, {
  "imdbId" : "2375692",
  "season" : "4",
  "episodeNumber" : "5",
  "title" : "XXXIII.",
  "description" : "Silver places Flint's survival in his own hands; Billy sows further dissonance; Eleanor jeopardizes everyone and everything to ensure her victory; Rogers orchestrates a seemingly effective appeal."
}, {
  "imdbId" : "2375692",
  "season" : "4",
  "episodeNumber" : "6",
  "title" : "XXXIV.",
  "description" : "Spain invades Nassau without much resistance; Silver tries to fix relations between the pirates and the former slaves; Flint and Eleanor work together to survive the Spanish invasion."
}, {
  "imdbId" : "2375692",
  "season" : "4",
  "episodeNumber" : "7",
  "title" : "XXXV.",
  "description" : "Flint urges Silver to exercise more caution; Max shows Jack and Anne how to get upriver; Billy meets a survivor; Rogers discovers the truth."
}, {
  "imdbId" : "2375692",
  "season" : "4",
  "episodeNumber" : "8",
  "title" : "XXXVI.",
  "description" : "Flint and Silver's relationship threatens to collapse during a rescue mission; Max discovers the true cost of freedom; Rackham pursues his target."
}, {
  "imdbId" : "2375692",
  "season" : "4",
  "episodeNumber" : "9",
  "title" : "XXXVII.",
  "description" : "Silver and his crew travel to Skeleton Island in pursuit of Flint; Madi is presented with a proposition; Rogers struggles to hear Eleanor; Billy commits himself to the group."
}, {
  "imdbId" : "2375692",
  "season" : "4",
  "episodeNumber" : "10",
  "title" : "XXXVIII.",
  "description" : "Flint launches a final, desperate attack to destroy England's hold on Nassau; Silver makes an irreversible decision; Rackham confronts Rogers; Nassau is forever changed."
}]