[{
  "imdbId" : "4378456",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "A Suitable Donor",
  "description" : "After Jimmy Pritchard is killed in a robbery at his son's home, Pritchard is brought back to life in the body of a younger man by a billionaire and a bioengineer."
}, {
  "imdbId" : "4378456",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "One More Notch",
  "description" : "Due to the power surge that Mary and Otto caused in bringing Pritchard back to life, two notorious murderers escape from prison. Still determined that this is his city to protect, Pritchard goes on the hunt for them, and Mary - who believes she's partially responsible for the fugitives' escape - offers assistance. Meanwhile, in order to win Duval's trust, Pritchard tells him they're half-brothers."
}, {
  "imdbId" : "4378456",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "From Darkness, the Sun",
  "description" : "Pritchard tries to prove to Duval that he was a better police officer and man than his son ever knew. Meanwhile, he and Duval go up against a deadly psycho and another father-son duo that is out to cause trouble."
}, {
  "imdbId" : "4378456",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Admissions",
  "description" : "A case from the past comes back into play as Pritchard and Duval investigate a series of murders involving young prodigies. As the investigation unravels, Duval comes to terms with the possibility that Pritchard could be his father reincarnated."
}, {
  "imdbId" : "4378456",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Scratch That Glitch",
  "description" : "Mary's life is in danger when a dead pool predicts her death for the same day as an important Lookinglass product launch. Meanwhile, when Pritchard is needed the most, he fails to show up and winds up in the hospital after a near fatal brawl. After Pritchard's hospitalization, Otto begins to find glitches in Pritchard's code that might not only drastically change Pritchard, but Mary, as well."
}, {
  "imdbId" : "4378456",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Palimpsest",
  "description" : "A killer that mangles his victims beyond recognition is on the loose. Meanwhile, Otto becomes jealous of the growing bond between Pritchard and his sister and considers finding another donor."
}, {
  "imdbId" : "4378456",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "That Time in the Car",
  "description" : "Duval's sister, is dating Wally, a parole officer, whom she's known since high school. Pritchard never liked him and must hide his distrust. However, he and Duval discover Wally involved in a possible prison break."
}, {
  "imdbId" : "4378456",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "May Old Acquaintance Be Forgot",
  "description" : "Pritchard's past comes back to haunt him. 20 years ago, Pritchard covered up a murder committed by a drug lord's girlfriend, who happened to be his confidential informant at the time. Instead of staying on the right side of the law after Pritchard helped her elude the crime. 20 years later she has turned into a major drug lord."
}, {
  "imdbId" : "4378456",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "When You Have to Go There, They Have to Take You In",
  "description" : "Prichard and Duval join forces to track down a serial killer, and Alexa and Connor (guest star Adan Canto) try to procure key technology from Lookinglass."
}, {
  "imdbId" : "4378456",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "Geworfenheit",
  "description" : "Pritchard and Duval continue to investigate who Albert Lin really is, who created him and try to uncover how he is involved in a string of murders. The investigation drives a wedge between Mary and Otto, and Otto must choose if he will betray Mary and undo everything they have built."
}, {
  "imdbId" : "4378456",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "Gelassenheit",
  "description" : "Pritchard and Duval race against the clock to save Gracie from Connor and Otto's life-threatening experiment. But time is quickly running out for Pritchard, as well, since there is no tank in which he can regenerate. Meanwhile, Mary, with the help of Alexa, does everything she can to try and unlock the code to save Pritchard's life before it's too late, and Otto wrestles with his conscience and the decisions he's made that have changed lives forever."
}]