[{
  "imdbId" : "5511582",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Pilot",
  "description" : "An unlikely team must travel through time and stop a criminal mastermind from destroying the past."
}, {
  "imdbId" : "5511582",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "The Assassination of Abraham Lincoln",
  "description" : "The team debates whether to prevent Abraham Lincoln's assassination when they learn that Flynn has ties to John Wilkes Booth."
}, {
  "imdbId" : "5511582",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Atomic City",
  "description" : "The team tracks Flynn to 1962 Las Vegas where they end up on the run with the era's most infamous mistress."
}, {
  "imdbId" : "5511582",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Party at Castle Varlar",
  "description" : "The team continues its search for Garcia Flynn in Nazi Germany during WWII, where they receive help from Ian Fleming, the creator of James Bond."
}, {
  "imdbId" : "5511582",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "The Alamo",
  "description" : "The team learns about courage at the Battle of the Alamo."
}, {
  "imdbId" : "5511582",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "The Watergate Tape",
  "description" : "As the team goes after Flynn in 1972, tensions rise among the team as secrets are revealed."
}, {
  "imdbId" : "5511582",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Stranded",
  "description" : "The Team gets stranded in 1754 after the Lifeboat gets damaged."
}, {
  "imdbId" : "5511582",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Space Race",
  "description" : "As the historic Apollo 11 mission unfolds, the team needs to summon courage as they reach out to an unsung hero to thwart Flynn's scheme."
}, {
  "imdbId" : "5511582",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "Last Ride of Bonnie & Clyde",
  "description" : "The team evades justice with Bonnie and Clyde while they find out Flynn's target in the Depression-era South."
}, {
  "imdbId" : "5511582",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "The Capture of Benedict Arnold",
  "description" : "The team questions whether they've been fighting on the wrong side when they encounter Benedict Arnold during the American Revolution."
}, {
  "imdbId" : "5511582",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "The World's Columbian Exposition",
  "description" : "Lucy's situation grows desperate after she's taken captive by Flynn and brought to the 1893 Chicago World's Fair. In their dogged pursuit of Lucy, Wyatt and Rufus fall into a sinister trap."
}, {
  "imdbId" : "5511582",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "The Murder of Jesse James",
  "description" : "Flynn joins forces with legendary outlaw Jesse James, and the two create bloody havoc across the American frontier. Cut to Lucy, Wyatt and Rufus, who team up with a notable marshal to bring the fugitives to justice."
}, {
  "imdbId" : "5511582",
  "season" : "1",
  "episodeNumber" : "13",
  "title" : "Karma Chameleon",
  "description" : "Wyatt and Rufus go rogue by traveling back to the 1980s in a desperate bid to save Jessica's life. Lucy covers for them in the present as Agent Christopher discovers the ship is missing."
}, {
  "imdbId" : "5511582",
  "season" : "1",
  "episodeNumber" : "14",
  "title" : "The Lost Generation",
  "description" : "As Lucy grapples with her newfound identity, Flynn disappears to 1927 France on the day that Charles Lindbergh completes his transatlantic flight. Now, Rufus, Lucy and their new soldier scramble through the City of Lights and team with young reporter, Ernest Hemingway, to keep history intact."
}, {
  "imdbId" : "5511582",
  "season" : "1",
  "episodeNumber" : "15",
  "title" : "Public Enemy No. 1",
  "description" : "Flynn lands in 1931 Chicago to call in a favor from Al Capone, so the trio enlists the help of Eliot Ness. They also find a clue that reveals something crucial about Rittenhouse."
}, {
  "imdbId" : "5511582",
  "season" : "1",
  "episodeNumber" : "16",
  "title" : "The Red Scare",
  "description" : "The team chases Flynn to 1954 en route to a once-in-a-generation meeting of Rittenhouse leaders."
}, {
  "imdbId" : "5511582",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "The War to End All Wars",
  "description" : "After barely escaping an explosion at Mason Industries, Wyatt (Matt Lanter) and Rufus (Malcolm Barrett) chase the Mothership back to a French battlefront during World War 1 to rescue Lucy (Abigail Spencer) from Rittenhouse. There, they discover that Lucy has recruited Marie Curie, the famous French scientist and the only person ever to win two Nobel Prizes, to help save the life of a wounded American soldier, only to learn that the soldier is Lucy's own great-grandfather who Rittenhouse is bringing to the present to be their leader."
}, {
  "imdbId" : "5511582",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "The Darlington 500",
  "description" : "The Time Team chases Rittenhouse to a stock car race in the 1950s where Wyatt learns that his favorite race car driver is actually a Rittenhouse sleeper agent on a mission to destroy the American car industry. To stop the Rittenhouse plan, Wyatt, Lucy and Rufus team up with Wendell Scott, the first African-American NASCAR driver."
}, {
  "imdbId" : "5511582",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "Hollywoodland",
  "description" : "When a Rittenhouse sleeper agent in 1941 Hollywood steals the only copy of Citizen Kane, Lucy, Wyatt and Rufus team up with Hedy Lamarr to get it back. Hedy Lamarr turns out to be not only a glamorous movie star but also a scientific wizard whose discoveries led to the invention of Wi-Fi."
}, {
  "imdbId" : "5511582",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "The Salem Witch Hunt",
  "description" : "While Wyatt sneaks away from the bunker to face an unbelievable truth, Lucy, Rufus and their former enemy-turned- teammate, Garcia Flynn, chase the Mothership to the Salem Witch Trials."
}, {
  "imdbId" : "5511582",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "The Kennedy Curse",
  "description" : "Wyatt and Rufus bring a 17 year-old John F. Kennedy to the present when a mission goes awry."
}, {
  "imdbId" : "5511582",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "The King of the Delta Blues",
  "description" : "When Rufus and Jiya add a fourth seat to the Lifeboat, for the first time ever, Connor Mason joins the team as they travel back to the dusty backroads and smoky juke joints of the Depression-era South to rescue the life and legacy of Robert Johnson, who, legend has it, bought his musical genius from the devil for the price of his soul. Meanwhile, Agent Christopher keeps Wyatt in the present to execute a dangerous raid on Rittenhouse headquarters."
}, {
  "imdbId" : "5511582",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "Mrs. Sherlock Holmes",
  "description" : "In 1919 New York, the Time Team partners with a female crime solver to prove the innocence of a suffragette who's been framed for murder."
}, {
  "imdbId" : "5511582",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "The Day Reagan Was Shot",
  "description" : "The Time Team travels back to 1981 Washington D.C. on the day President Reagan was shot, only to discover that the Sleeper's target isn't the President, but a young rookie police officer, none other than Agent Christopher."
}, {
  "imdbId" : "5511582",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "The General",
  "description" : "The team partners with Harriet Tubman to thwart Rittenhouse's plan to alter the outcome of the Civil War."
}, {
  "imdbId" : "5511582",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "Chinatown",
  "description" : "Jiya escapes from Rittenhouse but is stranded in 1888 with no way home; the fractured team goes back to save her."
}, {
  "imdbId" : "5511582",
  "season" : "2",
  "episodeNumber" : "11",
  "title" : "The Miracle of Christmas Part I/II",
  "description" : "With a little help from their future selves, Lucy and Wyatt, along with the rest of the team, journey to the California Gold Rush and the Korean War's Hungnam evacuation in a daring bid to save Rufus and stop Rittenhouse once and for all."
}]
