[{
  "imdbId" : "0058855",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "The Night of the Inferno",
  "description" : "President Grant, beset by problems, recalls his top troubleshooter James West to service. West and his partner Artemus Gordon must discover why Juan Manolo has staged a series of raids in the southwest territories. Sending the army might cause a war, but a pair of low key troubleshooters might be able to solve the problem."
}, {
  "imdbId" : "0058855",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "The Night of the Deadly Bed",
  "description" : "West arrives to meet an informant. Before he can, an attempt is made on his life and the informant is blown up! The man's dying word, \"Flory,\" is West's only clue to a plot that just might rewrite the map south of the Mexican border, and threaten the future of the United States..."
}, {
  "imdbId" : "0058855",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "The Night the Wizard Shook the Earth",
  "description" : "West and Gordon must help Professor Neilsen reach Washington with his invention - a new and extremely powerful explosive. But a diminutive genius has ambitions of his own, and they require the professor's death. When the professor dies, West and Gordon must discover his killer before the madman's plans unfold and Professor Neilsen has a lot of company."
}, {
  "imdbId" : "0058855",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "The Night of Sudden Death",
  "description" : "Black clad men clamber over each other and up the wall to a high window, entering the United States Mint at Carson City. They plant a bomb and leave without taking any of the money. Jim West and Artemus Gordon must learn why they broken in and who masterminded the plot before economic chaos overtakes the United States."
}, {
  "imdbId" : "0058855",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Night of the Casual Killer",
  "description" : "John Maxwell Avery advised the President and led powerful men in Washington. Then he was discovered to be a political opportunist and a scoundrel. He fled Washington and rumor has it the President helped him do it. He has killed many many to keep his freedom. To avert a scandal the President sends Jim and Artie, the only men who can capture Avery and return him for trial."
}, {
  "imdbId" : "0058855",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "The Night of a Thousand Eyes",
  "description" : "After several ships are lost with all aboard, Jim and Arte's investigation leads them to a blind former river boat captain who wants complete domination of the American rivers."
}, {
  "imdbId" : "0058855",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "The Night of the Glowing Corpse",
  "description" : "During the Franco-Prussian War, the French entrust their newest scientific breakthrough, Franconium, to the care of the United States to keep Prussian agents from it. Deadly in the smallest quantities, the chemical must be protected. Before it can be debuted to the American scientific community thieves steal it; Jim and Artie must recover it before the thieves escape the country with their toxic treasure."
}, {
  "imdbId" : "0058855",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "The Night of the Dancing Death",
  "description" : "Jim and Artie must ensure Princess Gina reaches the Albanian embassy safely. So when the carriage arrives, they breathe a sign of relief - until Ambassador Perkins, a long time friend of the princess, tells them the passenger in the coach is not Her Highness! Jim and Artie must discover where and how the princess was intercepted, whether she is still alive, and if she is, rescue her. But a mysterious organization has other plans."
}, {
  "imdbId" : "0058855",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "The Night of the Double-Edged Knife",
  "description" : "Jim is dispatched to find the killers of gandy dancers."
}, {
  "imdbId" : "0058855",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "The Night That Terror Stalked the Town",
  "description" : "Dr. Loveless imprisons Jim and surgically creates his double called a doppelganger, code-named Janus. Arte must find Jim and uncover the truth behind the warped scheme."
}, {
  "imdbId" : "0058855",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "The Night of the Red-Eyed Madmen",
  "description" : "A madman with a private army and an unusual political philosophy has designs on the Southwestern United States! His tactics are simple: superiority of individual soldiers, supported by subterfuge, will win the day, ensuring the land is ruled by the 'right kind of people.' And he might be right: his soldiers are as well trained as Jim West! If Jim and Artie cannot infiltrate his camp and put a stop to his plans, the United States may lose a good chunk of its land..."
}, {
  "imdbId" : "0058855",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "The Night of the Human Trigger",
  "description" : "Jim and Arte investigate a rash of earthquakes. They discover a mad scientist named Professor Orkney Cadwallader is using nitroglycerin to set off the disasters."
}, {
  "imdbId" : "0058855",
  "season" : "1",
  "episodeNumber" : "13",
  "title" : "The Night of the Torture Chamber",
  "description" : "Governor Bradford of California dispatches a letter to President Grant. He requests assistance, and Grant obliges by dispatching his two top agents, West and Gordon. It seems there is a conspiracy to take over the state government and the governor needs protection to stay alive long enough to discover and punish the perpetrators. But as time goes by and attempts are made against the agents' lives and not the governor's, Jim begins to smell a rat. There's something about the painting that hangs on the wall behind the governor's desk, and when Jim realizes what it is, ..."
}, {
  "imdbId" : "0058855",
  "season" : "1",
  "episodeNumber" : "14",
  "title" : "The Night of the Howling Light",
  "description" : "Jim and Arte must deliver a message of peace to Chief Ho-Tami, head of the Indian tribes. Dr. Arcularis captures Jim in an attempt to stop the treaty signing."
}, {
  "imdbId" : "0058855",
  "season" : "1",
  "episodeNumber" : "15",
  "title" : "The Night of the Fatal Trap",
  "description" : "Jim goes undercover as an outlaw to stop Mexican bandits, led by the ruthless Colonel Vasquez, from terrorizing US towns along the border."
}, {
  "imdbId" : "0058855",
  "season" : "1",
  "episodeNumber" : "16",
  "title" : "The Night of the Steel Assassin",
  "description" : "Jim and Arte must stop Torres-a man more metal than flesh, with superhuman strength and a taste for revenge-from killing President Grant."
}, {
  "imdbId" : "0058855",
  "season" : "1",
  "episodeNumber" : "17",
  "title" : "The Night the Dragon Screamed",
  "description" : "Jim must return a princess to the Hunan throne in China and save Arte from the deadly grip of two warring Chinese opium smuggling rings."
}, {
  "imdbId" : "0058855",
  "season" : "1",
  "episodeNumber" : "18",
  "title" : "The Night of the Grand Emir",
  "description" : "Jim and Arte try to protect the Grand Emir of the Ottoman Empire from members of an assassin's club who have set their sights on his murder."
}, {
  "imdbId" : "0058855",
  "season" : "1",
  "episodeNumber" : "19",
  "title" : "The Night of the Flaming Ghost",
  "description" : "Jim and Arte follow the trail of stolen kerosene and sulfur to Harpers Ferry, where they find an 1870's version of John Brown wielding an instrument of doom."
}, {
  "imdbId" : "0058855",
  "season" : "1",
  "episodeNumber" : "20",
  "title" : "The Night of the Whirring Death",
  "description" : "Jim and Arte serve as couriers, delivering bribes to save California from bankruptcy. Problem is, Doctor Loveless is killing the benefactors and stealing their money."
}, {
  "imdbId" : "0058855",
  "season" : "1",
  "episodeNumber" : "21",
  "title" : "The Night of the Puppeteer",
  "description" : "The mad puppeteer Zachariah Skull re-creates a courtroom drama, using life-size puppets, to seek revenge on both Jim and the Supreme Court Justices who sentenced him to death."
}, {
  "imdbId" : "0058855",
  "season" : "1",
  "episodeNumber" : "22",
  "title" : "The Night of the Bars of Hell",
  "description" : "Jim goes undercover as a prison inspector to investigate a local prison. When Jim is sentenced to die in the electric chair, Arte poses as the executioner to save him."
}, {
  "imdbId" : "0058855",
  "season" : "1",
  "episodeNumber" : "23",
  "title" : "The Night of the Two-Legged Buffalo",
  "description" : "Jim and Arte are assigned to protect a South Seas Coral Island Prince from assassins who threaten the signing of a treaty with United States."
}, {
  "imdbId" : "0058855",
  "season" : "1",
  "episodeNumber" : "24",
  "title" : "The Night of the Druid's Blood",
  "description" : "Jim and Arte investigate an evil magician and an attractive young woman's connection to the murders of distinguished scientists."
}, {
  "imdbId" : "0058855",
  "season" : "1",
  "episodeNumber" : "25",
  "title" : "The Night of the Freebooters",
  "description" : "Jim poses as a hired gunman, and Arte as a corrupt colonel, to infiltrate a renegade army led by Thorwald Wolf, who plans to conquer Mexico's Baja California."
}, {
  "imdbId" : "0058855",
  "season" : "1",
  "episodeNumber" : "26",
  "title" : "The Night of the Burning Diamond",
  "description" : "Jim and Arte investigate the disappearance of the Kara diamond. They discover a sinister plot by Morgan Midas to use the stone to create an invisibility potion."
}, {
  "imdbId" : "0058855",
  "season" : "1",
  "episodeNumber" : "27",
  "title" : "The Night of the Murderous Spring",
  "description" : "Jim succumbs to a hallucinogenic powder created by Dr. Loveless, who intends to create mass hysteria by polluting the country's water supply so he can rule the world."
}, {
  "imdbId" : "0058855",
  "season" : "1",
  "episodeNumber" : "28",
  "title" : "The Night of the Sudden Plague",
  "description" : "As Jim West and Artemus Gordon ride into the mysteriously quiet town of Willow Springs, they notice that the citizens are all paralyzed and the bank has been robbed. When they visit a nearby town to investigate this bizarre occurrence, the agents discover a mad professor breeding bacteria for a serum that causes temporary paralysis."
}, {
  "imdbId" : "0058855",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "The Night of the Eccentrics",
  "description" : "Agents West and Gordon are notified by another agent about an assassination plot against President Juarez of Mexico. Later, they find the agent dead with a knife in his back through a flyer for the Echo Amusement Park. When West arrives at the deserted amusement park, he meets Count Manzeppi, master of trickery and corruption. Manzeppi captures West and force him to help kill the Mexican President. First, he must kill his partner and best friend, Artemus Gordon."
}, {
  "imdbId" : "0058855",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "The Night of the Golden Cobra",
  "description" : "The Indian Commissioner of the Pawnee Indians recruits James West to investigate the strange occurrences at the reservation. In his search, West is bitten by a cobra snake rendering him unconscious. When he awakens, Jim finds himself in the palace of the Maharajah of Rampor, also known as Mr. Singh."
}, {
  "imdbId" : "0058855",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "The Night of the Raven",
  "description" : "Agents West and Gordon are engaged to rescue an Indian Chief's abducted daughter before the Indians retaliate. The agents learn that the miniature Dr. Miguelito Loveless, responsible for the kidnapping, has a plan to rule a land of little people, with the help of a powder he invented to reduce the size of people. During the rescue mission, Loveless shrinks Jim and the Indian Princess to a height of six inches, leaving them to defend themselves from the mad doctor's now gigantic cat."
}, {
  "imdbId" : "0058855",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "The Night of the Big Blast",
  "description" : "Dr. Faustina and her mute servant, Miklos, have transformed a corpse into a duplicate image of Jim West. When they bring the corpse back to life, Faustina's plot is to have West look-alike gain entry to a meeting of the President's cabinet to kill four of the members."
}, {
  "imdbId" : "0058855",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "The Night of the Returning Dead",
  "description" : "Agents West and Gordon are called to investigate a mysterious Confederate night rider who comes to the ranch of Carl Jackson, its wealthy owner. When the agents are charged by the ghost rider, they discover that the rider's appearance coincides with the stable boy's eerie flute music. West and Gordon soon learn that Jeremiah, the stable boy, has been living with a secret since his childhood, but others are trying their best to keep the agents from discovering the truth."
}, {
  "imdbId" : "0058855",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "The Night of the Flying Pie Plate",
  "description" : "Agent James West is protecting a shipment of gold en route to an Arizona town when he sees a flaming light in the sky and hears a loud crash. West and the townspeople discover that a spaceship has landed and they witness three green women, resembling Martians, coming out of the ship. Apparently, the women want to trade the precious gems on their clothing for gold, which will be used as fuel for their spaceship's return trip. Artemus Gordon, posing as an expert jeweler, senses a scam as he examines one of the gems."
}, {
  "imdbId" : "0058855",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "The Night of the Poisonous Posey",
  "description" : "While on vacation, West and Gordon wander into the town of Justice, Nevada. After an unexpectedly exciting greeting by the citizens, they start to notice an unusual number of infamous international criminals around town. Artie goes undercover to investigate this mysterious gathering while Jim gets into trouble confronting the villains directly."
}, {
  "imdbId" : "0058855",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "The Night of the Bottomless Pit",
  "description" : "The assignment for James West is to find a fellow agent who is imprisoned on Devil's Island. Getting imprisoned himself, West is given lashes and sent into a pit where he finds Vincent Reed, the agent he was to free."
}, {
  "imdbId" : "0058855",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "The Night of the Watery Death",
  "description" : "While at the Mermaid Bar, Agent James West is shot with a blow dart by a woman disguised as a Mermaid. When he comes to, West finds himself aboard a ship, where he meets an unusual woman with a mysterious compact. Suddenly, the ship is attacked by a fire breathing dragon and ship explodes. After floating to shore, Jim meets Arte and they unveil the secrets of a new weapon: a dragon-like torpedo attracted to a homing device in a woman's compact. Together they must find the weapon before a government ship, loaded with a cargo of explosives, arrives in the San Francisco ..."
}, {
  "imdbId" : "0058855",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "The Night of the Green Terror",
  "description" : "As they ride through the forest, Jim West and Artemus Gordon notice the unusual lack of vegetation and animal life. They are suddenly approached by a giant knight who takes them to a large tent. There, West and Gordon meet a miniature Robin Hood, who is really the evil Dr. Miguelito Loveless in disguise. Loveless wants to control the Indians as he starves them by killing their food with his lethal green powder."
}, {
  "imdbId" : "0058855",
  "season" : "2",
  "episodeNumber" : "11",
  "title" : "The Night of the Ready-Made Corpse",
  "description" : "Agents West and Gordon are assigned to guard foreign dictator Colonel Pellargo but are foiled by a clever assassin who himself shows up dead only a few days later. However, the disappearance of a local Irishman into Fabian Lavendor's funeral parlor piques the agents' curiosity -- and the cut-and-dried assassination becomes a far more complex intrigue."
}, {
  "imdbId" : "0058855",
  "season" : "2",
  "episodeNumber" : "12",
  "title" : "The Night of the Man-Eating House",
  "description" : "Agents West and Gordon are sent to transport a prisoner to the hospital after the prisoner spent nearly thirty years in solitary confinement for treason. Looking for a place to spend the night, the men come upon a deserted mansion whose doors mysteriously swing wide open for the travelers and slam shut once they enter. As night approaches, the men begin to hear a crying woman but they can not find its source."
}, {
  "imdbId" : "0058855",
  "season" : "2",
  "episodeNumber" : "13",
  "title" : "The Night of the Skulls",
  "description" : "Jim pretends to kill Arte. Now, posing as a wanted man, Jim infiltrates a murderous clan, where he uncovers a plot to assassinate President Grant."
}, {
  "imdbId" : "0058855",
  "season" : "2",
  "episodeNumber" : "14",
  "title" : "The Night of the Infernal Machine",
  "description" : "At a judges' conference in the West, the power-crazed Judge M'Guigan plots against the Federal judiciary."
}, {
  "imdbId" : "0058855",
  "season" : "2",
  "episodeNumber" : "15",
  "title" : "The Night of the Lord of Limbo",
  "description" : "When a magician makes Arte disappear, Jim must travel to another dimension to find him. What his journey back in time reveals is a plot to change the outcome of the Civil War."
}, {
  "imdbId" : "0058855",
  "season" : "2",
  "episodeNumber" : "16",
  "title" : "The Night of the Tottering Tontine",
  "description" : "Jim and Arte must protect a key member of a wealthy investment group whose surviving member stands to inherit the group's sizable assets."
}, {
  "imdbId" : "0058855",
  "season" : "2",
  "episodeNumber" : "17",
  "title" : "The Night of the Feathered Fury",
  "description" : "Special Agents Jim West and Artemus Gordon meet a mysterious woman with a toy chicken who has important information about the dastardly Count Manzeppi. West and Gordon notice the Count, disguised as an organ grinder, outside their window, when a monkey tosses in a smoke bomb. When the smoke clears, the woman is gone but the toy chicken remains. Manzeppi is after the chicken which contains the mystical Philosopher's Stone. The stone will turn anything near it to gold in the light of a full moon."
}, {
  "imdbId" : "0058855",
  "season" : "2",
  "episodeNumber" : "18",
  "title" : "The Night of the Gypsy Peril",
  "description" : "Jim and Arte infiltrate a gypsy camp and join their circus to unravel an extortion plot against the US involving a stolen elephant."
}, {
  "imdbId" : "0058855",
  "season" : "2",
  "episodeNumber" : "19",
  "title" : "The Night of the Tartar",
  "description" : "By order of President Grant, Agents James West and Artemus Gordon must bring Russian prisoner Rimsky to Vladivostok, Siberia, in exchange for American Vice Consul, Millard Boyer. When he tries to escape, Rimsky falls to his death forcing Gordon to disguise himself as Rimsky to complete the exchange. The Russian contact arranging the exchange has West and Gordon imprisoned with the Vice Consul instead. There, they learn that Rimsky should have returned with 5 million dollars in extortion money from wealthy Russian immigrants. Now, the corrupt Russians are waiting for ..."
}, {
  "imdbId" : "0058855",
  "season" : "2",
  "episodeNumber" : "20",
  "title" : "The Night of the Vicious Valentine",
  "description" : "To warn some of the country's wealthiest men about recurrent murders, Agents West and Gordon visit Curtis Dodd, who could become the next victim. Dodd, who is playing the piano, is killed as a lethal spear is fired from the piano keys. Through a series of clues, West and Gordon realize that murdered men were all married to younger women whose marriages were arranged by matchmaker Emma Valentine."
}, {
  "imdbId" : "0058855",
  "season" : "2",
  "episodeNumber" : "21",
  "title" : "The Night of the Brain",
  "description" : "Jim and Arte investigate the early predictions of a friend's death. Before they can warn the next victim, they discover a plot underway to murder all the world leaders and replace them with look-alikes."
}, {
  "imdbId" : "0058855",
  "season" : "2",
  "episodeNumber" : "22",
  "title" : "The Night of the Deadly Bubble",
  "description" : "Investigating a series of mysterious tidal waves, West and Gordon find a fanatical marine environmentalist."
}, {
  "imdbId" : "0058855",
  "season" : "2",
  "episodeNumber" : "23",
  "title" : "The Night of the Surreal McCoy",
  "description" : "Agents West and Gordon are guarding a museum containing the famous Herzberg jewels but someone still manages to steal the gems. Afterwards, a famous painting of Western scene is removed from the museum by its wealthy rancher-owner. Gordon becomes suspicious and notifies West who discovers that the rancher is partners with Miguelito Loveless, the evil inventor-doctor."
}, {
  "imdbId" : "0058855",
  "season" : "2",
  "episodeNumber" : "24",
  "title" : "The Night of the Colonel's Ghost",
  "description" : "President Grant wants to go to Gibsonville to dedicate the statue of an officer under his command during the Civil War. James West travels ahead to ensure it's safe for the President. West finds Gibsonville is now a ghost town and is experiencing an \"epidemic\" of broken necks. The few residents left are seeking buried gold -- and the number of bodies is rising."
}, {
  "imdbId" : "0058855",
  "season" : "2",
  "episodeNumber" : "25",
  "title" : "The Night of the Deadly Blossom",
  "description" : "Jim and Arte must stop a deadly plot to kill a Hawaiian King on the high seas."
}, {
  "imdbId" : "0058855",
  "season" : "2",
  "episodeNumber" : "26",
  "title" : "The Night of the Cadre",
  "description" : "Jim and Arte blow the whistle on a plot devised by a criminal mastermind to implant a crystal in President Grant's head, to control him, so he can become dictator of the US."
}, {
  "imdbId" : "0058855",
  "season" : "2",
  "episodeNumber" : "27",
  "title" : "The Night of the Wolf",
  "description" : "Jim and Arte are assigned to protect a soon to be crowned King. But first, they must stop a kidnapping plot to force him to renounce his throne."
}, {
  "imdbId" : "0058855",
  "season" : "2",
  "episodeNumber" : "28",
  "title" : "The Night of the Bogus Bandits",
  "description" : "The miniature maniacal Miguelito Loveless is landing his bandits into small bank robberies, then he burns the money. It seems Loveless has bigger plans and is only using these stunts as training for his gang. When one bandits spends some of the charred money, agents West and Gordon are sent to investigate. West follows the clues back to Loveless who brags about his big plans by showing West his training models. An arsenal, a prison and a U.S. Treasury Office are his real targets!"
}, {
  "imdbId" : "0058855",
  "season" : "3",
  "episodeNumber" : "1",
  "title" : "The Night of the Bubbling Death",
  "description" : "The United States Constitution is stolen by a revolutionary and agents James West and Artemus Gordon are sent by the government to recover it. Arriving at a Mexican border town, the agents penetrate an installation under a fortress to find the priceless document. When the agents find the revolutionary, he demands one million dollars for what is later discovered to be a forgery of the Constitution. Before forcing the revolutionary into a pool of acid, they are told a riddle that leads them to the hiding place of the real document."
}, {
  "imdbId" : "0058855",
  "season" : "3",
  "episodeNumber" : "2",
  "title" : "The Night of the Firebrand",
  "description" : "Sent by President Grant, Jim West travels to Fort Savage and finds outlaw Sean O'Reilley in charge trying to incite a revolution in Canada. Gordon infiltrates the revolutionaries and finds West held captive."
}, {
  "imdbId" : "0058855",
  "season" : "3",
  "episodeNumber" : "3",
  "title" : "The Night of the Assassin",
  "description" : "West and Gordon accompany the Ambassador to Mexico who's trying to establish diplomatic ties with them which has not been going so well. They attend a festival wherein the Mexican President makes an appearance while riding in his carriage. West sees a sniper so he throws a wrench in the plan. He and Gordon try to get the shooter but he gets away but they get the his accomplice whom they recognize as an American criminal. They keep the Mexicans from finding him because as mentioned the Ambassador's mission has not been going well and if word gets out that an American ..."
}, {
  "imdbId" : "0058855",
  "season" : "3",
  "episodeNumber" : "4",
  "title" : "The Night Dr. Loveless Died",
  "description" : "Special agents West and Gordon are sent to the mortuary to identify the body of their arch enemy, Dr. Miguelito Loveless. A mourner at the morgue takes a key from the wrist of the corpse and West traces it back to a safe deposit box containing instructions to contact an attorney. When West makes contact, he also meets Dr. Leibknicht, the look-alike relative of Loveless."
}, {
  "imdbId" : "0058855",
  "season" : "3",
  "episodeNumber" : "5",
  "title" : "The Night of Jack O'Diamonds",
  "description" : "West and Gordon are sent to escort a horse, a gift from President Grant, to the Mexican government. The horse is stolen, however, and the two work to recover the lost gift before a diplomatic incident occurs."
}, {
  "imdbId" : "0058855",
  "season" : "3",
  "episodeNumber" : "6",
  "title" : "The Night of the Samurai",
  "description" : "A valuable samurai sword being returned to a Japanese prince by the United States' government is stolen and must be found by Jim and Artemus before the prince leaves the next day."
}, {
  "imdbId" : "0058855",
  "season" : "3",
  "episodeNumber" : "7",
  "title" : "The Night of the Hangman",
  "description" : "Jim and Arte go undercover to overturn a hanging verdict unjustly given to an innocent man."
}, {
  "imdbId" : "0058855",
  "season" : "3",
  "episodeNumber" : "8",
  "title" : "The Night of Montezuma's Hordes",
  "description" : "James West travels to a museum to meet Johnson for the search of Montezuma's lost treasures. Along the way to the Aztec location, they meet Artemus Gordon, disguised as a desert rat, who is hired as a digger. The expedition discovers an Aztec temple."
}, {
  "imdbId" : "0058855",
  "season" : "3",
  "episodeNumber" : "9",
  "title" : "The Night of the Circus of Death",
  "description" : "When masterfully forged bills appear in circulation, West and Gorden must catch the forgers to prevent the collapse of the U.S. economy from a flood of nearly perfect counterfeit bills."
}, {
  "imdbId" : "0058855",
  "season" : "3",
  "episodeNumber" : "10",
  "title" : "The Night of the Falcon",
  "description" : "After witnessing the total destruction of a town called Tonka Flats, agents West and Gordon receive a further threat to destroy the city of Denver. Demanding a ransom, Dr. Horace Humphries, alias \"The Falcon\", plans to fire a single shell from a falcon-shaped cannon toward this western city. West and Gordon go to an underground hideout in search of the destructive cannon. But once inside, the agents discover syndicate leaders from foreign countries bidding to purchase the massive weapon for their own use."
}, {
  "imdbId" : "0058855",
  "season" : "3",
  "episodeNumber" : "11",
  "title" : "The Night of the Cut-Throats",
  "description" : "A band of outlaws threatens to destroy the town of New Athens. West and Gordon are the town's only hope of survival."
}, {
  "imdbId" : "0058855",
  "season" : "3",
  "episodeNumber" : "12",
  "title" : "The Night of the Legion of Death",
  "description" : "Jim and Arte uncover an unscrupulous plot devised by an ambitious dictatorial governor who has plans to become President of the United States."
}, {
  "imdbId" : "0058855",
  "season" : "3",
  "episodeNumber" : "13",
  "title" : "The Night of the Turncoat",
  "description" : "Elisha Calamander, a thief of priceless art for wealthy clientèle, discredits agent West, who is severely punished by the government with a discharge from the special forces. Calamander offers West $50,000 to help with a special secret assignment."
}, {
  "imdbId" : "0058855",
  "season" : "3",
  "episodeNumber" : "14",
  "title" : "The Night of the Iron Fist",
  "description" : "West and Gordon work to escort Draja, a Bosnian count, to Washington for extradition. A disguised Gordon takes his place on the train, while West and the real Draja take a back route to keep the count from recovering a hidden stash of gold. They soon find a gang of reward-seeking vigilantes on their trail, while Gordon's cover is threatened by the appearance of an old friend of the count."
}, {
  "imdbId" : "0058855",
  "season" : "3",
  "episodeNumber" : "15",
  "title" : "The Night of the Running Death",
  "description" : "Jim and Arte decipher the meaning of a dying man's last words in order to stop an assassination attempt on the governor."
}, {
  "imdbId" : "0058855",
  "season" : "3",
  "episodeNumber" : "16",
  "title" : "The Night of the Arrow",
  "description" : "To save the Indians from being slaughtered by the cavalry, West and Gordon must keep the peace and uncover who is behind a plot to provoke war with the Indians."
}, {
  "imdbId" : "0058855",
  "season" : "3",
  "episodeNumber" : "17",
  "title" : "The Night of the Headless Woman",
  "description" : "West and Gorden investigate a plot by an international cotton syndicate to decimate America's cotton crops using boll weevils."
}, {
  "imdbId" : "0058855",
  "season" : "3",
  "episodeNumber" : "18",
  "title" : "The Night of the Vipers",
  "description" : "The Vipers, a band of outlaws, have been pulling off raids across Kansas towns. A clue leads West and Gordon to the quiet village of Freedom, where they meet a straight-shooting sheriff and a mayor who will stop at seemingly nothing to become governor. Gordon goes undercover and finds the plans to the Vipers' get-away wagon, while West discovers the secret entrance to the outlaws meeting place."
}, {
  "imdbId" : "0058855",
  "season" : "3",
  "episodeNumber" : "19",
  "title" : "The Night of the Underground Terror",
  "description" : "During Mardi Gras in New Orleans, agents West and Gordon look for the cruelest former commander of a Civil War prison who has been a fugitive from justice for the abuse of prisoners. They meet a young girl who leads them to Hazard, her legless father and victim of the prison commander. Hazard and his men are after the commander as well, but their real goal is to find a shipment of one million dollars that disappeared after arriving at the prison."
}, {
  "imdbId" : "0058855",
  "season" : "3",
  "episodeNumber" : "20",
  "title" : "The Night of the Death Masks",
  "description" : "Jim and Arte unknowingly become a part of a bizarre revenge plot involving mistaken identities."
}, {
  "imdbId" : "0058855",
  "season" : "3",
  "episodeNumber" : "21",
  "title" : "The Night of the Undead",
  "description" : "Revenge, jealousy and a rivalry between two doctors result in dastardly human experiments when James West comes upon a voodoo sacrificial killing. As West shoots his gun into the air to stop the ritual, the zombie-like participants turn and walk away. West is then attacked by a huge man named Tiny John, but as the agent shoots the man in the heart, Tiny John simply turns away and heads for the swamp. While the agents investigate further, they learn why the people are in a trance and discover the real reason behind the doctors' contempt for each other."
}, {
  "imdbId" : "0058855",
  "season" : "3",
  "episodeNumber" : "22",
  "title" : "The Night of the Amnesiac",
  "description" : "Special agent West is charged with the responsibility to transport the state's only supply of a smallpox vaccine to safety. On the way, West's stagecoach is ambushed by a gang, led by Silas Crotty, who steals the serum and shoots West as he tries to protect the vaccine. When West awakens in the field, he has lost his memory and his identity."
}, {
  "imdbId" : "0058855",
  "season" : "3",
  "episodeNumber" : "23",
  "title" : "The Night of the Simian Terror",
  "description" : "Jim and Arte uncover a secret revenge plot involving inhuman medical experiments."
}, {
  "imdbId" : "0058855",
  "season" : "3",
  "episodeNumber" : "24",
  "title" : "The Night of the Death-Maker",
  "description" : "Jim and Arte stop a plan to assassinate President Grant devised by a bitter officer who was stripped of his command."
}, {
  "imdbId" : "0058855",
  "season" : "4",
  "episodeNumber" : "1",
  "title" : "The Night of the Big Blackmail",
  "description" : "While President Grant attends a fencing contest at the German consulate, he is invited by Baron Hinterstoisser to a reception and special presentation afterward. Agent West learns that the Baron plans to show a bogus kinetoscope film (see Goofs) revealing Grant signing a secret agreement with a nation of questionable character. Because an embassy is considered protected foreign soil, West and Gordon need to disrupt the Baron's plot by substituting their own fake film without being discovered, thereby causing an international incident."
}, {
  "imdbId" : "0058855",
  "season" : "4",
  "episodeNumber" : "2",
  "title" : "The Night of the Doomsday Formula",
  "description" : "When arms dealer kidnaps the inventor of a powerful new explosive, Jim and Artie attempt to rescue him before his formula's sold to the highest bidder."
}, {
  "imdbId" : "0058855",
  "season" : "4",
  "episodeNumber" : "3",
  "title" : "The Night of the Juggernaut",
  "description" : "Jim and Artie are ordered to find out who or what is running homesteaders off their land."
}, {
  "imdbId" : "0058855",
  "season" : "4",
  "episodeNumber" : "4",
  "title" : "The Night of the Sedgewick Curse",
  "description" : "Jim and Artemus are asked by a beautiful young woman, Lavinia Sedgewick, to help her mute grandfather. Both Sedgewickes seem to be under control of a controversial physician in their own mansion."
}, {
  "imdbId" : "0058855",
  "season" : "4",
  "episodeNumber" : "5",
  "title" : "The Night of the Gruesome Games",
  "description" : "Racing the clock to recover a stolen vial of deadly germs, Jim and Artie stumble upon a party hosted by an eccentric millionaire who delights in playing lethal parlor games."
}, {
  "imdbId" : "0058855",
  "season" : "4",
  "episodeNumber" : "6",
  "title" : "The Night of the Kraken",
  "description" : "A religious fanatic (played by Ted Knight) warns passersby at the San Francisco harbor that the city will be destroyed because of its citizens' wild ways. When a kraken (a sea monster) attacks at a pier, agent West tear off a piece of its tail, which is man-made ! Agent Gordon investigates by going undercover as an old salt, while West works with the U.S. Navy,"
}, {
  "imdbId" : "0058855",
  "season" : "4",
  "episodeNumber" : "7",
  "title" : "The Night of the Fugitives",
  "description" : "To break a powerful crime syndicate, Jim and Arte must capture its wily bookkeeper before Diamond Dave gets him first.."
}, {
  "imdbId" : "0058855",
  "season" : "4",
  "episodeNumber" : "8",
  "title" : "The Night of the Egyptian Queen",
  "description" : "A priceless ruby is stolen from an Egyptian exhibit at the San Franciso Museum. When West and Gordon are commissioned to recover the jewel, they led to a waterfront bar where they notice the ruby on the toe of a beautiful young woman dancing on the table. Gordon, disguised as a sea captain, chases the dancer but fails to capture her or the ruby. As West gets closer to the dancer, he discovers that he has competition from two other unsavory characters who will stop at noting to get their hands on the valuable gem."
}, {
  "imdbId" : "0058855",
  "season" : "4",
  "episodeNumber" : "9",
  "title" : "The Night of Fire and Brimstone",
  "description" : "Claiming to have made a discovery of major importance, a professor summons Jim and Artie to the deserted mining town of Brimstone."
}, {
  "imdbId" : "0058855",
  "season" : "4",
  "episodeNumber" : "10",
  "title" : "The Night of the Camera",
  "description" : "To take down an opium-smuggling ring, Jim West and Jeremy Pike join forces with Bosley Cranston, a timid secret service agent with some extraordinary skills."
}, {
  "imdbId" : "0058855",
  "season" : "4",
  "episodeNumber" : "11",
  "title" : "The Night of the Avaricious Actuary",
  "description" : "When vibrations from a giant tuning fork destroy the palatial homes of extremely wealthy businessmen, Jim and Artie are called in to investigate."
}, {
  "imdbId" : "0058855",
  "season" : "4",
  "episodeNumber" : "12",
  "title" : "The Night of Miguelito's Revenge",
  "description" : "While West gets a shave at the barbershop, he becomes anesthetized by a hot towel and awakens in a fun-house. West soon learns of a series of kidnappings with clues leading to a traveling circus. There, West encounters the demented Dr. Miguelito Loveless with his latest invention, a powerful mechanized man. After the mechanical man knocks out West, places him in a coffin and throws the agent into a river, Loveless plans to hold a mock trial for his abducted victims and sentence them to death."
}, {
  "imdbId" : "0058855",
  "season" : "4",
  "episodeNumber" : "13",
  "title" : "The Night of the Pelican",
  "description" : "West and his temporary partner Jeremy Pike investigate a Chinese gangster's theft of rare explosives from a San Francisco armory. Artemus Gordon (Martin) is said to be on desk duty in Washington. The dying words of a murdered Chinese informant, leads Pike to go undercover in China Town searching for the thief, while West masquerades as a military prisoner at forbidding Ft. Alcatraz."
}, {
  "imdbId" : "0058855",
  "season" : "4",
  "episodeNumber" : "14",
  "title" : "The Night of the Spanish Curse",
  "description" : "Crossing the border into Mexico, Jim and Artie pursue a group of bandits posing as the ghosts of Cortez and his conquistadors."
}, {
  "imdbId" : "0058855",
  "season" : "4",
  "episodeNumber" : "15",
  "title" : "The Night of the Winged Terror: Part 1",
  "description" : "James West is dispatched to a town after the U.S. receives a warning of an impending catastrophe. The Secret Service agent is unable to prevent the town's mayor from blowing up a new railroad trestle. West is assigned to work with agent Frank Harper on the case. Harper arrives too late to prevent a museum official from slashing paintings and destroying other artwork. President Grant departs Washington to personally brief the agents about the case, in which prominent people inexplicably commit acts of destruction. West arrives just in time to stop a dedicated sheriff ..."
}, {
  "imdbId" : "0058855",
  "season" : "4",
  "episodeNumber" : "16",
  "title" : "The Night of the Winged Terror: Part II",
  "description" : "West departs Raven's headquarters in a bid to ruin the organization's plot to kill a Mexican official. The Secret Service agent, though, doesn't realize he has been programmed to assassinate the official -- and it appears he has done just that. However, fellow agent Frank Harper disguised himself as the official and wore a bulletproof vest, enabling him to survive the attack by the brainwashed West. Meanwhile, West bides his time, pretending to join Raven until he could find out more about Raven leader Tycho who claims to know \"all that ever was.\" Harper, meantime, ..."
}, {
  "imdbId" : "0058855",
  "season" : "4",
  "episodeNumber" : "17",
  "title" : "The Night of the Sabatini Death",
  "description" : "Johnny Sabatini makes a dying request of his adversary James West: ensure a special young woman receives the gift he is bequeathing her. The mission of mercy takes West and able assistant Ned Brown to the spooky ghost town of Calliope, Missouri."
}, {
  "imdbId" : "0058855",
  "season" : "4",
  "episodeNumber" : "18",
  "title" : "The Night of the Janus",
  "description" : "While solving the murder of a fellow Secret Service agent, Jim West and Jeremy Pike must uncover a traitor at the service academy with their only clue a sheet of music left by the dead agent."
}, {
  "imdbId" : "0058855",
  "season" : "4",
  "episodeNumber" : "19",
  "title" : "The Night of the Pistoleros",
  "description" : "Arriving at a lonely border outpost, Jim and Artie attempt to stop a terrorist gang from provoking a war with Mexico"
}, {
  "imdbId" : "0058855",
  "season" : "4",
  "episodeNumber" : "20",
  "title" : "The Night of the Diva",
  "description" : "West and Gordon receive orders to protect Rosa Montebello, a famous Italian opera diva and niece of the ambassador from Italy. Artemus gets nothing but grief from the difficult diva. When the curtain goes down in the middle of the opera performance, West suspects foul play and jumps to the stage just in time to stop the diva's kidnapping. With subsequent attempts on her life, Montebello soon realizes just how much she needs the protection from the agents."
}, {
  "imdbId" : "0058855",
  "season" : "4",
  "episodeNumber" : "21",
  "title" : "The Night of the Bleak Island",
  "description" : "On Bleak Island, James West travels to retrieve to a diamond that was left to the National Museum and teams up with his former associate Sir Nigel Scott of Scotland Yard to defeat a master criminal named Calendar."
}, {
  "imdbId" : "0058855",
  "season" : "4",
  "episodeNumber" : "22",
  "title" : "The Night of the Cossacks",
  "description" : "Following an assassination attempt, the royal family of Karovnia escapes to America where Jim and Artie attempt to save them from an evil count who's following in pursuit."
}, {
  "imdbId" : "0058855",
  "season" : "4",
  "episodeNumber" : "23",
  "title" : "The Night of the Tycoons",
  "description" : "James West investigates the deaths of members of the board of directors of the Jupiter Corporation with the help of the son of one of the deceased. They both encounter both stock fraud and an odd bar with a circus theme."
}, {
  "imdbId" : "0058855",
  "season" : "4",
  "episodeNumber" : "24",
  "title" : "The Night of the Plague",
  "description" : "While Jim attempts to rescue the governor's daughter from a band of kidnappers, Artie discovers one of the bandits is the carrier of a deadly plague."
}]