[{
  "imdbId" : "2069688",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "The Gathering Storm",
  "description" : "Just years after World War I, Germany and other nations are in an economic depression. Leader approval ratings of Germany, Italy, Japan and Spain are shallow, giving the rise to military dictators along with their parties. Years after Adolf Hitler becomes Chancellor of Germany, he and his generals plot the invasion of Poland."
}, {
  "imdbId" : "2069688",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Lightning War",
  "description" : "The Germans develop a new military tactic known as Blitzkrieg. The Nazis use Blitzkrieg, dominating land and air warfare, allowing them to take Poland and conquer France in matters of weeks."
}, {
  "imdbId" : "2069688",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Britain at Bay",
  "description" : "July 1940, Britain is standing on its last legs while being pummeled by Germany. Though Hitler has better soldiers and a more powerful air force, critical errors of the Luftwaffe allow Britain to regain strength and start pushing back."
}, {
  "imdbId" : "2069688",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Hitler Strikes East",
  "description" : "After the unsuccessful attempt to defeat the British, Hitler focuses his attention on the Soviet Union. This proves to be quite a military gamble."
}, {
  "imdbId" : "2069688",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "Red Sun Rampant",
  "description" : "On 7 December 1941, the Japanese bomb the U.S. Fleet in Pearl Harbor. The United States officially enters World War II starting with the Pacific Front."
}, {
  "imdbId" : "2069688",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "The Mediterranean and North Africa",
  "description" : "After success in North Africa and Greece, Allies push Benito Mussolini's forces all the way back to Italy. Italy is then knocked out of the war, Mussolini is deposed, and the Allies start to put real pressure on Nazi Germany."
}, {
  "imdbId" : "2069688",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Turning the Tide",
  "description" : "The Allies and the Axis are searching for a final blow to each other to end the war. While the Allies try out strategic fire bombing, Hitler tries cutting off American supply lines with submarines. Right now this is a stalemate."
}, {
  "imdbId" : "2069688",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "The Soviet Steamroller",
  "description" : "After Hitler's gamble in the East fails, failing to defeat Stalingrad and Moscow, the Soviet Union, with its vast resources and armies, starts to slowly push back and grow. Hitler is now on the defence on 2 of his 3 fronts."
}, {
  "imdbId" : "2069688",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "Overlord",
  "description" : "After careful planning and tremendous secrecy but more importantly the lack of Hitler's attention, the Allies successfully breach mainland Western Europe through the Normandy landings. After thousands of lives are lost to the operation, the Allies are able to start the liberation of Western Europe."
}, {
  "imdbId" : "2069688",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "Closing the Ring",
  "description" : "The Allies are now on the offensive on all three fronts. As their forces push through Europe soldiers start uncovering Hitler's death camps. This was the Allies' first concrete knowledge of the Holocaust."
}, {
  "imdbId" : "2069688",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "The Island War",
  "description" : "An aggressive war is being waged against the Japanese. America is now starting to use a new tactic of island-hopping, resulting in the slow crumbling of the Japanese air force and navy."
}, {
  "imdbId" : "2069688",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "Victory in Europe",
  "description" : "From three sides, the British, Americans, and Soviets are starting to shred through what is left of the Third Reich. As the Nazi forces see their final days, Hitler commits suicide, and the Allies begin dividing up Europe."
}, {
  "imdbId" : "2069688",
  "season" : "1",
  "episodeNumber" : "13",
  "title" : "Victory in the Pacific",
  "description" : "The Americans wipe out Japan's air force through a strategy of island-hopping. As the Americans face the decision of what to do with mainland Japan, President Truman calls to bomb Hiroshima and Nagasaki with nuclear weapons. Japan had no choice but to surrender, and the Cold War begins."
}]
