[{
  "imdbId" : "0407362",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "33",
  "description" : "The crew of Galactica is exhausted after 237 consecutive jumps in intervals of 33 minutes and 132.25 hour without sleep to escape from the Cylons. When Galactica is contacted by the Olympic Carrier, a vessel with more than 1,300 persons, Commander William Adama and are advised that there is a traitor on board. However, Dr. Gaius Baltar convinces both leaders that the Olympic Carrier is a menace to the refugee fleet led by Galactica."
}, {
  "imdbId" : "0407362",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Water",
  "description" : "President Roslin arrives on Galactica as Boomer's Cylon side asserts itself, forcing her to sabotage Galactica's water supply against her will. A series of explosions leads to the loss of 60% of the water reserves and Commander Adama is compelled to introduce rationing and begin a search of nearby planetary systems for any H20 deposits."
}, {
  "imdbId" : "0407362",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Bastille Day",
  "description" : "Deciding to use the thousand prisoners on a prison transport ship to mine the ice on the planet they've found, Galactica's plans are upset when a political prisoner onboard leads an uprising, taking hostages. He questions the legitimacy of Roslin's government and demands free elections to be held in the fleet."
}, {
  "imdbId" : "0407362",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "Act of Contrition",
  "description" : "There's a party on Galactica's flight deck as Flat-Top just had his thousandth landing. Something goes terribly wrong however when a drone accidentally goes off and explodes in a group of pilots. 13 are dead. During the ceremony Kara Thrace starts thinking about her dead fiancée Zak Adama. And those memories even get clearer when Adama orders her to start training new pilots. She seems very uncomfortable in doing so. The favor she did for Zak by letting him pass basic flight seems to bother her more and more. Angrily she stops training pilots after just one day. ..."
}, {
  "imdbId" : "0407362",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "You Can't Go Home Again",
  "description" : "Starbuck has been shot down over a barren moon, and must be rescued before she runs out of oxygen. Adama become obsessed with trying to save her even when all hope seems lost, putting the Fleet at risk. Meanwhile, Starbuck finds the Cylon Raider she shot down, and tries to learn how to fly it so she can escape."
}, {
  "imdbId" : "0407362",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Litmus",
  "description" : "A humanoid Cylon straps himself with explosives and commits a suicide bombing in a crowded hallway on Galactica. Roslin and Adama are forced to publicly reveal that the Cylons now have models that look like humans, and a wave of paranoia spreads over the fleet as everyone starts being suspected of being a Cylon."
}, {
  "imdbId" : "0407362",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "Six Degrees of Separation",
  "description" : "After Baltar has an argument with the vision of Number Six he sees in his head, a physical copy of Cylon model Number Six shows up in Galactica's CIC claiming to be a woman named Shelley Godfrey who has evidence that proves that Baltar has betrayed humanity...except that she's trying to frame him for an act of pre-attack sabotage."
}, {
  "imdbId" : "0407362",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "Flesh and Bone",
  "description" : "A humanoid Cylon is captured in the fleet, a copy of the Leoben model, who claims that he has planted a nuclear bomb in the Fleet before he was captured. Starbuck is tasked with interrogating him, which soon becomes a battle of wills as Starbuck has her marines to torture the Cylon to try to break him."
}, {
  "imdbId" : "0407362",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "Tigh Me Up, Tigh Me Down",
  "description" : "After the interrogated Cylon gave Roslin the idea that Adama might be a Cylon, Roslin becomes suspicious of him. Unexpectedly, Colonel Tigh's estranged wife Ellen turns up alive in the fleet, apparently miraculously, raising the possibility that she might be a Cylon."
}, {
  "imdbId" : "0407362",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "The Hand of God",
  "description" : "The fleet is running out of tylium fuel and will soon not have enough to keep running from the Cylons, when they find an asteroid with several years worth of tylium ore...unfortunately, the Cylons have already built a mining base on it."
}, {
  "imdbId" : "0407362",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "Colonial Day",
  "description" : "President Roslin has rebuilt a new Quorum of Twelve, the legislative branch of the government, but terrorist leader/political dissident Tom Zarek is elected as a member, and immediately motions that the Quorum vote to appoint a new Vice President, and runs for the office."
}, {
  "imdbId" : "0407362",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "Kobol's Last Gleaming: Part 1",
  "description" : "Galactica stumbles upon Kobol, the long-lost home world of humanity that the 13 Tribes came from, which legend says holds the only clues to the location of Earth. Roslin convinces Starbuck to steal the captured Cylon raider and return to Cylon-occupied Caprica with it to retrieve a religious artifact that will unlock the secrets on Kobol."
}, {
  "imdbId" : "0407362",
  "season" : "1",
  "episodeNumber" : "13",
  "title" : "Kobol's Last Gleaming: Part 2",
  "description" : "Infuriated that Roslin usurped his command by ordering Starbuck to steal the captured Raider, Adama decides that his only option is to storm Colonial One with marines and terminate her presidency. Starbuck reaches Caprica and finds the Arrow of Apollo in a museum, but she has to go through a copy of Number Six to get it."
}, {
  "imdbId" : "0407362",
  "season" : "2",
  "episodeNumber" : "1",
  "title" : "Scattered",
  "description" : "As the premiere for the second season unfolds, Adama lay dying leaving Tigh in command. Lee and Roslin have been sent to the brig. An emergency jump goes wrong leaving the Galactica alone in space without the fleet."
}, {
  "imdbId" : "0407362",
  "season" : "2",
  "episodeNumber" : "2",
  "title" : "Valley of Darkness",
  "description" : "A Cylon virus is interfering with Galactica's power supply, while Cylon centurions are heading for crucial systems. Somehow they must be stopped."
}, {
  "imdbId" : "0407362",
  "season" : "2",
  "episodeNumber" : "3",
  "title" : "Fragged",
  "description" : "Tigh has problems with the responsibility of being a leader, president Roslin loses control without chamalla. The Kobol team discovers a Cylon battery."
}, {
  "imdbId" : "0407362",
  "season" : "2",
  "episodeNumber" : "4",
  "title" : "Resistance",
  "description" : "Tigh's decision to impose martial law is protested in the fleet as well as on Galactica. On Caprica, Helo and Starbuck meet other humans."
}, {
  "imdbId" : "0407362",
  "season" : "2",
  "episodeNumber" : "5",
  "title" : "The Farm",
  "description" : "Starbuck finds herself wounded in a hospital on Caprica where she is suspicious about her doctor. President Roslin makes an appeal to the fleet to follow her to Kobol."
}, {
  "imdbId" : "0407362",
  "season" : "2",
  "episodeNumber" : "6",
  "title" : "Home: Part 1",
  "description" : "Starbuck, Helo and Boomer bring back the Arrow of Apollo, but Boomer doesn't seem welcome. Commander Adama wants to keep the fleet divided and appoints a new CAG."
}, {
  "imdbId" : "0407362",
  "season" : "2",
  "episodeNumber" : "7",
  "title" : "Home: Part 2",
  "description" : "While Commander Adama tries to join Roslin's team on Kobol, Dr. Baltar's Number Six tells him he's crazy."
}, {
  "imdbId" : "0407362",
  "season" : "2",
  "episodeNumber" : "8",
  "title" : "Final Cut",
  "description" : "Journalist D'Anna Biers is making an item on the Gideon incident, when she's asked by Adama and Roslin to film daily life on Galactica."
}, {
  "imdbId" : "0407362",
  "season" : "2",
  "episodeNumber" : "9",
  "title" : "Flight of the Phoenix",
  "description" : "While Tyrol decides to start building a new fighter, the Cylon virus is rearing its ugly head again. Boomer tells it means a large Cylon attack is imminent."
}, {
  "imdbId" : "0407362",
  "season" : "2",
  "episodeNumber" : "10",
  "title" : "Pegasus",
  "description" : "Gallactica meets Pegasus, and Adama's command is threatened when the captain of Pegasus outranks him. A joyous celebration turns sour at some of the secrets emerging out of the differences of the two crews, and Baltar meets a familiar Cylon prisoner aboard Pegasus."
}, {
  "imdbId" : "0407362",
  "season" : "2",
  "episodeNumber" : "11",
  "title" : "Resurrection Ship: Part 1",
  "description" : "Adama and Cain find common ground when Starbuck returns with footage of the Cylon ship. Roslin negotiates a temporary truce, while Starbuck plans an attack."
}, {
  "imdbId" : "0407362",
  "season" : "2",
  "episodeNumber" : "12",
  "title" : "Resurrection Ship: Part 2",
  "description" : "Starbuck and Fisk are preparing for the murder jobs, while the attack on the Resurrection ship is planned. It goes wrong for Apollo. Dr. Baltar has feelings for Pegasus' Number Six."
}, {
  "imdbId" : "0407362",
  "season" : "2",
  "episodeNumber" : "13",
  "title" : "Epiphanies",
  "description" : "President Roslin, who is about to die, believes Sharon's baby is dangerous and orders it must die. Meanwhile, a terrorist group inside the fleet starts to ask for a peace negotiation with the cylons."
}, {
  "imdbId" : "0407362",
  "season" : "2",
  "episodeNumber" : "14",
  "title" : "Black Market",
  "description" : "Apollo investigates the murder of one of the crew and falls for a young prostitute, whom he vows to save from the rogue ship dealing with the Black Market. As well as confronting the bad guys, Apollo has to confront some past mistakes."
}, {
  "imdbId" : "0407362",
  "season" : "2",
  "episodeNumber" : "15",
  "title" : "Scar",
  "description" : "This is an episode about loss. Kat and Starbuck confront each other about their piloting skills and each vow to kill Scar (a Cylon spaceship) before the other."
}, {
  "imdbId" : "0407362",
  "season" : "2",
  "episodeNumber" : "16",
  "title" : "Sacrifice",
  "description" : "A terrorist attacks and holds several key people hostage and threatens to murder them unless she is given the Cylon prisoner."
}, {
  "imdbId" : "0407362",
  "season" : "2",
  "episodeNumber" : "17",
  "title" : "The Captain's Hand",
  "description" : "Two of Pegasus' raptors go missing after a suspicious distress call. President Roslin must make a decision on abortion that could hurt her political career."
}, {
  "imdbId" : "0407362",
  "season" : "2",
  "episodeNumber" : "18",
  "title" : "Downloaded",
  "description" : "The Cylon baby is finally born, leading to some political decisions being made. Meanwhile, the Cylons on Caprica contemplate life and humans when they meet up with a certain human from a previous episode. This story explores the Cylon world."
}, {
  "imdbId" : "0407362",
  "season" : "2",
  "episodeNumber" : "19",
  "title" : "Lay Down Your Burdens: Part 1",
  "description" : "While Dr. Baltar is behind in the polls for the election and tries desperately to turn things around, Starbuck is planning a mission to rescue Anders from Caprica."
}, {
  "imdbId" : "0407362",
  "season" : "2",
  "episodeNumber" : "20",
  "title" : "Lay Down Your Burdens: Part 2",
  "description" : "The group on Caprica is under fire by the Cylons, but suddenly they stop. With only one ship's votes to be counted, Roslin is way behind in the elections."
}, {
  "imdbId" : "0407362",
  "season" : "3",
  "episodeNumber" : "1",
  "title" : "Occupation",
  "description" : "The Cylons have now been in control of New Caprica for over four months. Gaius Baltar is under their collective thumbs and essentially follows their orders. There is a resistance who set off bombs and do their best to disrupt Cylon activity. Col. Tigh is in prison and despite extensive torture, including the loss of an eye, has told them nothing. His wife Ellen will do anything to secure his release and is soon in a sexual relationship with one of the Cylons, John Cavil. There are mixed feelings among the survivors. Some feel the random acts of violence against their ..."
}, {
  "imdbId" : "0407362",
  "season" : "3",
  "episodeNumber" : "2",
  "title" : "Precipice",
  "description" : "As a result of the most recent suicide bombings, some of the Cylons are now arguing that they need to retaliate. Laura Roslin, among others, is in custody and Gaius Baltar tries to get her to cooperate. Tigh however absolutely refuses to stop the suicide bombings. Nighttime raids also leads to Cally's arrest but they leave her baby alone. Sharon Valerii sees what she can do about it. John Cavil meanwhile tells Ellen Tigh she is to provide the date and location of the next meeting of the resistance commanders. Leoben Conoy is still holding Starbuck prisoner but ..."
}, {
  "imdbId" : "0407362",
  "season" : "3",
  "episodeNumber" : "3",
  "title" : "Exodus: Part 1",
  "description" : "The secret source in the administration has provided Tyrol with a list of all humans scheduled for extermination. Tyrol's wife Cally is on the list and he sets off to rescue her. Sharon Agathon has made it safely to the planet but they are ambushed by Cylons lying in wait. They realize they were betrayed and Anders finds damning evidence that points to the identity of the traitor. D'Anna Biers has been having strange dreams of late and an oracle tells her that the child Hera is alive and she will hold her in her arms. Roslin meanwhile assigns a squad of men to protect..."
}, {
  "imdbId" : "0407362",
  "season" : "3",
  "episodeNumber" : "4",
  "title" : "Exodus: Part 2",
  "description" : "The attack to rescue everyone on New Caprica begins. The Galactica encounters four rather than the expected two Cylon Basestars. The end appears in sight but they get help from a welcome but unexpected source. On the planet below, Tyrol and Anders lead the attack to free everyone from the prison. Anders finds Starbuck but she won't leave without Kacey. Her successful return to the Galactica results in mixed emotions. Colonel Tigh must decide what to do about his wife Ellen after she admits to giving the rendezvous coordinates to the Cylons. Hera doesn't make it off ..."
}, {
  "imdbId" : "0407362",
  "season" : "3",
  "episodeNumber" : "5",
  "title" : "Collaborators",
  "description" : "Now safely back in the fleet, those who managed to escape from New Caprica are seeking revenge against those they believe collaborated with the Cylons. Six of them, including Chief Tyrol and Col. Tigh, have formed the Circle and are acting as judge, jury and executioner. Those found guilty are blown out of an airlock. Lee Adama has noted that in the three days since everyone was reunited, 13 people have simply disappeared without a trace. The morale aboard the Galactica is not good with perceived collaborators being shunned by the others. Among those in that situation..."
}, {
  "imdbId" : "0407362",
  "season" : "3",
  "episodeNumber" : "6",
  "title" : "Torn",
  "description" : "Baltar learns from Caprica Six of their ability to project themselves and imagine different surroundings which leads him to wonder if he too is a Cylon. He has told the Cylons what he knows about the location of Earth and they dispatch a Basestar to investigate. In the end, the survey ship is infected with a virus killing everyone aboard. Aboard the Galactica, Lt. Gaeta has been reviewing Baltar's work in deciphering the map they recovered on Kobol. He too thinks he know what it all means. Of greater concern however is the wedge between those who stayed with the fleet..."
}, {
  "imdbId" : "0407362",
  "season" : "3",
  "episodeNumber" : "7",
  "title" : "A Measure of Salvation",
  "description" : "When a group of ill Cylons from the infected Basestar is brought to Galactica, Lee discovers a way to solve the Cylon problem forever - by destroying the whole Cylon race. Meanwhile, D'anna's acts to discover if Baltar is reliable will forge an unusual relationship."
}, {
  "imdbId" : "0407362",
  "season" : "3",
  "episodeNumber" : "8",
  "title" : "Hero",
  "description" : "A figure from Adama's past returns to haunt him. His return raises questions about why the Cylons launched their initial attack against the Twelve Colonies."
}, {
  "imdbId" : "0407362",
  "season" : "3",
  "episodeNumber" : "9",
  "title" : "Unfinished Business",
  "description" : "A look at the events that took place during the year-long gap from the storyline in the Season Two finale. The story reveals the reasons for the rift between Kara (\"Starbuck\") and Lee (\"Apollo\")."
}, {
  "imdbId" : "0407362",
  "season" : "3",
  "episodeNumber" : "10",
  "title" : "The Passage",
  "description" : "The Colonial fleet makes a harrowing journey. Kat plays a vital role in the success or failure of the passage."
}, {
  "imdbId" : "0407362",
  "season" : "3",
  "episodeNumber" : "11",
  "title" : "The Eye of Jupiter",
  "description" : "The crew of Galactica makes a stop at the barren Algae planet."
}, {
  "imdbId" : "0407362",
  "season" : "3",
  "episodeNumber" : "12",
  "title" : "Rapture",
  "description" : "The Cylons descend upon the re-supply mission as the Chief races to decipher the markings in the temple believed to hold The Eye of Jupiter, a sacred icon that is believed to contain a map to Earth."
}, {
  "imdbId" : "0407362",
  "season" : "3",
  "episodeNumber" : "13",
  "title" : "Taking a Break from All Your Worries",
  "description" : "Baltar plays a game of cat and mouse with Adama and the President, thinking they will kill him once they've gotten out of him what they want to know. Lee deals with his feelings for Kara, while struggling to hang on to his marriage."
}, {
  "imdbId" : "0407362",
  "season" : "3",
  "episodeNumber" : "14",
  "title" : "The Woman King",
  "description" : "When a group of refugees board Galactica with a curable illness, it becomes very mysterious when they begin to die after taking the injection they do not believe in."
}, {
  "imdbId" : "0407362",
  "season" : "3",
  "episodeNumber" : "15",
  "title" : "A Day in the Life",
  "description" : "The Chief and his wife get trapped in an airlock on a routine maintenance job, while the Admiral copes with his wedding anniversary and the memories of his ex-wife."
}, {
  "imdbId" : "0407362",
  "season" : "3",
  "episodeNumber" : "16",
  "title" : "Dirty Hands",
  "description" : "When the head of the fuel production plant holds the fleet hostage by providing unsafe fuel, he's arrested for treason, which results in the Chief sent to the ship and held responsible for getting the plant back up and running."
}, {
  "imdbId" : "0407362",
  "season" : "3",
  "episodeNumber" : "17",
  "title" : "Maelstrom",
  "description" : "The Admiral is forced to make the decision of whether to ground Kara Thrace when she begins to show signs of an oncoming nervous breakdown."
}, {
  "imdbId" : "0407362",
  "season" : "3",
  "episodeNumber" : "18",
  "title" : "The Son Also Rises",
  "description" : "Besides having to deal with the loss of Kara Thrace, the crew of the Galactica is also charged with the security surrounding the trial of Dr. Baltar and his defense attorney, who is replacing one lawyer that has already been killed."
}, {
  "imdbId" : "0407362",
  "season" : "3",
  "episodeNumber" : "19",
  "title" : "Crossroads: Part 1",
  "description" : "Baltar goes on trial for his life, and it affects everyone from Lee on up to the president."
}, {
  "imdbId" : "0407362",
  "season" : "3",
  "episodeNumber" : "20",
  "title" : "Crossroads: Part 2",
  "description" : "Coincidences creates new alliances aboard Galactica."
}, {
  "imdbId" : "0407362",
  "season" : "4",
  "episodeNumber" : "1",
  "title" : "He That Believeth in Me",
  "description" : "During a seemingly hopeless battle, Kara Thrace appears in a pristine Viper, claiming that she has been to Earth and can lead the Fleet there -- but the terminal Laura Roslin believes otherwise. Meanwhile, four of the so-called Final Five are forced to tackle the repercussions of their newfound nature, while Gaius Baltar discovers he has a commune of nubile female cultists who believe him to be an agent of the \"one true God\"."
}, {
  "imdbId" : "0407362",
  "season" : "4",
  "episodeNumber" : "2",
  "title" : "Six of One",
  "description" : "Starbuck (Katee Sackhoff) and Laura Roslin (Mary McDonnell) face off with a gun between them, Lee Adama (Jamie Bamber) says goodbye to the Galactica, violent conflict breaks out between the seven models aboard Cylon Basestar, and Gaius Baltar (James Callis) is directly pulled into the \"Final Five\" situation."
}, {
  "imdbId" : "0407362",
  "season" : "4",
  "episodeNumber" : "3",
  "title" : "The Ties That Bind",
  "description" : "The aftermath of a coup among the Cylons leads to further violence, Lee finds himself facing off against Roslin during his first meeting with the Quorum of Twelve as the new representative of Caprica, and Cally discovers the horrible truth about her husband Galen Tyrol. Meanwhile, Starbuck aimlessly searches for Earth with Anders and other Galactica officers."
}, {
  "imdbId" : "0407362",
  "season" : "4",
  "episodeNumber" : "4",
  "title" : "Escape Velocity",
  "description" : "Gaius Baltar causes intense unrest within the fleet when he begins to openly promote belief in the Cylon god. Colonel Tigh, Galen Tyrol, and Tory Foster argue over how far they should go to ensure their secret is not revealed."
}, {
  "imdbId" : "0407362",
  "season" : "4",
  "episodeNumber" : "5",
  "title" : "The Road Less Traveled",
  "description" : "When a Heavy-Raider manned by Leoben Conoy docks aboard the Demetrius, confrontations form between the crew over the possibility of a truce with Cylon rebels, while Starbuck puts her trust in an old enemy."
}, {
  "imdbId" : "0407362",
  "season" : "4",
  "episodeNumber" : "6",
  "title" : "Faith",
  "description" : "A vicious injury ends the mutiny attempt aboard the Demetrius, Kara leads her crew to the Cylon rebel's Basestar, and Roslin begins to understand Gaius Baltar's appeal to his followers. Meanwhile, Anders attempts to secretly find answers to his purpose as a member of the Final Five."
}, {
  "imdbId" : "0407362",
  "season" : "4",
  "episodeNumber" : "7",
  "title" : "Guess What's Coming to Dinner",
  "description" : "A shaky alliance between the Colonial Fleet and Cylon rebels is put to the test when the two groups combine efforts to take out a Cylon \"Resurrection Hub\". Meanwhile, Athena loses control when Hera becomes unnaturally drawn to Natalie."
}, {
  "imdbId" : "0407362",
  "season" : "4",
  "episodeNumber" : "8",
  "title" : "Sine Qua Non",
  "description" : "President Roslin's abduction by the Cylon Hybrid triggers a bitter power struggle within the Colonial Fleet."
}, {
  "imdbId" : "0407362",
  "season" : "4",
  "episodeNumber" : "9",
  "title" : "The Hub",
  "description" : "The Hybrid keeps jumping the basestar, and Roslin has visions. The three, D'Anna, is un-boxed. Humans and Cylons engage in a battle to destroy the Resurrection Hub. Baltar is badly wounded and Roslin has to decide whether or not to help him."
}, {
  "imdbId" : "0407362",
  "season" : "4",
  "episodeNumber" : "10",
  "title" : "Revelations",
  "description" : "D'Anna demands that the four Cylons in the fleet be sent to the basestar. Only Tory goes, while the remaining three are suddenly drawn to Kara's Viper by the music. The route to Earth is finally found."
}, {
  "imdbId" : "0407362",
  "season" : "4",
  "episodeNumber" : "11",
  "title" : "Sometimes a Great Notion",
  "description" : "Scouting the planet reveals that there is no life except plants. The destruction occurred about 2,000 years earlier. Among the ruins, skeletons and wrecks of a different kind of Centurions are found. But closer examination of the skeletons reveals they are Cylon! Could the 13th Tribe really have been all Cylons? Chief Tyrol, Colonel Tigh, Sam Anders and Tory remember living on the planet and dying there. How did they get to the colonies? Starbuck finds a piece of her Viper, and despite Leoben's warnings, starts to look for the cockpit... Roslin loses her faith in the ..."
}, {
  "imdbId" : "0407362",
  "season" : "4",
  "episodeNumber" : "12",
  "title" : "A Disquiet Follows My Soul",
  "description" : "Adama considers Saul and Tyrol's suggestion that the Fleet should integrate Cylon jump technology since it will triple the distance they will be able to cover before they run out of fuel. But the Cylon's condition is that they will be allowed to join the Fleet, for safety against Cavil, who's still out there. Ultimately, the decision is up to President Roslin, but Zarek calls the Quorum and gets them to carry the motion that no Cylon be allowed aboard any Colonial vessel unless permitted by the ship's captain. Tyrol learns from Dr. Cottle that Cally had their child ..."
}, {
  "imdbId" : "0407362",
  "season" : "4",
  "episodeNumber" : "13",
  "title" : "The Oath",
  "description" : "The Fleet refuses to cooperate with Cylon engineers and Adama decides to put and end to it. He sends the Quorum a message stating that unless they wish to join Zarek in the cell, they get their people in line. However, Gaeta is already freed Zarek with the help of other would-be-revolutionists. They allow Zarek to leave Galactica on a raptor. He lands on Colonial One and enters a gathering of the Quorum. Meanwhile, Anders gets ambushed and captured. At the CIC, Gaeta cleverly manipulates everyone else until the time is at hand for the revolution to begin."
}, {
  "imdbId" : "0407362",
  "season" : "4",
  "episodeNumber" : "14",
  "title" : "Blood on the Scales",
  "description" : "Roslin is on board a raptor en route to the Rebel Cylon Base Star, but Gaeta has ordered to engage and destroy it. The marines have used a stun grenade on Adama and Tigh. Roslin manages to get a wireless transmission out for everyone to hear and learn what Gaeta has done. She and the others barely make it to the Base Star, where she convinces Tory and the other Cylons to use the Fleet as a cover in order to prevent Gaeta from attacking it. She also believes that Adama will be able to save the rest of the Final Four. Temporarily safe, the Rebel Cylons start voting on ..."
}, {
  "imdbId" : "0407362",
  "season" : "4",
  "episodeNumber" : "15",
  "title" : "No Exit",
  "description" : "Eighteen months ago: Saul poisons Ellen, who then finds herself downloaded into a new body aboard a Cylon Base Star, with a single Centaurion keeping watch over her. After the initial shock, she has a revelation as she remembers things she had forgotten. Present Day: Dr. Cottle is operating on Anders, who has a bullet lodged in his brain. Anders starts to remember things he had forgotten. Eighteen months ago: Cavil comes to see Ellen, who calls him John, because that's his \"real\" name. Cavil says he hates that name. John was the first Cylon model *Ellen* created. She ..."
}, {
  "imdbId" : "0407362",
  "season" : "4",
  "episodeNumber" : "16",
  "title" : "Deadlock",
  "description" : "Ellen and Boomer travel to the Galactica. Saul is entranced at the sight of his wife while Adama puts Boomer in the brig. Ellen is not so pleased when she learns that Caprica Six is pregnant by Saul. Her interference and jealousy leads Six to have a miscarriage. Sam Anders survived the operation but now seems to be brain dead. Ellen is disappointed that the Final Five cannot be completely reunited. By majority vote, the Five agree that they will go off on their own, leaving the Colonial Fleet behind. Adama has agreed to have the cracks in the Galactica's hull repaired..."
}, {
  "imdbId" : "0407362",
  "season" : "4",
  "episodeNumber" : "17",
  "title" : "Someone to Watch Over Me",
  "description" : "Kara meets a pianist who reminds her of her father. She tries to play a melody she remembers from her childhood, and a drawing made by Hera helps her. Meanwhile, Boomer is to be tried for treason. Tyrol takes her side, and helps her escape."
}, {
  "imdbId" : "0407362",
  "season" : "4",
  "episodeNumber" : "18",
  "title" : "Islanded in a Stream of Stars",
  "description" : "With Hera now likely in the hands of John Cavil, Admiral Adama sends out search teams to locate The Colony, the Cylon home world if you will, that Ellen Tigh says is the only place she imagines she could be. Adama reluctantly comes to the conclusion that the Galactica has reached the end of its days. He orders all repair activities halted and decides to strip the ship and share everything that is salvageable with the rest of the fleet. Starbuck meanwhile shares with Gaius Baltar what she found on the uninhabitable Earth. He subsequently - and quite publicly - ..."
}, {
  "imdbId" : "0407362",
  "season" : "4",
  "episodeNumber" : "19",
  "title" : "Daybreak: Part 1",
  "description" : "The Colony is located sitting on the edge of a black hole with only one point of entry in what is a very large debris field. Knowing that the Galactica has reached the end of the line, Admiral Adama asks for volunteers to mount a raid on the Cylon base, realizing it may be the ship's last jump. In flashbacks prior to the Cylon invasion, key moments in the lives of several of the crew are presented. These include include the first time Kara Thrace and Lee Adama meet; Admiral Adama's struggle with his decision to retire from the colonial fleet; Gaius Baltar's ..."
}, {
  "imdbId" : "0407362",
  "season" : "4",
  "episodeNumber" : "20",
  "title" : "Daybreak: Part 2 & 3",
  "description" : "A stripped down Galactica attacks the Cylon's Colony ship in the hopes of rescuing Hera. The meaning of the shared dream in the Opera House on Kobol is revealed. Sam Anders is moved in his Hybrid tank to the CIC in the hopes that he will be able to assist the combatants. Their mission complete, Admiral Adama orders Starbuck to pick a destination - any destination - to which the ship can jump to get out of there. With that, the meaning of the tune and the musical notes are explained. Having successfully jumped, the old Galactica has truly reached the end of it's life. ..."
}]