[{
  "imdbId" : "0086822",
  "season" : "1",
  "episodeNumber" : "1",
  "title" : "Liberation Day",
  "description" : "The evil Diana, captured and set to stand trial for her crimes against the human race, is kidnapped by corrupt corporate magnate Nathan Bates, who wants to know the secrets of the Visitors' advanced technology."
}, {
  "imdbId" : "0086822",
  "season" : "1",
  "episodeNumber" : "2",
  "title" : "Dreadnought",
  "description" : "Immune to the effects of the red dust bacteria, Diana activates her unstoppable Triax superweapon to reduce Bates and the city of Los Angeles to rubble."
}, {
  "imdbId" : "0086822",
  "season" : "1",
  "episodeNumber" : "3",
  "title" : "Breakout",
  "description" : "Donovan and Ham are imprisoned in a Visitor work camp guarded by a hideous alien monster; Nathan Bates mounts a desperate search to find the \"star-child\" to exchange for his son Kyle who's in Diana's custody."
}, {
  "imdbId" : "0086822",
  "season" : "1",
  "episodeNumber" : "4",
  "title" : "The Deception",
  "description" : "While the Resistance seeks to help Elizabeth escape from Los Angeles, Diana captures Mike Donovan in an elaborate scheme to learn Elizabeth's whereabouts."
}, {
  "imdbId" : "0086822",
  "season" : "1",
  "episodeNumber" : "5",
  "title" : "The Sanction",
  "description" : "Seeking to free his son Sean from the Visitors, Donovan grapples with an insidious, powerful alien named Klaus."
}, {
  "imdbId" : "0086822",
  "season" : "1",
  "episodeNumber" : "6",
  "title" : "Visitor's Choice",
  "description" : "The Resistance, led by Donovan, Julie, and Ham, stage a daring sabotage at a convention of Visitor commanders in a seaside estate where Diana intends to show off the ultimate device in processing humans for food."
}, {
  "imdbId" : "0086822",
  "season" : "1",
  "episodeNumber" : "7",
  "title" : "The Overlord",
  "description" : "Led by Donovan, Ham, and Elias, the Resistance runs into a doublecross when they seek to rid a mining community from alien-backed thugs."
}, {
  "imdbId" : "0086822",
  "season" : "1",
  "episodeNumber" : "8",
  "title" : "The Dissident",
  "description" : "When Diana seals off the Open City with an impenetrable force field which destroys humans on contact, Donovan and Ham must kidnap the alien genius responsible for its development."
}, {
  "imdbId" : "0086822",
  "season" : "1",
  "episodeNumber" : "9",
  "title" : "Reflections in Terror",
  "description" : "With a blood sample from the \"star-child,\" Diana creates an uncontrollable and deadly clone which seeks out Elizabeth; Bates tests Julie's loyalty when he suspects she is sympathetic to the Resistance whose headquarters he is preparing to destroy."
}, {
  "imdbId" : "0086822",
  "season" : "1",
  "episodeNumber" : "10",
  "title" : "The Conversion",
  "description" : "Ham and Kyle are captured by Visitors, and Charles, the Leader's special envoy, assumes command of the alien forces."
}, {
  "imdbId" : "0086822",
  "season" : "1",
  "episodeNumber" : "11",
  "title" : "The Hero",
  "description" : "A small group of resistance sympathizers (Robin included) are arrested by Bates' police, and a prisoner will be handed over to the Visitors to be executed every day until Donovan, Ham, and Julie surrender."
}, {
  "imdbId" : "0086822",
  "season" : "1",
  "episodeNumber" : "12",
  "title" : "The Betrayal",
  "description" : "While Bates remains in a coma Charles plots to overthrow him, elsewhere Willie is gravely wounded so the rebels kidnap a medical student of the Visitors."
}, {
  "imdbId" : "0086822",
  "season" : "1",
  "episodeNumber" : "13",
  "title" : "The Rescue",
  "description" : "Feeling Diana's presence threatens his power, Charles forces her to marry him, after which Alien law requires she return home."
}, {
  "imdbId" : "0086822",
  "season" : "1",
  "episodeNumber" : "14",
  "title" : "The Champion",
  "description" : "Sent to investigate Charles' death, newly arrived Inspector General Philip allows Lydia to choose a trial by combat in a laser duel to the death with Diana."
}, {
  "imdbId" : "0086822",
  "season" : "1",
  "episodeNumber" : "15",
  "title" : "The Wildcats",
  "description" : "Needing medicine to treat a deadly diphtheria epidemic, Julie and Kyle recruit a youth gang, one of whom may be a Visitor spy, to help steal the serum."
}, {
  "imdbId" : "0086822",
  "season" : "1",
  "episodeNumber" : "16",
  "title" : "The Littlest Dragon",
  "description" : "Anxious to settle a personal vendetta, Philip trails a Fifth Columnist, hoping he will lead him to the Resistance and Donovan."
}, {
  "imdbId" : "0086822",
  "season" : "1",
  "episodeNumber" : "17",
  "title" : "War of Illusions",
  "description" : "When Philip and Diana install a high tech computer capable of launching a final victory over Earth, the Resistance's only hope at retaliation is a teenaged computer whiz."
}, {
  "imdbId" : "0086822",
  "season" : "1",
  "episodeNumber" : "18",
  "title" : "The Secret Underground",
  "description" : "Julie and Donovan sneak aboard the Mother Ship to look for a hidden list naming all the Resistance leaders; Diana schemes to have Lydia's brother slain during a ritual celebration."
}, {
  "imdbId" : "0086822",
  "season" : "1",
  "episodeNumber" : "19",
  "title" : "The Return",
  "description" : "The Leader stuns the Visitors by ordering a truce and traveling to Earth to negotiate peace; Diana plots to disrupt the peace."
}]